[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ii1bwp",
        "author": "AccurateInflation167",
        "title": "Netflix drops Emilia Pérez star from Oscars campaign over tweets",
        "content": "",
        "upvotes": 205,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1ii1bwp/netflix_drops_emilia_pérez_star_from_oscars/"
    },
    {
        "id": "1ii549c",
        "author": "gomi-panda",
        "title": "Anyone know what show this comedy came from? It looks hilarious",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o10p0nk31ahe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ii549c/anyone_know_what_show_this_comedy_came_from_it/"
    },
    {
        "id": "1ihevjl",
        "author": "Whobitmyname",
        "title": "‘PARASITE’ is now streaming on Netflix, ahead of the 5th anniversary of the film winning Best Picture at the Oscars.",
        "content": "",
        "upvotes": 469,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1ihevjl/parasite_is_now_streaming_on_netflix_ahead_of_the/"
    },
    {
        "id": "1ii0clu",
        "author": "Somethingman_121224",
        "title": "Insider Claims Netflix's 'Assassin's Creed' Series Is On Hold, But A New Live-Action Movie Is In The Works",
        "content": "",
        "upvotes": 15,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ii0clu/insider_claims_netflixs_assassins_creed_series_is/"
    },
    {
        "id": "1ii2dro",
        "author": "masterluke19",
        "title": "You are what you eat: A twin experiment",
        "content": "I just watched this 4 episode series. I understand the benefits of vegan food. But I couldn’t stop thinking about - Why do I feel like this is a big commercial for vegan foods. I see lot of founders and their brands getting advertised in the show. In the end they lost all the vegan food brands. \nIs this a vegan brand collab? \nAnyone else felt like this?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ii2dro/you_are_what_you_eat_a_twin_experiment/"
    },
    {
        "id": "1ii2icb",
        "author": "random1211312",
        "title": "Squid game (S1 E8 dub) only playing audio in my left ear.",
        "content": "Watching Squid Game S1 E8 in dub, and for some weird reason it's only playing audio in my left ear, music excluded. Is there any way I could possibly fix this? Idk what's going on",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ii2icb/squid_game_s1_e8_dub_only_playing_audio_in_my/"
    },
    {
        "id": "1ii5ms4",
        "author": "cuppachuppa",
        "title": "It seems inevitable that Netflix's next step will be annual subscriptions rather than monthly. Will you sign-up for 12 months at a time?  Or will that be your cue to cancel?",
        "content": "Same as Apple TV, Disney Plus etc., we sign up to Netflix for a few months, watch what we want and then cancel.\n\nI don't think it'll be long until streamers stop this by having 12 month subscriptions.  I think that would be the final straw for me and I'd just cancel them all.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ii5ms4/it_seems_inevitable_that_netflixs_next_step_will/"
    },
    {
        "id": "1ii1dml",
        "author": "supercarrier78",
        "title": "Preview in fast forward not working",
        "content": "Trying to watch RAW from earlier this week and cannot get it to preview while fast forwarding (iPad and FireTV). For a show without ad breaks or pre-announced schedules in broadcast the ability to see where you are is essential. Is anyone else experiencing this problem? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ii1dml/preview_in_fast_forward_not_working/"
    },
    {
        "id": "1ih14np",
        "author": "HarperLovey",
        "title": "Any one else canceling due to price increases?",
        "content": "Had to cancel this month as rate went up to just shy of $30/mo (with taxes added in)!  I remember paying something like $12.99/mo.  Even that was a stretch back then. I've always enjoyed Netflix programming, but just can't justify the price anymore. $300/year is just not realistic. ",
        "upvotes": 239,
        "comments": 184,
        "media": null,
        "permalink": "/r/netflix/comments/1ih14np/any_one_else_canceling_due_to_price_increases/"
    },
    {
        "id": "1ihzo4g",
        "author": "forevony_0904",
        "title": "Helpppp",
        "content": "Guys recommend me good teen dramas like:\n\n#ginnyandgeorgia \n#neverhaveiever\n#atypical\n#heartbreakhigh\n#everythingsucks\n\nTell me what other shows like these y'all like",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ihzo4g/helpppp/"
    },
    {
        "id": "1ihvojk",
        "author": "VesnaKostic",
        "title": "I need a recommendation for a series like Holy Family",
        "content": "I want to watch a series like Holy Family where I watched 16 episodes in 2 days. A family on the run, they stole a child, they change identities and kill, lots of mystery and intrigue 😂😂😂 Please helppp ❤️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihvojk/i_need_a_recommendation_for_a_series_like_holy/"
    },
    {
        "id": "1ii58a6",
        "author": "Charming-Rock4640",
        "title": "What new stuff can I watch that's not just poorly disguised propaganda?",
        "content": "I used to really look forward to watching new stuff on Netflix but it seems like apart from Squid game, nothing that came out this year is good.\n\nNow, everything is just military and pregnancy propaganda and none of it is good. I'm looking for stuff that's not like \"*Kinda Pregnant\"* or \"My happy Marriage\".",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ii58a6/what_new_stuff_can_i_watch_thats_not_just_poorly/"
    },
    {
        "id": "1ihl6uu",
        "author": "_mooi",
        "title": "Subtitle customisation on tv",
        "content": "I'm using Netflix on my Samsung TV \nIm trying to make the window behind subtitles be more transparent / make the subtitle border more visible but the video player only allows 4 preset window options for subtitles background \n\n \nIs there any hidden menu where I can customise it more than the video player allows me to ? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihl6uu/subtitle_customisation_on_tv/"
    },
    {
        "id": "1ihtgnj",
        "author": "Mean_Ferret677",
        "title": "Grey’s anatomy removed from Canadian site?",
        "content": "Update: creating a new profile solved the problem but this show is gone from my own profile for some reason. A bug I guess. \n\nAnyone living in Canada is able to access this show through Netflix? I didn’t see any announcements of it moving to a different streaming platform and it just disappeared halfway through an episode today. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihtgnj/greys_anatomy_removed_from_canadian_site/"
    },
    {
        "id": "1ihrovd",
        "author": "Crayola-eatin",
        "title": "Netflix/Roku question",
        "content": "I read there's a Chrome add-on that helps you search codes on Flix and supposedly gives you more options. I'm curious if there is a way to use this on the Roku that's hooked into your TV?\n\nTIA.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihrovd/netflixroku_question/"
    },
    {
        "id": "1ihwtp4",
        "author": "weareallpatriots",
        "title": "Karla Sofía Gascón: Netflix Silent On 'Emilia Pérez' Star",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihwtp4/karla_sofía_gascón_netflix_silent_on_emilia_pérez/"
    },
    {
        "id": "1ihloax",
        "author": "fleshymemes",
        "title": "Blackscreen and autoplay?",
        "content": "I've got a problem with netflix on google chrome. Every time a new episode starts with autoplay, I got a black screen with normal sound. The video only turns on, when i pause the video or when I click with my mouse. I already tried restarting, deleting browser data and reloading. Does anyone else have this problem or is it just me? Has anyone an idea how to get rid of this? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihloax/blackscreen_and_autoplay/"
    },
    {
        "id": "1ihgxjm",
        "author": "Sad-Year-4815",
        "title": "Is anyone facing the same problem?",
        "content": "I’m trying to watch shows but after a few minutes it just gets stuck and only the voice comes thru. I’ve tried deleting and redownloading - nothing. I’ve tried a different show - nothing. I was watching suits.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ihgxjm/is_anyone_facing_the_same_problem/"
    },
    {
        "id": "1ihp4nm",
        "author": "Ordinary_survival",
        "title": "What is the worsf netflix series you have watched or watching (spoiler alert)",
        "content": "I am a binge watcher, I watch a lot of things while I am doing chores or knitting. I am watching a tv series right now called breathless( original title is respira) and while knitting and giggling I feel like my grandma who watches all the soap operas. \nI mean in this one the doctor gave a false report to a girl whom she felt bad and who is the alleged rapist, his son 🤣while of course his ex husband is one of the top surgeant and also the top oncologist in the hospital. \nThe other doctor humped from the hospital building of how many floors I don’t even know ( but pretty high) still lives and in critical condition. \n\nSo what is your worst netflix series you have watched or whatching and why?\n\nPs: can’t change the title lol sorry for the typo, please share your worsf instead of worst 🤣\nAdditional note: the comments here does not mean your fav show is thrash, this is only comments of people who saw this thread and commented so feel free to what you like to watch to 🙌\n\n\nAnd the best part folks: I am knitting whT I am n\nKnitting mic drop",
        "upvotes": 0,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1ihp4nm/what_is_the_worsf_netflix_series_you_have_watched/"
    },
    {
        "id": "1ihtmy7",
        "author": "TheAmazingAmpharos",
        "title": "Unable to log in.",
        "content": "I'm unable to log into my Netflix account. I do not know the password, and cannot reset it because I don't know the password to the email I used to create the account. I also cannot reset the password of the email account, because BT just doesn't let you log in after you reset your password. (Please don't judge me, it was created a long time ago.) I do have the billing info for the account.\nIs there any way to recover the account, or if worse comes to worst, just delete it entirely? Thanks.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ihtmy7/unable_to_log_in/"
    },
    {
        "id": "1ih4yl9",
        "author": "Wonderful_Act3430",
        "title": "This is ridiculous",
        "content": "Me and my mom are away from home. She’s at a work thing and I’m watching Netflix out of nowhere in the middle of my show. It tells me that the TV is a part of the Netflix household is now telling me to pay more or make a new account and pay. What is this bull ",
        "upvotes": 16,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ih4yl9/this_is_ridiculous/"
    },
    {
        "id": "1igr62h",
        "author": "DemiFiendRSA",
        "title": "Cobra Kai: Season 6 Part 3 | Final Trailer | Netflix",
        "content": "",
        "upvotes": 80,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1igr62h/cobra_kai_season_6_part_3_final_trailer_netflix/"
    },
    {
        "id": "1ih07ip",
        "author": "lazybearcreations",
        "title": "Anyone else feeling that the new UI is terrible?",
        "content": "I was using Netflix on the TV with the options positioned on the left side of the screen, showing categories and everything I needed to find what I want to watch.\nNow I open the app in the last few days and the options have moved to the top of the screen and the categories are gone.\nSearch is there but just not really that helpful if you want to discover new things.\nScrolling endlessly through nearly full screen sections is quite frustrating when none of them are really what I am looking for.\nI am feeling like it is a mis-step but I am open to hear if I am just not seeing the benefits here…",
        "upvotes": 18,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ih07ip/anyone_else_feeling_that_the_new_ui_is_terrible/"
    },
    {
        "id": "1ihsbsj",
        "author": "indiewire",
        "title": "What ‘Emilia Pérez’ Can Win at the Oscars",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihsbsj/what_emilia_pérez_can_win_at_the_oscars/"
    },
    {
        "id": "1ihi1y8",
        "author": "KexyglamrocksBIG50",
        "title": "Should i or should'int i??",
        "content": " Im a big watcher of utube  channels i started watching about 8 monthes ago the abanded  pets in the angkor parc, i came across  recently  a channel  that has netflix  in thier name , these horrible channels do a lot to get views  im guessing  that they put netflix in thier name thinking they would get mors views becouse the viewers would think it had somethink to do with netflix so a good channel, but this channel does horrible things like chase down a mom with her 3 week old knowing that this mother doesn't  like her babies to cling to her belly so they have to walk next to her only the baby can not keep up that fast so when that happens the mom très to teach her babies (she has just one now) called lilly she tries to teach lilly that she has to keep up and not near the ppl but this for this particular  mother seems to use brutal, the mother drags the baby pulls on her fur all the long xhile the baby is screaming(well im guessing  its monkey screams)  thats just one of the things this channel does thier is a lot more, MY QUESTION  is should i try and get intouch  with netflix and tell them about tjis channel ?   Im guessing  they copy wrote thier name  that means no one can use that name?  And if the answer is yes how do i find an email that someone will read?   I thankyou for your reply and pls forgive me if my wording is not right  i dont write in english a lot.🙋‍♀️",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ihi1y8/should_i_or_shouldint_i/"
    },
    {
        "id": "1ihc1gf",
        "author": "psuitable_pseudonym",
        "title": "New category \"Swipe Left\"",
        "content": "On my Netflix there's a new category \"Swipe Left\" just above \"New on Netflix\" and after \"Casual Viewing\"\nWhy would they...  what were they thinking?\n\nSwiping left on dating apps means not interested and funny enough all the recommendations in that category\nare shit I had/have zero interest in watching or things I watched but didn't thumbs up or double thumb.\n\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihc1gf/new_category_swipe_left/"
    },
    {
        "id": "1ihhhxa",
        "author": "Square-Chapter-7889",
        "title": "Problems with Netflix residence/account",
        "content": "Ok, I'm gonna try to explain, but English isn't my first language.\nWe all know that traditional families aren't the only families.\nIn my family there is more than 2 residences, my dad's house in the big city, my mom's house in the big city, my dad's country house, my dad's wife's house in the small city close to the country house. Yeah, my dad is back and forth between those 3 places all the time because of business.\n\nMy dad pays one account(4k), my mom pays another account(1080p).\nMe and my brother use my dad's account at his house, at our mom's house and at the country house.\nMy dad use his account at his house, the country house and his wife house.\nHis wife and my half sister uses his account at my dad's house, at her house, and at the country house.\nMy mom only uses her account at her house.\n\nI use my dad's account for much more time, so when I'm at my mom's house, I still use my his account, but with all those changes, it's getting more and more difficult and it's pissing me off.\nEven him has some trouble using his account in all 3 places.\n\nI want to keep using my profile even when I'm at my mom's house, and it's already a pain to keep changing accounts everytime.\n\nAnyone got a solution? Netflix shouldn't assume that everyone has a traditional family with only 1 or 2 residences. And they even keep raising he prices!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihhhxa/problems_with_netflix_residenceaccount/"
    },
    {
        "id": "1igpkrg",
        "author": "pontiuspilate01",
        "title": "The Night Agent – Great Writing, Wooden Acting?",
        "content": "I’m currently on Season 1, Episode 7, and I’m still trying to understand the hype. The writing is slightly engaging—it knows how to keep you hooked with well-paced cliffhangers. But the acting? Yikes. It feels wooden, overly staged, and completely devoid of nuance, like a table read that somehow made it to the final cut. Some scenes are so stiff it’s almost impressive.\n\nI’m pushing through because I want to see if there’s a real payoff, but so far, it feels like a show that succeeds despite its cast rather than because of it. \n\nDoes it get better, or is this just what I signed up for?",
        "upvotes": 16,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1igpkrg/the_night_agent_great_writing_wooden_acting/"
    },
    {
        "id": "1ihhw43",
        "author": "Alone_Mess_4544",
        "title": "The funniest Hack ever",
        "content": "Hi all 👋!\n\nHere with the funniest hack that ever happened to me! \n\nLast night I was watching Netflix in my Apple TV and suddenly I started receiving confirmation emails that my password, phone number, email address was successfully changed and it wasn’t me 🥶\n\nMost important and hilarious moment is the notification that the account was upgraded from standard to premium 😁\n\nI quickly tried to take action as I have this account for years and I don’t want to lose it. \n\nWell of course I rang Netflix directly and explained my situation! They asked for my email and then they prompted me through an automated system where I had to prove my Visa card number that was used for the payments and I did so. \n\nI’ve changed password and email address of course and ended up recovering my account and got a free upgrade from the hacker 🥴🙂‍↔️\n\nWhat I’m still confused about is “why would someone hack a Netflix account “ ? To what ? \n\nI’m presuming I’ve logged in using someone’s computer and they just tried to cause problems but instant karma worked well 😄🥳",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ihhw43/the_funniest_hack_ever/"
    },
    {
        "id": "1ihhqu4",
        "author": "Slight_Medicine_463",
        "title": "In what order is Breaking Bad, Better call Saul and El Camino.",
        "content": "I watched Breaking Bad over 2 years ago and previously started Better call Saul to then see the likes of Tuco, Hector and the twins… but if you’ve seen breaking bad you’d see why I’m a bit confused now.\n\nSo what order was all of this suppose to be watched in if there is a correct order? ",
        "upvotes": 0,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1ihhqu4/in_what_order_is_breaking_bad_better_call_saul/"
    }
]