[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hqxs0j",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1hqxs0j/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1icnzmm",
        "author": "bora907",
        "title": "Rowing in Torino",
        "content": "Hi! I will be in Torino for about 6 months. I know people do rowing in river Po, is there any rower here? I wonder how to join a club or do rowing in Torino.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1icnzmm/rowing_in_torino/"
    },
    {
        "id": "1icbuzx",
        "author": "matbordaRnB",
        "title": "Revisione caldaia",
        "content": "Ciao\n\nMi consigliereste qualche revisore di caldaie di fiducia?\n\nGrazie!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1icbuzx/revisione_caldaia/"
    },
    {
        "id": "1ic53cn",
        "author": "hellnom55",
        "title": "Weekend torinese",
        "content": "Ciao,\n\nIo e la mia ragazza (26M, 25F) abbiamo intenzione di trascorrere un weekend a Torino. Potete darci più consigli possibili su posti da vedere, locali in cui mangiare e cose da fare?\n\nGrazie mille!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ic53cn/weekend_torinese/"
    },
    {
        "id": "1ic2d5n",
        "author": "Pul_in",
        "title": "Sotterraneo piazza Vittorio",
        "content": "Ma il parcheggio sotterraneo di piazza Vittorio è aperto 24/7 per tutti o ci sono ancora lavori in corso?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ic2d5n/sotterraneo_piazza_vittorio/"
    },
    {
        "id": "1ic9j42",
        "author": "zero_redditer",
        "title": "Dubbio blocco smog",
        "content": "Ciao a tutti!\nCopio e incollo un post che ho fatto su /ItalyMotori per provare ad avere qualche info più precisa.\n\nDubbio blocchi smog\n\nCiao a tutti,\n\ntorno da voi dopo il mio post precedente per valutare un'altra auto: A1 SPB 1.6 TDI 105 CV Ambition (77 kw), 200000 km, Diesel Euro 5b.\n\nI km mi preoccupano fino ad un certo punto, la macchina sarebbe venduta da concessionario di fiducia che l'ha valutata perfetta, revisioni sempre effettuate. Inoltre, io farei veramente pochissimi chilometri all'anno.\n\nIl mio unico dubbio è legato ai blocchi smog: io vivo a Torino, dove gli Euro 5 vengono bloccati già al livello arancione (superamento del valore di 50 µg/m³ per 3 giorni consecutivi), ma non riesco a capire quanto potrebbe essere impattante. Frugando su Google news mi pare che nel 2024 sia stato attivato una sola volta per 3 giorni e comunque i livelli di inquinamento sono in diminuzione già da qualche anno.\n\nSecondo voi quanto me la andrei a cercare acquistandola? Ovviamente feedback in generale sull'auto sono apprezzatissimi, grazie mille!",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ic9j42/dubbio_blocco_smog/"
    },
    {
        "id": "1ibqwvq",
        "author": "UccioDago",
        "title": "Carrefour corso Turati 75 Torino",
        "content": "Che si sappia: \n\nNel parcheggio del #Carrefour di corso Filippo Turati 75\nc'è un controllo all'ingresso mediante telecamere.\nSe superi le due ore di sosta arriva a casa un multone di 40€\n25€ di multa e 15€ per la gestione della stessa. La multa la emette una ditta tedesca con sede a Bolzano Parkdepot, la stessa che gestisce l'impianto di fotocamere. \n\nIo ne ho ricevute due oggi via posta. Non sono in grado di stabilire se sia lecito che un'azienda possa emettere multe.\n\nPer ora voglio ringraziare sentitamente  il Carrefour ",
        "upvotes": 22,
        "comments": 45,
        "media": null,
        "permalink": "/r/torino/comments/1ibqwvq/carrefour_corso_turati_75_torino/"
    },
    {
        "id": "1ic7wj3",
        "author": "Ale17kk_",
        "title": "Trasferimento a Torino/Piemonte",
        "content": "Ciao a tutti, premetto che feci già un altro post simile qua riguardo a un possibile trasferimento a Torino o Piemonte in generale per lavoro. \n\nSono un sardo di 24 anni, esperienza di 4 anni come informatico/help-desk per un’azienda della Grande distribuzione organizzata. \nAttualmente disoccupato cerco una esperienza fuori Sardegna, sia come esperienza lavorativa che di crescita personale, ma noto qualche difficoltà nel farmi notare negli annunci o dalle aziende in generale. Sicuramente la distanza non aiuta. \n\nQualcuno ha fatto un percorso simile a quello che vorrei affrontare e può darmi qualche consiglio? Avrei anche la possibilità di trasferirmi con il mio mezzo proprio.\n\nGrazie a chi mi darà feedback :)",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ic7wj3/trasferimento_a_torinopiemonte/"
    },
    {
        "id": "1ib3hq4",
        "author": "nullstuff",
        "title": "Ormea's loophole",
        "content": "",
        "upvotes": 293,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w1bnwdjzxhfe1.jpeg?auto=webp&amp;s=3f44d7005fd50397c4d8633d1354fedfec2f5dad"
        },
        "permalink": "/r/torino/comments/1ib3hq4/ormeas_loophole/"
    },
    {
        "id": "1ibjj7x",
        "author": "Kollop_",
        "title": "La guida degli autisti dei bus. Specialmente il 68",
        "content": "Ragazzi ma solo a me sembra che ultimamente gli autisti guidano come in una gara di formula 1? Frenate brusche, sterzate incontrollate e fermate saltate all'ultimo.\nSarà un problema dei nuovi bus? Quando ero ragazzino non ricordo che dovevo reggermi come se stessi su un idrovolante.",
        "upvotes": 24,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1ibjj7x/la_guida_degli_autisti_dei_bus_specialmente_il_68/"
    },
    {
        "id": "1ibx7b2",
        "author": "strawberryfairy97",
        "title": "Corso onicotecnica",
        "content": "Ciao amici torinesi, da un po' di tempo ho sviluppato una passione per le unghie che vorrei coltivare proprio facendo io stessa ricostruzioni ecc. Ma giustamente per avere delle basi concrete dovrei fare un corso, qualcuno di voi per caso ha fatto o conosce qualcuno che ha fatto un corso valido con prezzi non esagerati per diventare onicotecnica?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ibx7b2/corso_onicotecnica/"
    },
    {
        "id": "1iby5go",
        "author": "duckinlove",
        "title": "Zona ex-Gondrand",
        "content": "C'è qualcuno che vive vicino alla ex fabbrica?\nCome vi trovate? I tossici si fanno i fatti loro in fabbrica o rompono le scatole anche x strada?\nI miei vogliono acquistare casa, e hanno trovato questo appartamento niente male e a basso prezzo, scoprendo che costava poco perché appunto sta la gondrand vicino. \nTenete conto che i miei abitano in c.so Giulio di fronte al ponte mosca, con tossici e alcolizzati che fanno rissa quasi tutte le sere.",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1iby5go/zona_exgondrand/"
    },
    {
        "id": "1ic6npk",
        "author": "zlatan9958",
        "title": "Cerco un amico nero a Torino",
        "content": "Ciao a tutti.\n\nHo sempre pensato di voler avere degli amici neri, non vuole essere minimamente una cosa razzista. Ma un opportunità per conoscersi. Magari giocare a basket o a calcio.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ic6npk/cerco_un_amico_nero_a_torino/"
    },
    {
        "id": "1ibtm5e",
        "author": "Illustrious-Clerk584",
        "title": "Butcher recommendation",
        "content": "Do anyone know english speaking butcher around corso peschiara or can give recommendation",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ibtm5e/butcher_recommendation/"
    },
    {
        "id": "1ibymqf",
        "author": "rossblindo",
        "title": "Città morente?",
        "content": "Che è successo a Torino? Ci ho vissuto negli anni universitari, subito dopo le olimpiadi del 2006 e la adoravo. Ci sono stato la settimana scorsa dopo diverso tempo e l'idea che mi ha dato è di una città in crisi profonda...barboni, strade vuote e palazzi allo sfacelo in pieno centro... non dà l'idea di una città sicura e sì percepisce una crisi profonda.. potrà mai risollevarsi o il destino ormai è una periferia economica di Milano?",
        "upvotes": 0,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1ibymqf/città_morente/"
    },
    {
        "id": "1ibfpva",
        "author": "sborrazzi04",
        "title": "Palazzo Nuovo Punk",
        "content": "Sapete come risalgo alle foto o alla locandina della serata che c'è stata venerdì a palazzo nuovo? Ci sono capitato per caso e me la sono presa un sacco bene",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ibfpva/palazzo_nuovo_punk/"
    },
    {
        "id": "1ibih26",
        "author": "AliceOnDrugs",
        "title": "Ristorante per San Valentino",
        "content": "Ciao a tutti,   \nVoglio fare una cena con la mia ragazza in torino per San Valentino, ma non conosco troppi posti per mangiare. Se è possibile, potreste darmi qualche raccomandazione?\n\nGrazie Mille! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ibih26/ristorante_per_san_valentino/"
    },
    {
        "id": "1ib2mxg",
        "author": "James_Lovell",
        "title": "Conoscete supermercati che fanno acquistare gift card con i buoni pasto?",
        "content": "Conoscete supermercati a Torino che permettono di pagare le Gift card tipo di Amazon o zalando utilizzando i buoni pasto?",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ib2mxg/conoscete_supermercati_che_fanno_acquistare_gift/"
    },
    {
        "id": "1ibdbvq",
        "author": "SimonRisso",
        "title": "Qual è il numero della tessera GTT",
        "content": "salve a tutti! sono uno studente universitario e sto cercando di chiedere il rimborso per l’abbonamento. Tra le cose richieste c’è il numero della tessera e non riesco a capire se sia quello sul retro o sul fronte della carta. Sapreste dirmi qual è quello utile? Grazie :)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ibdbvq/qual_è_il_numero_della_tessera_gtt/"
    },
    {
        "id": "1ib5qcz",
        "author": "Alternative_Bat_6416",
        "title": "HELP: lavorare a Torino negli eventi musicali",
        "content": "ho bisogno del vostro aiuto per qualche consiglio su dove sbattere la testa (per evitare di sbatterla contro il muro).  \nSto cercando di cambiare vita e venire a Torino, ma la ricerca del lavoro è più complicata del previsto.  \nSto cercando lavoro nell'ambito di eventi musicali (organizzazione, comunicazione, promozione) e sto valutando le diverse proposte della città.  \nSapete indicarmi quali enti e/o organizzazioni possono fare al caso mio/quali contattare/cosa mi può essere d'aiuto? Qualsiasi consiglio è ben accetto, se siete sul pezzo nell'ambito per la realtà di Torino.  \nGracias &lt;333",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ib5qcz/help_lavorare_a_torino_negli_eventi_musicali/"
    },
    {
        "id": "1ibabe6",
        "author": "GhostGirl_34",
        "title": "Negozio di active wear a Torino",
        "content": "Hey ragazzi sapete consigliarmi un negozio di active wear a Torino (non decathlon)?\n\nCerco magari qualche negozio che abbia vestiti da palestra o running con brand decenti",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ibabe6/negozio_di_active_wear_a_torino/"
    },
    {
        "id": "1iaiyvu",
        "author": "tnndaboss1",
        "title": "Just moved into Torino as an American",
        "content": "Where do you guys suggest is the best place to network and meet new people. I’m in my early 20’s and just moved here alone. I don’t know anyone here xD. ",
        "upvotes": 15,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1iaiyvu/just_moved_into_torino_as_an_american/"
    },
    {
        "id": "1iadbpl",
        "author": "penoyixa",
        "title": "Chi èTEKIR ?",
        "content": "Vivo a Torino da quasi 3 anni e non sono ancora riuscito a capire chi sia Tekir. Non l'ho mai visto fare tag, ma ovunque vedo l'insegna. Qual è la leggenda su questo ragazzo?",
        "upvotes": 17,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7mikp6ps0cfe1.jpeg?auto=webp&amp;s=98ff20c255b06af87bc9d8a432c42396f9d49fc6"
        },
        "permalink": "/r/torino/comments/1iadbpl/chi_ètekir/"
    },
    {
        "id": "1iabnwq",
        "author": "Much-Cartoonist-9594",
        "title": "Questa zona è vivibile?",
        "content": "Ho trovato una bella casa in questa zona (accanto al parco) ma non sono sicuro della sicurezza di questa parte della città. ",
        "upvotes": 20,
        "comments": 68,
        "media": null,
        "permalink": "/r/torino/comments/1iabnwq/questa_zona_è_vivibile/"
    },
    {
        "id": "1iaaqkg",
        "author": "iannezluke79",
        "title": "Problematiche Mirafiori Sud",
        "content": "Vi prego aiutatemi a capire perché veramente faccio fatica.\nMa perché ogni volta che sento gente discutere delle zone di Torino (chiaccherando, sui social o in qualsiasi contesto) esce sempre che Mirafiori è una zona malfamata. Ci vivo da sempre e probabilmente non vedrò le problematiche ma io mi giro attorno e vedo solo vecchietti che fanno passeggiate.\nOkay, c'è Piazza Bengasi che sicuramente non è un bel posto per portare i nipotini a passeggio la sera però tolto quello cosa c'è di così assurdo?\nScusate il rant ma ho appena visto un TikTok di una ragazza che parlava dei peggiori quartieri di Torino e ovviamente ha menzionato Mirafiori e da lì mi è sorto il dubbio.",
        "upvotes": 24,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1iaaqkg/problematiche_mirafiori_sud/"
    },
    {
        "id": "1i9z548",
        "author": "NightPuzzleheaded114",
        "title": "RANT GTT - Bici in autobus",
        "content": "Lavoro come rider e questa sera ho avuto la triste esperienza di bucare la ruota dietro della bici elettrica.\nSiccome ero in mezzo alla periferia rispetto a dove abito (fine zona San Paolo) ho pensato di salire sul primo bus che mi portasse in zona da me (Gran Madre).\nAspetto 10 minuti, arriva il 64 e l’autista mi ha detto che non potevo starci, io insistendo mostrandogli la bici con la ruota totalmente andata lo pregato di farmi stare.\nSto stronzo mi fa “eh ma se devo caricare un disabile”.\nMi ha lasciato sotto la pioggia, ad 1,30h di distanza a piedi quando il pullman era mezzo vuoto e se ci fosse stato bisogno di spazio sarei anche sceso.\nAuguro a questo infame di passare il doppio della mia disgrazia.\n\nP.s qualcuno è conoscenza se fosse possibile viaggiare su un pullman con la bici?\nAvrei anche potuto schiacciarla perché è un modello smontabile ",
        "upvotes": 23,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1i9z548/rant_gtt_bici_in_autobus/"
    },
    {
        "id": "1iavhv8",
        "author": "No-Ant-9038",
        "title": "[ Removed by Reddit ]",
        "content": "[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1iavhv8/removed_by_reddit/"
    },
    {
        "id": "1i99s1r",
        "author": "Available-Fee-9219",
        "title": "My photos of Torino",
        "content": "I'm a first year international student at Politecnico di Torino and here are few photos of Torino that I clicked so far. Shot on OnePlus 11r.",
        "upvotes": 1318,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1i99s1r/my_photos_of_torino/"
    },
    {
        "id": "1iaawr1",
        "author": "FirmPop4841",
        "title": "Analisi del Sangue",
        "content": "Buongiorno, mi sono da poco trasferito a Torino e cerco un buon laboratorio per fare le analisi del sangue.\nIo abito in zona Filadelfia/Lingotto ma posso spostarmi anche in zone Poi centrali.\nVorrei avere anche un'idea dei prezzi che ci sono qui per capire dove converrebbe andare a farle.\n\nVi ringrazio in anticipo ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1iaawr1/analisi_del_sangue/"
    },
    {
        "id": "1iadrk7",
        "author": "matbordaRnB",
        "title": "Targhetta citofono e buca lettere",
        "content": "Ciao\n\nConsigli su dove farmi fare le targhette in ottone per citofono e buca lettere?\n\nGrazie",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1iadrk7/targhetta_citofono_e_buca_lettere/"
    },
    {
        "id": "1iakgka",
        "author": "bestemmioduro",
        "title": "Quale quartiere scegliere?",
        "content": "Stavo valutando di trasferirmi a Torino, quali quartieri consigliate?\nSostanzialmente quello che mi interessa è che sia una zona tranquilla nella quale se tieni la finestra aperta d'estate non ti sembra di stare col divano in mezzo ad una strada per via del rumore delle auto, se i negozi/supermercati non sono vicini non è un grosso problema; fondamentale che ci siano pochi o che siano del tutto assenti immigrati africani o arabi.\nGrazie",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1iakgka/quale_quartiere_scegliere/"
    }
]