[
    {
        "id": "1kspfrg",
        "author": "AlanAndMattAMA",
        "title": "Hey /r/movies! We're Alan Tudyk &amp; Matt Winn, actor &amp; director of THE TROUBLE WITH JESSICA, a dark comedy also starring Rufus Sewell &amp; Shirley Henderson about a group of longtime friends at a dinner party that goes horribly wrong, recently in theaters and now available on digital. Ask us anything!",
        "content": "You might also know Alan for films and series such as Firefly, Tucker &amp; Dale vs Evil, Serenity, Andor, A Knight's Tale, Resident Alien, Rogue One: A Star Wars Story, Moana, Frozen II, I Robot, Maze Runner, Transformers, Deadpool 2, The Electric State, Harley Quinn, Dodgeball, Raya and the Last Dragon, Ice Age, Arrested Development, 3:10 To Yuma, and much more.\n\nABOUT THE FILM: Married couple Sarah (Shirley Henderson) and Tom (Alan Tudyk) are in terrible financial trouble. On the brink of losing everything, they’ve managed to find a buyer for their stylish London home. When their best friends Richard (Rufus Sewell) and Beth (Olivia Williams) come over for a final dinner, an uninvited old friend, Jessica (Indira Varma), tags along.\n\nAfter a seemingly trivial argument at dinner, Jessica disappears. She has the temerity to hang herself in the garden, totally oblivious to the adverse consequences for Sarah and Tom’s real estate sale. The only solution: Sarah and Tom must convince Richard and Beth to help take care of this little inconvenience. If they’re clever enough about it, what could possibly go wrong? Knives are out and best-kept secrets are revealed in this laugh-out-loud dark comedy featuring a starry ensemble cast of phenomenal UK talent.\n\nTRAILER: [https://www.youtube.com/watch?v=l\\_xhtk8Tj18](https://www.youtube.com/watch?v=l_xhtk8Tj18) \n\nLearn More and Rent/Buy THE TROUBLE WITH JESSICA: https://www.musicboxfilms.com/film/the-trouble-with-jessica.\n\nAsk us anything! Back at 3 PM ET today for answers.\n\n\n\n",
        "upvotes": 621,
        "comments": 414,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ohy0hof2tb2f1.png?auto=webp&amp;s=7039a148f333722fa2414b6009872629b373b2c9"
        },
        "permalink": "/r/movies/comments/1kspfrg/hey_rmovies_were_alan_tudyk_matt_winn_actor/"
    },
    {
        "id": "1kt8f5n",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Mission: Impossible - The Final Reckoning / Lilo &amp; Stitch / Friendship) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[Mission: Impossible - The Final Reckoning](https://old.reddit.com/r/movies/comments/1kt8b6m/official_discussion_mission_impossible_the_final/?)\n\n[Lilo &amp; Stitch](https://old.reddit.com/r/movies/comments/1kt8b83/official_discussion_lilo_stitch_spoilers/?)\n\n[Friendship](https://old.reddit.com/r/movies/comments/1kt8b9q/official_discussion_friendship_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Dinosaur](https://old.reddit.com/r/movies/comments/1kt8baq/official_throwback_discussion_dinosaur_spoilers/?)\n\n[Road Trip](https://old.reddit.com/r/movies/comments/1kt8bc6/official_throwback_discussion_road_trip_spoilers/?)\n\n\n# Still in Theaters\n\n[Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n[Hurry Up Tomorrow](https://old.reddit.com/r/movies/comments/1knpnfr/official_discussion_hurry_up_tomorrow_spoilers/?)\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n\n\n# On Streaming\n\n[Fountain of Youth](https://old.reddit.com/r/movies/comments/1ku0tg1/official_discussion_fountain_of_youth_spoilers/?)\n\n[Fear Street: Prom Queen](https://old.reddit.com/r/movies/comments/1ku0thn/official_discussion_fear_street_prom_queen/?)\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)",
        "upvotes": 56,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kt8f5n/official_discussion_megathread_mission_impossible/"
    },
    {
        "id": "1ku9wyu",
        "author": "Ashamed_Feedback3843",
        "title": "Sparrows 1926 Mary Pickford",
        "content": "",
        "upvotes": 1553,
        "comments": 134,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xvpa04fnyp2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ku9wyu/sparrows_1926_mary_pickford/"
    },
    {
        "id": "1kuer6l",
        "author": "NoCulture3505",
        "title": "Les Dilley Dies: 'Star Wars' Art Director Was 84",
        "content": "",
        "upvotes": 397,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CQc-mk5k1on-Z_ZVy8apaIkGstd3v1tjoZPK0Gtw2tA.jpg?auto=webp&amp;s=aad5b081f5dbd18a5534663d7c4bdbc170bf12e0"
        },
        "permalink": "/r/movies/comments/1kuer6l/les_dilley_dies_star_wars_art_director_was_84/"
    },
    {
        "id": "1kuc26w",
        "author": "Mst3Kgf",
        "title": "There's few characters in cinema who are a big and as entertaining a loser as Jerry Lundegaard in \"Fargo.\" Not only is William H. Macy one of the best casting choices ever, but a big part of the film's appeal is just watching him mess up EVERYTHING.",
        "content": "I fully understand why Macy was so determined to play this role that he jokingly threatened to shoot the Coens' dogs if he didn't get it. Not only is Macy one of the best actors ever at playing this kind of character (see \"The Cooler\" for another excellent example), but Jerry is just such a screw-up at everything he does. Right from the beginning, his whole \"kidnap my own wife\" plan is so half-baked and inane that the very crooks he hires to do it are dubious about it. Think of how many ways he screws up:\n\n1. He hired Carl and Gaer on reference from someone at work (who only knows the latter and won't vouch for the former), knowing nothing about them or how competent they may be.(Short answer; not very.)\n\n2. Because of that, he can't contact them to call off the kidnapping when it looks like he might not need it done.\n\n3. He's amazed when his father in law, who is established from the beginning to not care much for him, won't just give him $750,000 with no strings attached.\n\n4. His mumbled excuses to the GM lawyer about the serial numbers to the non-existent cars he scammed them with. (\"Those're in the mail!\")\n\n5. His plan revolving around being able to deliver the ransom himself and therefore cut out most of it to keep, never realizing that his stubborn and controlling father in law (who, again, DOES NOT LIKE YOU, JERRY) might demand on doing it himself. And sure enough...\n\nAnd so on. And watching Jerry constantly fail and lose it is one of the great pleasures of the film, like when he impotently attacks his ice-covered windshield in rage or how his office blinds look like prison bars. Frequently, a character like this might bring about sympathy for his misfortunes, but not Jerry. Not only is he a loser, but his troubles are all self-inflicted. And in the end, when it all comes down on him, it feels earned and very satisfying.\n\nEven though he did manage to knock off $100 on the truecoat. You did accomplish that, Jerry.\n\n",
        "upvotes": 542,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1kuc26w/theres_few_characters_in_cinema_who_are_a_big_and/"
    },
    {
        "id": "1ku9aq1",
        "author": "Grant692",
        "title": "I Watched All 63 Disney Animated Movies, And It Was Delightful",
        "content": "I was born in the early 90s, in the midst of the Disney Renaissance, and I grew up on Disney movies. My mom showed me a lot of the classics in addition to the new ones that came out during my life, but I hadn't seen the vast majority of these films since childhood. So, nearly two years ago, I set out to watch every movie from Walt Disney Animation Studios (so, no live-action remakes, no made-for-TV sequels, etc.), in chronological order, to refresh my memory and fill in my blind spots. Overall, it was a wonderful experience. I ranked all of the movies on Letterboxd, and included my favorite moment from each one (usually an animated flourish, but occasionally a quote or an extended sequence). And below, I listed some good and bad surprises, and I ranked villains, vocal performances, and songs, just for fun!\n\nhttps://letterboxd.com/grant692/list/disney-ranked/\n\nGood Surprises:\n\n1. Cinderella - I really, really did not expect to come away from this with Cinderella as my favorite Disney movie and one of my favorite animated movies of all time. But it is. In my memory, it was the classic \"helpless princess, handsome prince, happily ever after\" story. Imagine my surprise when I find that it's a movie about a woman overcoming the most dreadful circumstances with kindness and humility and persistence and self-confidence. She's not immune to the weight of her terrible life, but when life gets her down, she picks her head up and gets back to solving her problems. She is a role model not just for little girls, but for all of us. AND it's beautifully animated, well-paced, and has one absolutely remarkable sequence (the transformation of everyone/everything in preparation for the ball). It's just splendid.\n\n2. One Hundred and One Dalmatians - I expected One Hundred and One Dalmatians to be relatively minor Disney, but I was blown away. From the gorgeous, painterly animation style, to the thrilling plot, to the devious villain, to the delightful side characters (Horace and Jasper are all-time great laughable lackeys)...it all just works.\n\n3. The Emperor's New Groove - I knew I was going to love The Emperor's New Groove, but not this much. It's just one amazing sight gag after another, coming in at an efficient 72 minutes (not including credits), and its blistering pace never runs out of steam. Amazing.\n\n4. Robin Hood - Robin Hood was one of my favorite Disney movies as a kid, but as an adult, I realized it didn't have the best reputation, so I wasn't optimistic going in...but I still loved it. It's fun, it's got some great music (\"Phony King of England\", especially), and a ridiculous villain+sidekick combo (Prince John and Sir Hiss).\n\n5. Atlantis: The Lost Empire - The crew could not be any more trope-y if it tried. Milo, the out-of-his-depth, nerdy scholar who the group reluctantly depends on. Rourke, the gruff, grizzled captain who clearly has ulterior motives. Helga, a young German woman and Rourke's second-in-command, who thinks she has to act all tough to look like she belongs next to her superior. Vinny, the cavalier Italian demolitions expert who just wants to run the family flower shop. Dr. Sweet, the physically imposing African-American/Native American doctor with a heart of gold. Audrey, the plucky, teenage Puerto Rican mechanic trying to impress her dad (who really wanted a son). Wilhelmina, the chain-smoking communications officer who looks and acts like she should have retired years ago. Cookie, the elderly chef of the expedition, who seems to have come from the Confederate South. Geatan Moliere, a Frenchman who goes by Mole, and also acts like a mole, and also looks like a mole. But it leans into those tropes with such affection, that I couldn't help but love it. \n\nBad Surprises: \n\n1. The Sword in the Stone - Like Robin Hood, The Sword in the Stone was one of my favorites growing up. I don't know what childhood me was thinking. The wizard duel is entertaining, but the plot is just totally inert otherwise. \n\n2. Tarzan - I didn't find the story all that interesting, nor the characters compelling. Much to my surprise, I also didn't love the music - it all sounded the same and didn't hook me whatsoever. RIP to the Phil Collins burning piano meme :(. \n\n3. Fantasia - Hailed as one of the all-time greats of Disney, I was excited...but it was too inconsistent. The Sorcerer's Apprentice is among the best things Disney has ever done, and Night on Bald Mountain is a good time...but otherwise? Couldn't find much to latch on to.\n\n4. The Black Cauldron - Yet another of my childhood favorite that I ranked lower than I'd hoped. I still probably have it higher than most, maybe due to my affinity for all things spooky and the fact that this is certainly the darkest Disney has ever gotten...but still didn't live up to expectations.\n\n5. Wish - This movie is SO bad. I skipped it in theaters when it came out a couple years ago (shortly after I started this project, actually) because of the so-so reviews, but I still thought I'd at least give it a solid 3/5 stars. But it looks terrible (like something from Disney Channel 10 years ago), the songs aren't the least bit memorable, there are no interesting characters, and the plot doesn't carry half the weight that it feels like it should. I LOVE the idea of this movie, and it fits so well into the mythology of Disney...which I think made me all the more angry at how it turned out. \n\n\nTop 10 Villains:\n\n1. Cruella De Vil (One Hundred and One Dalmatians)\n\n2. Hades (Hercules)\n\n3. Ursula (The Little Mermaid)\n\n4. Maleficent (Sleeping Beauty)\n\n5. Mother Gothel (Tangled)\n\n6. Yzma (The Emperor's New Groove)\n\n7. Ratigan (The Great Mouse Detective)\n\n8. John Silver (Treasure Planet)\n\n9. Scar (The Lion King)\n\n10. Doctor Facilier (The Princess and the Frog)\n\n\nTop 10 Vocal Performances:\n\n1. Robin Williams (Genie, Aladdin)\n\n2. James Woods (Hades, Hercules)\n\n3. Jodi Benson (Ariel, The Little Mermaid)\n\n4. Susan Egan (Meg, Hercules)\n\n5. Pat Carroll (Ursula, The Little Mermaid)\n\n6. Eleanor Audley (Maleficent, Sleeping Beauty)\n\n7. Eartha Kitt (Yzma, The Emperor's New Groove)\n\n8. Peter Ustinov (Prince John, Robin Hood)\n\n9. Patrick Warburton (Kronk, The Emperor's New Groove)\n\n10. Ming Na Wen (Mulan, Mulan)\n\n\nTop 20 Disney Songs:\n\n1. Friend Like Me (Aladdin)\n\n2. Part Of Your World (The Little Mermaid)\n\n3. I'll Make a Man Out of You (Mulan)\n\n4. Lost in the Woods (Frozen II)\n\n5. I've Got a Dream (Tangled)\n\n6. The Phony King of England (Robin Hood)\n\n7. For the First Time in Forever (Frozen)\n\n8. Under the Sea (The Little Mermaid)\n\n9. Surface Pressure (Encanto)\n\n10. Belle (Beauty and the Beast)\n\n11. Poor Unfortunate Souls (The Little Mermaid)\n\n12. Hellfire (The Hunchback of Notre Dame)\n\n13. I Just Can't Wait to Be King (The Lion King)\n\n14. Zero to Hero (Hercules)\n\n15. Hakuna Matata (The Lion King)\n\n16. The Bear Necessities (The Jungle Book)\n\n17. The Family Madrigal (Encanto)\n\n18. How Far I'll Go (Moana)\n\n19. I Won't Say (I'm In Love) (Hercules)\n\n20. Cruella de Vil (One Hundred and One Dalmatians)\n\nThat's it! It was a great little journey through the history of animation, and I'd encourage anyone interested to take it!",
        "upvotes": 395,
        "comments": 138,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gwSBG5Ox9DXp10DLwbOoZqn6TRWPDnV3Yva9hPAockc.jpg?auto=webp&amp;s=2b9006b5b6cb675497653a39139cc6545bf18311"
        },
        "permalink": "/r/movies/comments/1ku9aq1/i_watched_all_63_disney_animated_movies_and_it/"
    },
    {
        "id": "1ktkgcr",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Elijah Wood in 'The Toxic Avenger'",
        "content": "",
        "upvotes": 19239,
        "comments": 761,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1ane31n7gj2f1.jpeg?auto=webp&amp;s=70bbec22bec6e12cfbe0f26ae53036723b91c95e"
        },
        "permalink": "/r/movies/comments/1ktkgcr/new_image_of_elijah_wood_in_the_toxic_avenger/"
    },
    {
        "id": "1ktw1ir",
        "author": "cmaia1503",
        "title": "First poster for Lynne Ramsay’s ‘Die, My Love’ starring Jennifer Lawrence &amp; Robert Pattinson.",
        "content": "",
        "upvotes": 2053,
        "comments": 164,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v7agl1t0vl2f1.jpeg?auto=webp&amp;s=4e852fcd13dc6510d695743fb50a995433047ad8"
        },
        "permalink": "/r/movies/comments/1ktw1ir/first_poster_for_lynne_ramsays_die_my_love/"
    },
    {
        "id": "1ku6a42",
        "author": "Deep-Ad-840",
        "title": "What's a movie you truly wish you had never watched?",
        "content": "I’m not usually squeamish about films, but \"A Serbian Film (2010)\"  is one I deeply regret seeing. It’s been over ten years, and I still think about it—for all the wrong reasons. I went in not knowing what I was getting into, and some scenes have stuck with me in a way that’s more haunting than impactful.\n\nNot trying to spark controversy or glorify extreme cinema—just genuinely wondering:\nHave you ever seen a film that you wish you could unsee?\n",
        "upvotes": 267,
        "comments": 650,
        "media": null,
        "permalink": "/r/movies/comments/1ku6a42/whats_a_movie_you_truly_wish_you_had_never_watched/"
    },
    {
        "id": "1kubf4j",
        "author": "BunyipPouch",
        "title": "'Clueless' Returning to Theaters for 30th Anniversary (June 29th)",
        "content": "",
        "upvotes": 97,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/I4TzBI-_oOPw-RI05xzTdX6rIOIM2C32uy-awvuGxSY.jpg?auto=webp&amp;s=0d45d5dac5a9673b6a428302a85ee2cdfa2eba12"
        },
        "permalink": "/r/movies/comments/1kubf4j/clueless_returning_to_theaters_for_30th/"
    },
    {
        "id": "1ku8flm",
        "author": "Sisiwakanamaru",
        "title": "South of France Hit By Massive Power Outage Ahead Of Cannes Closing Ceremony",
        "content": "",
        "upvotes": 153,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OQ4hmrvvVduYXgNZTao6YBPM9Bo73ZYc2IUpSYQ4KII.jpg?auto=webp&amp;s=0028d8b1dfef1cad3bda106383bf270e42f86bf8"
        },
        "permalink": "/r/movies/comments/1ku8flm/south_of_france_hit_by_massive_power_outage_ahead/"
    },
    {
        "id": "1kufamj",
        "author": "Good-Body8515",
        "title": "What’s a great movie you watched recently that nobody talks about—and you wish more people had seen?",
        "content": "I recently watched *Coherence* (2013), and I’m honestly shocked more people don’t talk about it. It’s a low-budget sci-fi film that relies entirely on tension, dialogue, and a mind-bending concept instead of special effects. I won’t spoil anything, but if you're into psychological thrillers or multiverse theories, this one's a hidden gem.\n\nIt made me wonder—what other underrated movies are out there that deserve way more attention? I’d love to build a list of lesser-known but incredible films. Drop your favorites below!",
        "upvotes": 54,
        "comments": 115,
        "media": null,
        "permalink": "/r/movies/comments/1kufamj/whats_a_great_movie_you_watched_recently_that/"
    },
    {
        "id": "1ku9erd",
        "author": "danielhutt",
        "title": "What’s the most unforgettable movie ending you’ve ever seen?",
        "content": "I recently rewatched The 40-Year-Old Virgin and was reminded of how the ending totally blindsided me the first time around. One minute, I’m watching a raunchy rom-com, and the next, I’m smack in the middle of a full-blown musical fever dream. I honestly thought I had dozed off and imagined it—it was so out of left field, it felt like the movie switched genres just to mess with me.\n\nWhat other movies have endings that unforgettable?",
        "upvotes": 118,
        "comments": 293,
        "media": null,
        "permalink": "/r/movies/comments/1ku9erd/whats_the_most_unforgettable_movie_ending_youve/"
    },
    {
        "id": "1ku308r",
        "author": "hacked_your_account",
        "title": "What is a movie that had an excellent premise that failed to deliver as a complete film?",
        "content": "I want to talk about movie concepts that sound great but were poorly executed. It Follows (2014) had a great premise and was a great movie. Then there are movies like The Invention of Lying (2009), which had a very compelling premise but shit the bed by making it about religion. What are other movies that had immediately interesting premises that wore thin or could not stick the landing?",
        "upvotes": 411,
        "comments": 589,
        "media": null,
        "permalink": "/r/movies/comments/1ku308r/what_is_a_movie_that_had_an_excellent_premise/"
    },
    {
        "id": "1ku2iyd",
        "author": "WardenofWestWorld",
        "title": "Kid appropriate movies where bad guys win?",
        "content": "My son recently said he’s getting tired of movies where the good guys always win. He’s curious about stories where the bad guys win or at least don’t lose completely. I realized most kids’ movies play it pretty safe. Are there any age-appropriate films where the villain comes out on top or the ending isn’t so clean? Not looking for horror or anything truly dark—just something with a little more edge or ambiguity. Animated, live-action, fantasy—open to all suggestions. Thanks",
        "upvotes": 379,
        "comments": 600,
        "media": null,
        "permalink": "/r/movies/comments/1ku2iyd/kid_appropriate_movies_where_bad_guys_win/"
    },
    {
        "id": "1ktyg56",
        "author": "irrigated_liver",
        "title": "What's a song that outperformed/outlasted the movie it was written for?",
        "content": "I just heard \"Regulate\" by Warren G being played while I'm at work and it made me think about how enduring that track has been, still getting airplay 30 years later, despite coming from a film that nobody remembers.  \nIt got me wondering if there were any other pieces of music out there that had popularity and endurance far beyond the films they were created for.",
        "upvotes": 432,
        "comments": 642,
        "media": null,
        "permalink": "/r/movies/comments/1ktyg56/whats_a_song_that_outperformedoutlasted_the_movie/"
    },
    {
        "id": "1kubhw5",
        "author": "vihhkjhgf",
        "title": "A Working Man is a Disaster",
        "content": "I know I'm late to this, but yesterday I stumbled upon this movie, read the description and the cast. My expectations going in were: \"I just want a Taken knock-off that survives on the charm of Jason Statham.\" So I think I set them realistically low for an evening of kinda mindless entertainment. But even then, I was mostly bored and so disappointed that I wanted to make this post...\n\nThe biggest problem is, a big chunk of this movie is entirely useless. And I don't mean, I didn't like it or it was not that impactful. I mean, you could literally cut out the entire side plot about his daughter and father-in-law and it would change not a single thing about the main story. How do you even fumble this hard? Even in the places where it is set up to intersect, it doesn't. Statham is set up to need money to pay for his lawyers in the custody case for his daughter which never becomes relevant. Does he keep the money from the Russians? No. Is he tempted to sell the drugs he acquired in his investigation? No, the movie makes a point of him immediately flushing them. Do the Russians tempt him with a bribe to stop? Not even a throw-away scene like that...   \nAnd then, in the only intersection of these plots in the movie, the \"Russians\" set his father-in-laws house on fire. I say \"Russians\" because we don't even see one of our established bad guys doing it. And then, they do it to the father-in-law which is set up to be hateable anyways. His daughter is safe the entire time. Great emotional investment you got from me there, movie. On top of that, his father-in-law is completely fine. So there is zero consequences from this for our protagonist and, again, impacts him in no way. Does it change his motivations? No. Does it change his course of action? No. Does it maybe just make him hesitate a little or reflect on the danger he is causing? Not even that.\n\nSo we have 20 minutes of useless scenes in a movie that is already 20 minutes longer than Taken. On top of that, the movie really undercuts the emotional stakes by making the kidnappers complete buffoons that repeatedly get outsmarted by the kidnapped Girl. I have no problem with giving her more agency, but then do it in a way that makes her seem clever and not by making the bad guys completely non threatening.\n\nAnd lastly, David Ayer cannot help himself to insert his pathos over the top cringe. You want to honor the troops? Fine by me. But to have Jason Statham say to our drug producing and dealing, russian mafia associate, biker gang leader \"My beef wasn't with you\" before killing him because he was also a soldier? Wtf is even the message here?\n\nAll in all, completely wasted opportunity to make a fun, competency porn, Jason Statham against the world movie. Instead, every second scene is pointless, and the bad guys are incompetent and non-threatening. Has David Ayer made anything decent since Fury?",
        "upvotes": 35,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1kubhw5/a_working_man_is_a_disaster/"
    },
    {
        "id": "1ktn43w",
        "author": "Bullingdon1973",
        "title": "The original LILO &amp; STITCH had a famous ad campaign where Stitch ruined different Disney classics. Director Chris Sanders explains the story behind them.",
        "content": "",
        "upvotes": 1668,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EIHxlnizgaxzfqw66x29BaPYsfU6eHEHQmKTQ3DL4K8.jpg?auto=webp&amp;s=cb5ef215de4d765575ef93fcd351c8b6d26b04ae"
        },
        "permalink": "/r/movies/comments/1ktn43w/the_original_lilo_stitch_had_a_famous_ad_campaign/"
    },
    {
        "id": "1ku2lem",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Kevin Smith - Tuesday 6/3 at 3:00 PM ET - Director of 'Clerks', 'Dogma', 'Mallrats', 'Chasing Amy', 'Jay and Silent Bob Strike Back', 'Tusk', 'Cop Out', 'Red State', and much more.",
        "content": "",
        "upvotes": 176,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ie4zur7xjn2f1.png?auto=webp&amp;s=9e08c2d95b244811bfa0bb9aa1c45de05b68ffc4"
        },
        "permalink": "/r/movies/comments/1ku2lem/amaqa_announcement_kevin_smith_tuesday_63_at_300/"
    },
    {
        "id": "1kuevvf",
        "author": "MeagerTrog",
        "title": "Karate Kid Legends appropriateness",
        "content": "Google isn’t really helpful right now since the movie isn’t officially out but I wanted to know from those of you who might have already seen the movie if it would be appropriate to take an 8 year old. \n\nI plan to take one opening night and want to know if there are any scenes I might want to walk out on or any moments where I would need to cover his ears or eyes, stuff like that.",
        "upvotes": 20,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1kuevvf/karate_kid_legends_appropriateness/"
    },
    {
        "id": "1kuchsj",
        "author": "maidenless_pigeon",
        "title": "I watched suburbicon",
        "content": "It's definitely one of the movies of all time, it's not the worst film I've seen but it's up there it really is.\nOscar isaac was good in this movie that was my favourite part by far, uncle mich was also a good character who sadly didn't get much screen time.\n\nThere is a reason it bombed a few actually in my opinion. The one I noticed first was the weird awkward joke scenes that look like they were out of jag with that weird music. Also how the plot didn't make much sense like why were the lights in the line-up room turned on. The old Hollywood chloroform shtick where in reality you have to place the rag over a victims face between 5 and 10 minutes to knock someone out and you need to get the right dosage or you'll either give the victim a headache or they will die.\n\n Also if you hire people to kill your wife pay them on time. Like I said it's not the worst movie it's not something I'd watch again. But I would subject my kids to it though.",
        "upvotes": 21,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1kuchsj/i_watched_suburbicon/"
    },
    {
        "id": "1ktnj05",
        "author": "ChiefLeef22",
        "title": "Stanley Kubrick's 'The Shining' Turns 45: A Horror Classic Borne From Destroying The Source Material",
        "content": "",
        "upvotes": 1081,
        "comments": 190,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yJZRfxfHO1jR4xeH72bl5DUU2Iy59Kt6Wd-XtFxts5A.jpg?auto=webp&amp;s=e77dd55ec73f770d9856478e73507b4dab4905dc"
        },
        "permalink": "/r/movies/comments/1ktnj05/stanley_kubricks_the_shining_turns_45_a_horror/"
    },
    {
        "id": "1ktrow6",
        "author": "BunyipPouch",
        "title": "Questlove Spent 2½ Years Watching All 900-Plus ‘SNL’ Episodes To Prep His 50th Anniversary Documentary 'Ladies and Gentlemen… 50 Years of SNL Music'",
        "content": "",
        "upvotes": 616,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4QMggPCuBW9exX1ahoWOgDMixIQKM1wXBwPZFNq9V3A.jpg?auto=webp&amp;s=ced2d526b6f90aa17aa8647c53e91708eb5b321e"
        },
        "permalink": "/r/movies/comments/1ktrow6/questlove_spent_2½_years_watching_all_900plus_snl/"
    },
    {
        "id": "1ktsr17",
        "author": "NoCulture3505",
        "title": "Michael Jackson Biopic Returning To Production As Movie Is Split Into Two",
        "content": "",
        "upvotes": 459,
        "comments": 247,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oftIwp_KII6XJbMwyAPICi4sle3f49T0LuxaL-uIIDA.jpg?auto=webp&amp;s=947b5ed6de259091cee1daf407920780031b9ba6"
        },
        "permalink": "/r/movies/comments/1ktsr17/michael_jackson_biopic_returning_to_production_as/"
    },
    {
        "id": "1ku02dq",
        "author": "Keefer1970",
        "title": "MTV News: Real College Students Review \"PCU\" (1994)",
        "content": "",
        "upvotes": 156,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pu7wj4dzd7jRewLqMqQTfboLoy5xhanSTj435BzLI9s.jpg?auto=webp&amp;s=c420270051fef375f7ddda7be70ea0175bef4014"
        },
        "permalink": "/r/movies/comments/1ku02dq/mtv_news_real_college_students_review_pcu_1994/"
    },
    {
        "id": "1ktpgwh",
        "author": "SanderSo47",
        "title": "Diego Luna’s Criterion Closet Picks",
        "content": "",
        "upvotes": 618,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gRuDiXuy4zvkCA_P0Ke86rQNfRUzMPvlgVzXxeVUy3g.jpg?auto=webp&amp;s=c4e0e4ea787cbd09c5bd4dddb361c783f008b55f"
        },
        "permalink": "/r/movies/comments/1ktpgwh/diego_lunas_criterion_closet_picks/"
    },
    {
        "id": "1kufm3j",
        "author": "grzlyPOG",
        "title": "actually scary horror movies",
        "content": "me and my mates are planning on watching a horror movies together tonight and are looking for a movie that will actually scare us, we have recently watched hereditary and the babadook and thought they were both fairly scary, weve watched a few of the classics but we want something much more scary, truly spinechilling",
        "upvotes": 11,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1kufm3j/actually_scary_horror_movies/"
    },
    {
        "id": "1ktmvlm",
        "author": "insertusernamehere51",
        "title": "Which moment in a Disney live-action remake most misses the point of the original?",
        "content": "Freezing take: the disney live-action remakes aren't very good. But I think what's most frustrating about these movies is how often it seems that the people tasked with recreating those classic movies don't seem to understand why the original movies were the way they were in the first place.\n\nSo, often, you have times where they will change a certain plot point without understanding why that plot point was important in the original, or the consequences that it has for the rest of the story. Or, on the other hand, you have moments where they will KEEP a certain plot point of the original, while removing the reason for said plot point to exist in the first place. In the current discussion for the recent Lilo and Stitch remake, the most upvoted comment points out that the movie keeps Lilo's ritual of feeding her doll because she claims it controls the weather, while removing the information that Lilo's parents died in an accident caused by bad weather, which gave Lilo's silly ritual emotional weight and purpose.\n\nSo I want to know which moment in these live action remakes is most telling that the writers didn't understand the original movie. For me, I'll submit Pinocchio going to school in the remake. In the original movie, Gepeto tells Pinocchio to go to school, but on the way there, he is accosted by Honest John who convinces him to join the Strombolli's puppet show instead, which Pinocchio agrees, ignoring the advice of his conscience. When Pinocchio joins the puppet show, he is abused by the owner and is only freed when he learns what he did wrong.\n\nIn the remake, after meeting with Honest John, Cricket actually convinces Pinocchio to go to school and he does... only to be abused by the teacher for being a puppet and thrown out, at which point he follows John to the puppet show.\n\nThis is an absolutely baffling change because it completely contradicts the point of the movie. Pinocchio wishes to be a real boy, but in order to achieve that, he must first learn to be a *good* boy, which, among other things, involves obeying his father and steering clear of bad influences. In the original, Pinocchio willingly disobeys his father and fucks off to do something fun instead, which leads to a bad time. It's a simple morality tale; Pinocchio is rewarded for being good, and punished for being bad. Pinocchio's nose grows when lies. All of Pleasure Island. The story is centered on this theme\n\nBut in the remake, not only does Pinocchio obey his father from the start, he is PUNISHED FOR DOING SO. Now, joining the puppet show isn't a reckless decision by Pinocchio, it's his only option because obeying his father was actively bad for him.\n\nMaybe the writers wanted to make Pinocchio a \"better\" character by making him a well-behaved kid but, THE ENTIRE POINT OF THAT SCENE IS THAT PINOCCHIO MISBEHAVES. It's like if they made Pinocchio's nose grow even when he tells the truth\n\nAnyway, that's mine. What's yours?",
        "upvotes": 715,
        "comments": 249,
        "media": null,
        "permalink": "/r/movies/comments/1ktmvlm/which_moment_in_a_disney_liveaction_remake_most/"
    },
    {
        "id": "1ktp3v0",
        "author": "BeneficialSide2335",
        "title": "What is the first R-rated movie you saw when you were not an adult?",
        "content": "For me, it was Dawn of the dead(2004). When I was home alone, I watched it on my computer when I was 10. I remember talking to my friends at school about what kind of cruel movie they watched. Because... uh... at that age, there was something I wanted to show off that I saw something so cruel. It felt like I was more mature. ",
        "upvotes": 503,
        "comments": 1850,
        "media": null,
        "permalink": "/r/movies/comments/1ktp3v0/what_is_the_first_rrated_movie_you_saw_when_you/"
    },
    {
        "id": "1kty3dw",
        "author": "BunyipPouch",
        "title": "Icelandic Sheepdog Panda Wins Palm Dog Top Prize at Cannes Film Festival for 'The Love That Remains' - Honoring Best Dog Performances at the Festival, previous Palm Dog winners include Messi from 'Anatomy of a Fall' and Brandy from 'Once Upon A Time In Hollywood'",
        "content": "",
        "upvotes": 139,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/X5mxeCetC2Q11wdGpoWLCt2eN-ps4_JhejZWwZkdioQ.jpg?auto=webp&amp;s=2516a78cd4113ebd26d335b09b738a710745a9b8"
        },
        "permalink": "/r/movies/comments/1kty3dw/icelandic_sheepdog_panda_wins_palm_dog_top_prize/"
    },
    {
        "id": "1kubfpi",
        "author": "Embarrassed_Bus216",
        "title": "About time (2013) will always have a special place in my heart.",
        "content": "I watched *About Time* a few years ago, and while it made me feel a little sad back then, I didn’t think much of it at the time. Now, after spending a few years in college away from the life I once had and distant from family and old friends rewatching the film hit me much harder.\n\nThis time, it made me sob. The beach scene, in particular, was absolutely perfect. It stirred something deep inside me.\n\nHow I wish I could go back in time, just to relive those simple, beautiful moments of childhood.",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1kubfpi/about_time_2013_will_always_have_a_special_place/"
    },
    {
        "id": "1ku4dyb",
        "author": "Smart-University-574",
        "title": "Your first, and last, time you ugly cried real good during a movie?",
        "content": "My earliest memory was going to an empty theater with my best friend to watch Big Fish. Man by the end of the movie we were UGLY CRYING as we walked out, had a good laugh when the light hit our faces and saw how wrecked we were.\n\nLast time was when I showed my niece Field of Dreams bc she wanted to watch one of my fav sports movies. I have already showed her The Sandlot and Rookie of the Year, but she wasn't ready to see me after Field. She asked me why I was crying so much and I just explained how my dad, her grandpa, worked as an oilfield worker back in the day so he hardly was at any of my little league practices or games. ",
        "upvotes": 26,
        "comments": 188,
        "media": null,
        "permalink": "/r/movies/comments/1ku4dyb/your_first_and_last_time_you_ugly_cried_real_good/"
    }
]