[
    {
        "id": "1obhocr",
        "author": "MistressDispeller",
        "title": "Hi Reddit! I’m Elizabeth Lo, director-producer-cinematographer of MISTRESS DISPELLER (Venice &amp; TIFF 2024, 20 awards, releasing via Oscilloscope) and STRAY (Indie Spirit nominee 2021). MISTRESS DISPELLER is a documentary about a woman who breaks up affairs in China. It's out in theaters now. AMA!",
        "content": "Hi Reddit! I’m Elizabeth Lo, director-producer-cinematographer of MISTRESS DISPELLER (Venice &amp; TIFF 2024, 20 awards, releasing via Oscilloscope) and STRAY (Indie Spirit nominee 2021). MISTRESS DISPELLER is a documentary about a woman who breaks up affairs in China. It's out in theaters now. Ask me anything!\n\nIn China, a new industry has emerged devoted to helping couples stay married in the face of infidelity. Wang Zhenxi is part of this growing profession and is hired to go undercover and break up affairs by any means necessary; a “mistress dispeller.” Offering strikingly intimate access to a real, unfolding love triangle, Mistress Dispeller documents all sides of what is usually kept behind closed doors. As Teacher Wang attempts to bring a couple back from the edge of crisis, sympathies shift between husband, wife and mistress while emotion, pragmatism and cultural norms collide in this spellbinding look at modern love.\n\n**Trailer:** \n\n[https://www.youtube.com/watch?v=yUep-cxvQZo](https://www.youtube.com/watch?v=yUep-cxvQZo)\n\nThe film opens in New York on 10/22 and Los Angeles on 10/23 before expanding around the country in the weeks that follow.\n\nAsk me anything! I'll be back later today (Monday 10/20) at 3:00 PM ET to answer questions :)",
        "upvotes": 87,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5blq5cjif9wf1.png?auto=webp&amp;s=5b3bb73ba5a197ee081188413e052fa6d24ea95f"
        },
        "permalink": "/r/movies/comments/1obhocr/hi_reddit_im_elizabeth_lo/"
    },
    {
        "id": "1obtxe8",
        "author": "SanderSo47",
        "title": "October 17-19 Box Office Recap – 'Black Phone 2' debuts at #1 with a great $27.3M DOM and $42.8M WW. 'Tron: Ares' collapses a steep 67%, earning just $103M WW after two weeks. 'Good Fortune' and 'After the Hunt' flop with $6.1M and $1.5M, respectively.",
        "content": "https://preview.redd.it/nf8pix4l0cwf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=cbbc0038d1a7fb761edb8eb4e9e0c089377a8f7c\n\nAfter a very poor year, Blumhouse bounced back with ***Black Phone 2***, which managed to open above the original title. And in the process, ***Tron: Ares*** had a very ugly second weekend drop. The other wide release, Lionsgate's ***Good Fortune***, had very poor luck with an underwhelming debut, while the wide expansion of Amazon MGM's ***After the Hunt*** flopped.\n\nThe Top 10 earned a combined $60.3 million this weekend. That's slightly down from last year, when ***Smile 2*** topped the box office.\n\nDebuting at #1, Universal/Blumhouse's ***Black Phone 2*** earned a damn great $27.3 million in 3,411 theaters. That's above the original's $23.6 million, and marks Blumhouse's highest debut since ***Five Nights at Freddy's*** ($80 million). Yes, it's been some rough two years for the company. It's also above last year's ***Smile 2*** ($23 million), which opened on this exact same date.\n\nThe fact that it could open higher than the original is a very encouraging sign, considering sequels often tend to drop off from the original. While there were concerns over whether the film really warranted a sequel, props to director Scott Derrickson for pulling off a very interesting angle: the Grabber is back, and now he went the Freddy Krueger route of chasing his victims in his dreams. While that felt derivative from that franchise, it was solid enough to justify its existence. And solid reviews (72% on RT) definitely helped.\n\nAccording to Universal, 53% of the audience was male, and 53% was 25 and over. The film was very popular with Hispanic audiences, representing 39% of the weekend's gross. They gave it a \"B\" on CinemaScore; while this is below the original's \"B+\", it's still a solid score for a horror film. With very light horror competition, this is gonna be the main attraction for horror fans this month. It's unlikely it can match the original's gross ($90 million), as that film had stronger-than-usual legs for horror thanks to very strong word of mouth. But at the very least, ***Black Phone 2*** should have enough gas to hit $70 million domestically.\n\nIn second place, Disney's ***Tron: Ares*** earned $11.1 million. That's a very steep 67% drop, worse than ***Legacy***'s 56.5% drop. With such a soft debut, the film just failed to attract interest outside the most diehard fans of the franchise. Through 10 days, the film has earned a meager $54.5 million, and it will finish with just around $75 million domestically at this rate.\n\nIn third place, Lionsgate's ***Good Fortune*** opened with an underwhelming $6.1 million in 2,990 theaters. That's a very mediocre debut, especially considering that it had Keanu Reeves, Seth Rogen, and Aziz Ansari (its writer and director) attached.\n\nGiven its $30 million budget, this is a disappointing result. But it also shows the challenges of opening an original comedy in theaters; ***One of Them Days*** remains the only original comedy to hit $50 million domestically. It's a very complicated market, and unfortunately, comedies are often the most affected. Even with its intriguing combination (angels on Earth and body-swapping), perhaps the audience wasn't interested in seeing Keanu Reeves in a comedy role. Even with good reviews (78% on RT), it just wasn't enough.\n\nAccording to Lionsgate, 53% of the audience was male. It had almost no appeal for young audiences; a colossal 81% of the audience was 25 and over. They gave it an okay \"B+\" on CinemaScore, and it could hold well over the next few weeks. But right now, it'd be a surprise if it made it to $25 million domestically.\n\nWB's ***One Battle After Another*** eased 43%, adding $3.8 million this week. The film's domestic total stands at $61.7 million so far.\n\nIn fifth place, Paramount's ***Roofman*** added $3.7 million this weekend. That's a rough 54% drop, indicating that word of mouth might not be quite strong with this title. Through 10 days, the film has earned $15.5 million, and it will now finish with less than $25 million domestically.\n\nIn sixth place, Angel Studios' ***Truth &amp; Treason*** debuted with a weak $2.6 million in 2,106 theaters. Even with an \"A\" on CinemaScore, it's unlikely it will last long in theaters.\n\n***Gabby's Dollhouse: The Movie*** dropped 49% for a $1.7 million weekend. The film has earned $30 million, and it should finish with around $35 million domestically.\n\n***The Conjuring: Last Rites*** dropped 49%, grossing $1.6 million. That takes its domestic total to $175.4 million.\n\nIn ninth place, Amazon MGM's release of Luca Guadagnino's ***After the Hunt*** flopped with just $1.5 million in 1,238 theaters. This is Julia Roberts' worst ever debut in wide release, and it wasn't even in Guadagnino's top 3 wide debuts.\n\nThis result is not surprising. The film was positioned as a big Oscar player, but all that buzz died when it premiered in Venice. Adult dramas require critical acclaim to stand a chance, and ***After the Hunt*** was a rare Guadagnino misfire: it's sitting at a very bad 39% on RT. As such, Amazon MGM slowed down its marketing tactic. Couple all that, along with a very delicate subject matter (sexual assault), and the audience was just very limited. And with an awful \"C–\" on CinemaScore, this is going to fall quickly over the next weeks.\n\nRounding out the Top 10 was Sony's ***Soul on Fire***. Despite strong word of mouth, it dropped 53% for a $1.3 million weekend. The film's domestic total stands at $5.5 million.\n\nNeon released the Palme d'Or winner, Jafar Panahi's ***It Was Just an Accident***, in 3 theaters. It earned $68,294, which is a fine $22,765 per-theater average (although that's just the 18th best of the year). As a point of reference, last year's Palme d'Or winner ***Anora*** averaged $91,750 in its first weekend. It will continue expanding over the next few weeks.\n\nSony Pictures Classics also released Richard Linklater's ***Blue Moon*** in 5 theaters. It debuted with $66,000, which is an unremarkable $13,200 per-theater average. It will expand next week to 500 theaters.\n\n#**OVERSEAS**\n\n***Black Phone 2*** debuted with $15.5 million overseas, for a $42.8 million worldwide debut. Its biggest market was Mexico (the biggest OS market for the original), where it opened with a strong $4.3 million. The other markets were the UK ($1.5M), Brazil ($1.2M), Australia ($908K) and France ($569K). It still has some big markets left to open, so this should have a very strong run all the way through Halloween.\n\nFurther embarrassing itself was ***Tron: Ares***. Despite keeping all IMAX and PLF screens, the film dropped by 54% for $14.1 million overseas, taking its worldwide total to a very poor $103.1 million after just 2 weeks. It opened in China, where it flopped with just $2.8 million. Its biggest markets are Mexico ($4.9M), the UK ($4.3M), France ($3.3M), China ($2.8M) and Germany ($2.7M). With very few markets left, it's clear that the film will struggle to hit $170 million. Which means its worldwide total will be below ***Legacy***'s domestic total ($172 million). Deadline is already reporting that due to its high costs, the film will lose over $130 million. Maybe this is truly the end of the franchise?\n\n***One Battle After Another*** added $11.8 million, allowing it to cross the $100 million milestone overseas, and $162.3 million worldwide. The best markets are the UK ($13M), France ($10.1M), Germany ($7.7M), Italy ($5.2M) and Australia ($4.6M). \n\n***Gabby's Dollhouse: The Movie*** added $6.8 million overseas, taking its worldwide total to $58.7 million. It had very good debuts in the UK ($2.3M) and Spain ($1M). Only Japan is left, but that's until March.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*The Roses* | Aug/29 | Searchlight | $6,265,264 | $15,298,844 | $51,137,748 | $30M\n\n- Searchlight's ***The Roses*** has closed with a weak $15 million domestically and $51 million worldwide, failing to recoup its budget. For reference, the original ***War of the Roses*** made $86 million domestically and $160 million worldwide back in 1989. Turns out people just weren't interested in going back to the Roses.\n\n#**THIS WEEKEND**\n\nWe've got a lot of wide releases, and it's up in the air if any will take the #1 spot away from ***Black Phone 2***.\n\nThe first is 20th Century Studios' ***Springsteen: Deliver Me from Nowhere***, which stars Jeremy Allen White as the Boss during the making of his album *Nebraska*. Music biopics have been a gold mine at the box office (well, mostly), so it was inevitable that Bruce Springsteen would get his own biopic. Even if the reviews (66% on RT) do not exactly paint it as a great film itself.\n\nThe other is Paramount's ***Regretting You***, based on the novel by Colleen Hoover. The novel isn't as popular as ***It Ends with Us***, but it doesn't really need that to become a success. Without many romance options in the market, this could be a main attraction for women and couples.\n\nSony is also launching ***Chainsaw Man – The Movie: Reze Arc*** in many big markets. The film has already earned $68 million overseas, most of which came from Japan. We're coming off the massive success of ***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle***, but don't expect this to get anywhere close to those numbers. \n\nNeon is also releasing Chris Stuckmann's directorial debut ***Shelby Oaks*** in wide release. Announced back in 2021, the film became the most-funded horror film project on Kickstarter, allowing it to finally begin production. It has already premiered in festivals and getting some good reviews (83% on RT), and even got Mike Flanagan attached as executive producer. Even Neon is confident enough in the film, as they agreed to double the budget to increase the violence and gore and refine the film. So get ready to get Stuckmannized.\n\nAnd finally, Focus Features is releasing Yorgos Lanthimos' ***Bugonia*** in limited release, ahead of a wide expansion the following week. It stars Emma Stone, Jesse Plemons, Aidan Delbis, Stavros Halkias, and Alicia Silverstone, and follows two young men who kidnap a powerful CEO, suspecting that she is secretly an alien who wants to destroy Earth. It has premiered in so many festivals (just go look at the Wikipedia page, it's insane) and reviews are pretty great so far (91% on RT). With some Oscar buzz on the horizon, this should easily score one of the year's biggest per-theater averages.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 75,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_JDSc9R8Yh3Q1GSUtk9XgHbi4MnvuXrCJEMTg7-Tf_8.png?auto=webp&amp;s=8be12246beb8261d95f130e434917627f81a3d09"
        },
        "permalink": "/r/movies/comments/1obtxe8/october_1719_box_office_recap_black_phone_2/"
    },
    {
        "id": "1obzwl2",
        "author": "Top_Report_4895",
        "title": "Jeremy Strong on Replacing Jesse Eisenberg in 'Social Network' Sequel",
        "content": "",
        "upvotes": 1645,
        "comments": 276,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jlc2Tpz_dTZA3vCvMzay8va9WUu0ZZKkVCbcWiNsvwM.jpeg?auto=webp&amp;s=a4af4777ffc74a63adccb54d1e3b05866e47ad6d"
        },
        "permalink": "/r/movies/comments/1obzwl2/jeremy_strong_on_replacing_jesse_eisenberg_in/"
    },
    {
        "id": "1obtiw2",
        "author": "BunyipPouch",
        "title": "Tim Heidecker &amp; Tatiana Maslany Set For Late-Night-Themed Dark Comedy ‘The Comedy Hour’ - America is on the brink of collapse. A late-night talk show host (Heidecker) is forced to produce his show through famine, fire, &amp; plague. The network assigns a robot to be his co-host and help boost ratings.",
        "content": "",
        "upvotes": 2213,
        "comments": 143,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QLjfKPUCKL_UQ9VORTevvYoHp3kvVWGDHqgFdiY7o-w.jpeg?auto=webp&amp;s=f528364618c5a081d3f2a9fcd95721b5643a39cb"
        },
        "permalink": "/r/movies/comments/1obtiw2/tim_heidecker_tatiana_maslany_set_for/"
    },
    {
        "id": "1objtix",
        "author": "MarvelsGrantMan136",
        "title": "How ‘Tron: Ares’ Ran Off The Grid: Disney Sci-Fi Movie Set To Lose $132M+",
        "content": "",
        "upvotes": 5808,
        "comments": 1439,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8ahp64PgYnymGD6-EsDONM6TMw9LB2K_TcIGRJx-QeU.jpeg?auto=webp&amp;s=25246ef2df18d33c47d3af3339c7a342d6b1c48e"
        },
        "permalink": "/r/movies/comments/1objtix/how_tron_ares_ran_off_the_grid_disney_scifi_movie/"
    },
    {
        "id": "1obrbtx",
        "author": "MarvelsGrantMan136",
        "title": "Ryan Coogler's 'Sinners' is Returning to IMAX Theaters for Halloween (Oct. 30 - Nov. 5)",
        "content": "",
        "upvotes": 1096,
        "comments": 147,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7RTHRpm9IfrieHxDLAhg9jYH4rpSdBUVpEdgEReO5Gk.jpeg?auto=webp&amp;s=f6e04967040cd0858a39a5776f6c6755faf70562"
        },
        "permalink": "/r/movies/comments/1obrbtx/ryan_cooglers_sinners_is_returning_to_imax/"
    },
    {
        "id": "1oc1a52",
        "author": "LiteraryBoner",
        "title": "Planetarium monologue from I Saw the TV Glow (2024, dir. Jane Schoenbrun)",
        "content": "",
        "upvotes": 220,
        "comments": 58,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ygc216l6mdwf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oc1a52/planetarium_monologue_from_i_saw_the_tv_glow_2024/"
    },
    {
        "id": "1obu6dv",
        "author": "SanderSo47",
        "title": "Ethan Hawke Breaks Down His Career, From 'Training Day' to 'Boyhood' | Vanity Fair",
        "content": "",
        "upvotes": 362,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uy5wiVfaRisKfaSJcT1ke0uUIdOk4YNFGhHIE-fmQsU.jpeg?auto=webp&amp;s=5d9fe832bfb7e0c18783dae069602b9c47cf5d2d"
        },
        "permalink": "/r/movies/comments/1obu6dv/ethan_hawke_breaks_down_his_career_from_training/"
    },
    {
        "id": "1obvu86",
        "author": "NoCulture3505",
        "title": "Adam Driver on Jim Jarmusch, 'Star Wars' and putting filmmakers first",
        "content": "",
        "upvotes": 282,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Oj3oOLi3xH8Np617qmbyrvC_gaU7dGlmeofShHb4oes.jpeg?auto=webp&amp;s=07e971ee172499d2a28d1a7072c8db8264fd9adf"
        },
        "permalink": "/r/movies/comments/1obvu86/adam_driver_on_jim_jarmusch_star_wars_and_putting/"
    },
    {
        "id": "1obvz00",
        "author": "imcalledaids",
        "title": "The Strangers (2008) is the first film in a long time to make me truly scared.",
        "content": "I will start this with saying that I understand that there are probably more films that are traditionally scary, or the acting was better, the writing was smoother, etc.  \nAs a horror buff, I’ve become pretty numb to scares. I enjoy horrors for films, not necessarily for the fear. \n\nHowever, I have recently moved with my fiancée. We’re in a whole new location, we’ve gone from living in an apartment in the middle of a city to a house in the suburbs, from a studio to having actual bedrooms. \n\nThe scene where we &gt;!first see the Man in the mask!&lt; had me pausing the film for a minute to just recover. I can see my open bathroom door from where I’m sitting, and that quickly had to close. \n\nI think my biggest fear is being the victim of a home invasion, and I think that was brought up very quickly from this film. \n\nCurious though, are the sequels worth it? ",
        "upvotes": 151,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1obvz00/the_strangers_2008_is_the_first_film_in_a_long/"
    },
    {
        "id": "1obxneb",
        "author": "Empty-Speed-7075",
        "title": "Is the American History X “alternate ending” a myth? I can’t find a single reliable source.",
        "content": "The entire production history of this movie is incredibly bizarre so it’s forgivable if people have misconceptions but I can’t find a reliable source that the movie had an “alternate ending” or “original ending” of Derek shaving his head again in the mirror. The theatrical cut, workprint, and screenplay all follow the same beats. The screenplay by David McKenna ends with something I was surprised by: an incredibly melodramatic, overwritten scene where Sweeney (the principal played by Avery Brooks) talks Derek out of going after the killers before they join the mother and sister in mourning. It’s ambiguous, but so is the actual ending only with no need for dialogue. The workprint version of the film is available online and has the same ending as the theatrical albeit with a couple gruesome shots of violence. I can’t find anything about any version of the movie or the script with a “Derek shaves his head” scene nor can I find statements by the cast or crew verifying this. I suspect it’s one of a few movie myths which originate from IMDB trivia submissions which have been sitting there for decades. (“Darren Aronofsky owns the rights to Perfect Blue” is laughably false and not even plausible but people keep repeating it)",
        "upvotes": 116,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1obxneb/is_the_american_history_x_alternate_ending_a_myth/"
    },
    {
        "id": "1ob91qk",
        "author": "Kimosabae",
        "title": "Finally Saw 28 Years Later... and Discussions about the Ending Has Me Wondering if I'm Brain Damaged.",
        "content": "The Movie itself is pretty good. Not without some issues, but I really appreciate this thing swinging for the fences. One of the most legitimately beautiful films I've seen in some time with some strange editing choices that can't all be easily explained away as stylistic.\n\nIt's divisive for a reason.\n\nThat said... the ending should be one of the least controversial aspects of the film and online criticisms in spaces like this have me wondering if my whole face should be wrapped in a strait jacket.\n\nVAGUE SPOILERS\n\nIf you didn't know that there's supposed to be a follow up film... *maybe* I could understand having pure tonal whiplash. But even then... it's clear the Power Rangers montage wasn't the ending. This was more of a post-credits/epilogue scene further expanding the world.\n\nBut even in the context of the film alone; it earns this supposedly hysterical idea. It's evident from the film itself that there are disperse communities in this post-apocalyptic UK and segregation would engender sociological differences in how they adapt to this hostile world.\n\nThis is Mad Max, post-apocalyptic, sci-fi world-building 101.\n\nThis particular band of roving, Sentai-simulating crazies isn't any more outlandish than an isolated doctor making a tower of babel out of human skulls.\n\nFinding the tone off-putting is one thing (it would likely have worked better as a post-credits scene overall) but I've seen many occasions of people stating that the scene put them off the film and the sequel entirely, which I find to be *completely* mental, personally.\n\nThere are other aspects of the film that I find to be *far* more outlandish than the ending (\"*the magic of the placenta*\"???).\n\nBut maybe it's just me.\n\nDownvote away.\n\n\\*edit\\*\n\nI honestly thought this would just be downvoted and forgotten about in minutes. Or even more likely - closed.\n\nReddit is so random.\n\nMight as well plug some shit, if that's okay?\n\n[If you care about health and fitness please sub to the Youtube channel!](https://youtu.be/aWERcKIhHow?si=uZaHmB0gI4ctTa4n)\n\nAlso, follow on [instagram](https://www.instagram.com/theoriginalkye/?hl=en)!\n\nFinally, I do online training! If you're interested, fill out a [consultation form!](https://docs.google.com/forms/d/e/1FAIpQLSck21tNZGpAfvs_SONXlyvGiPY20LII-j70UgM9hkYGokxdHg/viewform)\n\nThanks!",
        "upvotes": 4737,
        "comments": 1248,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Jr8i3bn2nd9BJW8xsVdHRzXTWMXm1_UTEPQaFr-HFPU.jpeg?auto=webp&amp;s=24ef914eef2237a3998e26d13fcdbe509349f779"
        },
        "permalink": "/r/movies/comments/1ob91qk/finally_saw_28_years_later_and_discussions_about/"
    },
    {
        "id": "1obleyw",
        "author": "NoCulture3505",
        "title": "‘Wicked: For Good’ Casts Colman Domingo as Cowardly Lion",
        "content": "",
        "upvotes": 403,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IxSa9ch8tDbeGH2nPUYU6e2mgRORMMT8f1fmJSG1RN8.jpeg?auto=webp&amp;s=dd640b39706ff7172b84d05c06c457e5449cb673"
        },
        "permalink": "/r/movies/comments/1obleyw/wicked_for_good_casts_colman_domingo_as_cowardly/"
    },
    {
        "id": "1oc6boc",
        "author": "L0udM0uth666",
        "title": "What’s a movie that completely changed your perspective after a second watch?",
        "content": "Sometimes a movie doesn’t hit you the first time you watch it. Maybe you were too young, distracted, or just didn’t understand the themes. On a second viewing, the story, performances, or hidden details completely change your perspective. Which movies surprised you this way, and what about them stood out on the rewatch that you didn’t notice the first time?",
        "upvotes": 19,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1oc6boc/whats_a_movie_that_completely_changed_your/"
    },
    {
        "id": "1obwy19",
        "author": "GoldDerby",
        "title": "Barry Sonnenfeld recalls the disastrous first cut of ‘Get Shorty’ on its 30th anniversary:",
        "content": "",
        "upvotes": 60,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9TD3Onqw7lWoyHgaiH1myyi_WJqbpZ0fa2FhdK8KE9A.jpeg?auto=webp&amp;s=71b87b2a1e1e878c8c0601768df7e4ba1ff63d49"
        },
        "permalink": "/r/movies/comments/1obwy19/barry_sonnenfeld_recalls_the_disastrous_first_cut/"
    },
    {
        "id": "1ob8go5",
        "author": "TheWor1dsFinest",
        "title": "What do you think is Netflix’s best movie so far?",
        "content": "Got to thinking about this because I just got done watching K-pop Demon Hunters for the first time (as fantastic as everyone said). \n\nMy vote would be for The King (2019). I don’t understand how it continues to fly under the radar. 2019 was absolutely stacked with great films (Parasite, Midsommar, Little Women, Once Upon a Time in Hollywood, etc.). and this was right up there with any of them to me. The screenplay and cinematography are fantastic, the performances are great (though I think Robert Pattinson might have been a miscast), and it’s Timothee Chalamet’s best role to date in my opinion.",
        "upvotes": 1422,
        "comments": 984,
        "media": null,
        "permalink": "/r/movies/comments/1ob8go5/what_do_you_think_is_netflixs_best_movie_so_far/"
    },
    {
        "id": "1obxtuq",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Michael Waldron - Tuesday 10/28 at 3 PM ET - Creator &amp; Showrunner of 'Chad Powers', 'Loki', and 'Heels' - Writer of 'Doctor Strange in the Multiverse of Madness' and 'Avengers: Doomsday' - Producer of 'Rick and Morty'",
        "content": "",
        "upvotes": 29,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zijh0m7rtcwf1.png?auto=webp&amp;s=eb2880a9554cd386b6864b7223e88bbed9765487"
        },
        "permalink": "/r/movies/comments/1obxtuq/amaqa_announcement_michael_waldron_tuesday_1028/"
    },
    {
        "id": "1obts13",
        "author": "Comic_Book_Reader",
        "title": "‘Terrifier’ star Jenna Kanell to lead ocean-set survival horror ‘The Hatchery’, AMP launches ahead of AFM.",
        "content": "&gt;The synopsis reads: “Eight women awaken in darkness inside a cargo container with no memory of how they got there. Captives of a human trafficking ring, their fight for survival turns even more desperate when a violent storm hurls their container into the ocean. Stranded at sea, they band together against the odds — until one of them begins to change. Her wounds heal unnaturally fast, her strength grows monstrous, and the others realize the truth: she’s not just a victim, but the product of a horrifying experiment. Trapped with a predator, survival takes on a whole new meaning.”",
        "upvotes": 34,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hxgtJp8u9TyqPhIlSkd7PMdF8DMgiyjcoGkY4cjXTsA.jpeg?auto=webp&amp;s=4bd528e8f231f1174645bba14a8a5a367a2367de"
        },
        "permalink": "/r/movies/comments/1obts13/terrifier_star_jenna_kanell_to_lead_oceanset/"
    },
    {
        "id": "1oc7hpr",
        "author": "Isaac3699",
        "title": "What’s one movie that genuinely made you think about it for ages? Mines the perks of being a wallflower, I love it",
        "content": "I’d love to see what other movies make people feel this way. After watching the perks of being a wallflower I never stop thinking about it. Even the quotes live in my head, “we accept the love we think we deserve” or “in that moment I felt infinite”. There’s so many more quotes but those are Definetly both my favourite.",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1oc7hpr/whats_one_movie_that_genuinely_made_you_think/"
    },
    {
        "id": "1oaoxy8",
        "author": "Amaruq93",
        "title": "Behind the Scenes footage from the making of \"Van Helsing\" (2004)",
        "content": "",
        "upvotes": 9244,
        "comments": 386,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1mlqn1vtf2wf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oaoxy8/behind_the_scenes_footage_from_the_making_of_van/"
    },
    {
        "id": "1obmw37",
        "author": "MrShadowKing2020",
        "title": "Netflix Lands Holiday Comedy ‘The In-Claus’ From Lord Miller And Writer Travis Braun",
        "content": "",
        "upvotes": 37,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Nq36XDiFSat0cpFki6On3XUMX9cH-SSkIr1UOq6BtHU.jpeg?auto=webp&amp;s=bfb077e93796e14d75979453260bfabdc6c629e5"
        },
        "permalink": "/r/movies/comments/1obmw37/netflix_lands_holiday_comedy_the_inclaus_from/"
    },
    {
        "id": "1oboinl",
        "author": "Fan387",
        "title": "Veteran Bollywood actor Govardhan Asrani passes away at 84",
        "content": "",
        "upvotes": 30,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1oboinl/veteran_bollywood_actor_govardhan_asrani_passes/"
    },
    {
        "id": "1ob40ll",
        "author": "Amaruq93",
        "title": "\"Re-Animator\" at 40 | A famously lurid horror movie turned Jeffrey Combs into a genre all-star",
        "content": "",
        "upvotes": 907,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5GZHSefpwgjpIkyFHtqXqltpqdSWH2cjNKAf08zaMgM.jpeg?auto=webp&amp;s=c715aa68412931c2009f7672b4bdcaadaca445f4"
        },
        "permalink": "/r/movies/comments/1ob40ll/reanimator_at_40_a_famously_lurid_horror_movie/"
    },
    {
        "id": "1obabwz",
        "author": "vrschikasanaa",
        "title": "What is the most well-executed and/or memorable jump scare you've ever seen in a movie/show?",
        "content": "What is the one scene that stuck with you to this day and scared the hell out of you?\n\nI think mine would probably be in Hereditary when there's a certain someone sawing away....I was already so tense from the very beginning of that scene, I remember having such a visceral reaction to even the sounds the wire was making.",
        "upvotes": 240,
        "comments": 602,
        "media": null,
        "permalink": "/r/movies/comments/1obabwz/what_is_the_most_wellexecuted_andor_memorable/"
    },
    {
        "id": "1obaq6w",
        "author": "CosmosisJones42",
        "title": "What’s one tiny behind the scenes thing that completely changed movie history?",
        "content": "i’ve been thinking about how one tiny decision can flip movie history. like how pulp fiction only exists because tarantino’s first idea for true romance 2 got rejected, or how toy story 2 was almost deleted entirely when someone hit the wrong key, and a backup on one animator’s home computer literally saved it.\n\nstar wars almost fell apart when fox slashed the budget and rushed the schedule, but all those limitations ended up forcing lucas to get creative with models and editing, which gave it that rough, lived-in feel everyone loved. and titanic nearly got shut down halfway through filming because of cost overruns, but cameron gambled everything and pushed through, and it became the biggest movie ever.\n\nit’s wild how much of film history just comes down to luck, chaos, or someone refusing to quit. what’s your favorite little behind-the-scenes thing that ended up changing everything?",
        "upvotes": 223,
        "comments": 211,
        "media": null,
        "permalink": "/r/movies/comments/1obaq6w/whats_one_tiny_behind_the_scenes_thing_that/"
    },
    {
        "id": "1oc7bk8",
        "author": "frolicols",
        "title": "What minor movie characters have had the biggest pop culture influence?",
        "content": "What minor movies characters have had the biggest influence on pop culture for the screen time they have had?\n\nTwo that spring to mind is Mary in Total Recall (if you know, you know) or Bixby Snyder in Robocop (I'd buy that for a dollar).\n\nTLDR: Characters with minimum screen time but maximum pop culture reference.",
        "upvotes": 3,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1oc7bk8/what_minor_movie_characters_have_had_the_biggest/"
    },
    {
        "id": "1oaunvh",
        "author": "Slight-Response-6613",
        "title": "Romeo + Juliet (1996) absolutely rules",
        "content": "I have no idea why this movie isn’t considered a classic. It is one of the most stylistically interesting and entertaining movies I have seen a while - and I’m not just talking about Shakespeare adaptations here, I mean literally out of all movies.\n\nIt oozes phrenetic energy, swagger and sheer style in every single frame. The costumes, the sets, the lighting, the editing - you feel like watching an explosion of overconfident late 90s aura that’s injected directly into your eyeballs.\n\nAnd the acting? I’m just gonna say every single actor knew exactly what kind of film they were in and they deliver appropriately scene chewing performances. With young Leo dicaprio at the height of his twink fame, as well as Claire Danes as Juliet (who we all know has insane chops from her TV outings) - their chemistry is just fantastic. Everyone else in this movie is fantastic too (shout out to Mercurio).\n\nLike this movie might have been seen as over the top when it first came out, but I’m not gonna lie it aged like a fine wine. I feel like it is probably more in tune with pop culture nowadays than it was even in the 90s (I literally wanna wear every single outfit from this movie).\n\nNot to say it’s all just bombastic silliness - some scenes, like the balcony scene, feel genuinely sweet, and oddly ethereal. This movie has such a unique vibe (I honestly feel that euphoria was kinda inspired by it in terms of the atmosphere it manages to create).",
        "upvotes": 1217,
        "comments": 276,
        "media": null,
        "permalink": "/r/movies/comments/1oaunvh/romeo_juliet_1996_absolutely_rules/"
    },
    {
        "id": "1oc6hyl",
        "author": "Born-Cucumber-7316",
        "title": "Det. Sonny Grosso tells how and why Jimmy Caan got shot up bigger-than-life at that famous tollbooth scene in The Godfather",
        "content": "[This story excerpt is from Sonny Grosso’s biography, Harlem to Hollywood]\n\nDet. Sonny Grosso actually helped revolutionize the role of the technical consultant for cop movies, with film critic James Monaco once observing, “Sonny Grosso has had a hand in most of the major cop films and television series of the 1970s” while jokingly speculating that someday scholars would discuss “Grossovian subtexts” about the period’s police dramas.\n\nAfter the last day of filming The French Connection, director Billy Friedkin took his technical adviser, NYPD Det. Sonny Grosso, over to Filmways studio (East 127th) to talk to Francis Ford Coppola who was prepping to direct the first movie in his Godfather opus. \n\nAs adviser on the set, Grosso recalls: “Coppola would ask me things about cops and wiseguys. One story is about the scene where James Caan as passionate but hothead ‘Sonny’ Corleone is shot at the tollbooth. Every night, Francis and I would talk about what we were going to film the next day. So, he asks me about the tollbooth scene and I suggest, ‘You know when you use a “machine gun, it makes a hole only this big going in but this much bigger going out. So, when you got five guys shooting machine guns, not only will you not find Jimmy Caan, you won’t find the f-ing car he drove up in.’ Francis says, ‘Let me think about that.’ Next morning I’m getting a haircut for the scene, where I’m playing one of those shooters, and Francis says, ‘You know, Sonny, I thought about what you said and I respect what you do and I know you’re an expert. But we’re going to do it another way.’\n\n“As cops we don’t even know what’ll happen when our guns go off. But Francis explains, ‘I understand what you’re saying. But Sonny Corleone is larger-than-life in this movie and you can’t shoot him unless you shoot him up big.’ I’m thinking, ‘Nobody will hear from this director again.’ And next year, he’s Academy Award-winning Francis Ford Coppola (for Adapted Screenplay). That made me feel two inches high. But the good thing it taught me was that everything isn’t the way that you think it is in the entertainment business. And you’re allowed to take ‘creative license.’ Little by little, I learned from that as I later became a movie/TV producer myself. Meanwhile, Jimmy Caan got dramatically torn to shreds at the tollbooth…and, yeah I got to play an extra, like Francis promised me, who shot Sonny Corleone.”\n\nCheck out the trailer for that shootout scene:\n\nhttps://www.youtube.com/watch?v=sJU2cz9ytPQ\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bdxTJRfTHiBl-hg1zDmzgg8t6CaV-OIUq0KMAmHjxrY.jpeg?auto=webp&amp;s=a0940ab254782d85eb5f90adcb5360c220bc076d"
        },
        "permalink": "/r/movies/comments/1oc6hyl/det_sonny_grosso_tells_how_and_why_jimmy_caan_got/"
    },
    {
        "id": "1obf6wd",
        "author": "Alicentscat",
        "title": "His Three Daughters deserved to be recognized",
        "content": "Probably few of you are familiar with His Three Daughters. It was a movie on Netflix last year starring Natasha Lyonne, Elizabeth Olsen and Carrie Coon. I wanted to spread this awareness because it's too good and I remember it wasnt even top 5 movies when it released on Netflix and neither did it get any award.  \nIt currently holds 97/82% on RT and the plot is basically three estranged daughters reunite to take care of their dying father.  \nThe thing about the movie is that from the very first scene you know it's different and it seems almost like a stage play with it's monologues, you truly get into the person's head. All those actresses did one of the best performance I've seen them do ever, but what I truly love about the film is how comforting it is. With it's fall season theming think of Little Women but more personal and quiter.   \nIt's Fall so I really recommend you check it out because that film really deserved the attention it sadly never got",
        "upvotes": 47,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1obf6wd/his_three_daughters_deserved_to_be_recognized/"
    },
    {
        "id": "1oaxq6q",
        "author": "LiteraryBoner",
        "title": "Snake Eyes (1998, dir. Brian De Palma) Detective Santoro questions the boxer. Featuring Nicolas Cage and Stan Shaw",
        "content": "",
        "upvotes": 593,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o0z28m3674wf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oaxq6q/snake_eyes_1998_dir_brian_de_palma_detective/"
    }
]