[
    {
        "id": "1lpvbzw",
        "author": "HeadsOfStateAMA",
        "title": "Hello r/movies! Ilya Naishuller here. I'm the director of Hardcore Henry, Nobody and vocalist/guitarist in the indie rock band Biting Elbows. My new movie, Heads of State (starring John Cena, Idris Elba, Priyanka Chopra Jonas and Jack Quaid), is hitting Amazon Prime today. AMA!",
        "content": "Hello r/movies! Ilya Naishuller here. I'm the director of Hardcore Henry, Nobody and vocalist/guitarist in the indie rock band Biting Elbows. My new movie, Heads of State (starring John Cena, Idris Elba, Priyanka Chopra Jonas and Jack Quaid), is hitting Amazon Prime today. AMA! \n\nHere's the trailer:\n\n[https://www.youtube.com/watch?v=8J646zM7UM8](https://www.youtube.com/watch?v=8J646zM7UM8)\n\nSynopsis:\n\nU.S. President Will Derringer and British Prime Minister Sam Clarke have a not-so-friendly and very public rivalry. However, when Air Force One gets shot down over enemy territory, they find themselves on the run and working together to thwart a global conspiracy that threatens the entire free world.  \nIt'll be streaming on Prime Video starting today.\n\nI'll be back at 3 PM ET today to answer your questions. AMA!",
        "upvotes": 320,
        "comments": 247,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o11cg0exlgaf1.png?auto=webp&amp;s=8127f9e4902b626ab117320d5e30dfc440c5f212"
        },
        "permalink": "/r/movies/comments/1lpvbzw/hello_rmovies_ilya_naishuller_here_im_the/"
    },
    {
        "id": "1lr61a7",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Jurassic World Rebirth / Heads of State / The Old Guard 2 / Ice Road: Vengeance) plus throwback discussions!",
        "content": "**New In Theaters**:\n\n* [Jurassic World Rebirth](https://old.reddit.com/r/movies/comments/1lqdtaw/official_discussion_jurassic_world_rebirth/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [The Perfect Storm](https://old.reddit.com/r/movies/comments/1lr5yfc/official_throwback_discussion_the_perfect_storm/?)\n* [The Patriot](https://old.reddit.com/r/movies/comments/1lr5ygy/official_throwback_discussion_the_patriot_spoilers/?)\n* [The Adventures of Rocky &amp; Bullwinkle](https://old.reddit.com/r/movies/comments/1lr5yi5/official_throwback_discussion_the_adventures_of/?)\n\n**Still In Theaters**:\n\n* [F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n* [M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n* [From the World of John Wick: Ballerina](https://old.reddit.com/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/?)\n* [The Phoenecian Scheme](https://old.reddit.com/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/?)\n\n\n**New On Streaming:**\n\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 41,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1lr61a7/official_discussion_megathread_jurassic_world/"
    },
    {
        "id": "1lthzdy",
        "author": "dvsinla",
        "title": "Saw Spaceballs in 70mm last night... sound cut out, audience took over, it was amazing",
        "content": "Went to see Spaceballs in 70mm last night in Hollywood… part of a summer 70mm program.\n\nIt was packed.\n\nThe movie started great as usual... but right when Dark Helmet gets to Mr. Radar, the sound cuts out.\n\nSo we all end up watching in silence for about 5 minutes…\n\nBut the best part? Since most people there knew the movie by heart, they just started doing the dialogue out loud. It was hilarious. People were actually matching the lip movements on screen.\n\nEventually they had to cancel the screening, which was a bummer, but those 5 minutes were awesome. I would’ve honestly watched the whole thing that way. I know it by heart.",
        "upvotes": 3183,
        "comments": 158,
        "media": null,
        "permalink": "/r/movies/comments/1lthzdy/saw_spaceballs_in_70mm_last_night_sound_cut_out/"
    },
    {
        "id": "1ltlh9d",
        "author": "DemiFiendRSA",
        "title": "Scarlett Johansson Becomes Hollywood’s Highest Grossing Lead Actor With ‘Jurassic World Rebirth’",
        "content": "",
        "upvotes": 913,
        "comments": 188,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5LsF-9mqXB03YDesSKAqkowzaFLSsqAZfJie8Qv95W0.jpeg?auto=webp&amp;s=52fec97e3600bc0c8bae61f4c25ecb5fd82d18c5"
        },
        "permalink": "/r/movies/comments/1ltlh9d/scarlett_johansson_becomes_hollywoods_highest/"
    },
    {
        "id": "1lt5rcj",
        "author": "ChiefLeef22",
        "title": "'Psycho' at 65: How Alfred Hitchcock revolutionised cinema start times | Before 'Psycho', it was fairly common for people to just “show up\" to movies halfway through a film, watch the second half and then stay for the first half of the next showing. Hitchcock insisted cinemas to become more strict",
        "content": "",
        "upvotes": 4388,
        "comments": 205,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w59vi6gMRTe8CNuTl32zx3NNI3swHS5d5yIUzyqRE2Q.jpeg?auto=webp&amp;s=b8de22f4632549dbaa73811f96d6e234c7d71751"
        },
        "permalink": "/r/movies/comments/1lt5rcj/psycho_at_65_how_alfred_hitchcock_revolutionised/"
    },
    {
        "id": "1ltgnjg",
        "author": "thebigeverybody",
        "title": "Most distracting use of sound effects you've ever heard in a movie?",
        "content": "I used to do SFX and my first job out of university was a shock to me because I realized motorbikes and gunshots on screen didn't sound like actual motorbikes or gunshots. I suddenly realized the studio's collection of 100 000 sound effects was useless without the experience to know which 50 effects the audience had been conditioned to accept as authentic by other films. And then there as the foleying that I helped with, in which a man kneeing a watermelon doesn't sound like a Hollywood effect, a real punch to the face doesn't sound like a Hollywood effect, but a man kneeing a watermelon with olive oil on his leg sounded \"right\" for reasons I can't explain.\n\nSomething I appreciate in the filming of movies is when the actors are actually shouting in loud environments (nightclubs, windstorms) because they're recorded in silence and the music/wind is added later. What this usually results in is the audio being loud to establish it's loud, then the SFX editor has to radically drop the levels because the actors have been recorded talking in their normal voices. I appreciate it when the director gives them directions to act like they're in a loud place. I was on a set once where the director had the actors put earplugs in so they HAD to yell (everyone in the scene had long hair or were given weird hats to hide the ear plugs).\n\nAnyways, I'm watching Bullet Train Explosion right now and they just used the Wilhelm scream for a student getting punched. I had to burst out laughing because, well, it sounds right when someone falls off a cliff, not when someone falls over a train seat.\n\n\n\n",
        "upvotes": 545,
        "comments": 507,
        "media": null,
        "permalink": "/r/movies/comments/1ltgnjg/most_distracting_use_of_sound_effects_youve_ever/"
    },
    {
        "id": "1ltn2ge",
        "author": "Just_Rice63",
        "title": "Iranian film director Beiraghi: several crew members sentenced to prison and fines over movie about a female singer defying Iran’s ban on women performing publicly",
        "content": "",
        "upvotes": 137,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1ltn2ge/iranian_film_director_beiraghi_several_crew/"
    },
    {
        "id": "1lte5b5",
        "author": "tonivesdream",
        "title": "The Story behind The Day After” (1983) - possibly the most important movie ever shown on TV. (OC)",
        "content": "I’ve been obsessed with the cultural shockwave that The Day After (1983) created for quite a while. \n\nA made-for-TV movie that somehow ended up scaring the hell out of hundreds of millions people and left Ronald Reagan “greatly depressed”, leading to him rethinking the nuclear arms race.\n\nAfter weeks of research, I was lucky enough to speak with director Nicholas Meyer himself, plus the PR mastermind behind the film, Josh Baran, who helped turn it into one of the most talked-about broadcasts in American history.\n\nIt feels like this story is somehow just as relevant now as it was back then. \n\nWould love to hear your thoughts and I hope you enjoy! ",
        "upvotes": 451,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1oU1slvMAbCrFRJ_sTJDrqVb4mRoCo0sCEbvjb0OvQ8.jpeg?auto=webp&amp;s=4ee14b592f8f4a59ae7bdd16ddb0513856a506c9"
        },
        "permalink": "/r/movies/comments/1lte5b5/the_story_behind_the_day_after_1983_possibly_the/"
    },
    {
        "id": "1lt06s3",
        "author": "Infinite-Fold-1360",
        "title": "'Vietnam was insane, Apocalypse Now only slightly less so': The inside story of the wildest shoot in film history",
        "content": "A good read about Apocalypse now. Been over 15 years since I watched the movie. I knew it was a very difficult movie to make but this article made me realise that coppala had to overcome insurmountable barriers.\n\nMore than the oliver stone triology or full metal jacket, it is apocalypse now that probably resonates more with the Vietnam war. The entire setting makes you undergo that disturbing feeling of war. The fact that the entire cast and crew underwent similar territory as the soldiers, could probably be one of the reasons.",
        "upvotes": 2857,
        "comments": 131,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4O1LekHwTC8PrtW5KjARAZeJrPyXFpipRTEtqysGE5w.jpeg?auto=webp&amp;s=b98e81ff87d0228d6e1669b2a6075c91d30c8f8b"
        },
        "permalink": "/r/movies/comments/1lt06s3/vietnam_was_insane_apocalypse_now_only_slightly/"
    },
    {
        "id": "1ltedg2",
        "author": "BunyipPouch",
        "title": "'Jaws' - Official 50th Anniversary IMAX Re-Release Trailer",
        "content": "",
        "upvotes": 377,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kms9gndI0SHCvkGtROkrWJghn-7tM2_A7oItVOkeUpQ.jpeg?auto=webp&amp;s=bfb07d744e89dbb43e4b8a322fd3875937b9289a"
        },
        "permalink": "/r/movies/comments/1ltedg2/jaws_official_50th_anniversary_imax_rerelease/"
    },
    {
        "id": "1lt2u5a",
        "author": "lockerbiestreet",
        "title": "Which movie completely surprised you — in a bad way?",
        "content": "There was a positive surprise thread yesterday that made me wonder what films have you been PUMPED to see only to be massively (or minimally) disappointed by the end product? \n\nFor me \"The Green Knight\" had a great trailer full of compelling visuals and I was excited to see Gawain get the big screen A24 treatment, but found the film to be a letdown. It's not that it's a bad film, it just was not what I expected. \n\nSequels:\n\nMission: Impossible - Dead Reckoning Part 1 was such a bummer after a franchise high with Fallout.\n\nThe Accountant 2 - buddy film molded into the world of \"The Accountant\". It didn't embrace what made the first one a sleeper hit.  \n\nJoker: Folie a Deux - amazing visuals in incredible promotional materials but such a slog. ",
        "upvotes": 1218,
        "comments": 1486,
        "media": null,
        "permalink": "/r/movies/comments/1lt2u5a/which_movie_completely_surprised_you_in_a_bad_way/"
    },
    {
        "id": "1lsw512",
        "author": "ChiefLeef22",
        "title": "The LA Philharmonic performs the ‘JAWS’ score live alongside the film at the Hollywood Bowl.",
        "content": "",
        "upvotes": 3831,
        "comments": 122,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ixvw1g7lq7bf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1lsw512/the_la_philharmonic_performs_the_jaws_score_live/"
    },
    {
        "id": "1lta9kb",
        "author": "indiewire",
        "title": "'Clueless': Unseen Footage Released for 30th Anniversary",
        "content": "",
        "upvotes": 415,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BQmFVyodlJPAWwAtWq1EmHsM6gtaZnhLaV_NMS5NmVs.jpeg?auto=webp&amp;s=980170375a2621b2e53507e8388a42ac52e495c0"
        },
        "permalink": "/r/movies/comments/1lta9kb/clueless_unseen_footage_released_for_30th/"
    },
    {
        "id": "1lt7ays",
        "author": "Wonder-Lad-2Mad",
        "title": "I didn't know how bad I was aching for a chick flick until Kpop Demon Hunters (2025) satisfied that desire out of nowhere. What a kick ass movie from every angle.",
        "content": "This is just a spoiler free recommendation\n\nFirst and foremost, I don't like Kpop. Don't really listen to it. Not a pop person in general. Just listen to a few hits here or there, I'm saying this to highlight I'm not the targeted demographic for this flick. But despite that the premise of this movie, popstars Vs. Demons seemed really intresting to me. So I went in with doubts and walked out with my mind blown. This was one of the best things that came out this year and as far as animation goes, one of the best animated things I've seen in a long while.\n\nThat biggest thing that has floored me about this movie is just the sheer amount of outfits the characters change into. They fucking went HAM on their character designs. The animation quality and the exquisite taste of this movie are top notch. Smooth Sakuga action scenes at every corner.\n\nI can't praise this movie enough. It's perfect from every angle. It's bursting with Korean culture and It's fucking hilarious, the comedy is spot on. It's taking aspects from K-movies, dramas, music, fashion. Everthing. The story is also fucking amazing when it hits it's emotional peaks.\n\nThe biggest compliment I can give this movie is that it's like capturing those imaginary music videos we make in our heads when listening to music and animating it into an hour and a half montage.\n\nThe songs in this movie have potential to be \"Let It Go\" annoying with the overuse. Because they're catchy af.\n\nI didn't know how bad I was aching for a good ~~chick flick~~ (**EDIT**: ***Not*** a chick flick, my bad. I misinterpreted the term. I meant girl power action movie) until this satisfied that desire spontaneously. It brought back a sense of nostalgia for me of watching Totally Spies for some reason. It's the superhero/ teenager work, life balance vibes that they share.",
        "upvotes": 601,
        "comments": 106,
        "media": null,
        "permalink": "/r/movies/comments/1lt7ays/i_didnt_know_how_bad_i_was_aching_for_a_chick/"
    },
    {
        "id": "1lt2uss",
        "author": "Express_Classic_1569",
        "title": "The stained glass knight in Young Sherlock Holmes (1985) - The first fully CGI human character in a movie.",
        "content": "This groundbreaking scene, created by Lucasfilm’s Graphics Group (later Pixar), featured the first fully CGI human character in a live-action film: a knight made entirely of stained glass that steps out of a church window. A true milestone in visual effects history.",
        "upvotes": 927,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rt_3trYFC6sN40WzyK6nQA5v3Kx30Pz3ntfOBb-ECLA.jpeg?auto=webp&amp;s=40d282456a6a6a93141f7b9fa1e6289279a1f0c7"
        },
        "permalink": "/r/movies/comments/1lt2uss/the_stained_glass_knight_in_young_sherlock_holmes/"
    },
    {
        "id": "1ltmf6a",
        "author": "wordsandwich",
        "title": "I think I finally understand No Country for Old Men for myself",
        "content": "I've always loved this movie since I first saw it in theaters, but I think I've always struggled to connect with it thematically. Obviously the movie is subject to a wide variety of interpretation, but I saw it again last night and there were a couple of scenes that stood out to me this time:\n\n1. The conversation Sheriff Ed Bell has with his brother. His brother brings up the point about having humility and warns Ed not to believe the world *works differently for you*.\n\n2. The scene where Carson Welles meets Lleweyln Moss in the hospital in Mexico. Carson is talking about Chigurh, and Llewelyn makes the comments \"Who is this guy? The ultimate badass?\" in kind of an annoyed tone of voice.\n\nThe three main protagonists of the movie, Llewelyn, Ed Bell, and Chigurh, all share the same flaw to varying degrees--they all share in a degree of personal exceptionalism:\n\n1. Ed Bell believes at some level that he's on a noble path, and like he tells his brother, he felt like his choices would be validated in the end by \"God suddenly coming into my life\"--feeling like his life would culminate in some spiritual satisfaction and was therefore meant to be. He has become disillusioned by the lack of this feeling--a lack of success or victory as a lawman (as he sees it), with the criminals getting away with heinous, senseless violence. He can't even find closure in his personal life--the dream he describes to his wife in the end symbolizes that: it doesn't have a happy, meaningful ending--it just ends.\n\n2. Llewlyn thinks *he* is the ultimate badass and that he's smart/tough enough to overcome any adversary, even if it's the full brunt of the drug cartel. He tries to act like he's Rambo by putting all of his Vietnam combat experience into staging his escape/cat-and-mouse hunt with Chigurh, and his ego won't let him give up the fight. Carla Jean is enamored by this quality when she tries to tell Ed Bell that Llewelyn can take on all comers. In actuality, we see, as Carson points out, that he's a loser who can't make ends meet and is really not that difficult to predict. The movie devotes a fair number of scenes to him \"prepping\" for the fight by buying various things from sporting goods stores, and as a moviegoer you expect some kind of Rambo/A-Team/MacGyver-esque ingenuity from that, but it doesn't really amount to much. His skills and instincts keep him alive for a while, but he never really turns the tables and is vastly outnumbered by the cartel, which has no dearth of hitmen after him.\n\n3. Chigurh, of course, is delusional and insane and believes he is some sort of supernatural force of fate.\n\nAll three guys commit the sin of vanity in their own ways, and Reality ensues for them all, but the only one to cash his chips in and move on with life is Bell. He is humbled by the carnage and literally escapes with his life after he decides to give up his pursuit (with Chigurh right there!). That's the movie for me--it's an all-time great movie that still has me thinking about it nearly twenty years later.",
        "upvotes": 51,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1ltmf6a/i_think_i_finally_understand_no_country_for_old/"
    },
    {
        "id": "1ltherl",
        "author": "LetMeExplainDis",
        "title": "Has a movie's rating ever revealed a spoiler?",
        "content": "Let's say a movie is rated R for suicide themes or sex scenes etc. If you're nearing the end and you still haven't seen that particular thing then you already know what's going to happen and you can probably guess which character it happens to. Most of the time it's not a big deal but has this ever spoiled a major plot point for you?\n\nObviously use spoiler text for your answers.",
        "upvotes": 104,
        "comments": 67,
        "media": null,
        "permalink": "/r/movies/comments/1ltherl/has_a_movies_rating_ever_revealed_a_spoiler/"
    },
    {
        "id": "1ltjofl",
        "author": "Dry-Funny-6946",
        "title": "Most consistent actor?",
        "content": "Be it script selection or acting performance or both. Who do you think is the most consistent actor \n\nMy answer: Willem DaFoe. He’s got both great acting skills and great script selection skills. You can almost say that if he’s in a movie, it’s probably gonna be good or an interesting at the very least",
        "upvotes": 71,
        "comments": 160,
        "media": null,
        "permalink": "/r/movies/comments/1ltjofl/most_consistent_actor/"
    },
    {
        "id": "1lt7ykd",
        "author": "BunyipPouch",
        "title": "'Hearts of Darkness: A Filmmaker's Apocalypse' - Official 4K Restoration Trailer - A documentary film about the production of 'Apocalypse Now', Francis Ford Coppola's 1979 Vietnam War masterpiece.",
        "content": "",
        "upvotes": 369,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zL4KnCB2nxz3G0lsbNjunCibdDhRGhb3f066RYTmZLs.jpeg?auto=webp&amp;s=58ab752612b59ad031a1ff62e73a56f466aa26b2"
        },
        "permalink": "/r/movies/comments/1lt7ykd/hearts_of_darkness_a_filmmakers_apocalypse/"
    },
    {
        "id": "1ltksv0",
        "author": "GeneSmart2881",
        "title": "Annihilation",
        "content": "I absolutely love when a movie “transports” us somewhere I have never seen. Tron 1982, Interstellar, Dune, Fury Road, Aliens. That Wizard of Oz moment where we are no longer in Kansas anymore. Maybe that’s story telling’s way of wiping the slate clean to make the conflict and resolution as simple as possible. So on that note, did anyone else absolutely love Annihilation? I saw it 4 times in the theater. I like Alex Garlands work ",
        "upvotes": 48,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1ltksv0/annihilation/"
    },
    {
        "id": "1ltk139",
        "author": "Wanderinaimlesslyish",
        "title": "What movie is kinda ok if you’ve never seen the source material?",
        "content": "For example- When I first saw “The Last Airbender” movie in 2010, I’d never seen any of the Tv show, and I thought the movie was “alright”. Only after I watched the TV show/ finished the book of water did I think it was terrible. (Source material as in books, movies, tv shows, real-life events, historical events, etc)",
        "upvotes": 52,
        "comments": 171,
        "media": null,
        "permalink": "/r/movies/comments/1ltk139/what_movie_is_kinda_ok_if_youve_never_seen_the/"
    },
    {
        "id": "1ltb4ui",
        "author": "millamber",
        "title": "“I forgot my mantra” - Throwaway lines that stuck with you?",
        "content": "In almost every movie there is a random line or joke that isn’t necessarily there to add anything to the plot or character development but is just thrown in as filler. The one listed in the title is from Annie Hall, delivered by a then unknown Jeff Goldblum, speaking on a telephone as the main characters enter the building. Others that stick out to me:\n\n“I’ll have what she’s having” - When Harry Met Sally\n\n“Hey Malkovich,  think fast!” - Being John Malkovich\n\n“It’s not going to be a boring soup! Onions and carrots are just the base of a soup!” - Grosse Pointe Blank\n\nWhat other throwaway lines have stuck with you over the years?",
        "upvotes": 181,
        "comments": 276,
        "media": null,
        "permalink": "/r/movies/comments/1ltb4ui/i_forgot_my_mantra_throwaway_lines_that_stuck/"
    },
    {
        "id": "1lsvrcm",
        "author": "Briggykins",
        "title": "The real Salt Path: how a blockbuster book and film were spun from lies, deceit, and deception",
        "content": "",
        "upvotes": 1550,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QL7ex6fDsRqQZo0o3KHJ0GsK39pZ-TkAALBAGi2s-oI.jpeg?auto=webp&amp;s=4114d6757426f02dc9fa70316659b50111716da3"
        },
        "permalink": "/r/movies/comments/1lsvrcm/the_real_salt_path_how_a_blockbuster_book_and/"
    },
    {
        "id": "1lto1ev",
        "author": "SiTheHandsomeGuy",
        "title": "What’s a movie you were completely wrong about going in?",
        "content": "We all have those films we went into with low expectations, maybe the trailer didn’t grab us, or we thought it wasn’t our genre but then it totally blew us away. On the flip side, maybe a super-hyped movie just didn’t hit for you at all. What movie completely flipped your expectations, either positively or negatively? What made you change your mind? Mine: *Edge of Tomorrow.* Thought it was gonna be another generic Tom Cruise action flick, but it turned out to be clever, funny, and rewatchable as hell.",
        "upvotes": 19,
        "comments": 58,
        "media": null,
        "permalink": "/r/movies/comments/1lto1ev/whats_a_movie_you_were_completely_wrong_about/"
    },
    {
        "id": "1ltjffu",
        "author": "Smingers",
        "title": "What’s a movie you’ve only seen once and is among your favorites of all time?",
        "content": "Most of my favorites, I’ve seen at least three times. But what’s everyone’s favorite that they have only seen once. Whether it’s because it’s too hard to watch again or simply you have not yet had a chance for a second viewing. \n\nI’ll start with mine: “O Brother, Where Art Thou?”\n\nProbably my favorites Coen Brothers film. I’ve seen most of them more than once. ",
        "upvotes": 41,
        "comments": 138,
        "media": null,
        "permalink": "/r/movies/comments/1ltjffu/whats_a_movie_youve_only_seen_once_and_is_among/"
    },
    {
        "id": "1lt283j",
        "author": "TruthInAnecdotes",
        "title": "Name a flick you liked so much that you had to rewatch immediately",
        "content": "I can only name a few but Avatar and Endgame come to mind.\n\nYesterday, I watched Sinners on max and was completely blown away.\n\nWatched it once and had to pay more attention the second time just so I can catch every foreshadowing and fine details of the movie.\n\nI've seen maybe hundreds of movies in my lifetime and these are the only three of recent memory that warranted an instant rewatch\n\nWhat's yours?\n",
        "upvotes": 314,
        "comments": 856,
        "media": null,
        "permalink": "/r/movies/comments/1lt283j/name_a_flick_you_liked_so_much_that_you_had_to/"
    },
    {
        "id": "1ltiy2j",
        "author": "MorePea7207",
        "title": "Which movies had a better sub plot that should have been the focus of the movie instead of the actual plot?",
        "content": "When you've watched an action, comedy, thriller, horror, adventure, sci-fi or fantasy movie and you've seen a side character's back story or a secondary story that seems so fascinating but gets sidelined for the main plot which is actually boring or the world built in the movie is so fascinating  that there's better movies to be made in that world?",
        "upvotes": 27,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1ltiy2j/which_movies_had_a_better_sub_plot_that_should/"
    },
    {
        "id": "1lt9ztf",
        "author": "NOWAY_YESWAY",
        "title": "I go to the movies for many reasons",
        "content": "That review of *Princess Mononoke* ([https://imgur.com/a/fro6OYr](https://imgur.com/a/fro6OYr)) really hit home for me, especially the beginning. It perfectly expresses how I see animation, far deeper and more meaningful than most people give it credit for. A lot of folks I know still think it's just for kids, but they're missing out! ",
        "upvotes": 84,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mIdLJ9UDmOEhTM4QNPE7OFu8IO1ZSUaVOv4mrpwleJ8.jpeg?auto=webp&amp;s=746c24968c0ae1c4b561d475fa66ae49254d228c"
        },
        "permalink": "/r/movies/comments/1lt9ztf/i_go_to_the_movies_for_many_reasons/"
    },
    {
        "id": "1ltndbo",
        "author": "Chance_Raccoon5937",
        "title": "What are the chances  Hugo will ever be screened in 3D again?",
        "content": "I’ve heard it’s a masterpiece, and maybe the best use of 3D ever filmed. I’m sad I never saw it in this original intended format. Anybody ever hear of times when it’s shown in 3D for special events? What about any other movies filmed in 3D like Life of Pi? I’m a little bummed out that these filmmakers went to so much effort to film in 3D without much of a way to see them in this format. Thank you.",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1ltndbo/what_are_the_chances_hugo_will_ever_be_screened/"
    },
    {
        "id": "1lthrjy",
        "author": "Minute-Necessary2393",
        "title": "Back to the Future.",
        "content": "Just finished watching Back To the Future, such a classic movie/sci-fi coming of age comedy that still holds up. The prime example of a simple, fun, and straight to the point premise down right.\n\nGreat music, great acting, great directing and writing, and a very great balance of tones. Not too mention, it ends with the kid literally creating himself a better living by helping his parents when they were younger. Also, Michael J Fox and Christopher Loyd are great as always.\n\nIts not just one of the best films ever made, buts its Robert Zemekis's best film in general. Yeah, I said it.\n\nEasy 10/10.",
        "upvotes": 17,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1lthrjy/back_to_the_future/"
    },
    {
        "id": "1ltavuu",
        "author": "Remarkable-Pea4889",
        "title": "What movie didn't end the way you expected it to?",
        "content": "I recently watched Robot Dreams and assumed it would have a &gt;!happy!&lt; ending but it didn't and it made me very angry. It didn't feel poignant to me, only wrong. I thought it was a kids' movie about friendship but it's actually an adult movie about romantic relationships. Because friends can have multiple friends and don't need to &gt;!move on!&lt; just because they haven't seen someone in a while.\n\nWhat's a movie you saw that had an unexpected ending? Did you like it or dislike it?",
        "upvotes": 37,
        "comments": 138,
        "media": null,
        "permalink": "/r/movies/comments/1ltavuu/what_movie_didnt_end_the_way_you_expected_it_to/"
    },
    {
        "id": "1ltgff8",
        "author": "turcois",
        "title": "Really well-made movies that have nothing to do with anything sad or traumatic, but you still hate for personal reasons",
        "content": "When people talk about movies they only would watch once, it's almost exclusively sad movies. Requiem for a Dream, 12 Years a Slave, Grave of the Fireflies, Dear Zachary - all these movies are really well made and people give them their flowers, but like no shit people only want to watch them once, they're emotionally devastating. \n  \nMeanwhile I think of Nomadland. Other than the main character's background of losing her things in a recession, the story isn't supposed to be sad. I mean, it's about a woman finding out what makes her happy and brings her joy and peace. And she finds a community of like-minded people. But man, it just instilled such an incredible sense of loneliness in me unlike anything else I've seen. And it came out right after the worst bout of depression I've ever had in my life, so I hate it because I felt like it found joy specifically where I had found misery.\n \nAnd this post was also inspired by how much I hated the new How to Train Your Dragon, which was also, technically, in theory, \"well made,\" but I hated because of its sheer and (other than 1998's Psycho) unprecedented lack of creativity, but unlike with Psycho which arguably made for an interesting artistic experiment, HTTYD was made exclusively for the sake of money and commercialism. Idc if money is the driving force behind your movie getting made, I just care that you're going to make something original\n  \nSo, other non-sad movies that you hate with a passion?",
        "upvotes": 16,
        "comments": 87,
        "media": null,
        "permalink": "/r/movies/comments/1ltgff8/really_wellmade_movies_that_have_nothing_to_do/"
    }
]