[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qs7mho",
        "author": "Large-Cardiologist54",
        "title": "Why do I keep rewatching the same shows instead of starting new ones?",
        "content": "I have a whole watchlist. So many “good” shows saved. But every night I end up rewatching the same comfort show I’ve already seen 5 times. It’s like my brain doesn’t have the energy to try something new. Anyone else stuck in this loop? 😅",
        "upvotes": 141,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1qs7mho/why_do_i_keep_rewatching_the_same_shows_instead/"
    },
    {
        "id": "1qsayt8",
        "author": "Slow-and-low-15",
        "title": "WHY?!",
        "content": "Rant from US: I didn’t ask for \\*mobile games\\* but my eyes are assaulted by them every time I look at my home page. And now, I’m supposed to watch PODCASTS?? On Netflix?? Who wants this?! I hate it.",
        "upvotes": 84,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1qsayt8/why/"
    },
    {
        "id": "1qskipm",
        "author": "kaszpur",
        "title": "What are your go-to comfort shows?",
        "content": "I watch a decent amount of things I haven’t seen before but there are shows I love to rewatch because they feel familiar. Shows that make you feel calm or safe. There are specific shows I’ll just put on even while I’m going to sleep at a low volume. Usually corny light hearted things like the big bang theory has been my go to lately. What are your comfort shows? ",
        "upvotes": 18,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1qskipm/what_are_your_goto_comfort_shows/"
    },
    {
        "id": "1qrdfop",
        "author": "phillygirllovesbagel",
        "title": "Catherine O'Hara Dead at 71",
        "content": "",
        "upvotes": 1448,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1qrdfop/catherine_ohara_dead_at_71/"
    },
    {
        "id": "1qs2cec",
        "author": "7856356",
        "title": "I don’t think I can continue Tell Me Lies after season 2",
        "content": "I just binge watched Tell Me Lies seasons 1 and 2 over the last two days, and I honestly don’t know how to process what I’m feeling right now.\n\nBy the end of season 2, I felt physically sick. Like genuinely nauseous, sweating, head pounding, stomach turning. I’ve never had a show affect me like this before. It wasn’t just “wow that was intense”, it felt disgusting, suffocating, and overwhelming in a way I can’t even properly describe.\n\nI hate Stephen. I don’t think I’ve ever hated a fictional character this much. He’s manipulative, toxic, emotionally abusive, and watching him operate felt draining and disturbing. But what hurts even more is Lucy. Watching her repeatedly abandon her self respect, excuse his behavior, and spiral deeper just made me angry and sad at the same time. It’s frustrating in a way that feels personal.\n\nHonestly, I can’t even name many “good” characters in this show. The only one who felt remotely decent to me was Wrigley. He’s messed up too, sure, but compared to everyone else, he didn’t actively destroy people the way the others did.\n\nThe worst part is the show is captivating. The writing, the tension, the way it pulls you in… it works. That’s why it’s so hard. I went in planning to watch all three seasons eventually, but after finishing season 2, I’m done. I can’t continue. I don’t care how good the plot is.\n\nMy mental health feels wrecked right now. I’ve got a headache, my chest feels tight, I can’t breathe properly, and I don’t think I’ll be able to eat for at least a day. I know it’s “just a show,” but the emotional weight of it hit way harder than I expected.\n\nI just needed to get this out somewhere because this reaction scared me.\nHas anyone else felt this messed up after watching it? Or am I alone in this?",
        "upvotes": 10,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1qs2cec/i_dont_think_i_can_continue_tell_me_lies_after/"
    },
    {
        "id": "1qskv78",
        "author": "jcwolf12",
        "title": "Fast forwarding through live event",
        "content": "On mobile. I was trying to fast forward through a streamed event that was already finished. I kept scrubbing through but it was not fast forwarding through to the right part and despite skipping 3 hours ahead it was still pretty much in the first hour despite time codes saying it was 3 hours ahead. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qskv78/fast_forwarding_through_live_event/"
    },
    {
        "id": "1qskkze",
        "author": "Superb_Tangerine221",
        "title": "Streaming issues",
        "content": "Anyone else having issues this last week? I have never had issues with Netflix before. It's one of the few sites that I can depend on. But ,not lately.\nNo other internet issues either.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qskkze/streaming_issues/"
    },
    {
        "id": "1qsk9sl",
        "author": "Louigidude",
        "title": "Too bright?",
        "content": "I'm very sensitive to light, and the android netflix app is hurting my eyes even on the lowest setting. I'm just wondering if anyone knows how to get it lower. Thanks.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qsk9sl/too_bright/"
    },
    {
        "id": "1qses3d",
        "author": "saintly_devil",
        "title": "Eko - an incredibly nuanced thriller",
        "content": "I'm probably going to get bombed with racist comments here, but to those who can look past it.\n\nEko is a Malayalam language slow burn thriller (movie) from India, currently on Netflix. No, it's NOT Bollywood (which sucks, for the most part). No, it DOES NOT have songs and dances. It's two hours of brilliant and nuanced storytelling, building layer upon layer before a finale that not many can see coming. If you're open to foreign movies, give this a look.\n\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qses3d/eko_an_incredibly_nuanced_thriller/"
    },
    {
        "id": "1qrip4p",
        "author": "Pawssabillitysawait",
        "title": "The end of the F***ing world.",
        "content": "I think this is one of my absolute all time netflix favs, and the second season is actually arguably better than the first, which is rare for television shows in my opinion. I never hear anyone talk about it, but i highly recommend it to everyone. It is amazing if you like coming of age/teen shows, that have a more serious theme.",
        "upvotes": 86,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qrip4p/the_end_of_the_fing_world/"
    },
    {
        "id": "1qrf5r4",
        "author": "Less_Manufacturer218",
        "title": "Elizabeth Smart documentary, what a powerful family. Must watch",
        "content": "Just wanted to say how impressive the entire Smart family is. From Mary Katherine remembering and cracking the case, to her parents and uncles never giving up. And of course Elizabeth, a true survivor with incredible strength.\n\nWill make you cry. ",
        "upvotes": 96,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qrf5r4/elizabeth_smart_documentary_what_a_powerful/"
    },
    {
        "id": "1qscjzt",
        "author": "l_zeus_l",
        "title": "Dhurandhar color degradation",
        "content": "Recently netflix released Dhurandhar on Netflix. But they degraded the color..... but why??? Also muted some words... seriously???? Why's that? They could have released an director cut (uncensored version) also differently.\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qscjzt/dhurandhar_color_degradation/"
    },
    {
        "id": "1qsjiy1",
        "author": "No-Mine5802",
        "title": "Alice in 11.22.63",
        "content": "I think it was the first episode where Jake meets a waitress in the past named Alice and seems to recognize who she would be in the future. He tells her to \"behave hersel\" or something like that.  Who is Alice?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qsjiy1/alice_in_112263/"
    },
    {
        "id": "1qsaa6c",
        "author": "Sohaibahmadu",
        "title": "Why \"Not part of Household\"?",
        "content": "I've been sharing a Netflix account with a friend for years, but today I got locked out with the \"Not part of Household\" screen.\n​I know I can click \"Watch Temporarily\" and get a code sent to them, but I feel like it's going to be super awkward texting them every two weeks asking for a verification code immediately.\n\n​Has anyone successfully kept sharing an account using the verification codes? \n\nDid your friend get annoyed eventually?",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qsaa6c/why_not_part_of_household/"
    },
    {
        "id": "1qrkwrd",
        "author": "bradleyistheman",
        "title": "Ted Danson",
        "content": "Ted Danson stars in both \"A Man On The Inside\" and \"The Good Place.\" I just watched an episode of \"A Man On The Inside\" where one of the characters mentions that Charles (Danson's character) looks like a handsome devil. I wonder if that's an inside reference to his character on \"The Good Place.\"",
        "upvotes": 29,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qrkwrd/ted_danson/"
    },
    {
        "id": "1qsjz6k",
        "author": "Wildflowers4me",
        "title": "Unfair",
        "content": "Does anyone else think it’s really unfair that if we have the cheaper Netflix with ads, we are not allowed to watch certain movies when they come out on Netflix. We’re already watching ads, can’t they just make a deal with the movie producers to let us watch their movies? It feels like we’re being punished for being poor. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qsjz6k/unfair/"
    },
    {
        "id": "1qsc5fm",
        "author": "Mochog",
        "title": "Any chance for Netflix to stream live concerts?",
        "content": "Since boxing streams achieved a significant global success—according to google search, will there also be a chance for the platform to stream live concerts? Pretty sure they will also somehow manage to make a profit out of it, and to think that there will be massive to almost unlimited contents for their subscribers to see.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qsc5fm/any_chance_for_netflix_to_stream_live_concerts/"
    },
    {
        "id": "1qsffh7",
        "author": "No_Bottle_3181",
        "title": "Ads despite premium subscription",
        "content": "I have a Netflix premium subscription. Today I had to watch ads. This happened twice today I should not see any ads. I mean i pay the highest price and this shouldn't happen. Does anyone have made similar experiences? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qsffh7/ads_despite_premium_subscription/"
    },
    {
        "id": "1qrged5",
        "author": "superfecta37",
        "title": "When life gives you tangerines is a masterpiece",
        "content": "I never watch kdramas, but decided to give this one a go, and I finished all 16 episodes in 2 days.\n\nWhat a masterpiece. Easily one of the best shows I've ever watched. Has anyone watched this?",
        "upvotes": 19,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qrged5/when_life_gives_you_tangerines_is_a_masterpiece/"
    },
    {
        "id": "1qqm8bc",
        "author": "MattTheKing23",
        "title": "Netflix Had a Plan If Alex Honnold Died During Live Skyscraper Climb",
        "content": "",
        "upvotes": 1143,
        "comments": 181,
        "media": null,
        "permalink": "/r/netflix/comments/1qqm8bc/netflix_had_a_plan_if_alex_honnold_died_during/"
    },
    {
        "id": "1qry7oi",
        "author": "MrFizzbin761",
        "title": "Anybody else experiencing issues with netflix commercials skipping last 15 minutes of episodes ?",
        "content": "I'm having an issue watching shows on netflix where the last commercial before the last 15 minutes of an episode on any show I watch causes netflix player to jump to the next episode skipping the last 15 minutes of the episode.  I have to stop the player, go back to the series header, reselect the episode to have it pick up.   Sometimes that doesn't work and I have close the browser and restart netflix.  ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qry7oi/anybody_else_experiencing_issues_with_netflix/"
    },
    {
        "id": "1qs6pwl",
        "author": "zoebnj",
        "title": "Is buffering caused by several people using the account at the same time?",
        "content": "Basically the title--I just discovered that you can look at your viewing history, and I saw that someone is watching the kind of shows that I don't watch--reality and chef shows.  I'm sure that it's a family member, I don't care if they are watching, but I've been having buffering problems and wonder if it's because someone else is in my account at the same time.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qs6pwl/is_buffering_caused_by_several_people_using_the/"
    },
    {
        "id": "1qrwaht",
        "author": "DragonsLoveBoxes",
        "title": "Why won’t it connect?",
        "content": "So I just signed up for Netflix. But it’s been about five minutes of it trying to log in with a blank screen and a blue waiting bar. I took video but I can’t post it. The money has come out of my account. \n\nWhat can I do?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qrwaht/why_wont_it_connect/"
    },
    {
        "id": "1qqnyn5",
        "author": "Jumpy_Wing_7884",
        "title": "Anyone else feel sad when they outgrow a show? (me: Bridgerton)",
        "content": "I used to LOVE *Bridgerton*, but Season 4 just isn’t hitting for me anymore. Same thing happened with *You*. It’s not bad, I’m just… not as into it.\n\nKind of makes me sad because these used to be such comfort shows for me. 😅\n\nAnyone else go through this with shows they used to love?",
        "upvotes": 425,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1qqnyn5/anyone_else_feel_sad_when_they_outgrow_a_show_me/"
    },
    {
        "id": "1qrv77j",
        "author": "Revolverocelot1998",
        "title": "Audio issue on Netflix.",
        "content": "I am watching the James Bond movie You Only Live Twice and there seems to be an issue with the audio as it sounds very low quality and not very high quality compared to other versions. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qrv77j/audio_issue_on_netflix/"
    },
    {
        "id": "1qrlzai",
        "author": "Delicious_Mess7976",
        "title": "Problem with loading a series episode",
        "content": "I have already tried the common fixes online and none are working.\n\nI have finished Season 3, (Poldark) episode three, but instead of moving to episode four, it skips all the way to Season 4....\n\nI have tried a bunch of fixes (settings, turning off and on, disconnecting. etc.)\n\nI am in an AirBnb, and I watch on my laptop. Not having problems with any other shows.\n\nAny other suggestions?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrlzai/problem_with_loading_a_series_episode/"
    },
    {
        "id": "1qrqhr5",
        "author": "Civil-Heron-9124",
        "title": "Netflix Error Code 100",
        "content": "When trying to mirror screen Netflix from my Ipad to Samsung TV I always get Error Code 100. I use it with different apps and there are no issues. Has anyone else encountered this error problem? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrqhr5/netflix_error_code_100/"
    },
    {
        "id": "1qrxfsx",
        "author": "NatuRal_Pro",
        "title": "Is Colour grading changed in Dhurandar OTT release ?",
        "content": "I didn't watch dhurandar in ghe theatre and now I'm seeing people talking about the OTT release and some are saying that the theatre had better colour grading than the OTT also that many dialogues are muted. I'm confused now can please someone clarify these things",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qrxfsx/is_colour_grading_changed_in_dhurandar_ott_release/"
    }
]