[
    {
        "id": "1qof7n3",
        "author": "RabbitTrapAMA",
        "title": "Hi /r/movies! I'm Bryn Chainey, writer/director of RABBIT TRAP, a folk-horror starring Dev Patel &amp; Rose McEwen that's out in UK cinemas this weekend. Ask me anything!",
        "content": "Hi r/movies, I'm Bryn Chainey. I wrote and directed RABBIT TRAP, a psychological folk-horror that premiered at Sundance last year and that will be out in UK cinemas this weekend via Picturehouse Entertainment. It stars Dev Patel &amp; Rosy McEwen, (please excuse the autocorrect typo in the title, it's Rosy not Rose!) and I'm here to answer your questions.\n\n**Synopsis:**\n\nIn 1976, married musicians Daphne (Rosy McEwen) and Darcy Davenport (Dev Patel) move to the Welsh countryside to finish their new record. While making field recordings in the ancient woodlands, Darcy captures a forbidden sound not meant for human ears. This brings a strange boy to their doorstep who draws them into an enigmatic realm where the line between reality and myth begins to blur.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=y953Fl\\_BdWM](https://www.youtube.com/watch?v=y953Fl_BdWM)\n\nStarring Dev Patel &amp; Rosy McEwen. In UK cinemas January 30.\n\nAsk me anything! I'll be back Thursday 1/29 at 8 AM ET to answer your questions!",
        "upvotes": 28,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rdm685dpiwfg1.png?auto=webp&amp;s=a08a1aaf1be4aaae83c83affa9664012b165f07b"
        },
        "permalink": "/r/movies/comments/1qof7n3/hi_rmovies_im_bryn_chainey_writerdirector_of/"
    },
    {
        "id": "1qnurzw",
        "author": "MelBrooks99AMA",
        "title": "Hey r/movies, I’m Michael Bonfiglio. I directed and exec. produced Mel Brooks: The 99 Year Old Man! alongside Judd Apatow — available now on HBO Max. I’ve also directed George Carlin’s American Dream and other stuff. Ask me anything!",
        "content": "Hey r/movies, I’m Michael Bonfiglio. I directed and exec. produced Mel Brooks: The 99 Year Old Man! alongside Judd Apatow — available now on HBO Max. I’ve also directed George Carlin’s American Dream and other stuff. Ask me anything!\n\nSynopsis: \n\n&gt;Mel Brooks: The 99 Year Old Man! explores the life, career, friendships, and loves of legendary writer, director, producer, and performer, Mel Brooks. One of Hollywood’s most daring satirists from the early years of television sketch comedy through his film and stage hits, Brooks has held a funhouse mirror up to the human condition and used laughter as a path to resilience, connection, and joy for nearly a century. \n\nFilmmakers: Judd Apatow &amp; Michael Bonfiglio - Streaming on HBO Max\n\n[Trailer](https://www.youtube.com/watch?v=eKo_urZAm9o&amp;embeds_referring_euri=https%3A%2F%2Fpress.wbd.com%2F&amp;source_ve_path=MjM4NTE)\n\nAsk me anything! Back Tuesday 1/27 at 3 PM ET to answer questions. ",
        "upvotes": 124,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/as4hvzp6prfg1.jpeg?auto=webp&amp;s=5901eaca67d3738c4075cfecf3b944bb6bd6eda2"
        },
        "permalink": "/r/movies/comments/1qnurzw/hey_rmovies_im_michael_bonfiglio_i_directed_and/"
    },
    {
        "id": "1qoe7m8",
        "author": "Morgan-Moonscar",
        "title": "\"Throne of Blood\" (1957, Akira Kurosawa) - Lord Washizu (Toshiro Mifune) is betrayed by his own soldiers after the tide of battle turns to certain defeat",
        "content": "",
        "upvotes": 1067,
        "comments": 139,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7l4jbuyebwfg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qoe7m8/throne_of_blood_1957_akira_kurosawa_lord_washizu/"
    },
    {
        "id": "1qofsho",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Brian Cox’s Directorial Debut ‘Glenrothan’ - After 35 years in America, a man (Alan Cumming) returns to the Scottish Highlands following a personal crisis to reconcile with his estranged brother (Cox) and save their family’s struggling whisky distillery",
        "content": "",
        "upvotes": 427,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0sfyoqvvmwfg1.jpeg?auto=webp&amp;s=a5e47df0fd2c5f21cc6ce0eae2e07ff2b4ef53bd"
        },
        "permalink": "/r/movies/comments/1qofsho/official_poster_for_brian_coxs_directorial_debut/"
    },
    {
        "id": "1qnz0r6",
        "author": "latchkey_adult",
        "title": "Sidney Kibrick, the last remaining kid actor from the Little Rascals/Our Gang short films, died a couple of weeks ago at age 97.",
        "content": "It didn't get a lot of attention in the news so I'm posting it here.  He played the character \"Woim\" which is \"Worm\" with a Brooklyn accent. He was Butch's buddy and therefore the enemy to Spanky and Alfalfa. He was the last of them that actually had a featured role (non extra). Sad for classic film and comedy fans. \n\n[Here's a short featuring Woim and Butch and the rest of the gang](https://youtube.com/watch?v=Xk2aF8RbW04&amp;si=9kcHqwVNEhLK4rV5)",
        "upvotes": 5077,
        "comments": 150,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_PwH1lwh0dM8SSnkJIJnoC9JrEI-j9lENxFEIUrbVDU.jpeg?auto=webp&amp;s=ce79e5c595eee7699af4f52be84ab6d097448ec9"
        },
        "permalink": "/r/movies/comments/1qnz0r6/sidney_kibrick_the_last_remaining_kid_actor_from/"
    },
    {
        "id": "1qnzly7",
        "author": "PeneItaliano",
        "title": "The Red Sea parting in The Ten Commandments (1956) took six months and $1 million to film. DeMille’s team flooded a massive tank with 360,000 gallons of water and reversed the footage",
        "content": "",
        "upvotes": 3145,
        "comments": 347,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pxsvfkzknsfg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qnzly7/the_red_sea_parting_in_the_ten_commandments_1956/"
    },
    {
        "id": "1qo9u30",
        "author": "MrGittz",
        "title": "Dan Aykroyd has this amazing talent where he makes exposition sound super interesting &amp; believable. Even in a not great movie like Pearl Harbor I can’t help but be interested in what he’s saying.",
        "content": "I’ve always really loved Dan Aykroyd. Ever since I saw that cigarette dangle off his lip in Ghostbusters? This dude interested me. \n\nAnd even tho he’s been in more than a few turkeys, he is never not good. But where he really shines is delivering information and exposition. \n\nGhostbusters has made up mythology but the two scenes I LOVE are with him and Winston where he quotes the bible and then when they are in jail and he tell us what the building of Dana is meant for. \n\nEven in a movie like Pearl Harbor. My ex LOVED that frigging movie. And during all the lovey dovey stuff I always thought “cut back to Dan Aykroyd breaking codes!” \n\nI don’t know if it’s the sound of his voice or the way he talks.",
        "upvotes": 415,
        "comments": 144,
        "media": null,
        "permalink": "/r/movies/comments/1qo9u30/dan_aykroyd_has_this_amazing_talent_where_he/"
    },
    {
        "id": "1qnnjbc",
        "author": "MarvelsGrantMan136",
        "title": "Israeli Police Shut Down Jerusalem Screenings of Oscar Entry ‘Palestine 36’",
        "content": "",
        "upvotes": 8319,
        "comments": 258,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MIEaF_Xt4d1XK71uIIgyFIjE9LDe77-ov_O4-OfL5hc.jpeg?auto=webp&amp;s=a711bc2255c7f5b5a4095c5847996064b4c61c3c"
        },
        "permalink": "/r/movies/comments/1qnnjbc/israeli_police_shut_down_jerusalem_screenings_of/"
    },
    {
        "id": "1qoao74",
        "author": "Such-Worldliness-655",
        "title": "Documentaries that are hated by their subjects?",
        "content": "I’m curious to hear about documentaries rejected or disliked by their subjects. It’s especially interesting when the subject participated heavily in the film and accused the filmmaker of misrepresenting them. \n\nA few examples include TV series’ The Jinx and Tiger King. \n\nA different and more complex case is Paris is Burning’s participants. Some were very happy with the documentary while others felt exploited and misrepresented. \n\nDoes anyone have more examples of documentaries whose subjects disliked the final product?",
        "upvotes": 308,
        "comments": 246,
        "media": null,
        "permalink": "/r/movies/comments/1qoao74/documentaries_that_are_hated_by_their_subjects/"
    },
    {
        "id": "1qoh8lk",
        "author": "SandersSol",
        "title": "Arrival (2016) hits so, much, harder, after having children. I'm glad I got to watch it on both sides of the coin.",
        "content": "\n\nThe relationship being a parent creates a natural dichotomy between love and loss because you get to go through those things as milestones in your life after having children.\n\nIn many ways you lose your life and who you were before you had them, but the love you gain after is really immeasurable but present. So would that loss Louis and Ian experience be worth the journey? You never know until youre there in that moment of time.\n\nYoull always have those memories, but they become moments in the stream of life that you remember. Not a linear path, because youll recall them at different times and phases of your life. What a wonderful way to approach it.\n",
        "upvotes": 111,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1qoh8lk/arrival_2016_hits_so_much_harder_after_having/"
    },
    {
        "id": "1qocila",
        "author": "ICumCoffee",
        "title": "2026 BAFTA Film Awards Nominations: ‘One Battle After Another’ (14 Noms) Leads ‘Sinners’ (13 Noms) by One Nomination While ‘Hamnet’ and ‘Marty Supreme’ Earned 11 Noms Each",
        "content": "",
        "upvotes": 165,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fXQhuO1dFUL67qGFbgGlJhXr1vmWJS-Ri54v8dr4CC0.jpeg?auto=webp&amp;s=4f3bfdf28c268c591341f7242f020bb1538d3840"
        },
        "permalink": "/r/movies/comments/1qocila/2026_bafta_film_awards_nominations_one_battle/"
    },
    {
        "id": "1qnxwhm",
        "author": "BunyipPouch",
        "title": "Anticipated Sequel ‘Ready or Not 2: Here I Come’ Moves Up Release Date to March 20",
        "content": "",
        "upvotes": 1284,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BCCDIyKjA66-7TD7JRKn2jlqwHhNiIuqrepm55rbFkQ.jpeg?auto=webp&amp;s=51fa35b6ff7c9daba673f8881b91a284bcc354e7"
        },
        "permalink": "/r/movies/comments/1qnxwhm/anticipated_sequel_ready_or_not_2_here_i_come/"
    },
    {
        "id": "1qo2xlu",
        "author": "uuddlrlrbas2",
        "title": "What movie is memorable for you, but barely anyone you know has seen it?",
        "content": "For me it would a movie called Ides of March with Ryan Gosling and George Clooney. Its a story about politics and mystery. Great film, wonderful script, and the rest of the cast is fantastic. Im surprised I've never met anyone that's seen it.\n\nAnother one would be Robot Jox. Such a fun early 90s movie about the USSR and the U.S. fighting over territory with giant mechs. Crash and burn!",
        "upvotes": 504,
        "comments": 1405,
        "media": null,
        "permalink": "/r/movies/comments/1qo2xlu/what_movie_is_memorable_for_you_but_barely_anyone/"
    },
    {
        "id": "1qogg0v",
        "author": "joesen_one",
        "title": "Neon acquires conversion therapy horror film 'LEVITICUS' from 2026 Sundance Film Festival - Two teenage boys must escape a violent entity that takes the form of the person they desire most: each other",
        "content": "",
        "upvotes": 57,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UXNwFa292Gn6QUelL0oEfNGOu-OwwlthKG3A7PWbq_8.jpeg?auto=webp&amp;s=5d680eb56a172af347ad16fe84be18f165be54a8"
        },
        "permalink": "/r/movies/comments/1qogg0v/neon_acquires_conversion_therapy_horror_film/"
    },
    {
        "id": "1qno3cy",
        "author": "ubcstaffer123",
        "title": "Black cakes and branded buckets: welcome to the White House premiere for Brett Ratner’s Melania movie",
        "content": "",
        "upvotes": 2139,
        "comments": 237,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pp0YzQjsysQg8RHtZijLkJbzPmc9RStTrANZNvU8Epo.jpeg?auto=webp&amp;s=f2de8f446ed1f557779e48fb24b0065242d20088"
        },
        "permalink": "/r/movies/comments/1qno3cy/black_cakes_and_branded_buckets_welcome_to_the/"
    },
    {
        "id": "1qocfo2",
        "author": "bobber66",
        "title": "What's your favorite sideways twist in a comedy movie?",
        "content": "Abigail Breslin's performance at the beauty pageant in Little Miss Sunshine still cracks me up. I am not going to go any further than this for those of you who haven't seen this crazy movie but those who know, know. I didn't see that coming. Napolean Dynamite's scene is up there too. Are there anymore great ones out there? ",
        "upvotes": 65,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1qocfo2/whats_your_favorite_sideways_twist_in_a_comedy/"
    },
    {
        "id": "1qnlpk9",
        "author": "ChiefLeef22",
        "title": "Sam Raimi's 'Send Help' - Review Thread",
        "content": "*A woman and her overbearing boss become stranded on a deserted island after a plane crash. They must overcome past grievances and work together to survive, but ultimately, it's a battle of wills and wits to make it out alive.*\n\nCast: Rachel McAdams, Dylan O'Brien\n\n**Rotten Tomatoes:** [93%](https://www.rottentomatoes.com/m/send_help)\n\n**Metacritic:** [73/100](https://www.metacritic.com/movie/send-help/)\n\nSome Reviews:\n\n[IndieWire - Alison Foreman](https://www.indiewire.com/criticism/movies/send-help-review-rachel-mcadams-sam-raimi-1235175473/) - 'A-'\n\n&gt;Wickedly lovable with the potential to be timeless, “Send Help” is controlled delirium microwaved on high heat. At 66, Raimi reminds us who he was when he made horror-comedy history with “Evil Dead II,” and more importantly, why his voice still matters. Watching McAdams snarl and strategize, you can practically imagine how much fun Raimi would’ve had handing her a chainsaw in the ’80s.\n\n[IGN - Tom Jorgensen](https://www.ign.com/articles/send-help-review-rachel-mcadams-dylan-obrien-sam-raimi) - 9 / 10\n\n&gt;Sam Raimi drives the survival thriller genre to some amazing and sadistically giddy ends, with Rachel McAdams and Dylan O’Brien along for the ride in the back seat cackling and stabbing each other the whole way through. Linda and Bradley’s ordeal creates immensely fertile ground for Raimi to interrogate the validity of first impressions with twists and turns of the plot and of various sharp objects that seldom tire. Sure, drag me to hell, but let's stop at this island on the way and have a freakin’ party with Linda and Bradley!\n\n[HighonFilms - Liam Gaughan](https://www.highonfilms.com/send-help-2026-movie-review/) \\- 3.5/5\n\n&gt;To characterize “Send Help” as a standard “eat the rich” satire would be slightly dismissive, as the film is more centered on workplace culture than it is on class. The narrative kerfuffles in “Send Help” don’t mean that it’s a highly watchable cinematic experience that is intended to be experienced with a crowd that can wince, jeer, laugh, and cover their eyes in equal measure. O’Brien and McAdams are two actors who can find emotional truths in the characters, even if they’re incorporating idiosyncratic traits that feel entirely original. “Send Help” won’t go down as one of Raimi’s defining achievements, but it makes the case that he’s back within his comfort zone.\n\n[Variety - Peter Debruge](https://variety.com/2026/film/reviews/send-help-review-1236637527/)\n\n&gt;Essentially stripping all that’s “logical” from the psychological thriller genre, Raimi doesn’t seem especially concerned with plausible human behavior, preferring to keep audiences guessing as the characters’ motivations keep changing. Once the master of extreme practical effects (with then-accomplice Tom Sullivan), Raimi now relies far too heavily on digital tools — and that’s one thing that has no business on a desert island, where everything from fire to fresh water must be cultivated by hand.\n\n[InSession Films - 8/10](https://insessionfilm.com/movie-review-send-help/)\n\n&gt;This is a return to form for horror-fare Raimi, including a stellar performance from Rachel McAdams\n\n[SlashFilm - Chris Evangelista](https://www.slashfilm.com/2085042/send-help-2026-movie-review/) - 7 / 10\n\n&gt;I had oodles of fun watching Raimi go wild and give McAdams a chance to play the type of unhinged weirdo she hasn't really played before. This is the type of sturdy, bloody, silly January genre programmer we need on the big screen again.\n\n[Micropsiacine](https://www.micropsiacine.com/2026/01/send-help-review-rachel-mcadams-and-dylan-obrien-in-a-brutal-survival-duel/) \\- Diego Lerer\n\n&gt;Pessimistic and biting, violent yet undeniably entertaining, ***Send Help*** functions as a kind of metaphorical capsule for the “every man for himself” ethos of the contemporary world. For Raimi, it also represents a reboot of sorts—a return to form. The catch, perhaps, is that what once played as cynical, absurdist black comedy in the ’90s now feels uncomfortably close to reality.  \n",
        "upvotes": 1702,
        "comments": 203,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jwc5-XyeHceHVJulmXu7L5ecJpJmm7NssDp1qwbYGLc.jpeg?auto=webp&amp;s=4e24936c5fdbfc0d51bb4f30bd44691d48544fe5"
        },
        "permalink": "/r/movies/comments/1qnlpk9/sam_raimis_send_help_review_thread/"
    },
    {
        "id": "1qnh9as",
        "author": "MarvelsGrantMan136",
        "title": "‘One Battle After Another’ Wins Best Picture &amp; Best Director At Online Film Critics Society",
        "content": "",
        "upvotes": 2761,
        "comments": 464,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hZmzpphlJBkBzp9TakAW_dHdLtnWVB5hEgwbLci5sLE.jpeg?auto=webp&amp;s=f6c92356ab99375209f1b4e4d5d3eaca008b719d"
        },
        "permalink": "/r/movies/comments/1qnh9as/one_battle_after_another_wins_best_picture_best/"
    },
    {
        "id": "1qnz8f5",
        "author": "BunyipPouch",
        "title": "'Marty Supreme' Breakout Odessa A’zion to Star in ‘Deep Cuts’ at A24 from Director Sean Durkin ('The Iron Claw') - Joining Cailee Spaeny and Drew Starkey",
        "content": "",
        "upvotes": 367,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WH3BLlOEfAoc1JDqlNX4X_wlCLFtCqMHQKvvPn21INs.jpeg?auto=webp&amp;s=a6bb73e18cb0da704b346a5ceb498a6569ff142d"
        },
        "permalink": "/r/movies/comments/1qnz8f5/marty_supreme_breakout_odessa_azion_to_star_in/"
    },
    {
        "id": "1qo92la",
        "author": "jaystats2",
        "title": "To Live and Die in L.A.",
        "content": "\n⸻\n\nWilliam Friedkin’s To Live and Die in L.A. is one of his best films. It features strong performances by William Petersen, Willem Dafoe, John Turturro, and Dean Stockwell. The film showcases Friedkin’s trademark realism and follows U.S. Secret Service procedural detail, based on the novel of the same name by real-life secret serviceman Gerald Petievich. I love the pacing, the violence, and the passion of a man hell-bent on settling a score.\n\nFriedkin brought in real ex-con counterfeiters to replicate the process onscreen. Some of the printed fake money actually leaked outside the production, leading to a federal investigation that Friedkin and his crew narrowly avoided. The freeway car chase ranks alongside the best, including Peter Yates’ Bullitt and Friedkin’s own French Connection.\n\nI own the Shout Factory blu-ray, which features deleted scenes and an alternate ending. The film was released in late 1985, but younger generations owe it to themselves to see it. Friedkin has said that this film, along with Sorcerer(1978), is the closest he ever came to realizing his true vision for a movie.\n",
        "upvotes": 82,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1qo92la/to_live_and_die_in_la/"
    },
    {
        "id": "1qntchf",
        "author": "BunyipPouch",
        "title": "Kevin Smith, Dan Aykroyd, Kim Basinger to Star in R-Rated Animated Stoner-Comedy 'Getting Lost' - The nephew of a legendary wilderness TV host decides to finish his uncle's final episode after he dies during a catastrophic on-air incident. He heads into the jungle guided by a the pot-smoking ghost.",
        "content": "",
        "upvotes": 682,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gNcaINN_bRmpFeTozy0ypssP9eCzLLXKi1iRWZQqJvo.jpeg?auto=webp&amp;s=5dd2f74e79a71e14a2bc04fc3e45555803aa70a4"
        },
        "permalink": "/r/movies/comments/1qntchf/kevin_smith_dan_aykroyd_kim_basinger_to_star_in/"
    },
    {
        "id": "1qocifi",
        "author": "loq4i",
        "title": "watched city of god after a friend had been obsessing over it and im mesmerized.",
        "content": "Where do I even start, one of the, if not the most beautiful picture I've seen in terms of storytelling, editing, mesmerising cinematography, plot, etc. I can continue for days. The idea of having so many relevant characters in the film and everything still being connected and portrayed so perfectly was my favourite part of this film. Leandro Firmin (Lil Ze) had one of the best actings for a antagonist i've ever seen, by the end of the film i truly developed hatred for him in a way i wanted him gone by the end of the film, hes pure psychotic evil and a sadistic character and has only one motto in one life which is honestly pretty respectable, The contrast between Lil Ze and Rocket is honestly amazing, from both of them being young at the time of the Tender Trio to their lives completely contrasting one another. With Lil Ze having a completely different approach in his future, more towards gun violence and being dominant, to Rocket having a far different approach to violence and never getting into the cycle.\n\nThe young actors did amazing portraying the lives of those in favelas, they are born in a warzone with guns and gangsters all around them, and ultimately growing up with a gun in their hand. Death is almost meaningless towards them as they've witnessed it ever since they had conscious. The film executes it all so complacently, with no glamour and no meaning. This is the life they were born into, and there's no way to escape it. Either hunt or be hunted is what I would say is the pure motto of this film and how the favelas are depicted.\n\nBenny you deserved a farm of your own.",
        "upvotes": 36,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1qocifi/watched_city_of_god_after_a_friend_had_been/"
    },
    {
        "id": "1qno3mb",
        "author": "GoldDerby",
        "title": "Ving Rhames reveals why he gave his Golden Globe to Jack Lemmon:",
        "content": "",
        "upvotes": 756,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TqwO6XlmEjdF0yUaWFAmZiLyPiNYP0ZNz5jPU09jI8o.png?auto=webp&amp;s=25b528607a004cc8aafdf4ab753a2ae8b7f12211"
        },
        "permalink": "/r/movies/comments/1qno3mb/ving_rhames_reveals_why_he_gave_his_golden_globe/"
    },
    {
        "id": "1qnlshd",
        "author": "SanderSo47",
        "title": "Official Poster for the IMAX Re-Release of Alejandro Gónzalez Iñárritu's 'The Revenant', In Theaters February 26 and March 1.",
        "content": "",
        "upvotes": 883,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q91ro9516qfg1.jpeg?auto=webp&amp;s=b9f24ccbfb394fc101064cd75dea7851844bf72a"
        },
        "permalink": "/r/movies/comments/1qnlshd/official_poster_for_the_imax_rerelease_of/"
    },
    {
        "id": "1qogcij",
        "author": "EThorns",
        "title": "Mia Goth, Andrew Scott To Star In Justine Triet Film 'Fonda'",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MhK1oVSEllH2iPjrDTQKvbxcXxWV6ZF5YI4a8USMCT0.jpeg?auto=webp&amp;s=1e40ae13066c1356d608bbe543b570723f050cdc"
        },
        "permalink": "/r/movies/comments/1qogcij/mia_goth_andrew_scott_to_star_in_justine_triet/"
    },
    {
        "id": "1qnxbdt",
        "author": "IceTrucKilla",
        "title": "I don't care what people say, Terminator Salvation is awesome!",
        "content": "Just re-watched Terminator Salvation and I've got to say, I didn't get the hate that movie received when it came out. It's so awesome! It's the only one that sets it during the War, it doesn't rely on time travel nonsense in a lame attempt to soft reboot the franchise, the Easter eggs and links to the 1st &amp; 2nd are well placed, and the action is badass. And Young Arnie as a T-800 looked amazing (as far as de-aging goes)! Yes, the marketing spoiled the twist (if you want to even call it that). I would honestly put it as the best of the franchise, after 1 &amp; 2 of course. T3 and everything since salvation has been a joke. I would rank this franchise as follows:\n\n  \n1. T2\n\n2. Terminator\n\n3. Terminator Salvation \n\n4.\n\n5.\n\n6. T3, Genisys, Dark Fate\n\n\n\nThoughts? Who's with me??",
        "upvotes": 244,
        "comments": 221,
        "media": null,
        "permalink": "/r/movies/comments/1qnxbdt/i_dont_care_what_people_say_terminator_salvation/"
    },
    {
        "id": "1qnmyoh",
        "author": "Morgan-Moonscar",
        "title": "Turner Classic Movies becomes “Ongoing Home” of the Looney Tunes library in exclusive six year deal | Starts in February, with 45 shorts featuring 'Star of the Month' Bugs Bunny",
        "content": "",
        "upvotes": 740,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gyxgwYPQUTOc0BiFUj7KYj70EMUWibDakCHEr4NNVHo.jpeg?auto=webp&amp;s=9eab7eeb54832f6e5a14a5ed2bec03304cefc772"
        },
        "permalink": "/r/movies/comments/1qnmyoh/turner_classic_movies_becomes_ongoing_home_of_the/"
    },
    {
        "id": "1qo7lw6",
        "author": "Julian0527",
        "title": "What do you think the greatest scene in movie history is? (maybe spoilers?)",
        "content": "Was recently rewatching Return of the King with my dad, and I said that the Ride of the Rohirrim is the greatest scene in movie history. He disagreed and said it was the destruction of the first death star in A New Hope. Was curious to see where everyone stands on this and what other opinions you guys might have!",
        "upvotes": 42,
        "comments": 364,
        "media": null,
        "permalink": "/r/movies/comments/1qo7lw6/what_do_you_think_the_greatest_scene_in_movie/"
    },
    {
        "id": "1qnlx9w",
        "author": "SanderSo47",
        "title": "Official Poster for Boots Riley's New Film 'I Love Boosters', Starring Keke Palmer, Naomie Ackie, Taylour Paige, Poppy Liu, Eiza Gonzalez, LaKeith Stanfield, Will Poulter, Don Cheadle and Demi Moore. – A group of shoplifters take aim at a cutthroat fashion maven.",
        "content": "",
        "upvotes": 632,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/td1jlcww6qfg1.jpeg?auto=webp&amp;s=c8cba58272629c16834d5161bba19d8737c7b348"
        },
        "permalink": "/r/movies/comments/1qnlx9w/official_poster_for_boots_rileys_new_film_i_love/"
    },
    {
        "id": "1qo22zd",
        "author": "moviesperg",
        "title": "First poster for \"AGITΩ: Psychic War\" — the 25th anniversary movie for Kamen Rider Agito and the 55th anniversary movie project for Kamen Rider",
        "content": "",
        "upvotes": 90,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1g2zrrtm6tfg1.jpeg?auto=webp&amp;s=2f22166265213e6e43d531a86d7cb1da5f03cb68"
        },
        "permalink": "/r/movies/comments/1qo22zd/first_poster_for_agitω_psychic_war_the_25th/"
    }
]