[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 49,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r7r53d",
        "author": "TonyTaranteeno",
        "title": "Netflix is single-handedly ruining podcasts",
        "content": "The recent multi-year deals that Netflix made with all these podcasts is going to be the downfall of the podcasts. The podcast companies hold blame as well for being greedy. But this was a major miscalculation by both sides. Completely pulling the full content from YouTube, Apple etc to instead place it all on Netflix and only clips on the previous platforms was a bad move. I’m never gonna go to Netflix to watch a podcast. I’d rather just not watch the podcast. The numbers will reflect the sentiment because I know I’m not alone. ",
        "upvotes": 295,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1r7r53d/netflix_is_singlehandedly_ruining_podcasts/"
    },
    {
        "id": "1r7pxq0",
        "author": "AttorneyFun4901",
        "title": "First youtube, now netflix",
        "content": "is it down for everyone or just me?\n\nYoutube server just went down about an hour ago. Just opened netflix and started to face problems in netflix as well.",
        "upvotes": 15,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1r7pxq0/first_youtube_now_netflix/"
    },
    {
        "id": "1r7f570",
        "author": "stravocadomf",
        "title": "Anyone else’s Netflix down right now?",
        "content": "I can watch about 30 seconds and then it forces me to restart and repeat. \n\nThis might not be related but my Crunchyroll is doing the same lmao. Weird day ",
        "upvotes": 37,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1r7f570/anyone_elses_netflix_down_right_now/"
    },
    {
        "id": "1r6z9j9",
        "author": "HehroMaraFara",
        "title": "Reality Check: America’s Next Top Model",
        "content": "I was getting upset initially because Tyra and all the other trash people involved with the show were just rose colored glasses-ing the useless and abusive drivel that they were responsible for.\n\nThen came halfway through episode two and finally some receipts came out. Then all you hear is the excuses of “we didn’t know then about rape and SA!”\n\nFuck right off everyone involved with the production, we see who you really are.\n\nEdit: I was disappointed in the ending. Just because the other judges got fired didn’t make them less complicit than Tyra the monster. I couldn’t of cared less about what happened to them and to spend half the episode on that was inane.",
        "upvotes": 216,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1r6z9j9/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r7sqm7",
        "author": "luv_kamui",
        "title": "Do anyone remember this show?",
        "content": "It was an animated series about a girl (adolescent) with dark hair (blue if I remember correctly) that had a little brother (not very important to the storyline, although I remember he annoyed her sometimes). her mom and dad appeared in some episodes, and she had friends, I remember one that had brown hair and I think she liked him but, it was like just blushing when she saw him (I liked this character, so maybe I'm comfusing it). The series was episodical and it was just about the girl, nothing too fantastic. It was not anime, it was a 2d series and it was on netflix between 2012-2018 at least on Chile.\nI remember the ending being in portuguese, but I haven't find any series in portuguese that fit the series. Plz help, I want to be able to sleep, but I have to find this series.\n(No, is no Luna's world)\nThanks!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r7sqm7/do_anyone_remember_this_show/"
    },
    {
        "id": "1r7304f",
        "author": "Empty-Relative3036",
        "title": "error code tvq-pb-101 (8.1)",
        "content": "anyone have any idea what this is?\n\nI'm assuming its a hardware issue, specifically xbox. no streaming apps are working on the series x and whatever the last Gen is called. internet is fine on other devices and netflix is working. no idea what this error is. obviously powered off and on, reset everything, reinstalled app. \n\nconfused. Tia. \n\nIts (5.6.1) error code. Not sure why it uploaded that. ",
        "upvotes": 54,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1r7304f/error_code_tvqpb101_81/"
    },
    {
        "id": "1r7s2v7",
        "author": "jkjeepguy84",
        "title": "Star search finale who did you vote for? Out of the 3 of us in the house everyone had TJ last.",
        "content": "After the finale we were shocked at the winner.  Each of us picked someone different but we all agreed that TJ was our least likely to win.  Out of the two magicians we had Harry being the sure pick and Duo was incredibly talented and Spud sounded great.  Don’t know we are shocked.  The announcing of the winners where Duo thought they won was wild… ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r7s2v7/star_search_finale_who_did_you_vote_for_out_of/"
    },
    {
        "id": "1r68bvn",
        "author": "MintySea92",
        "title": "Reality Check: Americas Next Top Model",
        "content": "Tyra, the judges and all the producers on that show were just pure evil towards those girls. They filmed and aired a crime, put many through unnecessary surgeries as well as mentally and physically humiliating them. To then have the gall to justify it all by saying they didnt realise they were hurting them at the time and that they were helping them!!\n\nThe documentary was a hard watch and I hope all the women involved have been able to find some happiness after the trauma they were put through.",
        "upvotes": 1315,
        "comments": 887,
        "media": null,
        "permalink": "/r/netflix/comments/1r68bvn/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r6sn18",
        "author": "Tikitanya6667",
        "title": "Reality Check: Americas next top model",
        "content": "So it’s bad enough that nobody had Keenyah’s back when she was made to feel uncomfortable by a male model BUT for Nigel to say during his interview it’s a reality of that world to deal with harassment (maybe it wouldn’t be if people stood up for other people in those situations) “you as an individual should be able to stand up for yourself and say this isn’t working and figure it out and get the job done there’s people and cameras everywhere.” UM she did try to stand up and she was dismissed. He was harassing her and making her uncomfortable in front of all those “people and cameras” and nobody did a damn thing and she was scolded for speaking up. Like all these years later and after seeing the entire situation that happened between them and he still can’t say we messed up on how we handled that situation we should have protected her? It’s still she should have been able to get the job done regardless of how someone was making her feel… She “needed to be professional” when that man was being a creep &amp; in reality the creep was the one not being professional and should have been scolded not her. “Just take it and shut up”. Smh disgusting.",
        "upvotes": 103,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1r6sn18/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r7kyye",
        "author": "SuzQP",
        "title": "Audio loss after pausing",
        "content": "Every time I pause a show on Netflix, the audio cuts out upon resuming the show. Initially, a brief rewind would correct the issue, but that no longer works. Now I have to exit Netflix completely-- and even that doesn't always work. I've taken to exiting the app every time I want to pause, which is a pita. Anybody know of a workaround for this?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r7kyye/audio_loss_after_pausing/"
    },
    {
        "id": "1r7ulr1",
        "author": "Twelve2375",
        "title": "Zero Day Questions",
        "content": "I’m late. I just finished this, not very good product.\n\nI looked around and there are 2 problems I have that I haven’t seen addressed, though I have given up digging pretty quickly. Spoilers ahead.\n\n1. the commission techs work on an anti-virus patch and then push it out through automatic updates. How? If everything is down including power and comms, how are they pushing out these auto updates? The App Store servers would be down. The cell towers to push the updates would be down. How exactly did they get these updates pushed?\n\nThat is all. I thought it was fine, not amazing, through the first 4.5-5 episodes. But that last episode was next level stupid.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r7ulr1/zero_day_questions/"
    },
    {
        "id": "1r7o28d",
        "author": "Ill-Promise-7597",
        "title": "Using Netflix to help learn languages",
        "content": "Okay, is it possible to restrict what languages family members can select for audio and for subtitltes? So I want my family to watch movie etc. in English, because it will help them learn. But I dont think Netflix gives that option? But it really should.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r7o28d/using_netflix_to_help_learn_languages/"
    },
    {
        "id": "1r6exe2",
        "author": "Einsteinssister",
        "title": "Reality Check: Americas Next Top Model severe abuse!",
        "content": "Shandi being raped while completely blacked out, no stopping it, AND then supposedly filming it is absolutely insane. Filming her break up after being raped was so tacky. Why in the world did they even put that into the story line? Shandi faced significant backlash and bullying online. \n\nAlso hearing that they filmed while a girl was showering with another guy was said to be prohibited? Sounds like a bunch of creeps to me.",
        "upvotes": 312,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1r6exe2/reality_check_americas_next_top_model_severe_abuse/"
    },
    {
        "id": "1r7l9bi",
        "author": "Illustrious-Use-5472",
        "title": "Is this possible?",
        "content": "So last year my father passed away and I had no way of getting his Netflix email or anything that he used for the account though I do know the email I just don't have access to it so I was wondering if there was anyway to contact Netflix to see if they can somehow change the email to his Netflix to my email, I know it might not seem important but it was the last thing my father paid for and he had had this Netflix account for a very long time since I was like 9 or 10 so it's important to me as I didn't get anything of his when he passed. Please help me, I understand if there is nothing that can be done.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1r7l9bi/is_this_possible/"
    },
    {
        "id": "1r7f1am",
        "author": "ManufacturerPlane985",
        "title": "Subtitles help",
        "content": "Hi, I’m trying to use Korean Netflix but I’m in need of English subtitles. I’m trying to watch the movie the man from nowhere but there’s no option for English subtitles I’m on Netflix on my fire stick any help .",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r7f1am/subtitles_help/"
    },
    {
        "id": "1r7vzz2",
        "author": "ThatAtlasGuy",
        "title": "Jamie Campbell Bower Returning as Henry Creel",
        "content": "ok if this is real we need to talk because Jamie Campbell Bower possibly coming back as Henry Creel for the Netflix taping of The First Shadow is not a small thing its franchise level lore fuel. \n\nthe play already dives into young Henry decades before Stranger Things and if they actually recorded it with Bower stepping in again after that surprise cameo, thats basically canon expansion not just stunt casting and I am not calm about it.\n\nnothing is confirmed yet and yeah it could just be fan hype spiraling but the timing with the Broadway recording is sus in the best way, and if Netflix drops this with him fully integrated it bridges the gap between the lab era and Season 4 Vecna in a way thats way more intentional than a random appearance. \n\nif this turns out true its not just nostalgia bait its the Duffers locking the mythology in place before the universe expands, and im kinda losing my mind over it.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r7vzz2/jamie_campbell_bower_returning_as_henry_creel/"
    },
    {
        "id": "1r7suh5",
        "author": "Southern-Brother5693",
        "title": "Netflix Moves Into MMA With Ronda Rousey &amp; Gina Carano Fight",
        "content": "",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1r7suh5/netflix_moves_into_mma_with_ronda_rousey_gina/"
    },
    {
        "id": "1r663yp",
        "author": "Zokieiei022",
        "title": "Did Don't Look Up age way too well… or was it always this accurate?",
        "content": "I just rewatched Don't Look Up and honestly it hits differently now. When it first came out, I thought it was exaggerated satire. But on a rewatch, the media chaos, political spin, meme culture, people turning everything into a trend… it doesn’t even feel unrealistic anymore.\n\nDo you think the movie was brilliant social commentary, too on-the-nose, or just heavy-handed? And which character do you think was the most realistic?\n\nCurious how everyone feels about it now vs when it first dropped.",
        "upvotes": 675,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1r663yp/did_dont_look_up_age_way_too_well_or_was_it/"
    },
    {
        "id": "1r7itxv",
        "author": "Important-Bit-6500",
        "title": "Downloads",
        "content": "Hi, it's my first time with my own account (I used to use my brothers). I wanted to download the jjk0 movie in Japanese with English subtitles. I had as my two languages English and Spanish. The movie downloaded with Spanish subs only. I deleted the download, removed Spanish from my languages and downloaded the movie again. Now it downloads with Spanish and Portuguese subs. How can I choose what subs/language to download movies in?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r7itxv/downloads/"
    },
    {
        "id": "1r760w4",
        "author": "Normal-Substance6924",
        "title": "Want to watch limited series. Do you have any recommendations?",
        "content": "I recently finished watching His&amp;Hers and How to get to heaven from Belfast. One reason I started watching them was they are limited series. Any suggestions for more such limited series or a show that ends within 2-3 seasons? I prefer comedy or suspense/mystery.",
        "upvotes": 4,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1r760w4/want_to_watch_limited_series_do_you_have_any/"
    },
    {
        "id": "1r7idg2",
        "author": "RiskAndReason",
        "title": "Heartbreak High: Season 3",
        "content": "Just saw the Season 3 teaser for Heartbreak High and it honestly feels like forever since Season 2 dropped.\n\n\n\nDo you think the hype is still there after the long gap? What are you expecting from this season?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r7idg2/heartbreak_high_season_3/"
    },
    {
        "id": "1r7h9jk",
        "author": "RedStarRaccoon",
        "title": "KDramas not available with English dubbing when Google says they are???",
        "content": "I keep trying to watch KDramas that Google says are available with English dubs, but it's not available on my apps on any device. I'm in the US if that matters for licensing. Help!\n\nFor example: My Demon.\nI can't remember which others I've tried, but it's been several.\n\nAlternatively: any suggestions for Fantasy or historical k-drama romances that *are* available with English dubbing in the US? So far, I've loved Alchemy of Souls, Genie Make a Wish, Bon Appetit Your Majesty, and The King's Affection...but now I'm struggling to find another show along those lines.\n\nEdit to add: I specifically need English dubs because I mostly watch while doing chores or before bed when I don't have my glasses on. Nothing against subtitles, but they don't work for how I watch.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r7h9jk/kdramas_not_available_with_english_dubbing_when/"
    },
    {
        "id": "1r7h8ed",
        "author": "Background-Dig849",
        "title": "just watched \"Click\" movie and f man wtf was i am doing with my life",
        "content": "i never get emotional watching a movie and i thought of watching this movie as i thought its some cool time travel gadget or somethig, but man this made me emotional on a whole another level and i saw myself going the same path as the lead character.\n\nthank netflix for recommending me this, this was soooooooo good, i really suggest each one of you to watch this who are too much focused and takes their career life way too seriously",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r7h8ed/just_watched_click_movie_and_f_man_wtf_was_i_am/"
    },
    {
        "id": "1r7e09u",
        "author": "MycologistSame866",
        "title": "Movies Requiring an Ad-Free Subscription",
        "content": "I receive Netflix with ads for free through my Dish Network service. I want to watch a couple of movies there that say they are only available with the ad-free subscription. Is there any way to do this, for instance paying a little extra for one month?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r7e09u/movies_requiring_an_adfree_subscription/"
    },
    {
        "id": "1r75xv8",
        "author": "Worried-Reserve-5678",
        "title": "Alguem me ajuda",
        "content": "I've been watching One Piece on Netflix for a while, but today it won't load. It just keeps loading and loading, then it gets to 83% and doesn't start. I've already restarted my Xbox, I've restarted Netflix, and it didn't work. I also tested Netflix on my TV and it was working fine, but I want to watch it with headphones. If anyone has had this problem and can help me, I would be very grateful. ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r75xv8/alguem_me_ajuda/"
    },
    {
        "id": "1r6tole",
        "author": "Middle-Abalone-3142",
        "title": "Most Hooking Shows On Netflix Today",
        "content": "I have just wrapped up some shows and been don’t with Stranger Things since December 31 😢 so I am looking for a new show. Drop the greatest, most intense, or loveable shows in the comments. Preferably a show with more then 1 season (so not really a limited series but more of a show)",
        "upvotes": 11,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1r6tole/most_hooking_shows_on_netflix_today/"
    },
    {
        "id": "1r774x0",
        "author": "Mr_Lighters42",
        "title": "Dual housing location",
        "content": "Everything was working just fine a couple of weeks ago\n\nI only have my phone, and 2 tvs set up for it one in each location.\n\ni live in two different places. weekdays in one and weekends on the other. this household BS is getting annoying especially when me and my partner want to watch something while at different locations. is there some way to make it work? im not buying two memberships just for it to work.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r774x0/dual_housing_location/"
    },
    {
        "id": "1r6m5rx",
        "author": "R_Steelman61",
        "title": "Best comedy - Mom",
        "content": "Wife started watching this and I was skeptical but it's a nightly ritual for us now. Just really funny, great characters and consistent quality.\n\nWhat surprised me is how such a serious topic is handled in a comedy. Somehow they are able to address the topic of addiction and still be able to laugh.\n\nGreat show. ",
        "upvotes": 16,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r6m5rx/best_comedy_mom/"
    }
]