[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 573,
        "comments": 4327,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1ne6xhd",
        "author": "rohanad1986",
        "title": "Eunice Kim Out as Netflix’s Chief Product Officer",
        "content": "",
        "upvotes": 51,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ne6xhd/eunice_kim_out_as_netflixs_chief_product_officer/"
    },
    {
        "id": "1ndtq67",
        "author": "ProteinPapi777",
        "title": "What is a film series you watched where you just couldn’t stop yourself from clicking “next episode”",
        "content": "I really want to find film series where every time I finished an episode I just couldn’t stop myself from going for the next episode even tho I should have been sleeping or something that’s how much I was excited what was gona happen. I honestly only felt that for 4-5 film series’:\n\nMoney heist\n\n\nBreaking bad\n\n\nBetter call Saul\n\n\nSquid game\n\n\nQueen’s Gambit\n\n\n(I know, I am basic)\n\nSo what is a film series where you did/felt the same way?",
        "upvotes": 270,
        "comments": 589,
        "media": null,
        "permalink": "/r/netflix/comments/1ndtq67/what_is_a_film_series_you_watched_where_you_just/"
    },
    {
        "id": "1ndyzg8",
        "author": "Pretend_Mark_5143",
        "title": "I loved Wednesday Season 1 but this second season is so annoying to me.",
        "content": "The first season had all the charm anyone could want in a show like this. It was quirky with a darker tone and I greatly enjoyed all the slight nods to the original Addams Family. It seemed like such a strong show. Every episode was good until the season final which I felt was a little over the top and lame. I thought it would pick back up for season two but my gosh was I wrong. The episodes are uncreative and unnecessarily long and to my dissatisfaction all the characters were butchered to an extreme. It hurt so bad to witness Eugene and Pugsley spend all there time causing issues with Slurp. Also, don’t expect Wednesday to show any signs of improvement she seemed to have sorta gained at the end of the first season. Not only is that work erased but it actually feels like it’s declining steadily. It’s like she’s supposed to be a badass but her character seems to have a bad case of main character syndrome. Bringing Tyler back to continue being a whiny jerk was not pleasant either and it was made worse for leaving Zavier out. Don’t even get me started on the writing. It’s some of the cringiest stuff I’ve heard in a while. This is a lot of negative stuff but I can say some good things about the show too. Season 2 was mildly entertaining. Oh, wait. That’s all I’ve got. Feel free to disagree with my opinion but for me this season was a joke.",
        "upvotes": 95,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ndyzg8/i_loved_wednesday_season_1_but_this_second_season/"
    },
    {
        "id": "1ne0qi7",
        "author": "Repulsive-Dog3371",
        "title": "Aka Charlie Sheen",
        "content": "I loved this two part docuseries! Of course most of his fallouts have occurred in the public eye. But at the end of the series, he lets out a wild secret and I loved that for him! I hope he stays with his sobriety. \n\nI also didn’t realize that there is another brother in the clan, while Emilio and their dad Martin are not a part of this, the other brother is. ",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ne0qi7/aka_charlie_sheen/"
    },
    {
        "id": "1ndkken",
        "author": "RoboticStaticShock",
        "title": "What will scare me shitless?",
        "content": "I need horror suggestions that will fuck me up and scare me. I am not an easily scared person when it comes to movies but I wamna watch something deeply creepy.  I love psychological thrillers.  I also have prime if that helps.  Thank you!!!",
        "upvotes": 60,
        "comments": 173,
        "media": null,
        "permalink": "/r/netflix/comments/1ndkken/what_will_scare_me_shitless/"
    },
    {
        "id": "1nec0c3",
        "author": "peoplemagazine",
        "title": "Ben Affleck and Matt Damon Play Miami Cops Who Discover Millions in The Rip Trailer",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nec0c3/ben_affleck_and_matt_damon_play_miami_cops_who/"
    },
    {
        "id": "1nebqlt",
        "author": "Sad-Rush-4269",
        "title": "Netflix Account Information",
        "content": "Hi everyone.\nI was in India and created a Netflix account, but I need to return to Italy. The account has an Indian credit card. Can I continue using it in Italy?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nebqlt/netflix_account_information/"
    },
    {
        "id": "1nddsmr",
        "author": "punchtheface",
        "title": "Kaos - What a disappointment!",
        "content": "Not in the show of course, but disappointed I am to hear it was cancelled and we may never reach a conclusion. I loved every minute of it. It was such an authentic and original take on a story as old as we can remember.\n\nThe cast was amazing, every character was so rich and engaging I could not honestly pick a favourite… apart from Dionysus of course.\n\nI was wondering what the majority of people felt about it though, it appears to not have drawn in the audience numbers to keep going.",
        "upvotes": 109,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nddsmr/kaos_what_a_disappointment/"
    },
    {
        "id": "1nea42p",
        "author": "Icy_Cold-View",
        "title": "I can't wait to see what will happen in Beauty in Black Season 2",
        "content": "\nI finished the first season last week -- the ending was amazingly satisfying, but I felt sad for Angel, and I’m excited to see where the story goes next!!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nea42p/i_cant_wait_to_see_what_will_happen_in_beauty_in/"
    },
    {
        "id": "1ne8phk",
        "author": "Healthy-Rent-5133",
        "title": "If you miss a Netflix boxing fight live can you watch later or is it only live?",
        "content": "Gonna miss the Canelo Alvarez versus Terence Crawford fight, wondering if I should find a way to record it or if I can just stream it after the fact. \n\n\n\nThanks",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ne8phk/if_you_miss_a_netflix_boxing_fight_live_can_you/"
    },
    {
        "id": "1nebtxb",
        "author": "Fun_Molasses5215",
        "title": "Lisa Rinna revealed the hardest part about playing Kendra Licari in film about shocking case",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nebtxb/lisa_rinna_revealed_the_hardest_part_about/"
    },
    {
        "id": "1ndwnia",
        "author": "Corrupt_Echo",
        "title": "What’s a good show or movie series for a 13YO Boy",
        "content": "LF something decent - have seen raising Dion, and a few others and now looking for a new show to binge or just watch even if it’s in a different series",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ndwnia/whats_a_good_show_or_movie_series_for_a_13yo_boy/"
    },
    {
        "id": "1ne589r",
        "author": "historyinprogress",
        "title": "Justin from Fenn’s Treasure",
        "content": "Watching Gold and Greed: The Hunt for Fenn’s Treasure and noticed the treasure hunter Justin Posey, the software engineer. Hot nerd appreciation post. Love nerdy guys. That is all. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ne589r/justin_from_fenns_treasure/"
    },
    {
        "id": "1ne4ef3",
        "author": "harshdavra",
        "title": "Just watched Shiny_Flakes: The Teenage Drug Lord and I have so many questions",
        "content": "I just finished this doc and I can’t stop thinking about it. The whole thing plays out like a movie but some parts really don’t add up.\n\nMax built this drug empire literally from his bedroom and the police show up like “we cracked a huge cyber case”… but wasn’t it basically a returned package and him using the same Packstation that gave him away? Makes me think the “big investigation” angle is oversold.\n\nThen there’s the money. They say millions were made, but where did it actually go? They show cops holding piles of drugs, not piles of cash. Authorities even admitted they don’t know where all the money ended up. So are there wallets out there still untouched?\n\nAnd the family thing… this all happened in his mom’s apartment yet she’s never shown on camera. Not even after her son was arrested at home. How does a global drug empire run out of your house and you’re never part of the story? Feels like something is being left out.\n\nMax himself is another puzzle. Totally flat, no emotion, no remorse. He talks about this like he’s describing a homework project. Makes me wonder if he had some major trauma or if he’s just wired differently.\n\nAnd the ending… they tease that he set up another website after all this but don’t reveal the name. Like they want to keep the mystery alive. Later reporting says there was another site called Candylove but the doc never mentions it. Why hide that?\n\nIt almost feels like the “teen genius alone in his room” story is too neat. Was there really no bigger network? Or is the lone wolf angle just a legend?\n\nAnyone else feel like the documentary left out some huge pieces?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ne4ef3/just_watched_shiny_flakes_the_teenage_drug_lord/"
    },
    {
        "id": "1ndu6se",
        "author": "Deanno0",
        "title": "Need a good series to watch that is actually entertaining!",
        "content": "Please list something that is actually entertaining to watch and somewhat addicting . So hard to find something decent to watch that actually catches my attention !! Just list your favorites from best to worst don’t need to go into detail . Thanks netflixers!",
        "upvotes": 5,
        "comments": 159,
        "media": null,
        "permalink": "/r/netflix/comments/1ndu6se/need_a_good_series_to_watch_that_is_actually/"
    },
    {
        "id": "1ndr9ky",
        "author": "Wonderful_Cost4856",
        "title": "Autumn Vibes Only — Best Netflix Series &amp; Movies to Cozy Up With?",
        "content": "Hey everyone!\n\nWith autumn almost here, I’m on the hunt for the **perfect Netflix series or movies** that give off those cozy, warm, and slightly nostalgic vibes. Think falling leaves, rainy afternoons, blankets, and hot coffee.",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ndr9ky/autumn_vibes_only_best_netflix_series_movies_to/"
    },
    {
        "id": "1ne1ms8",
        "author": "Parking_Honeydew2523",
        "title": "pausing subscription",
        "content": "i applied a gift card to my netflix account when i signed up, and it auto applied 2 months worth so my subscription lasts until oct 22. is it possible for me to pause sep 22 and resume oct 22 so the subscription runs aug 22-sep 22 and oct 22-nov 22? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ne1ms8/pausing_subscription/"
    },
    {
        "id": "1neayco",
        "author": "Every-War-9595",
        "title": "Nikki Rodriguez: 33 and Playing a 15/16-Year-Old in Netflix Show",
        "content": "https://preview.redd.it/09rdqjbwsjof1.png?width=2294&amp;format=png&amp;auto=webp&amp;s=1cd28c7e6c77cd584cd951213a1bf6b56be75f74\n\nI wanted to share my thoughts on Nikki Rodriguez, who plays Jackie (lead) in My Life with the Walter Boys. I recently found out that she’s actually **33 years old**! This makes sense because her vibe feels much more **mature** than her character, who’s supposed to be **15 or 16**.\n\nYou can definitely tell she’s older in some ways. For example, the lines around her eyes and her smile lines really show her age and add to that mature impression. Plus, the way she carries herself feels much more adult. She graduated from Roseville Area High School in Minnesota in **2010**, which fits with her being older.\n\nI’ve noticed that older actors sometimes take on teenage roles, but it feels off for someone **over 30** to be playing a teenager, and this casting choice detracts from the **authenticity** of the show. Honestly, her acting is **subpar,** and she feels too mature for the role and struggles to embody a teenage character, especially given that it's almost **20 years** since she was that age.\n\nETA: Her real age is in the public domain and has been reported on social media and news sites.\n\n  \nEdit to add: My observations were about acting authenticity, not a personal attack. Physical characteristics matter when an actor is portraying a much younger character. This is a legitimate critique of casting and performance.",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1neayco/nikki_rodriguez_33_and_playing_a_1516yearold_in/"
    },
    {
        "id": "1ndfz91",
        "author": "hestooopinionated",
        "title": "Love Con Revenge Is A Joke",
        "content": "I thought this documentary series was a joke and I was surprised to Cecilie again, but I guess she would be an expert in this subject since she willingly gave away all her money too. ",
        "upvotes": 7,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9t6v8f4hmcof1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ndfz91/love_con_revenge_is_a_joke/"
    },
    {
        "id": "1ndm513",
        "author": "SlightlyBoringCat",
        "title": "yo i watched never have i ever",
        "content": "real good and fun to watch. teenage stuff and all shown good. Would recommend to people who're looking for something not too serious and will make them feel good.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ndm513/yo_i_watched_never_have_i_ever/"
    },
    {
        "id": "1ndku4i",
        "author": "Serious_Share_2381",
        "title": "Just watched Two Graves",
        "content": "I absolutely loved it! Very satisfying mini-series. Seems like nowadays it's hard to find something that would keep my attention but they succeeded.\nMy strong recommendation if you like a good European thriller.\nBtw is there anything similar that I could watch on Netflix?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ndku4i/just_watched_two_graves/"
    },
    {
        "id": "1nczjt7",
        "author": "CitygirlCountryworld",
        "title": "Need a Recommendation to watch as a couple that husband likes",
        "content": "Hey all, \nWhat do you recommend my husband and I watch next. (It doesn’t even have to be Netflix). My husband liked: \n- Justified \n- Yellowstone/1923 (1889 was too dreary) \n- Reacher \n- Prison Break \n- Outlander \n- Ozark\n- American Primeval \n- Narcos\n- Queen of the South \n- Landman \n- Tulsa King\n- We couldn’t get into Breaking Bad but could try again. (Life interfered and then we got out of it) \nPlease give any suggestions you might have for us! :) \n\n ",
        "upvotes": 34,
        "comments": 282,
        "media": null,
        "permalink": "/r/netflix/comments/1nczjt7/need_a_recommendation_to_watch_as_a_couple_that/"
    },
    {
        "id": "1ncxa7b",
        "author": "harshdavra",
        "title": "Just watched Sweet Bobby: My Catfish Nightmare and I’m mind blown",
        "content": "I just finished watching Sweet Bobby and I’m shocked. How is it even possible for someone to catfish like this for years without being caught?\n\nThere are things that just don’t add up. Bobby supposedly lived only about an hour away from Kirat yet she never managed to meet him in person or even properly google him? In today’s world that feels almost impossible.\n\nAnd then the layers of fake accounts, the endless lies, the way he kept the story alive for so long… it’s wild. Was there someone else involved helping him cover tracks? Or was Bobby just that good at manipulation?\n\nAlso makes me wonder how many red flags got ignored or brushed off. Did he have access to some kind of insider info about her life? How did he always know what to say to keep her hooked?\n\nHonestly it almost feels bigger than a one-person catfish. Either he was way too clever or there’s more to the story that’s never been revealed.\n\nAnyone else feel like some pieces are missing here?",
        "upvotes": 43,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1ncxa7b/just_watched_sweet_bobby_my_catfish_nightmare_and/"
    },
    {
        "id": "1nddxn0",
        "author": "Official_vegito",
        "title": "Exciting titles upcoming on Netflix",
        "content": "Hi, is anyone aware of the upcoming exciting shows on Netflix? I am specifically looking for crime thriller based shows which may be coming up on Netflix exclusively ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nddxn0/exciting_titles_upcoming_on_netflix/"
    },
    {
        "id": "1ncn0hz",
        "author": "ZestycloseFig4025",
        "title": "Ever wish your doctor explained things like Shaun does?",
        "content": "I been watching The Good Doctor and it really got me thinking about how rare it is to have a doctor who actually takes the time to explain things clearly. Shaun walks patients through their options breaks down complicated medicalinfo and never talks down to them its the kind of care a lot of people just don’t experience in real life. Most appointments I had feel rushed Lab results get thrown at me with no explanation or I get a quick everything looks fine with zero context. It leaves a lot of questions hanging and makes it hard to know what to do next or what even matters.Thats part of what led me to try out EurekaHealth. It’s an AI tool that’s built specifically for health questions not just general chatbot stuff. I use it to make sense of test results, get second opinions based on visit notes, and ask follow up questions I didn’t get to bring up during appointments.  \nWatching The Good Doctor just kind of reinforced how helpful it is to have something that brings that kind of clarity and support into real life even if its through tech.",
        "upvotes": 86,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ncn0hz/ever_wish_your_doctor_explained_things_like_shaun/"
    },
    {
        "id": "1ndh6th",
        "author": "Top-Three-USA",
        "title": "From Spice Girl to style icon, Victoria Beckham shares her journey in a new Netflix docuseries premiering October",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ndh6th/from_spice_girl_to_style_icon_victoria_beckham/"
    },
    {
        "id": "1ncag2d",
        "author": "powcatnipdoll",
        "title": "The new layout of Netflix is so lame",
        "content": "One of the most iconic things about Netflix was their distinct layout compared to other streaming platforms and now it looks boring, it doesn’t feel iconic anymore, plus the amount of disappointing not good shows, Hulu and Disney hotstar might just be better idk",
        "upvotes": 532,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1ncag2d/the_new_layout_of_netflix_is_so_lame/"
    },
    {
        "id": "1nd9q1t",
        "author": "-hwaberry",
        "title": "Netflix automatically looping movies?",
        "content": "Recently has anyone else found that netflix is automatically repeating what they just watched? I had Kpop Demon Hunters on the other day while doing something, and then it just played it again, and bc I just had it on in the background I was like okay sure I'll watch it again, and then it looped it a third time, so it seems my netflix will just continually repeat movies now, is it a glitch or a new feature??? I've never had it automatically repeat before so I'm just curious 😂",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nd9q1t/netflix_automatically_looping_movies/"
    },
    {
        "id": "1ndds2r",
        "author": "youryoungversion",
        "title": "Cobra Kai 🐍",
        "content": "I just finished watching the entire 6 seasons in just 2 days. Man, what an amazing series. Loved everyone’s role.\n\nIt does make you feel badass from the get go! #CobraKaiNeverDies 👊🏻",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ndds2r/cobra_kai/"
    },
    {
        "id": "1ndsaks",
        "author": "SomethingLikeRigby",
        "title": "Wednesday S2: am I the only one?! Am I being too harsh?",
        "content": "I really enjoyed S1 of Wednesday. It had some flaws, but overall a fun concept and use of the Addams IP. \n\nThis season though… 6 episodes so far, and it feels like a completely unfocused mess, and I’m considering just checking out. Where the first season had subplots BUT were NECESSARY red herrings &amp; dead ends as part of Wednesday’s investigation, S2 subplots feel all over the place, as though the writers were just winging it because they weren’t sure what they wanted to do. \n\nThere are also WAY too many returning characters we DIDN’T need. And guest spots that don’t feel like the intended nice surprise they’re meant to be IF they were supported by good writing. They feel shoehorned. Especially Weems. I liked her character in S1, but they made their choice killing her off, and should have stuck with that. She now being Wednesday’s spirit guide is a reach too far. \n\nI also find it perplexing that when Bianca’s power would have been needed at a moment where it could have been life or death for the Nightshades facing Tyler, she doesn’t even attempt to use it. Huh?!?!!?! What about Ajax? When shit hit the fan, he doesn’t attempt to stone Tyler?!\n\nI also take issue with some of the way the Addams are represented here, compared to past media. Yes, the Addams are meant to be creepy &amp; kooky, and part of the gag of The Addams is how off putting &amp; backwards they’re supposed to seem to regular people. But they were NEVER portrayed as bad people, doing bad things, at least to society. The subplot involving Pugsley’s “pet”, and the lack of any genuine remorse from Pugsley &amp; Gomez for the amount of people it’s killed is distasteful. I also dislike that Fester is a lifelong career criminal that escapes any true negative consequences, and even the family don’t take issue with it either. The show handles these sorts of things in a “Yeah? So what?” fashion, and it really rubs me the wrong way. \n\nI am at odds as to whether I bother continuing with the remaining episodes, because if Tyler somehow gets a “redemption &amp; all is forgiven” arc, that will be the straw that breaks the camels back for me. \n\nCredit where credit is due though: Wednesday &amp; Enid having a “Freaky Friday” was great. It really seemed that both actresses had loads of fun playing each other’s respective characters for that episode, and both did a remarkably good job: they totally sold that they had swapped bodies because they had the personalities nailed. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ndsaks/wednesday_s2_am_i_the_only_one_am_i_being_too/"
    }
]