[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1m0db1t",
        "author": "JoJoFC27",
        "title": "Porta Palazzo: divieto di transito per chi cammina a testa in giù",
        "content": "",
        "upvotes": 90,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bnkij5pec0df1.jpeg?auto=webp&amp;s=95813166ce6a7c810166ea2b2b7842b6ddc82ec3"
        },
        "permalink": "/r/torino/comments/1m0db1t/porta_palazzo_divieto_di_transito_per_chi_cammina/"
    },
    {
        "id": "1m0h42b",
        "author": "zhenming91",
        "title": "FPV dive National Museum of Cinema",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1tprfn97d1df1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1m0h42b/fpv_dive_national_museum_of_cinema/"
    },
    {
        "id": "1m0cdym",
        "author": "Throw4away477",
        "title": "Come viene percepito il Politecnico di Torino all’estero?",
        "content": "Ciao a tutti!  \nUn mio amico, studente internazionale, sta valutando se iscriversi al Politecnico di Torino oppure optare per un’università in Svizzera. Una delle sue preoccupazioni riguarda la reputazione del PoliTo all’estero: ha sentito dire che al di fuori dell’Italia, non sarebbe molto riconosciuto o apprezzato, soprattutto nel mondo del lavoro. \n\nVoi che ne pensate?  \nAvete esperienze dirette o conoscete persone che si sono laureate al PoliTo e poi hanno cercato lavoro all’estero? Il titolo di studio è ben considerato, oppure ci sono limiti in termini di riconoscimento o reputazione internazionale?  \nHo provato anche a chiedere ad un mio amico che vive a Torino ma non mi ha ancora risposto.\n\nGrazie mille in anticipo a chi risponderà!",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1m0cdym/come_viene_percepito_il_politecnico_di_torino/"
    },
    {
        "id": "1m0d62n",
        "author": "ohhisofia",
        "title": "Revolut Direct Debits...",
        "content": "Has anyone had trouble (or success!) in using a Revolut account for direct debit with local companies? I have an Italian Revolut, with \"IT\" at the start of the IBAN, but I'm having issues with both Fastweb and Eni (plenitude) trying to pull the money via direct debit. On the flip side, my revolut account isn't even registering that they are trying to create the direct debit.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m0d62n/revolut_direct_debits/"
    },
    {
        "id": "1lzw65i",
        "author": "glorious-ahole",
        "title": "Alla ricerca di posti da visitare in bicicletta nei pressi di Torino",
        "content": "Ciao a tutti, sono nuovo in città e cerco posti da visitare in bici nelle vicinanze (preferibilmente zone collinari). Sono già stato a Susa, Sacra di San Michele, Rivoli, Moncalieri, Superga. Cerco posti dove poter andare e tornare in giornata. Preferisco le zone con piste ciclabili, ma anche in assenza di piste ciclabili va bene.",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lzw65i/alla_ricerca_di_posti_da_visitare_in_bicicletta/"
    },
    {
        "id": "1m00b79",
        "author": "Confident_Music_5798",
        "title": "Cerco gruppo WhatsApp per incontri adulti a Torino",
        "content": "Ciao, sono un uomo serio, educato e curioso.\nCerco un gruppo WhatsApp attivo su Torino dove ci si possa conoscere tra adulti realmente interessati a incontrarsi, senza spam e senza fake.\n\nSe qualcuno ha un gruppo affidabile e rispettoso, mi scriva pure in privato.\nGrazie!",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m00b79/cerco_gruppo_whatsapp_per_incontri_adulti_a_torino/"
    },
    {
        "id": "1lzk1jq",
        "author": "IcyLetterhead6750",
        "title": "A Torino da un paio d’anni, a qualcuno va di fare amicizia?",
        "content": "Ciao a tutti, sono un ragazzo di 25 anni e sono a Torino già da un po’, ma non ho avuto molta fortuna con le amicizie e con le persone della vita di tutti i giorni non riesco a superare la barriera del “siamo solo conoscenti”, e sono un po’ impacciato per prendere l’iniziativa.\n\nSo che ad alcuni questi post stufano, ma anche se non ci pensano perché magari godono di una vita sociale più ricca immagino che avere zero amici non farebbe loro piacere e cercherebbero di rimediare, e sto cercando di fare lo stesso, che sia un modo efficace o meno ho visto molte persone gentili e disponibili, quindi ci provo anch’io e spero gli altri non se la prendano troppo.\n\nDetto ciò parlo brevemente di me: ho una passione per le moto, mi piace l’arte e dipingere, pratico la boxe da 2 anni ma apprezzo molto anche il basket. Poi ho una simpatia per gli anime anche se ne ho visti pochi, apprezzatissimo qualcuno che possa consigliarmene. \nRisulto una persona un po’ introversa più per incapacità che per modo di essere, ma con le persone giuste so che posso aprirmi facilmente, quindi se a qualcuno va di uscire mi scriva pure!\n(Non gente sotto i 20 anni per favore!)\n",
        "upvotes": 15,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1lzk1jq/a_torino_da_un_paio_danni_a_qualcuno_va_di_fare/"
    },
    {
        "id": "1lz53gt",
        "author": "Cairoli23",
        "title": "qual'è quello che vi piace di più di Torino?",
        "content": "sono straniero e sono arrivato appena una settimana fa a Torino per fare un corso estivo. voglio capire cosa vi piace di questa città. a me piace quest'aria di storia e la magia che si respira. e per voi?\n(foto presa il venerdì 11 luglio di sera da corso casale)",
        "upvotes": 91,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mvrfktaarpcf1.jpeg?auto=webp&amp;s=43fff1eec1c76ed495e444bb3724759c79dc8543"
        },
        "permalink": "/r/torino/comments/1lz53gt/qualè_quello_che_vi_piace_di_più_di_torino/"
    },
    {
        "id": "1lzqwn8",
        "author": "Smalljules89",
        "title": "Posto per ballare salsa e bachata?",
        "content": "Ciao a tutti!\nTra poco sarò a Torino e perché mi piace ballare salsa e bachata così tanto volevo chiedere se ci sono dei posti belli dove si può ballare a Torino?\nGrazie in anticipo!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lzqwn8/posto_per_ballare_salsa_e_bachata/"
    },
    {
        "id": "1lyz438",
        "author": "Murky_Giraffe8700",
        "title": "A brief summary of being a foreign in Torino after ten years",
        "content": "* ***DISCLAIMER***\\*: This is not a rant (probably I'll get a lot of negatives from people originated from here but...foreign people will understand), and as I said, I'm living here, I love the place and even planning to be a house, but I believe you need to know this being a foreign coming here:\\*\n\nBefore starting, let me say I have live in six different neighborhoods in the city and also in the outskirts (settimo) so I won't speak about \"the city center\", I'll speak about every area of the city.\n\nThe city itself it's not \"**great**\", don't trust rankings, the city it's improving a lot since I arrived but after living ten years here I can say: \"it's OK\", if you want to plan ahead, but you need to know the rough edges before committing to a plan.\n\nMy vision on the city is that it's a city of contrasts, you can walk around being yourself and that's more than fine, however in the insides of every family of the Piedmont area you will find elitism, systematic racism, and maybe a bit more than I'm not open to disclose. The city is anarchic but in the background of every anarchism you will find the kid of a really rich family, and so (mostly like in every city in the world), but here it's quite exaggerated).\n\nThere's a lot of \"situa\" which allows you to go around hanging out and don't spend much if you have a bike because despite being huge it's not that \"crazy\" big to not discover it by bike. (be aware of madmens at the wheels!)\n\nCity itself it's quite \"dirty\" if you compare it with other cities from the north. It has a crazy huge problem with graffitis (that a lot of people in this subreddit already commented). Taxes are high enough to complain about this since rifuiti it's incredible high I'll say.\n\nA lot of systematic robbery of cars (don't let your car near parking spots at night on the outskirts). Streets in the outside of the city are a completely mess, holes and everything. Feels like in \"decay\".\n\nAdditionally, there are more and more no-go-areas, which is not a good thing at all.\n\nThere a plenty set of things to do given the reasonable size of the city, you can eat, have fun, go to the cinema, etc. Very cool events as well (C2C, Flowers, Kappa, Torino Film Festival, etc)\n\nUrbanism it's good but not quite there though, taking your bike across the city if you don't go in the bike lane it's literally a nightmare. Living close to a park or some green area it's a challenge (even tough Torino it's one of the greenest cities of Europe) but still if you live close to one you just pray it's not trash or full of crackheads.\n\nRent will be a pain in the ass to be honest, if you are not from here they will ask you even your grandmother name before renting something and it's like begging to the devil every time they open or book an appointment to see an apartment. It simply doesn't matter who you are or were before coming to the city but the people itself will make you feel small, tiny, insignificant.\n\nPersonal security it's OK if you are not \"in those no-go-areas\" I won't mention since I don't want to drive the attention of the post to if any area is good or not. Other than that I saw only one rob in ten years, which says a lot! (in London I remember one day I saw three in a day)\n\n**Air it's a huge negative aspect**. I didn't have any respiratory issue before arriving to the city and now I feel someday I \"force\" myself to breath correctly. (A regular weekend trip to the mountains fix it though)\n\n**Transportation it's completely utterly useless**. To say something they close the subway on August. No matter what people say from here that \"at least\" exists, you cannot compare GTT with other transportation group of Europe, it will be much worse. Every city I went had it better and more organized, even Palma De Mallorca!\n\nIf you come by airplane, don't take a Taxi, please. It's crazy expensive. Like 50 EUR or more. Taxis itself are a thing I don't quite understand, it's literally impossible to get around since Uber does not work and the most common use of Taxi service it's completely impossible to afford if you earn an Italian salary.\n\nTraffic is literally closer to India's traffic than Western traffic. (no kidding). Go to Baldissera around 6PM. (yes people i know \"ohh in rome\" but literally torino has a problem with it)\n\n*To my eyes, despite of being in close places like Sweden*, Torinese people here is not friendly at all (oh boy I see the negatives), don't get me wrong, they are polite and everything but they won't even commit to a talk with you if they feel you are foreign, and whenever you feel you are talking it's because it's mostly people from the south or other more friendly areas. The \"Torinese\" have this entitlement of 'one-upon-a-time-greatness' that cannot be avoided (maybe a mountain-head or so, idk). All my friends are foreign people and friends from these friends also are, only exceptions where someone met a girl from Italy or situations like that.\n\n**On a few positive random notes:** It's not a cosmopolitan city like others wants to put it which to me is good since it's not crowded, at all; night life it's good (Q35, Azimuth, etc); it's organized relatively (depending on which \"bureo\" you need to apply to); it's \"cheap\" still' it's close to really amazing landmarks and it's affordable if you wanna extend your period, but if you don't have any link to \"Torino\" other than being here, let me say you will pass a Nordic winter every time the summer goes away.\n\nIt's still not there \"to be connected\" in a way, that even the train to the airport sometimes does not even work or if you depend on public transportation you are probably f\\*\\*k in a way (it will work to go to the mountains from time to time but if you depend on it to go to work, I see the sciopero in coming)\n\nIt's a city that to me, took my hearth and I'll always be in debt with it, but at first I didn't understand it and I didn't play the rules of it. I was \"waiting for the bus\" but then I realized the bus will never come at time so I bought a bike, and my life improved 15%, and then I bought a car, and my life improved 15% more since I didn't depend on trains, and so...until you live OK.\n\nThe city has something inside the roots of it, it's \"magic\" indeed, it's hard to explain what but it has a \"vibe\" that you get it or not.\n\nOther than that, and with a lot of people I talked to, **it's a city that you will love or hate**, and most of that will depend on the people you will spend time with, find yourself a good group of expats that lives here and from there you will have a blast. I love this city because I met the love of my life, I got marry, I respect its values and I believe the tradition they have of being \"this kind of city\" it's something I respect, but be aware before moving here, that's all what I'm saying.\n\nPS: I have live in Sweden, Spain, Germany, France and now here, and from all the places I've been, Torino it's by far the best comparing tradeoffs. The only thing I'll completely replace it's madmen at the wheels, boy those are annoying",
        "upvotes": 101,
        "comments": 60,
        "media": null,
        "permalink": "/r/torino/comments/1lyz438/a_brief_summary_of_being_a_foreign_in_torino/"
    },
    {
        "id": "1lzxyks",
        "author": "Background-Chest-717",
        "title": "Bros write your top 5 cities in europe and please briefly explain why !",
        "content": "1 istanbul hit me like a storm chaotic loud but weirdly addictive\n2 vienna was the opposite everything in place nothing to prove\n3 turin felt cold at first like someone who doesnt talk much then somehow you miss it\n4 prague a dream you half remember a little strange a little too beautiful\n5 lviv soft light slow mornings and something unspoken that stays with you",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lzxyks/bros_write_your_top_5_cities_in_europe_and_please/"
    },
    {
        "id": "1lzrobj",
        "author": "Complex_Lynx_8546",
        "title": "AAA cercasi consiglio",
        "content": "Ciao a tutti,\n\nVenerdi' dovrei partire dall'autostazione dei pullman e stare via una settimana e avevo intenzione di lasciare la macchina li vicino al parco per poi averla quando arrivo dato che non sono da solo e ho anche la valigia. L'alternativa sarebbe lasciare mio padre all'autostazione con le valigie, andare a posare la macchina sotto casa (abito in zona aurora vicino porta palazzo) e tornare all'autostazione con la bici elettrica, solo che così quando rientro devo fare al contrario, quindi andare a prendere la macchina e andare a prendere mio padre. Ora non voglio tirarmela ma ho già lasciato una volta la macchina sotto casa per 4 giorni e non è successo nulla. Addirittura sotto il mio palazzo c'è una macchina parcheggiata li da Dicembre forse ma è ancora intatta. Voi sapete dirmi se quella zona è \"sicura\" per lasciare la macchina tutto quel tempo?!",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1lzrobj/aaa_cercasi_consiglio/"
    },
    {
        "id": "1lzqlta",
        "author": "RainDesigner",
        "title": "what's the best strategy to find a place to rent?",
        "content": "I'll be joining the flood of people arriving in Torino this September and I'm looking for a place to stay. I have a reservation for a room in a university dormitory but you can't stay there indefinitely and now sure I would like to do so even if I could.  \nA friend that lives in the north of Italy told me to be super cautious about renting, that the market is full of pirates and they will try to scam me every inch of the way. So I'm not sure how to approach this search.  \nI guess people will be leaving for vacation soon enough and maybe its a good time to search for a place but I'm not sure it actually works to try find a place this many months in advance.  \nI was honestly hoping that once I arrive there I'll find a bunch of \"room for rent\" posters on the university walls and maybe I'l be lucky to find something right there and then but maybe I'm being a bit too naive.\n\nso TLDR: how would you recommend approaching the finding a room for a year quest? start looking form home or should I be able to find something looking for something once I arrive?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lzqlta/whats_the_best_strategy_to_find_a_place_to_rent/"
    },
    {
        "id": "1lzqeez",
        "author": "Repulsive-Yak-126",
        "title": "Beaches near torino",
        "content": "\nCiao tutti!\nI'm living in Torino, and I was supposed to take a bus to Spotorno on the 16th of July, but FlixBus decided to cancel it.\nDo you have any suggestions for a beach town near Torino that I could visit instead?\n\nI've heard about Varigotti, Spotorno, and Genoa, but I've never been to a beach in my life, so I have no idea how it all works — especially where to store my personal belongings while swimming.\nI'm willing to pay around 20–25 euros for a spot on a sandy beach.\n\nAny tips or recommendations would be greatly appreciated!\n\n\n\nCiao a tutti!\nVivo a Torino e dovevo prendere un autobus per Spotorno il 16 luglio, ma FlixBus ha deciso di cancellarlo.\nAvete qualche suggerimento su una città di mare vicino a Torino che potrei visitare al suo posto?\n\nHo sentito parlare di Varigotti, Spotorno e Genova, ma non sono mai stato in spiaggia in vita mia, quindi non so bene come funziona — soprattutto dove lasciare i miei effetti personali mentre nuoto.\nSono disposto a pagare circa 20–25 euro per un posto su una spiaggia sabbiosa.\n\nOgni consiglio o raccomandazione è super apprezzato!\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lzqeez/beaches_near_torino/"
    },
    {
        "id": "1lzi5sg",
        "author": "Important_Still5639",
        "title": "Idee per regali/ricordi da portare in Germania?",
        "content": "Ciao a tutti! Sto cercando qualche consiglio: tra pochi giorni tornerò in Germania dalla mia famiglia e vorrei portare con me qualche regalo o souvenir tipico di Torino e dintorni. Ho passato qui un semestre Erasmus e il 18 luglio prenderò il treno per tornare a casa.  \nHo già comprato alcune cose legate alla Juventus e qualche bottiglia di vino da una cantina nel Monferrato.\n\nAvete altre idee su cosa potrei portare?  \nQualcosa di tipico, buono o interessante che rappresenti bene la regione? Idealmente non troppo grande o pesante, visto che viaggerò in treno.\n\nGrazie mille in anticipo per i vostri suggerimenti!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lzi5sg/idee_per_regaliricordi_da_portare_in_germania/"
    },
    {
        "id": "1lzv179",
        "author": "eventi_del_tano",
        "title": "I L L I C A",
        "content": "Serata per fare nuove amicizie \n\ntutti i mercoledì sera\n\n- calcio balilla \n- buon cibo\n- giochi di società\n- musica a 360°\n\ntutte le informazioni \nhttps://www.instagram.com/p/DMAsOPzIeSd/?igsh=NGhhZzc1bXVzaG4x",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lzv179/i_l_l_i_c_a/"
    },
    {
        "id": "1lys6jd",
        "author": "davivesp",
        "title": "Amicizie?",
        "content": "Ciao a tuttə, sono un ragazzo di 29 anni. \nMi sono trasferito qualche anno fa a Torino e, causa la mia personalità un po’ introversa, ho sempre fatto difficoltà nelle nuove amicizie.\nMi piacerebbe trovarmi con persone con la quale instaurare un bel rapporto di amicizia, uscire e fare cose insieme. \nSe anche tu sei in cerca di nuove conoscenze, commenta o scrivimi pure! :)",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lys6jd/amicizie/"
    },
    {
        "id": "1lyen74",
        "author": "Background-Chest-717",
        "title": "Guys do you think torino is a top tier city ?",
        "content": "Like paris berlin or amsterdam.or what are your thoughts?",
        "upvotes": 141,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pux7d6ta6jcf1.jpeg?auto=webp&amp;s=74ac4910a6cd562038ba5c97d11712b1aaadcacd"
        },
        "permalink": "/r/torino/comments/1lyen74/guys_do_you_think_torino_is_a_top_tier_city/"
    },
    {
        "id": "1lyvs7w",
        "author": "FreeAd8663",
        "title": "Esibizione 13 luglio 2025 piazza Castello a Torino",
        "content": "Oggi 13 luglio 2025, in zona piazza Castello a Torino, la Only One Black band si esibirà in versione acustica presentando cover e pezzi inediti riarrangiati per l'evento. Un'ottima occasione per scoprire una giovanissima band  piemontese con un repertorio che spazia dall' Hard Rock al Progressive Metal.",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rbqri6fevncf1.jpeg?auto=webp&amp;s=205c12b5d04dfd6648808c8cb616032a8abde248"
        },
        "permalink": "/r/torino/comments/1lyvs7w/esibizione_13_luglio_2025_piazza_castello_a_torino/"
    },
    {
        "id": "1lz3avo",
        "author": "151pan",
        "title": "Bere e mangiare San Salvario",
        "content": "Cerco un posto dove bere qualcosa spendendo poco, ma dove servano anche cibo da condividere tipo aperitivo rinforzato (non una cena vera, ma nemmeno solo patatine). Vengono su i miei genitori e fratelli, quindi qualcosa di onesto, informale e con cose da mangiucchiare mentre si beve. Consigli?? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lz3avo/bere_e_mangiare_san_salvario/"
    },
    {
        "id": "1lyylx6",
        "author": "Ancient_Tourist_4268",
        "title": "Persone con cui giocare a golf",
        "content": "Ciao a tutti !\nM23, da circa 2/3 mesi gioco a golf , non ho ancora un handicap, ma entro settembre dovrei avercelo…mi piacerebbe creare una compagnia di ragazzi che come me non hanno un livello altissimo di golf, ma vogliono divertirsi.\nIo gioco principalmente a Torino Sud, ma se ci si vuole vedere per fare un po di pratica insieme o qualche buca anche a Torino nord con piacere!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lyylx6/persone_con_cui_giocare_a_golf/"
    },
    {
        "id": "1lypmtq",
        "author": "italiancollegekid",
        "title": "Amici?",
        "content": "M20. Chi vuole farsi un giro, due passi, fumare qualcosa, bere qualcosa, parlare del più o del meno? Scrivetemi qua sotto o un messaggio in privato.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lypmtq/amici/"
    },
    {
        "id": "1ly1o3d",
        "author": "srgolf313",
        "title": "Un tramonto d’inverno",
        "content": "",
        "upvotes": 45,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/88gwwjwcdgcf1.jpeg?auto=webp&amp;s=d4a1879057bc98a318951bb209afec2053447bce"
        },
        "permalink": "/r/torino/comments/1ly1o3d/un_tramonto_dinverno/"
    },
    {
        "id": "1lyou67",
        "author": "Shevrer",
        "title": "Tatuatori bravi in città",
        "content": "Yo! Come da titolo, chiedo nomi di bravi tatuatori in città secondo la vostra esperienza ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lyou67/tatuatori_bravi_in_città/"
    },
    {
        "id": "1lxx7hm",
        "author": "juvegimmy_",
        "title": "Mai più Sadem",
        "content": "7,50€ per andare in aeroporto e stare pure in piedi sul bus. Follia, mannaia a ma che non ho preso flibco.\n\nOvviamente i lavori sulla linea ferroviaria per l’aeroporto facciamoli sempre in estate o a Natale. ",
        "upvotes": 49,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1lxx7hm/mai_più_sadem/"
    },
    {
        "id": "1lycsj1",
        "author": "NoEnvironment5514",
        "title": "Abitare a Torino",
        "content": "Salve ragazzi! Sono uno studente internazionale e il prossimo semestre (da marzo a ottobre) sarò a Torino per svolgere un semestre Erasmus al Polito (ingegneria chimica).\n\nCerco informazioni sulla città, su dove vivere (e trovare alloggi che accettino studenti internazionali), cosa evitare e cosa fare.\n\nÈ ancora presto ma spero che potete aiutarmi 😁",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lycsj1/abitare_a_torino/"
    },
    {
        "id": "1lyiru1",
        "author": "Background-Chest-717",
        "title": "Name your top 5 cities in Europe (including torino if it is in top 5)",
        "content": "",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1lyiru1/name_your_top_5_cities_in_europe_including_torino/"
    },
    {
        "id": "1lxzkhg",
        "author": "ImportantTrouble3046",
        "title": "Uscire oggi al Valentino",
        "content": "Ciao raga, c'è qualcuno per uscire oggi magari andare a fare un giro al valentino? Non sto trovando nessuno oggi ahah andrei anche da solo però se c'è qualcuno meglio.  \nPer un minimo di contesto, M 27 anni, fatemi sapere raga se c'è qualcuno ✌",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lxzkhg/uscire_oggi_al_valentino/"
    },
    {
        "id": "1ly1kvk",
        "author": "Little-Accountant892",
        "title": "Gyms in Turin",
        "content": "Howdy folks!\nWhat sorta gyms can I find in Turin? \nWhat are their monthly prices? I heard some gyms charge 50€ while some 20€.\nI’ll preferably like to choose a cheap but reliable option.\nAlso, as I’m a student, do you guys think I’ll be given a discount if I show my ID card or something? \nAlso, lastly, how’s the gym culture in Turin? Can I survive with knowing just “basic” Italian with instructors and stuff? \n",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ly1kvk/gyms_in_turin/"
    },
    {
        "id": "1ly0a6r",
        "author": "yesilmercimek",
        "title": "Lost wallet",
        "content": "Hello guys, \n\na friend of mine lost his wallet in torino last night, i was wondering if there are groups in telegram or facebook that people share lost &amp; found stuff..or by chance any of you might have found it maybe? :'))",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ly0a6r/lost_wallet/"
    }
]