[
    {
        "id": "1kosz7r",
        "author": "Unit234AMA",
        "title": "Hi, /r/movies! I am Andy Tennant, director of HITCH, SWEET HOME ALABAMA, THE BOUNTY HUNTER, FOOLS RUSH IN, EVER AFTER, FOOL'S GOLD, ANNA THE KING. My newest film, UNIT 234, an action-thriller starring Don Johnson, Isabelle Fuhrman, and Jack Huston is out now. Ask me anything.",
        "content": "Hi, r/movies! I am Andy Tennant, director of HITCH, SWEET HOME ALABAMA, THE BOUNTY HUNTER, FOOLS RUSH IN, EVER AFTER, FOOL'S GOLD, ANNA THE KING. My newest film, UNIT 234, an action-thriller starring Don Johnson, Isabelle Fuhrman, and Jack Huston is out now. Ask me anything. \n\nTrailer:\n\n[https://www.youtube.com/watch?v=KYE1Hkl8Kpg&amp;pp=0gcJCdgAo7VqN5tD](https://www.youtube.com/watch?v=KYE1Hkl8Kpg&amp;pp=0gcJCdgAo7VqN5tD)\n\nSynopsis:\n\nA woman gets the shock of her life when she finds a handcuffed man inside a storage unit. When a group of criminals comes looking for him, she does whatever she can to save his life -- and her own.\n\nMy credits:\n\n[https://www.imdb.com/name/nm0855035/](https://www.imdb.com/name/nm0855035/)\n\nI will be back at 3 PM ET today (Saturday 5/17) to answer questions. Ask me anything!\n\n",
        "upvotes": 14,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/50m5fg3dfc1f1.png?auto=webp&amp;s=57fac10dd492c838954930150c33fec7a110733b"
        },
        "permalink": "/r/movies/comments/1kosz7r/hi_rmovies_i_am_andy_tennant_director_of_hitch/"
    },
    {
        "id": "1knppue",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Final Destination: Bloodlines / Hurry Up Tomorrow)",
        "content": "# New Theatrical Releases\n\n[Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n[Hurry Up Tomorrow](https://old.reddit.com/r/movies/comments/1knpnfr/official_discussion_hurry_up_tomorrow_spoilers/?)\n\n# Still in Theaters\n\n[Clown in a Cornfield](https://old.reddit.com/r/movies/comments/1ki7l69/official_discussion_clown_in_aa_cornfield_spoilers/?)\n\n[Fight or Flight](https://old.reddit.com/r/movies/comments/1ki7l7u/official_discussion_fight_or_flight_spoilers/?)\n\n[Shadow Force](https://old.reddit.com/r/movies/comments/1ki7l93/official_discussion_shadow_force_spoilers/?)\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[The Surfer](https://old.reddit.com/r/movies/comments/1kcpuhw/official_discussion_the_surfer_spoilers/?)\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n\n# On Streaming\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)",
        "upvotes": 23,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1knppue/official_discussion_megathread_final_destination/"
    },
    {
        "id": "1kopb6s",
        "author": "ErgoNonSim",
        "title": "Cannes reactions to Irreversible",
        "content": "",
        "upvotes": 17755,
        "comments": 2859,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ft9ij3u2eb1f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kopb6s/cannes_reactions_to_irreversible/"
    },
    {
        "id": "1kotzlc",
        "author": "phantom_avenger",
        "title": "What movie character had a death scene that was so unnecessarily cruel and brutal?",
        "content": "The first that comes to my mind is in Jurassic World where that one woman, Zara (I think that was her name). Is given a very long death scene where they went a little overboard and extra with it, that I was in complete shock where I thought to myself “wow, I know that they want to make this scene look terrifying and haunting, but to give that character such a cruel exit like that was so uncalled for.”\n\nI might’ve felt different about it, if the character was very unlikable and unpleasant but she wasn’t. She actually seemed pretty cool, and really tried her best to make sure she was keeping the kids safe and watching over them while Claire was too busy to spend time with them. \n\nThe worst part is, is that even after she dies, Claire never asks about her whereabouts or mentions ever again. ",
        "upvotes": 1722,
        "comments": 1274,
        "media": null,
        "permalink": "/r/movies/comments/1kotzlc/what_movie_character_had_a_death_scene_that_was/"
    },
    {
        "id": "1kp2vrv",
        "author": "lardparty",
        "title": "What 'big' movies of the last decade flopped but are actually pretty awesome in hind sight?",
        "content": "I'm looking for blockbuster type movies that have big production values but failed in the BO\n\nLike The Mummy (2017) or Annihilation (2018) for example (I haven't seen them but I could see myself enjoying them if they aren't just total garbage)\n\nLooking for similar movies that I could watch for a fun 'big' movie experience at home. \n\n",
        "upvotes": 462,
        "comments": 600,
        "media": null,
        "permalink": "/r/movies/comments/1kp2vrv/what_big_movies_of_the_last_decade_flopped_but/"
    },
    {
        "id": "1koxd2i",
        "author": "indiewire",
        "title": "Ari Aster’s ‘Eddington’ Sharply Divides Cannes: Star Pedro Pascal Defends a Western About Our Worst Fears Amid Lockdown",
        "content": "",
        "upvotes": 890,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JVrg1TOUpLC-iEbbr50OFWTUD_6KFVsCZCyEjp17xBc.jpg?auto=webp&amp;s=365a39569015c4fc15a78a824dd28797765a42de"
        },
        "permalink": "/r/movies/comments/1koxd2i/ari_asters_eddington_sharply_divides_cannes_star/"
    },
    {
        "id": "1koz1m1",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Samara Weaving and Jason Segel in Jorma Taccone’s ‘Over Your Dead Body’ - Follows a dysfunctional couple who head to a remote cabin to supposedly reconnect, but each has secret plans to kill the other.",
        "content": "",
        "upvotes": 659,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v2lfikqksd1f1.jpeg?auto=webp&amp;s=75852eaab6549106ac39e7de23ec5f35fa1c9bda"
        },
        "permalink": "/r/movies/comments/1koz1m1/first_image_of_samara_weaving_and_jason_segel_in/"
    },
    {
        "id": "1kozcwd",
        "author": "mayukhdas1999",
        "title": "First Image from 'THE PRESIDENT'S CAKE' - While people struggle daily to survive under sanctions in Saddam's Iraq, nine-year-old Lamia must use her wits to gather ingredients for the mandatory cake to celebrate President Saddam Hussein's birthday or face the consequences — prison or death",
        "content": "",
        "upvotes": 445,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4uhw4w7tid1f1.jpeg?auto=webp&amp;s=b7d6c25aef8a3fa607afe17a74b31ed43dc0e390"
        },
        "permalink": "/r/movies/comments/1kozcwd/first_image_from_the_presidents_cake_while_people/"
    },
    {
        "id": "1kovsss",
        "author": "theatlantic",
        "title": "And the Oscar Goes to … Something the Voters Didn’t Watch, by Amogh Dimri",
        "content": "",
        "upvotes": 577,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qvXJPdybgQaETuVRpUxyGBxHeh9TebAi0mZ4yTLnHZo.jpg?auto=webp&amp;s=6f57818d0bf4077ab88c291b3cf699880f03dc1a"
        },
        "permalink": "/r/movies/comments/1kovsss/and_the_oscar_goes_to_something_the_voters_didnt/"
    },
    {
        "id": "1koxdj2",
        "author": "mayukhdas1999",
        "title": "First Image of Zoey Deutch as Jean Seberg in Richard Linklater's 'NEW WAVE' - This is the story of Godard making “Breathless”, told in the style and spirit in which Godard made “Breathless”",
        "content": "",
        "upvotes": 260,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cu25lvrfed1f1.jpeg?auto=webp&amp;s=71d68ca231e5775f4b917ecf0ecdf74a4394039e"
        },
        "permalink": "/r/movies/comments/1koxdj2/first_image_of_zoey_deutch_as_jean_seberg_in/"
    },
    {
        "id": "1kp47qx",
        "author": "Randomnonsense5",
        "title": "To Live and Die in LA (1985): The real story of this film isn't Willem Dafoe or William Petersen's tour de force performances, its not the greatest car chase in movie history, nor the hot lesbian sex. Its the slow, methodical corruption of a good cop.",
        "content": "**SPOILERS BELOW!!** \n\nThe first time you watch Friedkin's '85 frenetic, gritty, neo noir action thriller you are dazzled by Dafoe's menacing insanity and by Petersen's red hot detective on the edge of total pychopathy. You are mesmerized by literally the greatest car chase in movie history, bar none. No CGI, just real cars doing real car shit. \n\nThe hot lesbian sex and the hot cop sex also wows you. And don't forget John Turturro being a total scumbag. The action is relentless and every character is grimier than the next. Honestly one of the greatest, and most under rated, movies of the 80s. \n\nBut here is the thing! its literally not until the very last line of dialogue that you realize Friedkin's genius in this flick. What you thought was the C story was actually the A story all along. \n\n\"You're working for me now\" \n\nholy shit! Then it hits you - this movie was really about Vukovich being slowly, methodically corrupted and turned into another psycho just like his partner was. Bit by bit, step by step, he is lead along the way until its too late and now he has become the monster. \n\nFriedkin you son of a bitch!",
        "upvotes": 104,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1kp47qx/to_live_and_die_in_la_1985_the_real_story_of_this/"
    },
    {
        "id": "1kp7uh2",
        "author": "Sirnando138",
        "title": "When Red tells Andy that his dream is “a shitty pipe dream”. What wonderful writing.",
        "content": "I’ve seen this movie a few times but never caught that foreshadowing until today. It’s so obvious when you hear it! I’ve been feeling super nostalgic lately and rewatching my favorite movies from being a teen in the mid 90s. The writing in this movie is so perfect. Everyone’s arch is so well crafted. ",
        "upvotes": 49,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1kp7uh2/when_red_tells_andy_that_his_dream_is_a_shitty/"
    },
    {
        "id": "1korb5j",
        "author": "Mst3Kgf",
        "title": "What actor do you think got the best send-off in their final film role, whether intended or not?",
        "content": "This came to mind after viewing \"Final Destination: Bloodlines\", which not only features Tony Todd in his final role, but which also gives him a deeply moving and memorable farewell onscreen (which they let him write himself no less). As hard as it can be to watch a clearly ill Todd, there's no doubt he's afforded a luxury actors don't always get, a curtain bow worthy of them. Many actors have their final roles in subpar films, either by necessity, choice or cruel fate. (One would think Peter Sellers, had he known his fatal heart attack was coming, would have much preferred \"Being There\" as his final role and not \"The Fiendish Plot of Dr. Fu Manchu.\") There's two in particular, however, who come to mind who really got sent off in grand style.\n\nBurt Lancaster in \"Field of Dreams.\" He did do some TV work afterwards, but Lancaster's turn as Doc \"Moonlight\" Graham was his movie farewell and what a beautiful one it is to see. Namely thanks to his departure into the cornfield accompanied by Ray Liotta's parting words.\n\n\"Hey rookie!...You were good.\"\n\nEdward G. Robinson in \"Soylent Green.\" This one is especially similar to Todd; a terminally ill actor in what he knows is will be his final role gets a grand showcase to say goodbye. Robinson's final act assisted suicide (\"going home\" in the words of the dystopian future society of \"Soylent Green\") is essentially a Viking-style funeral for the legendary actor and highly emotional (helped by co-star Charleton Heston's genuine reaction, who'd been told by Robinson of his terminal condition and thus his tears in that scene are not acting).\n\nAny other examples?",
        "upvotes": 286,
        "comments": 211,
        "media": null,
        "permalink": "/r/movies/comments/1korb5j/what_actor_do_you_think_got_the_best_sendoff_in/"
    },
    {
        "id": "1kp7dpp",
        "author": "talkingbook",
        "title": "Trailer: Nouvelle Vague (2025) | Dir. Richard Linklater | Starring Zoey Deutch",
        "content": "",
        "upvotes": 25,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/E7E1RvXYegMIXgJ4dyYjMXh06KweoUoOKSzHCrZpv2o.jpg?auto=webp&amp;s=30c40d40edcd6cbbcee280aba2a9deb038a782fd"
        },
        "permalink": "/r/movies/comments/1kp7dpp/trailer_nouvelle_vague_2025_dir_richard_linklater/"
    },
    {
        "id": "1kp2fls",
        "author": "Contcos",
        "title": "‘Dangerous Animals’ Review: A Great, White-Knuckle Horror Movie Featuring a Shark-Obsessed Serial Killer",
        "content": "",
        "upvotes": 51,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rzc2p3JFeIcJ_WOjJUc2zBB03ci0-hiyFcXSaZhAqfY.jpg?auto=webp&amp;s=9d8754b30f502c1dd2d78b60a6c484ba5b297213"
        },
        "permalink": "/r/movies/comments/1kp2fls/dangerous_animals_review_a_great_whiteknuckle/"
    },
    {
        "id": "1kp1o69",
        "author": "salmonpapayas",
        "title": "Empire’s Top 100 Films, No Country for Old Men, 12/100",
        "content": "In an attempt to watch more movies, I decided to watch Empires list of top 100 movies. I take dumb notes and write down my favorite lines then I put them here. Going from 100 to 1 (with exceptions), aiming for 1 movie each day. Disclaimer, I know nothing about movies and am bad at critical thinking. I will have many terrible takes. \n\n**Notes from No Country for Old Men, movie #89** \n\n- whooo we’re in the 80s! this is flying by \n- i, once again, have absolutely zero clue what this is about! let’s have some fun \n- ah jeez that poor deputy \n- holy shit the look on javier bardems face is so intense \n- so we’re off to a wild start! \n- idk why i thought this movie was set in the wild wild west \n- DAMN \n- he shot him through the head with OXYGEN \n- i love the silence with just the wind howling over the desert \n- already very into this \n- what happened here! \n- oh shit that’s a lot of drugs \n- WHOAAAAA\n- THATS A LOT OF MONEY\n- “hmm” reasonable reaction \n- “what’s in the satchel?” “it’s full of money.” “that’ll be the day” \n- this movie is so pretty \n- holy shit dude this is insane \n- oh my god the dog jumping at him \n- aw it’s little whimpers :( ik it was gonna kill him or whatever but still \n- god bardem is kind of terrifying \n- “what’s the most you’ve ever lost in a coin toss?”\n- oh is he gonna kill him if he loses \n- i am seriously loving this so far \n- the dialogue is amazing \n- other directors need to take notes because THIS is how you do lighting when it’s dark \n- god he’s a stone cold sociopath \n- OH it’s tommy lee jones!! \n- god i love southernisms\n- “oh hells bells, they even shot the dog”\n- i’m sorry this is a total nitpick but who the HELL takes eggs out in that order, all willy-nilly \n- the shots of the reflections in the tv are so cool \n- oh he’s smart, hiding it all the way back in the vent \n- also shout out to the detail of the vent being gross and dusty! \n- i appreciate a smart protagonist \n- ooooo the case has some sort of tracker \n- i am so stressed oh my god he’s totally gonna hear llewelyn poking around in the vents \n- jesus christ that oxygen gun is horrifying \n- YOOO WOODY HARRELSON\n- “Did i ask you to sit?” “No, sir. But you struck me as a man who wouldn’t want to waste a chair.” \n- YESS he’s finally checking the briefcase \n- jesus christ the scene in the room with chigurh slowly getting closer \n- insane \n- this movie uses silence like a goddamn weapon \n- the sound design is just !\n- captivating \n- “give me that beer, too” he has his priorities straight \n- if i woke up, after the night llewelyn just had, to a mariachi band playing at me, i would. i don’t even know what id do \n- “you’ve seen him? and you’re not dead? hm” now that’s aura \n- NOOO WOODY\n- “is carson wells there?” “not in the sense that you mean” god he is actually fucking terrifying \n- *casually moves his feet away from the pool of blood* \n- jesus the sound design is almost too good\n- love hearing a man gurgle and choke on his own blood \n- mannnn rip llewelyn \n- he just didn’t know when to quit \n- “well, all the time you spend trying to to get back what’s been took from you, more is going out the door. after a while you just have to try get a tourniquet on it.”\n- man poor carla jean \n- “the coin ain’t got no say” \n- they showed that green light and i KNEW he was gotta get hit \n- god \n- that movie was insane \n\n**Final Thoughts:**\n\nThis movie was incredible. One thing that really struck me is that, despite all the chaos and violence, it took its time. It lingered on specific images, and let quiet, still moments speak for themselves. Each character was brilliant and I absolutely adored the dialogue. And the ending! I can imagine there were probably many people who felt unsatisfied but I personally loved it. Nobody wins, nobody gets out on top. The story concludes itself quietly and calmly. \n\n- Enjoyment: 9\n- Plot: 9\n- Visuals: 10\n\n**Overall: 9.3/10**\n\nDoes it deserve a top 100 spot? Totally \n",
        "upvotes": 52,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1kp1o69/empires_top_100_films_no_country_for_old_men_12100/"
    },
    {
        "id": "1kp41kw",
        "author": "Cultural_Kick",
        "title": "What are GOOD movies that heavily features rain or snow?",
        "content": "I love thrillers and I love putting on movies with rain or snow as background noise.  Movies like The Girl With A Dragon Tattoo(Fincher) has a very cold feeling because of the snow, which I think really adds to the movie.  \n\nI think alot of movies that take place on mountains don't do well to use the ice and snow as characters in the movie.  Cliffhanger and Everest for example.  Not my type.\n\nCan't think too many good movies with rain other than Se7en.",
        "upvotes": 28,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1kp41kw/what_are_good_movies_that_heavily_features_rain/"
    },
    {
        "id": "1kowr31",
        "author": "Contcos",
        "title": "‘The Chronology Of Water’ Review: Kristen Stewart’s Long-Gestating Directorial Debut Is A Stylish Triumph",
        "content": "",
        "upvotes": 76,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vck27llgv8Ke5JcSoWxe0lVYzPcgG81XeEPqbUOvSLE.jpg?auto=webp&amp;s=01647715766339061f3e0d7c931576481315fe47"
        },
        "permalink": "/r/movies/comments/1kowr31/the_chronology_of_water_review_kristen_stewarts/"
    },
    {
        "id": "1kp2ri6",
        "author": "ChiefLeef22",
        "title": "Lynne Ramsay's 'Die, My Love' - Review Thread",
        "content": "*In a remote forgotten rural area, a mother struggles to maintain her sanity as she battles with psychosis.*\n\nCast: Jennifer Lawrence, Robert Pattinson, LaKeith Stanfield, Sissy Spacek\n\n(couldn't seem to update the last post so I'm making a new one, hoping it works now)\n\nRotten Tomatoes: [89%](https://www.rottentomatoes.com/m/die_my_love_2025)\n\nMetacritic: [N/A (updating)](https://www.metacritic.com/movie/die-my-love)\n\nSome Reviews:\n\n[BBC - Nicholas Barber](https://www.bbc.com/culture/article/20250517-die-my-love-review-jennifer-lawrence-is-better-than-ever-in-a-searing-portrait-of-motherhood) \\- 3/5\n\n&gt;Die, My Love should probably be shown to teenagers as a warning of how repetitive, exasperating and alienating it can be to look after a baby. Ramsay makes expert use of countless techniques – detailed sound design, insistent music, mixed-up chronology, bizarre dream sequences – to convey the sense that Grace is becoming blearily adrift from reality: she may be even more unstable than the traumatised protagonist of Ramsay's last film, 2017's You Were Never Really Here.\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/die-my-love-review-jennifer-lawrence-robert-pattinson-1236401527/)\n\n&gt;Jennifer Lawrence’s performance feels so explosive but, at the same time, so emotionally reined in. In “Die My Love,” you feel the power of her presence, the hellbent quality of her rage. When it comes to chewing out a blabby cashier, crawling around like an animal, trashing the bathroom and pouring soap products all over the floor, or bashing her head on a mirror, she’s an ace wastrel. But the very force of her destruction makes us want to go: What is happening?\n\n[IndieWire - Ryan Lattanzio](https://www.indiewire.com/criticism/movies/die-my-love-review-jennifer-lawrence-lynne-ramsay-1235124227/) \\- 'B'\n\n&gt;Seeing “Die My Love” at Cannes, European critics will be unfazed by Lawrence’s unvarnished and very naked turn, though in the U.S., she will be commended for her “bravery.” If enough people see it at all to make such an appraisal. Her performance will shock the baser public. What Lawrence achieves here is extremely impressive, a marquee movie star throwing herself with abandon into a filmmaker’s warped and demandingly miserable vision. A last visual metaphor, however strained, forces us (and Jackson) to finally see Grace for who she is: a woman beyond the pale, beyond reproach, beyond help. Lawrence is committed to the insanity. She’s never been better, and she needs no help getting to where this film takes her. Lynne Ramsay, wind her up and watch her go.\n\n[Independent UK - Monks Kaufman](https://www.independent.co.uk/arts-entertainment/films/reviews/die-my-love-review-cannes-jennifer-lawrence-b2752523.html?utm_medium=Social&amp;utm_source=Twitter#Echobox=1747514822) \\- 3/5\n\n&gt;MVP here is Robert Pattinson, whose layered performance contains both the man that Grace cannot abide and the one who is worried about his wife. His expression when she asks why he is stressed is so despairing that it deepens Jackson in one fell swoop. It’s a shame to single out a male performance in a tale of primal femininity. There is simply no one for Lawrence to bounce off and no structure against which to craft an emotional trajectory. She is dancing on her own.\n\n[The Wrap - Chase Hutchinson](https://www.thewrap.com/die-my-love-review-robert-pattinson-and-jennifer-lawrence-are-outstanding-in-haunting-domestic-horror/)\n\n&gt;Even as it’s not Ramsay’s best film, even a minor work from the filmmaker is still better than just about any other director. There remains a haunting power that she’s able to wield over her audience. Both Pattinson and Lawrence are outstanding in their roles — the latter becomes a protagonist of sorts while the other is a pseudo-antagonist. We can see the anger, fear and isolation in their every move, with the vacancy that exists behind their eyes proving to be the most chilling part of the whole affair.\n\n[DEADLINE - Damon Wise](https://deadline.com/2025/05/die-my-love-review-lynne-ramsay-jennifer-lawrence-robert-pattinson-1236402485/)\n\n&gt;America knows very well how good Jennifer Lawrence can be, and this could well mean a fifth Oscar nomination if it lands in savvy hands. It could also be the film that takes Ramsay into the next stage of her career. As producer Martin Scorsese well knows, she’s a genius. And now, it turns out — goddammit — she can sing too.\n\n[Collider - Emma Kiely](https://collider.com/die-my-love-review-jennifer-lawrence-robert-pattinson/) \\- 8/10\n\n&gt;*Die, My Love* feels like Ramsay’s way of showing how versatile she is. It’s not as hopeless and disturbing as something like *We Need to Talk About Kevin,* following the optimism of her last film, the desolate crime thriller, *You Were Never Really Here*. But what it has in common with all of her work is that it draws out the little ways humans can be so destructive to themselves and each other. *Die, My Love* is further proof that no one is doing it like Lynne Ramsay, whose technique and style continue to evolve, as she draws out a career-best performance from Jennifer Lawrence in a must-see thriller spectacle that turns a single woman’s experience into a brutally honest psychological epic.",
        "upvotes": 33,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/s0C3p957eX7Cfij8yiJsadlw-x0QiG_mT1L3E4M-BtA.jpg?auto=webp&amp;s=d79bdb18e1c1a9db48784e056042b6b2f2991924"
        },
        "permalink": "/r/movies/comments/1kp2ri6/lynne_ramsays_die_my_love_review_thread/"
    },
    {
        "id": "1koelow",
        "author": "Brain_Prosthesis",
        "title": "The 13th Warrior is fricking awesome",
        "content": "Not much else to say. Antonio Banderas repeating to himself “it’s a man…” while he is mowing down savages dressed as bears alongside a bunch of Vikings while a village burns is just top tier action filmmaking. They just don’t make movies like they used to. I couldn’t name a single other actor in this flick but the whole cast is just draining 3’s from the logo. Not much of a surprise though. Saying McTiernan is good at directing a monster movie in the jungle/woods is like saying Spielberg is good directing kids or Tom Brady is good playing football. The dude is in his element. \n\n“Lo there do I see my mother and my sisters and my brothers. Lo there do I see the line of my people back to the beginning. Lo they do call to me. They bid me take my place among them in the halls of Valhalla, where the brave may live forever.”\n\n\n\n\n",
        "upvotes": 1485,
        "comments": 278,
        "media": null,
        "permalink": "/r/movies/comments/1koelow/the_13th_warrior_is_fricking_awesome/"
    },
    {
        "id": "1koylpu",
        "author": "andalusiandoge",
        "title": "Sylvain Chomet announces he's working on a Triplets of Belleville sequel",
        "content": "",
        "upvotes": 49,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DLflmM03XU35lexgAFga13QJrsrqfZpy0zAECGySOv4.jpg?auto=webp&amp;s=70954551783a8b088b777c1826cd734cf541cd77"
        },
        "permalink": "/r/movies/comments/1koylpu/sylvain_chomet_announces_hes_working_on_a/"
    },
    {
        "id": "1koufgc",
        "author": "0110-1100",
        "title": "Which movies, good or bad, were overshadowed by their soundtrack?",
        "content": "My personal pick is Tron: Legacy. It was an OK movie, with good effects and questionable CGI characters, but the score was superb. Daft Punk did a great job, and the film is remembered primarily for its soundtrack rather than the film itself. Nine Inch Nails faces a major challenge because their work can't avoid being compared to the musical legacy Daft Punk left us.\nhich other movies do you think Another movie worth mentioning is Sucker Punch. While not particularly memorable as a film, its music selection is excellent, which, at least for me, often happens with Zack Snyder’s movies.",
        "upvotes": 83,
        "comments": 162,
        "media": null,
        "permalink": "/r/movies/comments/1koufgc/which_movies_good_or_bad_were_overshadowed_by/"
    },
    {
        "id": "1kny4nk",
        "author": "MarvelsGrantMan136",
        "title": "First Image of John C. Reilly as Buffalo Bill in ‘Heads or Tails’",
        "content": "",
        "upvotes": 18847,
        "comments": 643,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/beojw5llm41f1.jpeg?auto=webp&amp;s=bd6554ce5f0d508430b861ea7c8889e1ffcb7f6a"
        },
        "permalink": "/r/movies/comments/1kny4nk/first_image_of_john_c_reilly_as_buffalo_bill_in/"
    },
    {
        "id": "1kp5ma6",
        "author": "riki73jo",
        "title": "From Hollywood to Your Garage: The Screen-Used “Barricade” Mustang from Transformers is Up for Grabs",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d415pXYAEx5GPb2gZ0R8gneK6uwoKEI7oonIHYS_1zQ.jpg?auto=webp&amp;s=ae7bad0fab7e1dfb219c90f0d354bbbc665bc224"
        },
        "permalink": "/r/movies/comments/1kp5ma6/from_hollywood_to_your_garage_the_screenused/"
    },
    {
        "id": "1korzxk",
        "author": "TonyWonder18",
        "title": "I see more complaints on CGI quality than (mostly) anything else, what recent movies have had good CGI?",
        "content": "Seems like the most common feedback on an any new movie/trailer is that the CGI is bad.\n\nI know a lot of times in trailers that the CGI is not complete and then the final product and that it always ends up looking better, but even then still seemingly always complaints.\n\nMy question is, by industry standards which movies over the last ~10 years are used as an example of good CGI?\n\n\n\n",
        "upvotes": 93,
        "comments": 240,
        "media": null,
        "permalink": "/r/movies/comments/1korzxk/i_see_more_complaints_on_cgi_quality_than_mostly/"
    },
    {
        "id": "1ko3lhf",
        "author": "MarvelsGrantMan136",
        "title": "Bong Joon-Ho's 'Mickey 17' Sets May 23 Release on Max",
        "content": "",
        "upvotes": 4431,
        "comments": 297,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YD3K2-6ba7aRlB0dQ67G85wyezyp73GFmamGuJ8D4KM.jpg?auto=webp&amp;s=2c4bfeafcd7f6968ec940aa6a1127006df3523cb"
        },
        "permalink": "/r/movies/comments/1ko3lhf/bong_joonhos_mickey_17_sets_may_23_release_on_max/"
    },
    {
        "id": "1kom0y3",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Simon Pegg - Wednesday 5/21 at 10:45 AM ET - Actor in 'Shaun of the Dead', 'Mission Impossible', 'Hot Fuzz', 'Star Trek, 'The World's End', 'Ice Age', 'Star Wars', and lots more.",
        "content": "",
        "upvotes": 258,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/87luszjx8a1f1.png?auto=webp&amp;s=752df4a83f01b94155e789694577a179193e8db3"
        },
        "permalink": "/r/movies/comments/1kom0y3/amaqa_announcement_simon_pegg_wednesday_521_at/"
    },
    {
        "id": "1koq9i8",
        "author": "JonasKahnwald11",
        "title": "Marisa Tomei, Sam Rockwell and Chris Messina to Star in Zombie Comedy ‘Hellhound’ (EXCLUSIVE)",
        "content": "",
        "upvotes": 101,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0yV2Rde0nea-xetCy1Ct-p8ZLCmjV5yaCZ1rzTPib8w.jpg?auto=webp&amp;s=cd67e17cc9c736a8a5a970632c8f56f5c9c3ecb6"
        },
        "permalink": "/r/movies/comments/1koq9i8/marisa_tomei_sam_rockwell_and_chris_messina_to/"
    },
    {
        "id": "1kobana",
        "author": "DamnThatsInsaneLol",
        "title": "Elizabeth Debicki to Join David Fincher's ‘The Continuing Adventures of Cliff Booth’ Starring Brad Pitt",
        "content": "",
        "upvotes": 1395,
        "comments": 222,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dHL7Wj2PDxiAbg4n3VceaYKKb2_3kqflWfp2xrqavxg.jpg?auto=webp&amp;s=2818b3ce8760fb7930f979180d5999d9353e794e"
        },
        "permalink": "/r/movies/comments/1kobana/elizabeth_debicki_to_join_david_finchers_the/"
    },
    {
        "id": "1kp8rr0",
        "author": "BalaBustaRhymes",
        "title": "What was your first R-rated movie? How did it effect you?",
        "content": "I think mine was Die Hard.\n\nI remember watching it with my grandparents on TV when I was six or seven years old. I thought it was super cool to watch something that I probably shouldn’t have been watching. It didn’t really have any sort of negative effect on me; I just thought it was awesome, DEFINITELY wouldn’t let my kid watch it, though.\n\nWhat was yours?",
        "upvotes": 7,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1kp8rr0/what_was_your_first_rrated_movie_how_did_it/"
    },
    {
        "id": "1kp7pbt",
        "author": "indiewire",
        "title": "10 of David Lynch’s Favorite Films",
        "content": "",
        "upvotes": 6,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/STnm1zS2Q8yDT42pe1e0qlsU7iBHghaYH0992Q0slbU.jpg?auto=webp&amp;s=5123804b93849d0ec249e26d4e657747b2362981"
        },
        "permalink": "/r/movies/comments/1kp7pbt/10_of_david_lynchs_favorite_films/"
    },
    {
        "id": "1ko7by3",
        "author": "MarvelsGrantMan136",
        "title": "Ralph Fiennes to Play President Snow in ‘Hunger Games: Sunrise on the Reaping’",
        "content": "",
        "upvotes": 1997,
        "comments": 138,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eLEfJRcdrYNBecETCvF0WlgwcCojjH4YtLWyiATHFhA.jpg?auto=webp&amp;s=fdd0858e0482b6fae7b186e0247d83452bc79318"
        },
        "permalink": "/r/movies/comments/1ko7by3/ralph_fiennes_to_play_president_snow_in_hunger/"
    }
]