[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 486,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 121,
        "comments": 5781,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gy338w",
        "author": "Fishersalt",
        "title": "Any way to save frames?",
        "content": "Maybe a stupid question, but there’s a specific scene in the series Arcane that I desperately want as my wallpaper on my phone and PC, but I have no idea how to save said frame. I obviously can’t screenshot it, so how do I go about it? I’ve tried searching for the frame online but to no avail. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gy338w/any_way_to_save_frames/"
    },
    {
        "id": "1gxp54w",
        "author": "Russkafin",
        "title": "Ad-supported tier also limits content",
        "content": "We recently downgraded to the ad-supported tier to save money. I understood that this meant I would have ads and could only stream on one device at a time. What I didn’t realize is that some content would now be locked. \n\nMy kids went to watch Captain Underpants Hack-O-Ween and Boss Baby Back In The Crib, only to find they were locked with a message saying they are not available on the ad-supported plan due to licensing issues. I feel like they were not transparent about this when changing plans. \n\nI went on the Netflix customer service chat to complain about this. The response I got was, “I suggest you to please upgrade the plan.”\n\nIf it wasn’t for my kids I would absolutely cancel Netflix. ",
        "upvotes": 20,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1gxp54w/adsupported_tier_also_limits_content/"
    },
    {
        "id": "1gxwsqf",
        "author": "Automatic-Attorney96",
        "title": "Movies and tv shows I love because of how bad they are ",
        "content": "",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gxwsqf/movies_and_tv_shows_i_love_because_of_how_bad/"
    },
    {
        "id": "1gxsuqr",
        "author": "Fit_Conversation_151",
        "title": "Midnight gospel",
        "content": "I hate to be corny as fuck but this is one of my favorite cartoons that has ever existed. I rewatch it every year or so. This cartoon is so well thought out. Its so deep. Its so good. Its made me cry. Its made me laugh. The creators need to kiss themselves to sleep. \n\nJesus is right here dont be afraid.\n\nEpisode two always reminds me to chill the fuck out.\n\nGod this show is so deep it makes me ill. ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxsuqr/midnight_gospel/"
    },
    {
        "id": "1gxt49e",
        "author": "FamBamJam78",
        "title": "Empress Season 2",
        "content": "Am I missing something? This feels like a different show to me. Maybe it’s English dub? It’s not the way anyone looks….bit the writing and maybe even acting?  Curious if I’m alone here. ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxt49e/empress_season_2/"
    },
    {
        "id": "1gy1auv",
        "author": "RevolutionaryLion384",
        "title": "Recommend me some spanish language shows or movies that are about narcos/criminals.",
        "content": "I have already seen Narcos and narcos Mexico, Somos, Chapo, the inmate and enjoyed them all very much. Are there any other shows like these on netflix or even another streaming platform that are just as good? I just want the show to be predominantly in spanish because I am trying to learn",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gy1auv/recommend_me_some_spanish_language_shows_or/"
    },
    {
        "id": "1gxrtec",
        "author": "HypnoToadVictim",
        "title": "Pantheon is a great!",
        "content": "It’s like a William Gibson novel set in the contemporary if not slight future. Just binged the season. The animation is neither bad nor nothing to write home about. The main draw is for sure the plot. Would give it a strong 8.5/10\n\nIf you liked ghost in the shell, ergo proxy, irobot, akira, cyberpunk edge runners, scavengers reign, there’s probably aspects of this show you’ll enjoy. ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxrtec/pantheon_is_a_great/"
    },
    {
        "id": "1gy02hz",
        "author": "MalpighialesLeaf",
        "title": "Annoying navigation whoosh",
        "content": "Netflix seem to have added a feature where every time you tab between shows, it makes a 'whoosh' sound.\n\nIs there a way to turn this off before I throw my TV out the window?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gy02hz/annoying_navigation_whoosh/"
    },
    {
        "id": "1gxzj9c",
        "author": "Military_collectorx",
        "title": "Help ",
        "content": "I remember watching this show in like the mid 2010’s on Netflix it’s been taken down a while ago and all I can remember is the into. Which started with these 2 guys one dressed something like a Viking and the other that looked like a scientist or wizard and they were following this clock on a conveyer belt and tinkering with other stuff along the way, I also remember they lived in a brick castle like building ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxzj9c/help/"
    },
    {
        "id": "1gxzcta",
        "author": "Schwimp",
        "title": "The Helicopter Heist is streaming now! Being a 15year old at the time, this was the coolest thing to ever happen in Sweden. It's not a documentary, but it shows what went down accurately. ",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxzcta/the_helicopter_heist_is_streaming_now_being_a/"
    },
    {
        "id": "1gxdpkp",
        "author": "indiewire",
        "title": "Everything Coming to Netflix in December 2024",
        "content": "",
        "upvotes": 32,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gxdpkp/everything_coming_to_netflix_in_december_2024/"
    },
    {
        "id": "1gxim2c",
        "author": "rdv100",
        "title": "The blue eyed Samurai is fantastic, kind of like lord of the rings, check it out! #bingewothy",
        "content": "I came across it because Netflix mentioned it as one of the most popular TV series. I started watching and couldn’t stop.  \nIt’s a truly wonderful story with excellent direction and fantastic character development. The plot revolves around a person seeking revenge for her mother’s murder.\n\n  \nIt kind of reminds me of *The Lord of the Rings* in the sense that the entire story focuses on someone on a journey to defeat the villain.\n\n  \nAnyway, definitely check it out!\n\n\n\n[https://www.netflix.com/title/81144203](https://www.netflix.com/title/81144203)  \n\n\n",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1gxim2c/the_blue_eyed_samurai_is_fantastic_kind_of_like/"
    },
    {
        "id": "1gxkn6x",
        "author": "Puzzleheaded-Ad-379",
        "title": "Recommendations for snowy cozy movies like the Three Pines",
        "content": "Hello! I'm looking for your recommendations for shows or movies in snowy beautiful settings (that are currently on Netflix) but please please please NOT Christmas romances. ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxkn6x/recommendations_for_snowy_cozy_movies_like_the/"
    },
    {
        "id": "1gxh4s3",
        "author": "-maanlicht-",
        "title": "Anyone watched 'Spellbound' already? (No spoilers)",
        "content": "Share your thoughts.\nI think it is a very cute movie. Both on the surface but also more deep between the lines it shines a light on (quite heavy) parent-child struggles and how being part of a family requires teamwork. The songs are cute with some great lyrics and I find it is very well done, a fun movie to watch over the weekend as a family.",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gxh4s3/anyone_watched_spellbound_already_no_spoilers/"
    },
    {
        "id": "1gxukl4",
        "author": "PistolPeteLara",
        "title": "Rhythm and Flow ",
        "content": "Netflix got really cheaped out on season 2. Production sucked, rappers sucked, overall it just SUCKED. \n\nDon’t make the next season if you’re just trying to cash in. \n\nLame ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxukl4/rhythm_and_flow/"
    },
    {
        "id": "1gxob70",
        "author": "Sensitive-Anything34",
        "title": "Top 10 Lists (movie &amp; TV) Not Appearing on Browser or Apps (Xbox, phone, etc)",
        "content": "Anyone else not seeing the top 10 lists for Netflix? I checked on my phone, on browser (Firefox), and on the Xbox app, but the lists do not appear for top 10 movies or tv shows. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxob70/top_10_lists_movie_tv_not_appearing_on_browser_or/"
    },
    {
        "id": "1gxt9xu",
        "author": "pompompuriinn",
        "title": "Netflix extra slot",
        "content": "Help anyone. My fam and I can't watch, whenever we open our app, this here stops us from watching. Extra slot was automatically added and ofc the payment was automatically deducted from my card but when I checked it said that no one's using the extra slot (ofc coz we're only three on the family plan) and this started when I cancelled the extra slot. I can't watch even on the main profile. I don't know what to do, somebody help huhu ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gxt9xu/netflix_extra_slot/"
    },
    {
        "id": "1gxklfj",
        "author": "Detvan_SK",
        "title": "Future of Netflix app for MS platforms (discusion)",
        "content": "So an update came out that changed the application to an Edge browser window for both Windows and Xbox consoles. And I have also tested that the old version of the application now has a communication block with the server and behaves as if there is no internet.\n\nWhich is quite funny timing because there is more and more talk about ARM processors for PC, x86-64 are getting energy-efficient cores, a new Win Handheld is announced every year, even Xbox announced its own, and overall it seems that Windows core devices will become more and more mobile.\n\nI am seriously interested in whether movie services like Netflix will ignore this.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gxklfj/future_of_netflix_app_for_ms_platforms_discusion/"
    },
    {
        "id": "1gxgtje",
        "author": "-DreamLight-",
        "title": "Any new (good) scifi/fantasy series that haven't been cancelled yet?",
        "content": "I make it a habit to not watch a series till after a second season is confirmed, had my hopes up for Kaos because it looked great but glad I held off now! Any new series that appear to have a future?",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gxgtje/any_new_good_scififantasy_series_that_havent_been/"
    },
    {
        "id": "1gxixse",
        "author": "Sweet-Strawberry7250",
        "title": "Red Dragon question ",
        "content": "Hi! So I have the basic Netflix with ads and I was wondering for those with the ad free plan, do they have Red Dragon in 4k? If they do I might upgrade just for a month, been wanting to see this one in 4k.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxixse/red_dragon_question/"
    },
    {
        "id": "1gwnyhf",
        "author": "IrishStarUS",
        "title": "JonBenét Ramsey's father believes Netflix series 'can solve' decades-old murder if police take crucial action",
        "content": "",
        "upvotes": 317,
        "comments": 159,
        "media": null,
        "permalink": "/r/netflix/comments/1gwnyhf/jonbenet_ramseys_father_believes_netflix_series/"
    },
    {
        "id": "1gxp9gl",
        "author": "Childhood-Expensive",
        "title": "Episodes not showing",
        "content": "I already watched Act 2 last week, but I want to rewatch it. However, for some reason, it won't show the episodes now. I tried on both my PC and my PS5, but it still shows no episodes.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxp9gl/episodes_not_showing/"
    },
    {
        "id": "1gxopad",
        "author": "JoeMikeGent",
        "title": "All content distributed by Universal Pictures, Tristar, Sony Pictures, and Columbia stream max 540P on Win 10/11",
        "content": "Tested this with multiple locations, internet connections, and devices (including desktops and laptops). But all other content that is NOT distributed by these studios plays great in 1080P. Anyone have an idea what is going on?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxopad/all_content_distributed_by_universal_pictures/"
    },
    {
        "id": "1gxa7cx",
        "author": "peoplemagazine",
        "title": "Is 'A Man on the Inside' Based on a True Story? All About the 83-Year-Old Amateur Sleuth Who Inspired the Spy Sitcom",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxa7cx/is_a_man_on_the_inside_based_on_a_true_story_all/"
    },
    {
        "id": "1gxak82",
        "author": "Sung_the_King",
        "title": "Everytime an episode ends or movie ends, NSES-UHX Error Code pops up.",
        "content": "Hello, so ever since, i don't know maybe 3 months ago..?\n\nWhenever i finish an episode or movie and when its showing \\[Next Episode\\] \\[Credit\\]  buttons,\n\nthis error page pops up everytime.\n\nThere seems to be no existing fixes available, and even talking to Netflix Customer Rep yielded no help.\n\nDoes anyone know as to what the fundamental reason it happens and how to fix it?\n\nI tried logging out and logging back in and nada.. :(\n\n\\+ I also tried logging into incognito, guest mode, new profile, etc. and it keeps showing this error.\n\n  \n\\+ i tried recreating this issue on mobile and it seems to work fine.\n\n  \n\\+ so I think it has something to do with Netflix Windows format issue.\n\nhttps://preview.redd.it/q0eini1i2h2e1.png?width=2539&amp;format=png&amp;auto=webp&amp;s=a7edf5accb1a0fb186c38c74e416b7498b25f1e6",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxak82/everytime_an_episode_ends_or_movie_ends_nsesuhx/"
    },
    {
        "id": "1gwzlpj",
        "author": "dcd564",
        "title": "Arcane Season 2 not playing in HDR?!?",
        "content": "I started watching Arcane Season 2 tonight and I noticed that it was not playing in HDR, only SDR. I went to check out Season 1, and guess what? It’s playing in HDR. When you go for the series menu, it states that the series is a Dolby Vision-Atmos series. Other Netflix series are working just fine in HDR. I have a 4K Apple TV. Is anyone else having this issue of Season 2 not playing in HDR? ",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1gwzlpj/arcane_season_2_not_playing_in_hdr/"
    },
    {
        "id": "1gxf3ub",
        "author": "Informal_Cabinet_352",
        "title": "Is floribama shore uncensored ",
        "content": "Is floribama shore uncensored on Netflix? I can't seem to find the uncensored version anywhere. When the show first aired on cravetv, it was uncensored. Any and help would be much appreciated !! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxf3ub/is_floribama_shore_uncensored/"
    },
    {
        "id": "1gxe4f3",
        "author": "Tr0ssen",
        "title": "Can't stop autoplay on Netflix ",
        "content": "Today I opened Netflix on my Android tv  to discover that I can now not browse what to watch since I cannot turn off autoplay/prewatch of the shows. So no matter how I navigate Netflix apart from going to the very top can I shut the tv up while browsing. \n\nAnyone else hating this or am I alone? Can Netflix please take this horseshit back and make me able to browse thru shows in peace and quiet?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gxe4f3/cant_stop_autoplay_on_netflix/"
    },
    {
        "id": "1gx14o2",
        "author": "RED_SKY73",
        "title": "Netflix ads increasing in frequency and duration",
        "content": "Is it just me or is anyone else experiencing this? At first I'd get maybe 30 seconds of ads twice per show or something like that, it was great and I didn't mind it at all. Now I'm getting ad breaks that go for 90 seconds and the frequency has increased too, I've gotten ad breaks back to back with only 5 minute intervals... I feel a bit mislead",
        "upvotes": 9,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1gx14o2/netflix_ads_increasing_in_frequency_and_duration/"
    },
    {
        "id": "1gxcaj8",
        "author": "1337ingDisorder",
        "title": "Any likelihood of a third installment of the Oloturé saga?",
        "content": "Oloturé and Oloturé: The Journey tells a compelling story.\n\nIt also opens the door for another story — life for a newly landed refugee is no walk in the park either. It would be interesting to see Ehi's story continue as she attempts to navigate the challenges and hazards of her new world.\n\nCould be another limited series, or maybe Oloturé: The Destination could be another film — sort of make a series sandwich  :)\n\nEither way it feels like there's more story to tell here!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gxcaj8/any_likelihood_of_a_third_installment_of_the/"
    }
]