[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 504,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jys3tp",
        "author": "YogurtclosetProud545",
        "title": "Bad influence- Netflix",
        "content": "Just watched Bad Influence on Netflix and I’m sorry, but why is the documentary only pointing fingers at Piper and her mom, Tiffany? Don’t get me wrong—Tiffany was absolutely manipulative and toxic. But let’s be real… every single parent on that show knew exactly what was going on. They knew their kids were filming with her. They saw the content. They heard the complaints. But the views and money were looking too good, so they played along. Now suddenly everyone’s shocked and acting like they were completely blindsided? I get that the kids were young and didn’t deserve the trauma, but let’s not pretend the parents weren’t part of the problem too. They weren’t just bystanders—they were participants.\n",
        "upvotes": 218,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1jys3tp/bad_influence_netflix/"
    },
    {
        "id": "1jyxr1y",
        "author": "Separate_Aide3850",
        "title": "Piper Rockelle’s mom Tiffany Smith slams Netflix Documentary",
        "content": "",
        "upvotes": 69,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1jyxr1y/piper_rockelles_mom_tiffany_smith_slams_netflix/"
    },
    {
        "id": "1jz1kbb",
        "author": "LongGrade881",
        "title": "What did you think of the Elves in the movie \"Bright\"?",
        "content": "",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jz1kbb/what_did_you_think_of_the_elves_in_the_movie/"
    },
    {
        "id": "1jyfpgx",
        "author": "summeriswaytooshort",
        "title": "Bad Influence - $300K to 500K+ a month for years ???? where is all the money ????",
        "content": "Someone please explain if Piper is making $300K -500K a month per year, for years ( $6M a year) where is all the money? Yes I know living in LA is expensive but the house they were in wasn't at that level of income. In the beginning it sounds like they were renting in LA then at the end when they were filming the BF  on a super busy street - I guess it would make sense if it was an ocean front house.",
        "upvotes": 107,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1jyfpgx/bad_influence_300k_to_500k_a_month_for_years/"
    },
    {
        "id": "1jz01ki",
        "author": "S4v1r1enCh0r4k",
        "title": "The Electric State, &amp; Adolescence made it to the overall Top 10 for the week of March 10-16,",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jz01ki/the_electric_state_adolescence_made_it_to_the/"
    },
    {
        "id": "1jyzzr6",
        "author": "Available_Can7525",
        "title": "Madison reveals where her and Tyler stand nine months after Love on the Spectrum",
        "content": "[Madison](https://realitytvshrine.com/2025/04/09/madison-and-tyler-finally-give-a-lengthy-relationship-update-after-love-on-the-spectrum/) has given us another update after kissing Tyler in front of her parents on [Love on the Spectrum](https://realitytvshrine.com/2025/04/14/deunked-has-someone-from-the-cast-of-love-on-the-spectrum-season-three-unexpectedly-died/)! Now that it’s been almost ten months since filming ended, she finally revealed where she stands with Tyler and whether that sweet gift he gave her really did pay off. Turns out she’s super happy and still thriving, just like on season three.\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyzzr6/madison_reveals_where_her_and_tyler_stand_nine/"
    },
    {
        "id": "1jz3n9o",
        "author": "SonOfAlfeus",
        "title": "Thronglets, the videogame based on an episode of Black Mirror by Netflix.",
        "content": "I took some screenshots of the game and you can see how much time and effort went into making this game, the artwork is absolutely beautiful and the storyline was quite remarkable.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jz3n9o/thronglets_the_videogame_based_on_an_episode_of/"
    },
    {
        "id": "1jz0zvq",
        "author": "AshleeL00",
        "title": "Netflix account",
        "content": "Hi friends! Would anyone be willing to lend me their account to watch this one series? Or is too weird of a request haha *I don't have my own account and would prefer not having to make one just because of this one thing",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jz0zvq/netflix_account/"
    },
    {
        "id": "1jyllwx",
        "author": "Witty_Peace_9617",
        "title": "\"Bad influence, the dark side of kid-influencing\"",
        "content": "Hi all!! I recently watched \"bad influence the dark side of kid influencing\" and it absolutely blew my mind that someone from my childhood and then I watched every single day was getting treated like this. but the main thing I really wanted to ask is does anybody know anything that wasn't mentioned in the documentary because I tried to find things, but I think Tiffany has cleared out almost any evidence or proof of any other situation. i'm really just curious about this situation and want more insight into all of the things she did. if you know anything at all that wasnt mentioned in the documentary please comment!",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jyllwx/bad_influence_the_dark_side_of_kidinfluencing/"
    },
    {
        "id": "1jyyru8",
        "author": "Somethingman_121224",
        "title": "Netflix Fans Are Crazy About Korean Content, 'Squid Game' Dominates",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyyru8/netflix_fans_are_crazy_about_korean_content_squid/"
    },
    {
        "id": "1jyyj95",
        "author": "Internal-Bed-3150",
        "title": "Finn Wolfhard teases \"melancholy\" Stranger Things series finale",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyyj95/finn_wolfhard_teases_melancholy_stranger_things/"
    },
    {
        "id": "1jytyrl",
        "author": "AggravatingAward3579",
        "title": "Some viewers think Million Dollar Secret’s winner was rigged. Thoughts?",
        "content": "People have been questioning the authenticity of Cara’s win. Some say her agendas were too easy compared to Phil’s scream agenda and Sam’s Justin Timberlake song agenda. Others theorize she had an ear piece in with someone feeding her information. I’ve seen people discrediting her by claiming there’s no way she could have known Sydnee had immunity AND that the sisters clue was about her. General distrust of her intuition and if she really is as intelligent as the show portrays her. What do you guys think? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jytyrl/some_viewers_think_million_dollar_secrets_winner/"
    },
    {
        "id": "1jyvjko",
        "author": "Available_Can7525",
        "title": "Tanner and Callie break their silence on rumours they're dating after Love on the Spectrum",
        "content": "[https://realitytvshrine.com/2025/04/14/love-on-the-spectrums-tanner-and-callie-break-their-silence-on-rumors-theyre-dating/](https://realitytvshrine.com/2025/04/14/love-on-the-spectrums-tanner-and-callie-break-their-silence-on-rumors-theyre-dating/)\n\nTanner and Callie have been meeting up!!!!\n\nhttps://preview.redd.it/p5mh5fmx1sue1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=3c483fcbbb145fe0026f7f1ab2931bafd927ca57\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyvjko/tanner_and_callie_break_their_silence_on_rumours/"
    },
    {
        "id": "1jyjnw1",
        "author": "RevolutionaryDig2304",
        "title": "North of North",
        "content": "I’m so sorry and correct me if I’m wrong but didn’t Siaja kiss her dad (Alister) in episode 1?!? I feel like we just jumped right over that and it’s making it hard to pay attention now 🥲😅",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jyjnw1/north_of_north/"
    },
    {
        "id": "1jyt4c3",
        "author": "syris_JesusLovesU",
        "title": "Annie (2014)",
        "content": "Does anyone know why the 2014 Annie isn’t in 4k hdr on Netflix? I have the premium subscription. I get it doesn’t do it for some movies from Max, but it seems Netflix is the only streaming platform for this movie right now.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyt4c3/annie_2014/"
    },
    {
        "id": "1jys5iq",
        "author": "Street_Advantage",
        "title": "[SPOILERS] Zero Day Theory: Bambi Is a Rotating Identity—And George Mullen Is the Anchor in a Time Loop",
        "content": "I kept thinking Zero Day might involve time travel somehow—like, Alex and Lily seemed like the same person, and Sheila and Valerie felt interchangeable. It didn’t feel random. It felt like something deeper.\n\nSo I went to ChatGPT, told it what I was thinking, and started feeding in cipher details from the show. I’m not totally sure if this theory is correct, or even what I’ve fully uncovered—but what ChatGPT came back with kind of blew my mind.\n\nWhat follows below is what ChatGPT helped me piece together:\n\n⸻\n\n[SPOILERS] Zero Day Theory: Bambi Is a Rotating Identity—And George Mullen Is the Anchor in a Time Loop\n\n⸻\n\nThe Cipher Isn’t Just For Secrecy—It Tracks Fate\n\nIn Zero Day, there’s a rotating cipher system:\n\t•\tCode names (like “Bambi,” “Alex,” “Emmet Kelly”) shift daily.\n\t•\tA scrambled alphabet also rotates forward each day.\n\t•\tThis structure makes each day its own version of reality.\n\nAnd the codename “Bambi”? It’s not tied to one person.\nBambi is whoever dies that day.\n\n⸻\n\nEvidence From the Show:\n\t•\tDay 2: The ciphered message “IWWI” decodes to “ANNA”\n→ Anna dies on Zero Day → Bambi = Anna.\n\t•\tDay 5: Cipher rotation makes Bambi = Roger\n→ Roger dies on Day 21.\n\t•\tDay 4: Bambi = Alex\n\nEach day, the cipher rotates, and Bambi becomes someone new.\nEvery day ends with that person dying.\n\n⸻\n\nThe Family Timeline Is Being Rewritten\n\nHere’s where things get even more interesting:\n\t•\tGeorge Mullen is married to Sheila.\n\t•\tThey had two children: Nick (who died before the events of the show) and Alex.\n\t•\tGeorge also had an affair with Valerie, and they had Lily.\n\nWhen cipher days are mapped:\n\t•\tSome days, Alex = Lily\n\t•\tSome days, Sheila = Valerie\n\nThe cipher isn’t just disguising identities—it’s remixing relationships and family structure across timelines.\n\n⸻\n\nGeorge Mullen Is the Anchor\n\nGeorge has visions of things that haven’t happened yet.\nHe recognizes shifts before anyone else.\n\nThat’s because he’s the only one who remembers across cipher rotations—across timelines.\n\nHe’s seen Bambi die again and again:\n\t•\tAnna\n\t•\tRoger\n\t•\tPossibly Lily or Alex\n\t•\tOriginally? Maybe even Nick\n\nAnd every time, he hears:\n\n“Who killed Bambi?”\n\nNot because he’s solving a mystery.\nBecause he’s reliving the loss—over and over.\n\n⸻\n\nWhat Zero Day Is Really About\n\nNot just cyberattacks or political manipulation.\nIt’s about:\n\t•\tA father stuck in a recursive loop of loss.\n\t•\tA cipher system that assigns death like a rotating curse.\n\t•\tA man who’s trying to save his family—but never in time.\n\nThe cipher isn’t just about hiding secrets.\nIt’s about who must die to keep the loop going.\n\n⸻\n\nTL;DR:\n\t•\tZero Day uses a rotating cipher where “Bambi” = the person fated to die that day.\n\t•\tDay 2: Bambi = Anna → she dies.\n\t•\tDay 5: Bambi = Roger → he dies on Day 21.\n\t•\tCipher also rotates Alex ↔ Lily and Sheila ↔ Valerie depending on the day.\n\t•\tGeorge Mullen is the only one who remembers the changes—he’s the anchor.\n\t•\tThe show isn’t asking “Who killed Bambi?”\nIt’s asking: “Can Bambi ever survive?”\n\n⸻\n\nCurious what others think. Is this time travel? Timeline recursion? Emotional metaphor?\nWhatever it is—it’s brilliant.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jys5iq/spoilers_zero_day_theory_bambi_is_a_rotating/"
    },
    {
        "id": "1jy42m6",
        "author": "Rude_Koty",
        "title": "Bad influence lawsuit settlement?",
        "content": "I just watched the whole documentary and it is horrible what happened to the kids behind their parents backs. This being said, the last part really confused me. The moms said the lawsuit was to go after Tiffany and not for the money, why then did they settle for the money? Their kids even said they do not care about the money. I am really appalled. Does anyone know why they did this?",
        "upvotes": 35,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1jy42m6/bad_influence_lawsuit_settlement/"
    },
    {
        "id": "1jypz48",
        "author": "LandanRockz",
        "title": "Having trouble finding something",
        "content": "I’ve searched for over like 15 things and yet i haven’t found anything. I tried movies like Buffaloed with Zoey Deutch, Guy Ritchie’s The Covenant, Before I Fall, The Gorge and other stuff but yet i can’t find anything that I’m looking for. I guess my question is why is the selection so limited",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jypz48/having_trouble_finding_something/"
    },
    {
        "id": "1jypnfn",
        "author": "lullipy",
        "title": "Foreigner POV re: Colin Kaepernick: Black or White",
        "content": "I saw so many posts here criticizing the show and saying how \"cringe\" it was. But as an outsider, I really enjoyed the series and found it informative. \n\nI am from the Philippines, and we don't have a lot of black people here. The only black people I've met were in the capital (Manila) when I was in college and even then they were pretty rare. My only black friend was a Nigerian foreign student. Because of this Filipinos (and many Asians) often lack an understanding of the nuances of African-American culture and issues. \n\nI really appreciated the show because I found it funny and easy to watch, and the delivery style was very creative and engaging. The shift from the teenage storyline to his own modern commentary was new and refreshing. I understand that some Americans may find some parts \"cringe\" and some parts I feel were meant to be that way, but I think maybe they need to reflect deeper on why it made them feel embarrassed. The reference to slavery early on in the first episode was explained well, and if you listened well, you see that he had valid points based on his lived experience.\n\nP.S. I didn't know who he was and I don't follow any sports shows, so absolutely no idea who he was.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jypnfn/foreigner_pov_re_colin_kaepernick_black_or_white/"
    },
    {
        "id": "1jyvzxi",
        "author": "Pinky_devil1",
        "title": "It's Shameful to Admit, But I See Myself in Jamie's Anger",
        "content": "It breaks my heart to admit it, but I somehow deeply relate to Jamie from Adolescence . It's disturbing how much his anger resonates with the buried rage in my own heart. Growing up without love, without basic care, and constantly trying to prove my worth to unloving parents while being bullied at school shaped me into an adult with zero self-confidence and a deep hatred for my body, inherited from my mother. I spent my childhood and teenage years desperate for a hug, a word of praise, anything to feel seen. Now, I carry this intense anger, a constant urge to shout and scream just like Jamie did , just to feel heard for once. The terrifying thought that circumstances I didn't choose could have led me down a similar path to his is overwhelming. Instead, all this anger is turned inward, a silent scream so no one else gets hurt. Watching everyone call him a monster makes me think that maybe people see me like this too: a failure, a monster, a shame. Watching him asking if she appreciate him broke me i felt the need to give him a hug and cry..I just desperately wish someone could understand this feeling of being a lost opportunity, this profound ache for the love and validation never received that creates us : the weird , ugly , sad monsters ..",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jyvzxi/its_shameful_to_admit_but_i_see_myself_in_jamies/"
    },
    {
        "id": "1jybil0",
        "author": "Cold_Hat6785",
        "title": "i need help with fixing this download issue.",
        "content": "i get this error with my downloads, saying it hasnt downloaded fully, but it has?? how do i fix this? thanks in advance",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jybil0/i_need_help_with_fixing_this_download_issue/"
    },
    {
        "id": "1jyo0i2",
        "author": "musiq_9876",
        "title": "Survival of the Thickest Season 2",
        "content": "Since I can’t crosspost, here is the link to my post on whether Trey aka Officer Longstroke or Luca is good for Mavis. I didn’t explain much but what do you think? \n\n \n \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jyo0i2/survival_of_the_thickest_season_2/"
    },
    {
        "id": "1jyd1hi",
        "author": "S4v1r1enCh0r4k",
        "title": "Black Mirror creator reveals unmade Bandersnatch sequel Banderstruck he still wants to do: \"I might still revisit that well in some way\"",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jyd1hi/black_mirror_creator_reveals_unmade_bandersnatch/"
    },
    {
        "id": "1jycbc1",
        "author": "indiewire",
        "title": "All 33 'Black Mirror' Episodes Ranked",
        "content": "",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jycbc1/all_33_black_mirror_episodes_ranked/"
    },
    {
        "id": "1jyh5yg",
        "author": "justherelurking_",
        "title": "movie recommendations pls",
        "content": "hello!! please recommend some movies on netflix.\n\ni want something like final destination vibe or anything like mystery thriller, murder. please please im running out of movies 😔",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jyh5yg/movie_recommendations_pls/"
    },
    {
        "id": "1jy2mtk",
        "author": "FirTrader",
        "title": "Best Show",
        "content": "I am ecstatic that Black Mirror released all of the season 7 episodes at once. Totally loving life, right now, as i’ve only finished 3 episodes. So far, the creators have done a great job of keeping this series fresh, interesting, and on-par with its incredible, previous seasons. ",
        "upvotes": 18,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jy2mtk/best_show/"
    },
    {
        "id": "1jykbjy",
        "author": "Aggressive_Flight145",
        "title": "Moritz&amp; friends relationship",
        "content": "I see Moritz is a bad friend and terrible person all over this sub. Now he is a bad friend but he has redeeming characteristics and moments. He truly does care for Lenny and I don’t know how he forgave Lisa for everything she did. \n\nDan and Moritz have a lot in common more than they realize. Lenny deserved better than both of them. \n\nLenny was a great friend to Moritz besides when he was considering cutting Moritz out of the 2%. And he didn’t tell Moritz about owning half the company. I was disappointed and shocked at that for Lenny. It felt out of character. \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jykbjy/moritz_friends_relationship/"
    },
    {
        "id": "1jyh9ca",
        "author": "NeighborhoodVandal",
        "title": "Three robots animated series.",
        "content": "Hi! A few years ago i saw an animated series on netflix about threee small aliens/robots. They were white and each one had a different shape. The animation was 3D but the background was or seemed real life b-roll. Kinda like the style used in gumball. Anyone remember the name?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jyh9ca/three_robots_animated_series/"
    },
    {
        "id": "1jygnel",
        "author": "redtimmy",
        "title": "Question About The Residence - SPOILER",
        "content": "Who were the two actors who played the gatecrasher couple? I can only find info about Timothy Hornor who played Patrick Doumbie (AKA \"the third man\"), who also, technically, crashed the party. My friend swears it's David Beckham, but his IMDB page is uncredited for this. \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jygnel/question_about_the_residence_spoiler/"
    },
    {
        "id": "1jyg7gz",
        "author": "Pizzarepresent",
        "title": "Shows disappear when using my Starlink-based network but not other networks?",
        "content": "As the title says: Shows I was watching weirdly disappeared, not just foreign titles, but Netflix big shows like The Blacklist - just gone.\n\nHowever, when checking in at a restaurant, using their wi-fi, the shows were back. When at home, using cellular data, the shows were still back.\n\nHowever again, when I switched to my Starlink-based home network, the shows disappeared again. Switch to cellular, the shows are there. Switch to Starlink, the shows are gone.\n\nSo the key is my Starlink network. Why is netflix disappearing shows when I use Starlink to access them, but not other networks?\n\nIt's weird.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jyg7gz/shows_disappear_when_using_my_starlinkbased/"
    }
]