[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1pj70c5",
        "author": "ggiuliahz",
        "title": "Cerco amicizie",
        "content": "Ciao a tutti! Sono una ragazza di 24 anni e abito in provincia di Torino e sto cercando nuove amicizie! \nMi piace il cinema, le serie tv, i libri, i videogiochi e tanto altro: se condividete gli stessi interessi magari ci possiamo prendere un caffè insieme :)\nScrivetemi pure se siete interessati! ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pj70c5/cerco_amicizie/"
    },
    {
        "id": "1pix7mu",
        "author": "Slay3r024",
        "title": "come funzionano i tram?",
        "content": "ragazzi buongiorno, ho una domanda, sto vedendo da google maps come arrivare dall'aereporto \"caselle\" di torino come arrivare alla inalpi arena e mi dice di prendere la tratta del tram 4.. adesso, dove abito io non ci sono i tram e non so come funzionano\n\ndevo fare il biglietto a bordo o fuori dal tram?",
        "upvotes": 7,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1pix7mu/come_funzionano_i_tram/"
    },
    {
        "id": "1pixx77",
        "author": "twenty_Two_9594",
        "title": "Cerco gruppetto amici per Padel",
        "content": "Ciao a tutti sono una ragazza di 26 anni di Torino e mi piacerebbe iniziare un corso di Padel, mi piacerebbe se riuscissi a creare un gruppetto di tre quattro persone più o meno sul mio range di età per seguire qualche lezione assieme, smezzarci il costo del maestro e poi un indomani organizzare le partite fra di noi…c’è qualcuno di interessato?\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pixx77/cerco_gruppetto_amici_per_padel/"
    },
    {
        "id": "1piv5k0",
        "author": "Canjul93",
        "title": "GDR - Campagna di Daggerheart in partenza il 16 Gennaio",
        "content": "Ciao a tutti!\nSono Gianluca-the.italiandm, sono un game master e membro del Fortunadado (quelli che organizzano ToPlay).\n\nVuoi provare il GdR del momento? Ottimo!\n\nDa Gennaio, in collaborazione con i ragazzi di Daggerheart Italia faremo partire una campagna in presenza al Jolly Joker di Porta Susa, a Venerdì alterni. \nNon è richiesta nessuna esperienza pregressa, ma solo voglia di avventura!\n\nPer qualsiasi domanda commentate, vi lascio anche il link al post Instagram:\nhttps://www.instagram.com/p/DSA1ZW6DFqN/?igsh=bWU0dHJkZ25wY3Q0\n\nVi aspettiamo!",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c52qpgohib6g1.jpeg?auto=webp&amp;s=6604370dc657b62b2b2e63076518b049f5f9c879"
        },
        "permalink": "/r/torino/comments/1piv5k0/gdr_campagna_di_daggerheart_in_partenza_il_16/"
    },
    {
        "id": "1pj45q5",
        "author": "Appropriate-Donut-49",
        "title": "sala prove a to",
        "content": "ciao !! trasferit a torino un anno fa, oggi finalmente qua per chiedervi : qualcun\\* sa consigliarmi posti a torino da prendere in considerazione per prove musicali?  \ncosto più è basso, meglio è (lol), se ci sono anche degli strumenti da utilizzare top :3 grazie in anticipo &lt;3\n\nEDIT : su materia mi hanno consigliato la sala prove del comala, qualcun\\* sa per caso come ci si organizza? li contatto? mi presento di persona? come funziona? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pj45q5/sala_prove_a_to/"
    },
    {
        "id": "1piewn6",
        "author": "Thin-Tour-4922",
        "title": "How to find a part-time job here?!",
        "content": "As the title suggests, I am really tired of looking. The city is so big, there must be a way to find a job here right.   \n  \nI know I dont know the language yet but it's only been 3 months since I have been here. Anyone has any tips on how to get a part-time job here, anything would do, moreover I have 3 years of experience in customer service, kitchen assitance and manual labour. I am a first year masters student at the Politecnico and I am literally tired and sad to see that there are little to no jobs for students. How am I supposed to make living in this economy without any job. I am not looking for a big salary, just something for the month to pass by. Enough ranting, any suggestions would be appreciated, thank you!!\n\nOn a side note, is it possible to join schools in Torino to get experience as a teacher, I am not a native speaker but my English level is C1 overall. I am not looking for a huge salary, I have a passion for teaching and working with kids. It would help as an experience in my future studies. Is it possible to teach kids English or something in English here?\n\nThanks a lot everyone!",
        "upvotes": 11,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1piewn6/how_to_find_a_parttime_job_here/"
    },
    {
        "id": "1phg8oi",
        "author": "SteamPaz",
        "title": "Il Cielo Sopra Torino",
        "content": "",
        "upvotes": 314,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dnes9t47706g1.jpeg?auto=webp&amp;s=23ec38bece363c5b717a7027cfd693789783e8a3"
        },
        "permalink": "/r/torino/comments/1phg8oi/il_cielo_sopra_torino/"
    },
    {
        "id": "1pifjz0",
        "author": "BlackZanna",
        "title": "Migliori associazioni di volontariato animali a Torino",
        "content": "Ciao a tutti, \n\nCome da titolo, vorrei capire quali sono le migliori associazioni di volontariato per animali a Torino e dintorni,\nPer migliori, intendo dire posti che hanno una reputazione di essere luoghi affidabili dove al primo posto viene effettivamente la tutela e la cura degli animali che gestiscono, \nGrazie mille in anticipo a tutti",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pifjz0/migliori_associazioni_di_volontariato_animali_a/"
    },
    {
        "id": "1pi41fz",
        "author": "cristianemeok",
        "title": "Imparare (in realtà insegnare) a guidare",
        "content": "Ciao a tutti!\nSto cercando di insegnare a guidare a mia moglie. Lei frequenta la scuola guida e ha già superato l'esame scritto (ha già il foglio rosso).\n\nMa quando si tratta di guidare ha problemi con i pedali, tra le altre cose. Le lezioni di guida sono costose, ne ha già prese 10 e sta facendo pochi progressi.\n\nViviamo nella zona Millefonti e nei fine settimana andiamo al parcheggio del centro commerciale Lingotto per praticare per qualche ora. Ma è già troppo piccolo e finisce per girarle in tondo (è poco più di un blocco da andata e ritorno)\n\nLei (e io come copiloto) non siamo ancora pronti per uscire a guidare normalmente su strada, almeno finché non avrà imparato a usare bene la frizione. Deve ancora acquisire confidenza con la macchina.\n\nConosci qualche posto più grande dove possiamo guidare senza problemi? \n Come hai imparato a guidare in città?Hai qualche consiglio da darmi? Grazie!!",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1pi41fz/imparare_in_realtà_insegnare_a_guidare/"
    },
    {
        "id": "1phh6sj",
        "author": "Kind-Calendar793",
        "title": "E' arrivato il porta nuova express!!!",
        "content": "Tra i cambiamenti in casa GTT per molte linee urbane, troviamo la sperimentazione del nuovissimo Porta Nuova Express.   \nQuesta linea avrà come scopo quello di ridurre il numero di passeggeri tra le stazioni di Rivoli e Porta Nuova, tra le 7:00 e le 9:30, le fermate sono tre: Rivoli, Bernini e Porta Nuova (lato Via Sacchi), per poi proseguire in Corso Stati Uniti dove effettua capolinea unico. Non so a voi, ma a me ricorda tantissimo il Dora Fly... Cosa ne pensate? Top o flop?   \n🚍: BYD K9   \n🔢: M1N -&gt; Porta Nuova   \n\\#️⃣: 46E   \n📌: Piazza Rivoli ",
        "upvotes": 95,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1phh6sj/e_arrivato_il_porta_nuova_express/"
    },
    {
        "id": "1pi7owk",
        "author": "SuccessOriginal9402",
        "title": "Mirafiori Nord. Che tipo di zona è questa?",
        "content": "Ho trovato un appartamento molto carino proprio davanti allo stabilimento **Fiat**, nella zona di **Mirafiori Nord**. Mi interessa soprattutto capire com’è la situazione dell’inquinamento dell’aria e se ci sono rischi importanti per la salute, tipo malattie gravi come il cancro. Nella mia famiglia ci sono stati diversi casi e adesso ci sto molto attenta, vorrei evitare rischi inutili. L’agente immobiliare mi ha detto che la fabbrica è già chiusa e che tutti quegli edifici sono in vendita.",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1pi7owk/mirafiori_nord_che_tipo_di_zona_è_questa/"
    },
    {
        "id": "1phh8vs",
        "author": "Kind-Calendar793",
        "title": "LE NOVITÀ NON SONO FINITE",
        "content": "Dal 1⁰ dicembre sono state introdotte le linee 13+ e 68+, queste sono state istituite per agevolare il carico delle linee 13 e 68 nei rispettivi tratti tra Piazza Statuto e Piazza Vittorio Veneto e Corso Tortona e Porta Nuova",
        "upvotes": 44,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1phh8vs/le_novità_non_sono_finite/"
    },
    {
        "id": "1phdmvd",
        "author": "Necessary_Doctor_328",
        "title": "Qualcuno qui ha sempre voluto imparare la batteria ma non ha mai iniziato? 🥁",
        "content": "Io sono Erik, batterista torinese. Insegno già in una scuola di musica e da un po’ sto aprendo qualche slot per **lezioni private di batteria** qui in zona Torino/cintura.\n\nIl tipo di persone con cui lavoro di più:\n\n* chi parte **da zero totale** (anche se pensa di essere “negato per la musica”)\n* adulti che lavorano e vogliono un’ora a settimana solo per **sfogarsi e staccare**\n* ragazzi/ragazze che vogliono mettere delle basi serie per suonare in band\n\n**Come funziona con me:**\n\n* si parte SEMPRE da una **lezione di prova**: ci conosciamo, ti faccio sedere alla batteria e vediamo da che punto partiamo\n* niente letture di teoria infinite: già dalla prima lezione provi a suonare qualcosa su una base\n* impostiamo un percorso **su misura**: obiettivo band? Hobby? Migliorare il timing? Lo costruiamo insieme\n* studio attrezzato con batteria (elettronica/acustica) e cuffie, così non ti devi preoccupare del volume\n\nSe qualcuno qui si è appena riconosciuto tipo “ok, sono io quello che ci pensa da anni”, scrivetemi pure in DM:  \nposso mandarvi qualche info su **orari, zona e costi** e, se vi va, organizziamo una prova senza impegno.\n\nAnche solo per chiedermi: *“ma non è troppo tardi per iniziare a X anni?”* (spoiler: no, non è mai troppo tardi).\n\nGrazie a chi ha letto fin qui e, se conoscete qualcuno che vorrebbe iniziare, potete girargli il post 🙌",
        "upvotes": 24,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z2jtsso2pz5g1.jpeg?auto=webp&amp;s=a5763cae641a2ead2c157f2010175c3ca8636b94"
        },
        "permalink": "/r/torino/comments/1phdmvd/qualcuno_qui_ha_sempre_voluto_imparare_la/"
    },
    {
        "id": "1phjqry",
        "author": "GanSLAYER",
        "title": "Qualcuno appassionato di musica/concerti/festival?",
        "content": "Tra i vari post a tema \"cerco persone per fare x\" non mi sembra di averne visto alcuno per gente appassionata di musica, perciò eccolo. \nIo sono a Torino da un mesetto, ascolto una miriade di generi e sto in pari con le uscite più recenti (thanks fantano), dal post punk all'elettronica, hyperpop, hardcore, indie pop, experimental rap ecc.. Vado a un bel po' di concerti e festival (quest'anno primavera sound e pukkelpop + una decina di concerti singoli), perciò volevo sapere se c'è gente che si muove spesso o che conosce locali interessanti dove si suona in cui andare.\n \nPs: ho visto [qui](https://www.eventbrite.it/e/anima-larmonia-delle-sfere-tickets-1977139880606) che c'è una serata dove suonano l'album Anima di Thom Yorke questa settimana, qualcuno sa com'è il posto? Magari ci si organizza fra noi nerd di musica ahah",
        "upvotes": 6,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/badoejSA2OIt34rFIM5teco8Ec-n9LX0EF27X16dzMo.jpeg?auto=webp&amp;s=deb5ab09a0747b99fcdc5d296cb9650134a1fa6c"
        },
        "permalink": "/r/torino/comments/1phjqry/qualcuno_appassionato_di_musicaconcertifestival/"
    },
    {
        "id": "1phj9ob",
        "author": "marv150302",
        "title": "Nuove conoscenze",
        "content": "Ciao a tutti, sono un ragazzo di 23 anni, a Torino da 4 per l’università, mi piacerebbe ampliare un po’ il mio giro di conoscenze. Se ti interessano sport( in particolare calcio, palestra e corsa), musica, film, anime, manga, videogiochi o anche semplicemente uscire a bere un bicchiere scrivi pure!\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1phj9ob/nuove_conoscenze/"
    },
    {
        "id": "1pgxjw4",
        "author": "sico666",
        "title": "Nuovi amici 2",
        "content": "Siamo 7 amici (f26, 2f28, m28, m29, m26, m31) di Torino e provincia, i nostri interessi in generale gravitano attorno a:\n\n-le feste all'aperto (ci piace la natura)\n-il buon bere\n-il fantasy\n-il cinema\n-i concerti e il teatro\n-le conversazioni profonde\n-sparare cazzate\n- la magia e l'esoterismo\n -le gite\n -la cultura\n -l'arte\n-Igbtq+ \n-videogiochi\nSiamo inclusivi e di mentalità molto aperta, vogliamo ampliare la nostra cerchia. \n\nPer farvi capire chi siamo:\n\n• un intellettuale palestrato con la passione per gli abiti eleganti \n\n• un ragazzo timido, sensibile e introspettivo\n\n• un'artista ADHD un po' punk con la passione per la psicologia e l'horror \n\n• un'antropologa appassionata di esoterismo e concettualità\n\n• un informatico tranquillo e gentile, che quando beve diventa caotico\n\n• una jojobro, strega che ricorda un gatto\n\n•  un ragazzo molto estroverso, con la passione per i vampiri e i profumi ricercati\n\n Astenersi snob, omofobi e razzisti!!!",
        "upvotes": 28,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1pgxjw4/nuovi_amici_2/"
    },
    {
        "id": "1pgra26",
        "author": "spacecraft628",
        "title": "DISCOTECA DAI 35 ANNI IN SU: SONDAGGIO",
        "content": "Ciao a tutti!\n\nSe ci fosse una serata in discoteca pensata principalmente con musica per adulti dai 35 anni in su, dalle 18.00/18.30 fino alle 23.00/24.00, preferireste andare di sabato, di domenica o andrebbero bene entrambi allo stesso modo?\n\nMi aiutate? Grazie!",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1pgra26/discoteca_dai_35_anni_in_su_sondaggio/"
    },
    {
        "id": "1pgkupi",
        "author": "salvo_2000",
        "title": "Nuove amicizie",
        "content": "Buongiorno a tutti, siamo 3 amici (io e l’altro mio amico di 19anni e l’altro 20 anni) in giro per Torino e dintorni, sempre pronti a conoscere nuove persone, fare serate tranquille o avventure improvvisate. Se hai voglia di nuove conoscenze genuine, risate e un po’ di spontaneità… scrivici. Le cose migliori nascono così",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pgkupi/nuove_amicizie/"
    },
    {
        "id": "1pgf4v1",
        "author": "Imperatron_",
        "title": "Nuove conoscenze",
        "content": "Ciao a tutti ho 19 anni e sto in affitto a Torino da fine settembre per l'università (unito), considerando che mi sono spostato dalla provincia di Lecce solamente con il mio cane e senza coinquilino sto facendo abbastanza fatica a conoscere persone nuove.\n\nIn università chiacchero a volte con delle persone ma non ho stretto con nessuno. Mi chiedevo se qualcuno avesse dei consigli per conoscere nuove persone? Il fatto che verso le persone che non conosco appaia come riservato e che non sono un tipo da discoteca non aiuta molto (anche se quando si supera la barriera iniziale poi sono molto espansivo), pero' generalmente sono una persona socievole, e anche se non mi identifico in quel gruppo sono un po' nerd, non mi piacciono le discoteche pero' impazzisco per andare a bere in dei bar/pub e mi piace fare delle camminate e i videogiochi.\n\nCon tutto lo studio dell'università mi sta pesando non uscire con un gruppo/qualcuno anche perché la città mi piace molto, specialmente se messa a paragone dal piccolo comune da qui vengo\n\nSe avete dei consigli scrivetemi pure in privato o qui sotto",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1pgf4v1/nuove_conoscenze/"
    },
    {
        "id": "1pg1092",
        "author": "maschera84",
        "title": "Perchè si spaccia a cielo aperto in San Salvario di Sabato alle 13:00?",
        "content": "Non sono qui per criticare, anche perchè io e la mia famiglia siamo nuovi qui a Torino e la città ci piace molto.\n\nOggi, dopo una passeggiata al Valentino con le mie bimbe, abbiamo deciso di andare a mangiare un boccone a San Salvario, che ci era stata descritta come una zona una volta difficile, ma oggi in completa rivalutazione.\n\nE, infatti, alcune aree sono molto carine. \n\nFin quando pero' ci siamo addentrati in delle vie in cui sembrava un altro stato. Ragazzi ai bordi degli incroci che si guardavano intorno e aspettavano chiaramente clienti, mentre altri facevano \"i pali\" all'ingresso delle strade.\n\nInutile dire che ci hanno squadrato come fossimo degli alieni e guardato con aria minacciosa, ma io non ero preoccupato perchè ho capito che erano lì per vendere droga e non per rapinare gente random.\n\nSembrava essere entrati in una piazza di spaccio.\n\nQuello che non capisco, in una città virtuosa come Torino, com'è possibile che durante il giorno di un sabato qualunque, si lasci spacciare droga così spontaneamente, senza pudore?\n\nNon si parla di Barriera di Milano o di posti periferici (non che li si debba sorvolare, sia chiaro), ma di un posto centralissimo, dove un turista può tranquillamente capitarci per sbaglio con i bambini. Praticamente a due passi da via Lagrange.\n\nPossibile che non ci sia modo per la Polizia di intervenire e setacciare le aree?",
        "upvotes": 62,
        "comments": 60,
        "media": null,
        "permalink": "/r/torino/comments/1pg1092/perchè_si_spaccia_a_cielo_aperto_in_san_salvario/"
    },
    {
        "id": "1pgsd7r",
        "author": "Awkward-Warning-9238",
        "title": "Cenone di Capodanno",
        "content": "Ciao. \n\nSto cercando di prenotare un bel ristorante per Capodanno. Ci saranno 6 adulti, 1 cane da 10 kg e un neonato. \n\nQualcuno ha qualche suggerimento?",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1pgsd7r/cenone_di_capodanno/"
    },
    {
        "id": "1pgqtdh",
        "author": "Virtuousrea",
        "title": "Dermatologo",
        "content": "Salve bella gente, cerco un dermatologo a Torino che sia bravo nella cura di dermatiti, rosacea, acne ecc. Soprattutto che abbia un approccio al paziente che non si riduca ad un semplice sguardo, ma che sia una visita più approfondita, magari con macchinari appositi.  Mi sapete consigliare qualcuno? Provenite da una qualche esperienza positiva? Inoltre gradito è anche un listino prezzo onesto ahah",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pgqtdh/dermatologo/"
    },
    {
        "id": "1pgen0a",
        "author": "qazwest2021",
        "title": "Visiting Turin on Dec 25th and 26th",
        "content": "Hi everyone\n\nMy family and I will be visiting Turin on December 25th and 26th. \n\nWill the airport bus run on those days or will we have to take a cab?\n\nDo you think most museums and restaurants will be closed? \n\nAlso do we need cash or can we use credit cards / phones for all purchases even small ones? \n\nThanks a lot!",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1pgen0a/visiting_turin_on_dec_25th_and_26th/"
    },
    {
        "id": "1pgmmka",
        "author": "GiuseppeAlletto",
        "title": "Estasi, Misticismo e Arte: la mostra “Femminile Eterno/a” di Giuseppe Al...",
        "content": "Ti sei mai domandato cosa accade quando il misticismo femminile incontra l’estasi più profonda e diventa arte pura? \n\n\n\nEstasi, Misticismo e Arte: la mostra “Femminile Eterno/a” di Giuseppe Alletto – Torino 2025\n\n\n\nSabato 13 dicembre 2025, dalle 17:00 alle 21:00, inaugura la mostra di una mostra unica: Un ‘Eterno/femminile, il nuovo progetto artistico di Giuseppe Alletto ospitato da CSA Farm Gallery a Torino. \n\n\n\nAlletto rilegge figure archetipiche, soggetti comuni, tatto, diversità, sensualità e libertà, corpi aperti e scoperti e le intense e profonde possibilità del misticismo femminile.\n\nQuesta esposizione nasce come un’intensa indagine sul misticismo al femminile e sull’estasi intesa come “uscita fuori di sé”, un’esperienza sospesa tra spiritualità, corpo e trascendenza. Alletto rilegge figure archetipiche come Santa Teresa d’Avila e Giovanna d’Arco, interrogando la zona di confine dove il rapimento spirituale sfiora il sensuale e si intreccia all’erotico, rivelando un linguaggio simbolico potente e contemporaneo.\n\nAttraverso disegni in grafite, carboncino, pittura a olio e un sorprendente uso di lamiere metalliche, l’artista cattura la tensione del momento estatico, trasformando il corpo femminile in un veicolo di sacralità carnale e in un ponte verso una trascendenza universale. Ogni opera è un invito a contemplare il mistero dell’estasi, la fragilità del corpo e la forza inesauribile del sacro declinato al femminile.\n\nLa mostra, con testo critico di Giuseppe Biasutti e a cura di Marcello Corazzini, sarà visitabile dal 13 dicembre 2025 al 10 gennaio 2026, dal mercoledì al sabato, dalle 16:00 alle 19:30, presso CSA Farm Gallery, Via Vanchiglia 36, Torino.\n\nPer informazioni: [info@csafarmgallery.it](mailto:info@csafarmgallery.it) – +39 339 7796065",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_3qLna9Hoc0XbiS8W5eJdC2BQyOFBoecrmWo9rOGX0Q.jpeg?auto=webp&amp;s=7e01269c43dd0585ac791743f7594466af2f0f11"
        },
        "permalink": "/r/torino/comments/1pgmmka/estasi_misticismo_e_arte_la_mostra_femminile/"
    },
    {
        "id": "1pgt0ab",
        "author": "gloopie21",
        "title": "qualcuno conosce parrucchiere BRAVO che sappia fare un mullet/shaggy??",
        "content": "ciao ragazzi per caso qualcuno conosce qualche parrucchiere a torino bravo bravo in tagli femminili un po' complessi come lo shaggy-mullet? sto cercando come una pazza ma non trovo nessuno di bravo vi prego aiuto😭🙏",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1pgt0ab/qualcuno_conosce_parrucchiere_bravo_che_sappia/"
    },
    {
        "id": "1pgdo28",
        "author": "Top-Initiative-5626",
        "title": "Hi. Is Via Sant’Anselmo in the North of San Salvario safe? I am a woman moving to Turin for the first time, an would really appreciate if someone could share their thoughts on where I should look for an accommodation and not.",
        "content": "",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pgdo28/hi_is_via_santanselmo_in_the_north_of_san/"
    },
    {
        "id": "1pgk5ww",
        "author": "Temporary_Voice_949",
        "title": "Qualcuno vuole fare amicizia?",
        "content": "[M] 20 - cerco F\nNiente di complesso o complicato, preferibilmente",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pgk5ww/qualcuno_vuole_fare_amicizia/"
    },
    {
        "id": "1pframj",
        "author": "Alone-Entertainer911",
        "title": "NEGOZI VINTAGE",
        "content": "Vorrei trovare lavoro in questo tipo di negozietti, fare esperienza e imparare tutto su questo mondo, conoscete negozi a torino che potrebbero cercare?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pframj/negozi_vintage/"
    }
]