[
    {
        "id": "1hpkvz1",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 24,
        "comments": 1143,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hpkvz1/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1hrfpr3",
        "author": "ace-s",
        "title": "[Joyce] Real Madrid consider second January bid for Trent Alexander-Arnold ",
        "content": "",
        "upvotes": 212,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UQPpokiLWTrHzxNiUWReA1ObdXeM3mavnku0TKEb2Ec.jpg?auto=webp&amp;s=0ac8a2b2d04dca86020bd61d22ef1c72e233b270"
        },
        "permalink": "/r/realmadrid/comments/1hrfpr3/joyce_real_madrid_consider_second_january_bid_for/"
    },
    {
        "id": "1hrg7es",
        "author": "ace-s",
        "title": "[Lewis Steele] Carlo Ancelotti pushing for Real Madrid to ‘put their foot on the accelerator’ to sign Trent Alexander-Arnold this month",
        "content": "",
        "upvotes": 149,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RUb6dGK3jg-mAKAKeHFAalPe-HNTz5LLHUsYrKgUWPg.jpg?auto=webp&amp;s=a34b43d3ec5813f9d86342d72f51bd9c396c1fe8"
        },
        "permalink": "/r/realmadrid/comments/1hrg7es/lewis_steele_carlo_ancelotti_pushing_for_real/"
    },
    {
        "id": "1hr7cyh",
        "author": "FlyingWaterMen",
        "title": "Gary Lineker on playing abroad: \"Playing for either Barcelona or Real Madrid is something truly special. However strong, powerful and rich the Premier League is, the world's great still goes to Barcelona and Real Madrid. Only exception in the recent times would be Haaland.\"",
        "content": "",
        "upvotes": 476,
        "comments": 66,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6l226ffa1fae1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hr7cyh/gary_lineker_on_playing_abroad_playing_for_either/"
    },
    {
        "id": "1hrf6cm",
        "author": "Altruistic_Plane_110",
        "title": "Help identifying signatures?",
        "content": "",
        "upvotes": 121,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vze44h5crgae1.jpeg?auto=webp&amp;s=14365c4746d48fd8066b24dc054c7a200e0409c6"
        },
        "permalink": "/r/realmadrid/comments/1hrf6cm/help_identifying_signatures/"
    },
    {
        "id": "1hrf3wg",
        "author": "Icy-Designer7103",
        "title": "If we actually want a new RB, is there even a realistic alternative to Trent?",
        "content": "I've seen a lot of people in here saying that we don't need Trent, that he's gonna be a liability, with high wages and other stuff. I have to admit that even I was skeptical about him in the past, but if we actually look into the alternative scenarios, he's pretty much the only player we can and should get. \n\n* The first scenario is to not sign anyone. This means that Lucas Vazquez is gonna renew soon and he's gonna be our starting RB for the entirety of 2025. Once Carvajal is back he'll be 34 years old, with a destroyed knee and no guarantees that he'll be able to play on this level. This scenario is horrible and I have enough faith in Perez to know that it's not gonna happen, so let's assume that we'll indeed sign someone and move on.\n* Every single world class player or at least good plays for teams that won't want to negotiate with us by any means (Porro, Kounde, Hakimi, White), or we'll simply have to overpay for players that are... just decent, at best. Dalot is an example.\n* Other options I've seen people talking about like Frimpong, Couto, Dumfries, Cancelo (lol) are even worse defensively than Trent, while at the same time being not as good players overall.\n* The only other world class/good player we can get for free is Kimmich. But I'm not sure if RB is his best position (he hasn't played a single game there for Bayern this season), he's turning 30 next month and I don't know if the guy would want to leave Bayern and his country. And knowing Perez, if he had to choose between Trent and Kimmich on a free transfer, he'd always go for Trent, he's more marketable and exciting to watch, plus he's best pals with Jude.\n* \"Gambling\" on an average RB and hoping he'll improve isn't ideal either, especially given our recent history with this position. Danilo costed us a treble, Odriozola was proven to be a major flop, Vini Tobias isn't even good enough for Castilla or the Ukrainian league. Gambling on the academy isn't going to happen either, especially as long as Carlo is here.\n\nSo, what's left? We are not scouters, but I don't see who the club can bring that doesn't require breaking the bank or betting on a player who isn't (yet?) on Real Madrid level.\n\n",
        "upvotes": 62,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hrf3wg/if_we_actually_want_a_new_rb_is_there_even_a/"
    },
    {
        "id": "1hriri6",
        "author": "SexyAustralian",
        "title": "Should we be worried about Xabi Alonso?",
        "content": "TLDR AT THE BOTTOM :)\n\nOk this might sound like i’ve gone crazy and don’t know anything about football. But hear me out for a bit. \nAlonso plays a distinct 3-4-3 system at leverkusen, with 3 CBs, two wingbacks, two DMs and two AM/10s (ik it not exactly that) and a striker. Works and has worked great for them obviously. \nBut if he were to get the madrid job, which is pretty likely in the summer, the lack of proper wingers in his system concern me. Imo vini cannot cope with the defensive duties of being a wing back, and it would cause mendy/davies/fran to get pushed to right CB where it doesn’t suit them as well as a LB position they would currently play in. Vini also cannot play as a 10. So where would he play?\nIt would either make alonso change his system (which defeats the whole point of bringing in a manager with a new system) or vini to play out of position as an attacking midfielder. This of course is mirrored on rodrygos side too. \nDefensively, I believe we have had some experiments with 3 centre backs this season that have not gone particularly well, so that is a concern too but none that money can’t fix.\n\nManchester United:\nIt is obviously ridiculous to compare the squads of United and Madrid at the moment, but I think some interesting similarities could be pulled from Amorims start at Utd and what could happen with Madrid with Alonso. Firstly, wingers that had previously been pretty well established under Ten Hags 433 have been left out for technical reasons. I’m talking Garnacho and Rashford here (I know rashfords absence has other reasons, but i believe garnacho is purely technical). This shows that amorim doesn’t want these ‘traditional’ wingers anymore, and is opting for amad and others to shift into those wingback positions. \n\nHOWEVER, there are players in the madrid squad who fit these positions like a glove. Valverde at LWB sounds perfect and probably is. Arda as an AM behind mbappe? Again suits him perfectly. Cams and tchou i think can play in the central two behind the attacking mids, and as previously mentioned mbappe can of course play up top. + nearly forgot to mention the potential signing of wirtz. \nAND, finally having a spanish manager back in the job is a big plus (lopetegui and solari don’t count lol - edit: benitez barely)\nThen there’s the factor of ancelotti using outdated tactics and relying on individuals (which actually isn’t as bad as some think.) A more modern style of play could breathe new life into some players in this regard. \n\nAll in all, although i will of course always support any new manager that comes into the club, I will have some doubts about some positions and if our players will fit. \nI would love to hear your thoughts, especially those who have watched leverkusen (or sporting for that matter) more than me. \n\nTLDR: Vini may not suit wingback or AM. Three at the back has been tried before and not really worked. If vini was to move to wingback, no point getting davies + fran and mendy might not adjust to left centre back. \nExample of man united: garnacho and rashford are two wingers out of favour with amorim. Shows wingers don’t fit into 343. On other hand, 🦅 fits rwb and im sure our midfield can work especially with wirtz. \n\nHope you enjoyed my pretty hastily written thoughts (i apologise for mistakes here and there, english is my second language). \n\n\nEDIT: If you want to talk to me directly abt my thoughts, my discord is @hsauqs\n\nI’ve gone to sleep now but tommorow morning I promise I will respond to every reply, so please leave your thoughts and don’t hold back on criticism, I really want to learn more about football and hearing that sort of thing helps massively ",
        "upvotes": 31,
        "comments": 64,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hriri6/should_we_be_worried_about_xabi_alonso/"
    },
    {
        "id": "1hr1vks",
        "author": "seekingabeauty",
        "title": "Our 3rd kit for the 25/26 season according to Footy Headlines.",
        "content": "",
        "upvotes": 373,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uwmur8hrjdae1.jpeg?auto=webp&amp;s=c7bb7da8ea7566180e1c1402aece409a90894b79"
        },
        "permalink": "/r/realmadrid/comments/1hr1vks/our_3rd_kit_for_the_2526_season_according_to/"
    },
    {
        "id": "1hqh7qq",
        "author": "supplementarytables",
        "title": "Dani Carvajal poses with all the trophies and awards he won in 2024",
        "content": "",
        "upvotes": 3919,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fwp623u4f7ae1.jpeg?auto=webp&amp;s=600842a8f0cb0236377a277ffca9e122aeb31057"
        },
        "permalink": "/r/realmadrid/comments/1hqh7qq/dani_carvajal_poses_with_all_the_trophies_and/"
    },
    {
        "id": "1hqnaxn",
        "author": "seekingabeauty",
        "title": "[DataMB] Comparing Mohamed Salah to Vinícius Júnior in the 24/25 season.",
        "content": "",
        "upvotes": 791,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p4sj9saqu8ae1.jpeg?auto=webp&amp;s=dc969aa7ca97468bd3f36a91404bf7d942cc9cd3"
        },
        "permalink": "/r/realmadrid/comments/1hqnaxn/datamb_comparing_mohamed_salah_to_vinícius_júnior/"
    },
    {
        "id": "1hqpmnp",
        "author": "sloth0021",
        "title": "🌟ViniJr receives EFE Trophy for Best Ibero-American Player of 2024! 🌎",
        "content": "https://x.com/realmadriden/status/1874138458719182863",
        "upvotes": 476,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vc176hi5g9ae1.jpeg?auto=webp&amp;s=d2bc5deca044dd3da631536e8bf959decbc748cd"
        },
        "permalink": "/r/realmadrid/comments/1hqpmnp/vinijr_receives_efe_trophy_for_best_iberoamerican/"
    },
    {
        "id": "1hqm0cf",
        "author": "Charybd1ss",
        "title": "Jude Bellingham - 2024/25 so far",
        "content": "",
        "upvotes": 502,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/duzzh6v0j8ae1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hqm0cf/jude_bellingham_202425_so_far/"
    },
    {
        "id": "1hqh3wa",
        "author": "h4ssan_",
        "title": "Best Real Madrid Goals of 2024 🤍",
        "content": "Hard to pick a favorite 🥹\n\nFound this on Twitter (@MadridistatvYT)",
        "upvotes": 742,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vcujk2a4e7ae1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hqh3wa/best_real_madrid_goals_of_2024/"
    },
    {
        "id": "1hqbw9p",
        "author": "Chipichipi18",
        "title": "What a year it was! Gracias 2024 ",
        "content": "For my timezone most of the matches starts at midnight for me, but this year I started watching matches more frequently and what a year it was. Hala Madrid and Happy New Year to all madridistas 🤍🤍\n\n(I don't claim any credits for this video)",
        "upvotes": 971,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/28kojpcjt5ae1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hqbw9p/what_a_year_it_was_gracias_2024/"
    },
    {
        "id": "1hqh01b",
        "author": "blueXwho",
        "title": "Vini and Mbappé together",
        "content": "This clip shows two great players talking wonders about each other, relaxed, and playfully. I think we're very lucky Vini chose us and Mbappé finally came. The Frenchman is still improving, but they're here to stay and to take us to glory.\n\nI am happy we're able to enjoy so many wonderful seasons of trophies and winning, despite what the haters say/expect, even haters inside our own fan base.\n\nI wish you all a Happy New Year and remember how much they gave us in 2024. Hala Madrid!",
        "upvotes": 115,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BxOG7ZZEpB4dSK_idX57UIkpJ_9biKdJElyBSOo7Q9I.jpg?auto=webp&amp;s=4f810376ef628cb4bea6991b44dfd774367c6c33"
        },
        "permalink": "/r/realmadrid/comments/1hqh01b/vini_and_mbappé_together/"
    },
    {
        "id": "1hpkxah",
        "author": "yellowflash96",
        "title": "Amazing one touch passing and Goal.",
        "content": "",
        "upvotes": 4197,
        "comments": 64,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7x78utnlwy9e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hpkxah/amazing_one_touch_passing_and_goal/"
    },
    {
        "id": "1hpq2wd",
        "author": "beekay8845",
        "title": "One of the best quotes of all time 'promised 1 delivered 4 ..what a player this man was for real madrid ..",
        "content": "",
        "upvotes": 1230,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1hdjfz6vb0ae1.png?auto=webp&amp;s=5909260977965c99a6e65aed59d6314f4d2cb110"
        },
        "permalink": "/r/realmadrid/comments/1hpq2wd/one_of_the_best_quotes_of_all_time_promised_1/"
    },
    {
        "id": "1hpkvts",
        "author": "DoriOli",
        "title": "Who remembers these times? ",
        "content": "",
        "upvotes": 1997,
        "comments": 155,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/unannpj9wy9e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hpkvts/who_remembers_these_times/"
    },
    {
        "id": "1hpoloo",
        "author": "0luisera",
        "title": "Endrick is turning into a mini truck",
        "content": "Bobby is strong 💪🏻",
        "upvotes": 892,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nu00crilzz9e1.jpeg?auto=webp&amp;s=01f35fdef9d35d48103402eeb5a36d3443158a8d"
        },
        "permalink": "/r/realmadrid/comments/1hpoloo/endrick_is_turning_into_a_mini_truck/"
    },
    {
        "id": "1hppfxw",
        "author": "h4ssan_",
        "title": "New HP Commercial Featuring Kylian, Jude, and Fede 🤍",
        "content": "",
        "upvotes": 526,
        "comments": 34,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ybc9fkfq60ae1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hppfxw/new_hp_commercial_featuring_kylian_jude_and_fede/"
    },
    {
        "id": "1hr4eqm",
        "author": "Immediate-Drink2196",
        "title": "Do we really need Trent?",
        "content": "Obviously we have a serious problem in the defence and desperately need reinforcements. However, I am not convinced Trent is real Madrid calibre - hear me out. Just because he wants to join doesn't mean we should just get him based on the fact it's a brilliant deal. My problem with Trent is his defensive capabilities. Yes he's on of the best wing backs going forward with incredible playmaking abilities. However if you consider Alphonso Davies joining who is also incredible offensively but shaky in defence, could leave us seriously vulnerable at the back. \n\nWe won the UCL final against Liverpool a few years back because Trent doesn't know how to track a runner and left vini free at the back post. In addition to the fact the team is already unbalanced with too much attacking minded players and not enough defensive, hence our shaky defense all season. \n\nThis is why carvajal is the best RB in the world the last few years imo, due to how solid he is in defence and how much he fights wingers the way Rüdiger fights strikers, In classic old school fashion. \n\nThoughts?",
        "upvotes": 0,
        "comments": 65,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hr4eqm/do_we_really_need_trent/"
    },
    {
        "id": "1hpp9zd",
        "author": "supplementarytables",
        "title": "Kylian Mbappé is Real Madrid’s player of the month for December! ",
        "content": "",
        "upvotes": 404,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uhDT5dRYSv_naUbjW0b-IqM6kF5ahFCQ8wND5LiJd8g.jpg?auto=webp&amp;s=041233a6704485c6daf52e664daa6876a1d5920d"
        },
        "permalink": "/r/realmadrid/comments/1hpp9zd/kylian_mbappé_is_real_madrids_player_of_the_month/"
    },
    {
        "id": "1hpronw",
        "author": "Accurate_Advance6903",
        "title": "Am I the only one who doesn’t buy into the tabloids claiming Trent wants to sign with us?",
        "content": "When have Spanish tabloids like AS, Relevo, Marca ever been reputable in transfer news? They have constantly spewed trash clickbait news for clout which we have time and time seen with our previous transfer sagas. \n\nI think despite people saying Trent has remained “coy” about his future in the media and public eye and that Jude has been influential in this entire rumour I really doubt he would choose to leave his boyhood club especially when they are probably winning the premier league this season. \n\nDon’t get me wrong I would absolutely love to have him at Madrid, he is arguably technically the greatest creative passer for his position and it’s a position we have for long decided not to think about for the future. \n\n\nHere’s 3 reasons why he won’t\n\nHe is a scouser and it’s his boyhood club. \n\nHe’s already a vice captain and soon to be future captain. \n\nHe can be an integral part of their sporting project for years to come despite already winning everything with them. \n\nI know there are several Liverpool fans lurking in the sub, I’m curious to know what you guys think of this entire rumour? ",
        "upvotes": 144,
        "comments": 83,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hpronw/am_i_the_only_one_who_doesnt_buy_into_the/"
    },
    {
        "id": "1hp9gli",
        "author": "amungus45",
        "title": "Real Madrid Fans are awesome just like the club ",
        "content": "",
        "upvotes": 937,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/aah9x5mgkv9e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hp9gli/real_madrid_fans_are_awesome_just_like_the_club/"
    },
    {
        "id": "1hp41x1",
        "author": "Infiniterocket",
        "title": "No pilot? Bring in Camavinga",
        "content": "Camavinga may be able to play multiple positions but most importantly he can fly a plane",
        "upvotes": 1859,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/18pgcmxadu9e1.jpeg?auto=webp&amp;s=a1523a6a927f628241b6e5118525444a3aad9a56"
        },
        "permalink": "/r/realmadrid/comments/1hp41x1/no_pilot_bring_in_camavinga/"
    },
    {
        "id": "1hpnzto",
        "author": "Traditional-War-4387",
        "title": "THE RADIO ONE INTERVIEW ",
        "content": "\"Nico Paz is a player we’re following closely. He’s very good and a great talent. This training season away from Real is doing him a lot of good. We believe he’s a player who could be the future of Real Madrid.\" – Carlo Ancelotti, VIA [ Radio One ]\nDoes anyone know where Carlo Ancelotti's interview about Nico Paz is from? \nSomeone give me something guys i am a Nico Paz fan ",
        "upvotes": 24,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hpnzto/the_radio_one_interview/"
    },
    {
        "id": "1hoxigv",
        "author": "Beau_Fairy",
        "title": "Every Madridista wants a father like this",
        "content": "",
        "upvotes": 1306,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8igawjvews9e1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hoxigv/every_madridista_wants_a_father_like_this/"
    },
    {
        "id": "1hpk83y",
        "author": "No_Toe_4663",
        "title": "Need advice as an international fan",
        "content": "I’m planning a trip to Madrid to fulfill my childhood dream of watching the greatest team of all time play live. But wow, I had NO IDEA how expensive tickets are—even for games that aren’t considered big matchups!\n\nI’m planning to fly to Madrid in the first week of April, hoping to catch the home game against Valencia. Based on what I’ve read online, my best option seems to be getting tickets from reselling platforms like StubHub. However, the prices are shocking—an above-average ticket costs at least €400 on every resale site I’ve come across in this subreddit.\n\nInitially, I was also hoping to grab a cheaper below-average ticket if Madrid make it to the UCL semi-finals on April 8th or 9th, just to experience the magic of the Bernabéu on a Champions League night. But seeing how expensive resale tickets are even for the Valencia game, I’m starting to doubt if that’ll be possible.\n\nIf anyone has tips on how international fans can find tickets at more reasonable prices, I’d be so grateful!",
        "upvotes": 29,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hpk83y/need_advice_as_an_international_fan/"
    },
    {
        "id": "1hp6557",
        "author": "ManuMora98",
        "title": "[Basket] We close the year beating Barça in league 73-71 and go 3-0 against them this season so far. ",
        "content": "",
        "upvotes": 196,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C9GzFc52Ny-Ohpxt20zDdhQe03lAV356bSc1Ohvzclw.jpg?auto=webp&amp;s=51a13b457365ff246e096ecbf03a6f0a35fcda27"
        },
        "permalink": "/r/realmadrid/comments/1hp6557/basket_we_close_the_year_beating_barça_in_league/"
    },
    {
        "id": "1how796",
        "author": "sonic_rm",
        "title": "Had this Painting/Art Commissioned for the Love of Madrid - Hala Madrid!",
        "content": "",
        "upvotes": 351,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1how796/had_this_paintingart_commissioned_for_the_love_of/"
    },
    {
        "id": "1hoq4u8",
        "author": "LoneWolfGaming123",
        "title": "Crazy that this Castilla team from 2015 to 2017 failed to achieve league promotion",
        "content": "",
        "upvotes": 323,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hoq4u8/crazy_that_this_castilla_team_from_2015_to_2017/"
    }
]