[
    {
        "id": "1rfqabp",
        "author": "AutoModerator",
        "title": "Netflix Declines to Raise Offer for Warner Bros.",
        "content": "",
        "upvotes": 243,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1rfqabp/netflix_declines_to_raise_offer_for_warner_bros/"
    },
    {
        "id": "1rfwr79",
        "author": "CockroachPowerful387",
        "title": "being a college kid who uses netflix is infuriating.",
        "content": "I had a midterm today. and all i wanted to do when I got home was watch the new season of bridgerton. but I open the website only to be met with a message saying 'you're not on your home wifi (BECAUSE OF COURSE IM NOT) and we can send a code to your email for 14 days blah blah blah' and it makes me so so so mad because whenever im watching tv its at night after my mom has gone to sleep, so I cant call her and get the code. So here I am, my day ruined, because all I wanted to do was watch bridgerton. i sound dramatic I know but this is so infuriating",
        "upvotes": 340,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1rfwr79/being_a_college_kid_who_uses_netflix_is/"
    },
    {
        "id": "1rfj6s5",
        "author": "Ary1n_07",
        "title": "Midnight mass is netflix's best in horror",
        "content": "I know I am going to get toh of hate for this but hear me out .\nFrom the starting to the end , there are hardly any flaws in it .\nThe soundtrack, jumprsacres, character development are upto the mark .\nAnd the ending , it's one of the most beautiful (and hurtful) at the same time .\nI cried .\nStranger things is close for me , but midnight mass will always be the 1st .\n",
        "upvotes": 200,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1rfj6s5/midnight_mass_is_netflixs_best_in_horror/"
    },
    {
        "id": "1rg9m4a",
        "author": "Similar_Designer_251",
        "title": "K-drama The Art of Sarah proves that, in Korea, luxury goods are ‘like an ID card’",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rg9m4a/kdrama_the_art_of_sarah_proves_that_in_korea/"
    },
    {
        "id": "1rgbokg",
        "author": "Only-Standard445",
        "title": "Natasha arc in Accused",
        "content": "They started the whole Natasha’s arc in Dr. Geetika’s past, but let it completely unexplored and unexplained. Did anyone notice this?\n\nI thought they’ll reveal something in the end, but alas!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rgbokg/natasha_arc_in_accused/"
    },
    {
        "id": "1rg6c4u",
        "author": "Longjumping-Web-9808",
        "title": "Logged into a random family’s account",
        "content": "I logged in to use Netflix on my ps5 and all of the profiles are random names and the linked email isn’t mine. Pretty sure my family only has 1 Netflix account which is untouched on all my other devices. Is this some sort of weird bug? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rg6c4u/logged_into_a_random_familys_account/"
    },
    {
        "id": "1rg1g14",
        "author": "Appropriate_Gur7902",
        "title": "IF YOU LIKE K-DRAMAS LIKE MASK GIRL WATCH THE ART OF SARAH",
        "content": "If you like K-dramas that revolve around transformation or reinvention, whether it is physically or internally or both, definitely watch The Art of Sarah. It's thrilling, gripping, and the perfect amount of predictable. the show celebrity also has similar themes! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rg1g14/if_you_like_kdramas_like_mask_girl_watch_the_art/"
    },
    {
        "id": "1rff0nn",
        "author": "Outrageous-Baker5834",
        "title": "Apple and Netflix join forces to distribute F1 2026 content",
        "content": "",
        "upvotes": 31,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rff0nn/apple_and_netflix_join_forces_to_distribute_f1/"
    },
    {
        "id": "1rfuyz3",
        "author": "Ohi_111",
        "title": "Bridgerton season 4",
        "content": "I think season 4 of Bridgerton is the best season so far. Omg I really enjoyed this season. The chemistry Benedict and Sophie had was incredible and the storyline was 10/10. Felt like a love/romance fairytale happy ending I loved it.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rfuyz3/bridgerton_season_4/"
    },
    {
        "id": "1rf9ft8",
        "author": "fraction00",
        "title": "Is House of Cards (U.S) worth watching?",
        "content": "I am thinking of watching House of Cards on Netflix. Since it’s 6 seasons long, It’s better to be worth my time. Can I watch it? Is it worth watching? I like political thrillers in general. I liked the Diplomat",
        "upvotes": 39,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1rf9ft8/is_house_of_cards_us_worth_watching/"
    },
    {
        "id": "1reng13",
        "author": "RiskAndReason",
        "title": "What’s that one Netflix show you think is an absolute must-watch?",
        "content": "The kind where you’d say, “I can’t believe you haven’t seen this yet.”\n\nLooking for something great to start next, classics or hidden gems both welcome.",
        "upvotes": 879,
        "comments": 1588,
        "media": null,
        "permalink": "/r/netflix/comments/1reng13/whats_that_one_netflix_show_you_think_is_an/"
    },
    {
        "id": "1rfla35",
        "author": "Specialist_Tone2797",
        "title": "Why do Netflix series feel the same?",
        "content": "Just watched some of their newer series like Beast in me, Black Rabbit and His and Hers. I have to say that Netflix original series are awful. They all feel recycled and it feels like they have no substance to them, just packaged nicely with good visuals and top tier actors, but the end product is mediocre at best. \n\nI know this has always been a criticism for Netflix but I can’t help but feel like it’s getting more prevalent. Don’t even get me started on their original movies, they’re even more awful. Why can’t they hire good writers for their scripts , because they end by being totally bland and repetitive. Why would they spend so much on actors and production but cheap out on hiring competent writers. ",
        "upvotes": 6,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1rfla35/why_do_netflix_series_feel_the_same/"
    },
    {
        "id": "1rfsapy",
        "author": "muad_dib_the_maker",
        "title": "Why do you splat horrible imagery all over the app before signed in to a profile",
        "content": "My remote control has a Netflix button.\n\nI supervise my 4 year olds tv time other than when getting her a drink or plating up her dinner.\n\nYet for the 2nd time tonight she has been traumatised by god awful splashes for horror shows that are plastered all over the netflix home page since when you open the app it defaults to selecting the last used profile. \n\nWhy do I have to come back into the room to her crying in fear over that demon girl with the teeth. She doesnt use the remote to press the button. She leans on the remote and the Netflix button gets pressed.\n\nThis could be avoided by me being extra vigilant. Taking the remote with me at all times everywhere I go. Always ensuring that I dont leave it on my sofa. \n\nBut why the fuck should I, just dont advertise the shows until Im logged into a profile. Or give me the option to turn off this shit. \n\nIm an adult. I like scary stuff. My wife and daughter dont. \n\nStop forcing horrible, nightmare inducing images on kids. \n\nAnd I will try and duct tape my remote control to my leg in the meantime.\n",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1rfsapy/why_do_you_splat_horrible_imagery_all_over_the/"
    },
    {
        "id": "1rflbxw",
        "author": "AConant",
        "title": "Recommendation for West Wing episode \"In Excelsis Deo\"",
        "content": "New to the forum.\n\nI was always told I would like West Wing, but I have only recently started binging it on Netflix.\n\nI just finished the episode \"In Excelsis Deo\" and it moved me to take the time to share this recommendation.\n\nThe episode can stand alone but there are multiple threads happening in the arc that you will miss...but the main story is about military service, and loss and the honor due and so often unpaid for their service.\n\nI'm 57 - never served myself, but my life was influenced by my father's Vietnam service, which has been a scar on his soul that also wounded us all.\n\nMy father had never seen the Vietnam Memorial and DC - he always wanted to but only got to see the small traveling version some years ago when it passed through his town.\n\nBoth my parents are getting near the end of their lives. I took my parents to DC so he could see it before it is too late. It was a dream of his since it was built.\n\nIt was powerful moment and life event for us all.\n\nI had been to DC but never seen the Korean memorial somehow. Didn't even know it existed which is a shame as it is very powerful.\n\nAfter we spent some time at the Vietnam Wall, we wandered through the park with no particular plan. We approached the Korean memorial without knowing it was there, and as we came up through the trees, the soldier statues appeared like phantoms emerging from the shade cast by the trees we walked through.\n\nIt was a powerful and eerie experience. Like ghosts emerging from the dark I was very impressed and now see that memorial as probably the most powerful in DC. I mention it because the episode features it in the story.\n\nAnyway, I have not often been moved to share something like this, but I thought it was worthy. I found the story moving and beautiful, and my friends were right - so far, it is an excellent show...made only more engaging and honestly, frustrating by the current state of the country.\n\nIt is hard to see a dramatic representation of the presidency and government that is at least somewhat reminiscent - and even, to some degree - honorific - compared to the current permanently stained version of the office. The contrast is actually quite sad, while also giving me some much-needed hope - if only a little bit - hope that maybe in the future we might see something closer to what we once thought of it.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rflbxw/recommendation_for_west_wing_episode_in_excelsis/"
    },
    {
        "id": "1rfwnxu",
        "author": "CodDefiant2710",
        "title": "Baki-Dou: The Invincible Samurai, on Netflix",
        "content": "[Miyamoto Musashi](https://en.wikipedia.org/wiki/Miyamoto_Musashi) was the greatest samurai of the Edo Era, who, according to legend, cut through the Shogunate’s enemies like butter during the Battle of Sekigahara. Much to his surprise, a cutting-edge cloning project reincarnates him (with a little magical help from a “medium”) to fight the worst scourge of the 21st Century: boredom. The cure is deadlier than the disease, but those are risks Baki Hanma’s fellow underground fighter colleagues willingly embrace in [**Baki-Dou: The Invincible Samurai**](https://www.imdb.com/title/tt38201910/?ref_=mv_close), the latest anime series adapted from Keisuke Itagaki’s [**Baki the Grappler**](https://kodama-tales.com/baki-the-grappler/) manga franchise, directed by Toshiki Hirano, which premieres today on Netflix.\n\n[https://cinemadailyus.com/reviews/baki-dou-the-invincible-samurai-on-netflix/](https://cinemadailyus.com/reviews/baki-dou-the-invincible-samurai-on-netflix/)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rfwnxu/bakidou_the_invincible_samurai_on_netflix/"
    },
    {
        "id": "1rfw80n",
        "author": "katerinaa_petrova",
        "title": "This OP would very much like to know what the society thinks of our Bridgerton matches!?",
        "content": "Dearest gentle reader , \n\nAs the S4 is in gossip already, this OP likes to tell her audience that I very much liked beloved Sophie and benedict and the bond they harboured, heavens forbid , I even had a steady feeling that I MIGHT like them as much as I enjoyed Kate and Anthony. But , my dear reader , as the S4 progressed , I realised the love, the bond, the chemistry, everything Kate and Anthony had, bewitched my heart on a level that even though I loved Sophie and Benedict so much , it was impossible for op to love them like little edwand's parents. \n\nAs the season came to an end , I would like to admit that the show could've been a done a lot better if whistledown was still a mystery. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rfw80n/this_op_would_very_much_like_to_know_what_the/"
    },
    {
        "id": "1rfzol7",
        "author": "ChinaMilitarySecrets",
        "title": "Does Netflix help aspiring writers?",
        "content": "I am doing research for a book/movie that I am writing. \n\nI am writing a heartfelt inspirational story but also intense thriller comedy drama about an African-American man who marries a Chinese Woman and moves to China. He is an African-American Doctor working in China and then he also runs for Political Office and experiences many obstacles. \n\nAlso, the movie will have full frontal male scenes. But hes a masculine straight African-American man married to a Beautiful Chinese Wife...\n\nAnd the wife also has a secret... she is a spy for the Americans. \n\nNobody in China knows that she is an American Spy. \n\nNot even her African-American husband knows... \n\nAnd then if she ends up being caught in China as an American Spy... \n\nShe has to then decide whether she will risk what China does to traitors, or make her African-American Husband unknowingly take the fall for all her espionage... since China would already suspect him and she could easily frame him. \n\nLots of the other guys in China are also very jealous of him, because of that time when they saw him in the Gym Change Room, and then also they realized that not only does he have a beautiful chinese wife, but he is also a succesful Doctor. \n\nAnd when they visited his house, they saw what a beautiful house he has, and they saw his huge deck. (Patio Deck).  \n\nI will probably call the book/movie.... \" Hello Welcome\"....",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1rfzol7/does_netflix_help_aspiring_writers/"
    },
    {
        "id": "1rfudzi",
        "author": "running2reddit",
        "title": "“Famous Last Words” editing approval?",
        "content": "Did Jane or Eric get to approve the show’s editing before they passed? I really love the idea of the show, but I think I can’t really have a full opinion until I know if they approved of the final cut. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rfudzi/famous_last_words_editing_approval/"
    },
    {
        "id": "1rft47t",
        "author": "30DayRefund",
        "title": "Roku Tip for Netflix 5.1 Surround Sound",
        "content": "Recently I was struggling to get DTS 5.1 surround sound working on my Roku streaming box. Everyone online was saying how incredible the surround sound is with Stranger Things season 5, but I was only getting sound out of my front speakers. \n\nIt turns out there's a little known Roku setting called Volume Mode that disables 5.1 surround sound. Somehow my Roku was set to Volume Mode \"Leveling\". Once I changed that to \"Off\", I was able to watch Stranger Things in glorious room-shaking 5.1 surround sound.😁 I hope this tip helps someone.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rft47t/roku_tip_for_netflix_51_surround_sound/"
    },
    {
        "id": "1rfs03h",
        "author": "OnMyPhoneUndercover",
        "title": "Displayed Video Language",
        "content": "I am situated in Germany and watch Netflix from here. My system language, browser language and netflix's website language are all set to english.\n\n  \nSO why is it, that the video of the episode, for example with supernatural, which started with this BS at S6E1, display german texts. Usually it's \"The road so far\" and then a \"now\", but now it's \"das letzte jahr\" ( the previous year ) and \"heute\" (today). \n\nThis was an issue before but i didn't use netflix for a while, and i reeeeaaally HATE the fact that i get shown a different video, depending on my location. Put it in the subtitles and be done with it.\n\n  \nIs there any hidden setting or something i overlooked to fix this? Please please tell me there is.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1rfs03h/displayed_video_language/"
    },
    {
        "id": "1rfpi8h",
        "author": "Hiraeth-nomad",
        "title": "‘Bridgerton’ Showrunner Talks Major “Turning Point” For Benedict &amp; Sophie In Season 4 Part 2, Status Of Several Bridgerton Relationships And What To Expect In Season 5",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rfpi8h/bridgerton_showrunner_talks_major_turning_point/"
    },
    {
        "id": "1rfed7n",
        "author": "MiBareBear",
        "title": "Eric Dane - FLW",
        "content": "wow, just wow. you wouldn't finish this without crying. the messaging and how he conveyed it was so powerful. the host really did an amazing job in asking the right questions.. So yeah, we really have to live here NOW.😭",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rfed7n/eric_dane_flw/"
    },
    {
        "id": "1rf4cux",
        "author": "DaGeoffro",
        "title": "Has anyone seen the Russian show Better Than Us?",
        "content": "I don't feel like this show gets talked about enough, it's honestly one of my favorite sci-fi/futuristic offerings on the platform. I enjoy every storyline, which I can't say about a lot of shows where each character is off doing their own thing. They really managed to connect everything in a way that I found satisfying. And while it has a pretty run-of-the-mill take on life in the future, with some sillier elements like transparent smart phones, I do like that it takes place in the NEAR future (2029,) as opposed to 2058 or 2082 or something like that. And you can't mention Better Than Us without mentioning Arisa, the main character of the show who, despite being a robot, ends up being one of the most likeable and emotionally complex characters out of everyone.  \n  \nI'd definitely recommend checking it out if you're into sci-fi or robots. The story is definitely more of a slow burn, so if that isn't your thing you may not like it. There was never a season 2 unfortunately (but the first season has quite a few episodes). I heard something about another company renewing it for a second season but I'm not sure if anything ever came of that.",
        "upvotes": 9,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1rf4cux/has_anyone_seen_the_russian_show_better_than_us/"
    },
    {
        "id": "1recvyj",
        "author": "monroe099",
        "title": "Is there any way to hide movies that I already watched?",
        "content": "Netflix needs to stop recommending me the same movies I’ve already watched like I don’t pay a subscription to discover something new 😭 Is there any way to stop seeing these on my main page please ?  It takes me longer to find something to watch than to actually watch a movie.",
        "upvotes": 216,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1recvyj/is_there_any_way_to_hide_movies_that_i_already/"
    },
    {
        "id": "1rffsmj",
        "author": "Phoenixio7",
        "title": "Removal of Stargate SG1 and Black Clover?",
        "content": "I'm an almost daily watcher, and these days I was alternating between Stargate SG1 and Black Clover (I know, wildly different).  I was watching them yesterday, and yet today they seem to have disappeared.  There was no warning about their removal, unlike usual.  Stargate was added only recently even!  Was there an update, a patch, or some distribution issue that I may have missed?  I'm watching from Sweden.  Let me know if you have any info!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1rffsmj/removal_of_stargate_sg1_and_black_clover/"
    },
    {
        "id": "1ren0gz",
        "author": "anjilleea",
        "title": "How to get to heaven from Belfast",
        "content": "Just finished this mini series and LOVED it. It was oddball quirky in all the right ways. Created by the same woman who made Derry Girls which I also loved (maybe I’m just a sucker for N Irish accents and humour?!?). ",
        "upvotes": 48,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ren0gz/how_to_get_to_heaven_from_belfast/"
    },
    {
        "id": "1rff9wg",
        "author": "RollerSkatingHamster",
        "title": "My mum used our account while abroad and the rest of our profiles have disappeared",
        "content": "I take it that this is because of the one household rule. It's such an annoying policy! I know there is a way around it but right now I'm too pissed off to start looking at solutions haha.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rff9wg/my_mum_used_our_account_while_abroad_and_the_rest/"
    },
    {
        "id": "1reylt7",
        "author": "TheOttomanJanissary",
        "title": "Hot take: Marco Polo walked so Shōgun could run. Agree or disagree?",
        "content": "I rewatched it and honestly the production value was insane. Mongol Empire politics, brutal battles, massive sets. But it got cancelled after 2 seasons. With how well historical epics are doing now (like Shōgun), do you think Marco Polo would survive if it dropped today? Or was it just not that good? Curious what people think did it deserve to be cancelled? ",
        "upvotes": 12,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1reylt7/hot_take_marco_polo_walked_so_shōgun_could_run/"
    },
    {
        "id": "1retwvf",
        "author": "onlysummerxoxo",
        "title": "I just finished Night Agent, anyone have anymore good recommendations?",
        "content": "I’ve seen all the super popular shows like Waterfront , Lincoln Lawyer &amp;&amp; His &amp;&amp; Hers. I was just wondering if anyone had anymore recommendations. I need something binge worthy lol.",
        "upvotes": 20,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1retwvf/i_just_finished_night_agent_anyone_have_anymore/"
    },
    {
        "id": "1rfqxcs",
        "author": "indi933",
        "title": "Who is winning in a fight stranger things cast",
        "content": "Finn vs Caleb\n\nFinn vs Gaten\n\nGaten vs Caleb\n\nIf it was a fair one on one fight. No weapons involved. Just based on the actor and not the character they portrayed.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rfqxcs/who_is_winning_in_a_fight_stranger_things_cast/"
    }
]