[
    {
        "id": "1pgkdb8",
        "author": "IcefoxX5",
        "title": "[Match Thread] Zamora CF - Real Madrid Castilla | Primera Federación, Matchday 15",
        "content": "#FT: ZAMORA 2:2 CASTILLA  \n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 Kike Márquez 5' \n\n1:1 Dani Yáñez 48' \n\n1:2 Jorge Cestero 67'\n\nRed card: Loren Burón (Zamora) 78'\n\n2:2 Kike Márquez (p) 89'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n⚽ 5 ' - goal for Zamora - free kick cross into the box, where Manuel Ángel gets pushed away too easily by his marker, who is then completely open and finishes it nicely top bins on the volley\n\n23' - Valdepeñas gets his foot on a cross by Yáñez, the ball travels towards the far post, but the keeper can scratch it off the line just in time \n\nHT - after conceding an unnecessary goal early, Castilla dominated and created good chances throughout, playing with great urgency to score the equaliser, which sadly hasn't arrived yet\n\n🔄 46' - Lamini Fati for Valdepeñas at the half\n\n⚽ 48' - GOLLLL DEL CASTILLA - after a set-piece, the ball comes to Cestero, whose shot is deflected and the keeper can only defend it awkwardly with his foot - the ball comes straight to Yáñez, who calmly slots it into the open corner! \n\n⚽ 68' - GOLLLLL DEL CASTILLA - after another corner, Dani Yáñez receives the ball on the right wing - he cuts inside and puts in a low cross to Cestero - his first touch into a quick half volley shot is spectacular, and the ball falls low into the far corner! \n\n🔄 76' - Cristian David comes on for Álvaro Ginés\n\n🟥 78' - Red card for Zamora, Loren Burón hits Cestero in the face for no reason - Arbeloa asks for the review, and the referee, after seeing it on the screen, he has no choice but to send him off \n\n🔄 84' - Pol Fortuny comes on for Yáñez\n\n88' - a penalty is getting reviewed in the box - but Rivas' arm is tucked in\n\n⚽ 89' - the referee gives the penalty anyway, and Kike Márquez converts... \n\n90' - 9 minutes of added time left to get back the deserved lead in this game\n\nFT - the team failed to create any more chances against Zamora holding on for dear life, and the game ends in the first draw of Castilla's season after 8 wins and 6 defeats. The team absolutely deserved the 3 points today, being the better team for almost the entirety of the game, and conceding the equaliser from a debatable penalty when the game already seemed won\n\n\n&amp;#x200B;\n\n**Kickoff:** 16:00 CET\n\n**Venue:** Estadio Rute de la Plata, Zamora\n\n**Referee**: \n\n**Competition:** Primera Federación, Grupo 1, Matchday 15\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Diego Aguado, Víctor Valdepeñas (46' Lamini Fati), Mario Rivas, David Jiménez - Jorge Cestero, Thiago Pitarch, Manuel Ángel - César Palacios, Álvaro Ginés (76' Cristian David), Dani Yáñez (84' Pol Fortuny) \n\nBench: Guille Súnico (GK), Jesús Fortea, Álvaro Lezcano, Loren Zúñiga.\n\nUnavailable: Joan Martínez (first team call-up), Manu Serrano (injury), Roberto Martín (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** LWLWW\n\n**1ª RFEF stats:** 5th | 24pt | 8-0-6 | 17:17\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pgkdb8/match_thread_zamora_cf_real_madrid_castilla/"
    },
    {
        "id": "1pb9xd4",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 20,
        "comments": 4169,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb9xd4/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pghnxf",
        "author": "Messmers",
        "title": "18 year old Gabri Valero from our academy Juvenil A, plays RW and is backed by Marcello -- our future Right Winger?",
        "content": "",
        "upvotes": 315,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ia65f5ew3s5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pghnxf/18_year_old_gabri_valero_from_our_academy_juvenil/"
    },
    {
        "id": "1pgm46g",
        "author": "Swastik1504",
        "title": "Past is the Present.",
        "content": "Camavinga or Arda Guler: Who will fit the Xabi project long term?\nMy take:\nIts 2016 all over again. Zidane had a tough choice to make between Casemiro and James Rodriguez. Fans wanted James, some news portals said the then attackers liked James too(more goal scoring chances for them), fans even called the Brazilian 'Cancermiro' but Zidane took a bold decision and chose  defensive stability over offensive threat. \nResult: The legendary KCM trio, one of the most successful periods in club history.\n\nThe Camavinga and Arda Guler story rings a similar bell.\nBut its different. Though James and Arda Guler are prolific #10s but Casemiro was a CDM and Camavinga is an all phase monster. \n\nArda Guler is good but out of the two only Camavinga is generational. Arda Guler is well liked by fans and Mbappe but Camavinga is not far behind, he is liked by fans and Mbappe is his compatriot. \n\nWhen the time comes, Xabi will have to make the big decision , it remains to be seen if he has the nerves of steel that Zidane had. I wish the decision comes sooner rather than later.\n\nTell me your thoughts.",
        "upvotes": 46,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pgm46g/past_is_the_present/"
    },
    {
        "id": "1pgmrp9",
        "author": "IcefoxX5",
        "title": "Zamora CF 1-[2] Real Madrid Castilla - Jorge Cestero 67'",
        "content": "",
        "upvotes": 10,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4mze28za8t5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pgmrp9/zamora_cf_12_real_madrid_castilla_jorge_cestero_67/"
    },
    {
        "id": "1pgmck4",
        "author": "IcefoxX5",
        "title": "Zamora CF 1-[1] Real Madrid Castilla - Dani Yáñez 48'",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/e24bwl975t5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pgmck4/zamora_cf_11_real_madrid_castilla_dani_yáñez_48/"
    },
    {
        "id": "1pgjj28",
        "author": "ManuMora98",
        "title": "[Basket] Sergio Llull wins the game in the last second against La Laguna Tenerife (70-71)",
        "content": "",
        "upvotes": 15,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4hs9EYjVJTH-f8qv1cfcV-qhtQ1YU-yCRV-DHscAjdM.jpeg?auto=webp&amp;s=e0c65ba140aedb51af87da97a38b1323193da091"
        },
        "permalink": "/r/realmadrid/comments/1pgjj28/basket_sergio_llull_wins_the_game_in_the_last/"
    },
    {
        "id": "1pgafta",
        "author": "scoreboard-app",
        "title": "Pre Match Thread: La Liga, Round 15 Real Madrid vs Celta",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pgafta)",
        "upvotes": 50,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pgafta/pre_match_thread_la_liga_round_15_real_madrid_vs/"
    },
    {
        "id": "1pfybgm",
        "author": "travel8005",
        "title": "Jersey with champions league badge or without? It's a gift",
        "content": "I want to get this from the official real madrid store for my husband's birthday. I don't know if I should get it with the badge or without. I know he would like it anyway but which one would be better. He already has a regular real madrid jersey but he has said he wanted a different player and I'm getting his favorite one ",
        "upvotes": 148,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pfybgm/jersey_with_champions_league_badge_or_without_its/"
    },
    {
        "id": "1pg5cwa",
        "author": "Brawn132",
        "title": "Arda and Jude confusion",
        "content": "The common opinion on this sub is that Arda needs to play the 10 so that he can create chances for Mbappe. What I am not understanding however is Kroos did not play as a CAM and still created many chances for Madrid and was a key piece of our midfield. I feel like it would make more sense for the 10 to also have the threat of scoring, something that Jude has but Arda really does not. I think a lot of the characterizations of Arda (I love him and he deserves the praise) comes from some early dominance in the season when were playing teams that are really not that competitive. A bunch of those goals come from Mbappe's ability to develop plays considering of course that was what he was used to as a left winger. If Arda is truly that creative would we not see him succeed in the position he currently is in? Honestly I would ideally love to have Bellingham play further up (maybe 9), whoever is best fit in left wing between Mbappe and Vini, Mastantuono right wing, and Arda as 10. I have very limited knowledge so let me know what you guys think :)\n\nAlso please guys I love Arda, and I love the club. Im just trying to have a discussion, sometimes its scary to post here lmao.",
        "upvotes": 56,
        "comments": 57,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pg5cwa/arda_and_jude_confusion/"
    },
    {
        "id": "1pfyhok",
        "author": "ManuMora98",
        "title": "[Fem] Real Madrid 1 - 0 Real Sociedad | O.G. 43' | Very important win to overtake Real Sociedad in the table, who hadn't lost away in league yet. Next, Wolfsburg at home in the CL",
        "content": "",
        "upvotes": 46,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xztyusgi3n5g1.jpeg?auto=webp&amp;s=430269592272d2c214450a5c890550a7439c6d37"
        },
        "permalink": "/r/realmadrid/comments/1pfyhok/fem_real_madrid_1_0_real_sociedad_og_43_very/"
    },
    {
        "id": "1pfa4cg",
        "author": "FergieBall_FC",
        "title": "COMUNICADO OFICIAL: Real Madrid wins Supreme Court ruling against La Liga",
        "content": "COMUNICADO OFICIAL: \n\nReal Madrid C. F. expresses its satisfaction with today's Supreme Court ruling, which once again finds in favour of our club against LaLiga. \n\nThis ruling fully confirms the arguments put forth by Real Madrid against the illegal statutory amendment promoted by LaLiga in 2015. This illegal amendment altered the distribution of the clubs' audiovisual rights. \n\nThe Supreme Court has declared null and void the Second Additional Provision of LaLiga's Statutes, incorporated in 2015 without legal authorisation and aimed at altering the distribution of audiovisual revenues for the 2015-2016 season outside the scope of the law.  \n\n\nAs a result of this nullity, the valid distribution for that season must be that established by the Statutes at the time: \n\n\\* 60% of the revenue for First Division clubs. \n\n\\* 40% for Second Division clubs. \n\n\\* Equal distribution among all clubs within each category. \n\nTherefore, the applicable legal distribution entails the payment of approximately 88 million euros in additional funds, which were illegally withheld, to the clubs that played in the Second Division in the 2015-2016 season: Alavés, Albacete, Alcorcón, Almería, Bilbao Athletic, Córdoba, Elche, Gimnàstic de Tarragona, Girona, Huesca, Leganés, Llagostera, Lugo, Mallorca, Mirandés, Numancia, Osasuna, Ponferradina, Real Oviedo, Tenerife, Real Valladolid and Real Zaragoza.  \nIt also means that Real Madrid will receive the amount it was legally entitled to, some 8.8 million euros, of which it was also unlawfully deprived. \n\nThis ruling by the Supreme Court restores legality and ensures that decisions affecting Spanish professional football are always taken with full respect for the law and transparency.  \nThe Supreme Court's ruling completely dismisses the appeal filed by LaLiga and ratifies in full the ruling already made in favour of Real Madrid by the National High Court. \n\nThis ruling is of fundamental importance for the economic interests of the clubs that were then playing in the Second Division and for Real Madrid itself. \n\nWith this ruling, the Supreme Court confirms that Real Madrid and the aforementioned clubs were unlawfully damaged by LaLiga's actions. ",
        "upvotes": 579,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pfa4cg/comunicado_oficial_real_madrid_wins_supreme_court/"
    },
    {
        "id": "1pfpwca",
        "author": "Sl_PROXY",
        "title": "Our squad for the Celta Vigo match",
        "content": "",
        "upvotes": 39,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pfpwca/our_squad_for_the_celta_vigo_match/"
    },
    {
        "id": "1pftzw9",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against Real Sociedad (home) | Liga F Match Day 13",
        "content": "",
        "upvotes": 18,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l1vf84mq6m5g1.jpeg?auto=webp&amp;s=eb72a105082dcf6fd1ce7ef359a4ada2a3079d26"
        },
        "permalink": "/r/realmadrid/comments/1pftzw9/fem_our_starting_xi_against_real_sociedad_home/"
    },
    {
        "id": "1pflbl6",
        "author": "Ineedhelpistaken",
        "title": "What’s the outlook on Angelo Stiller at Real Madrid if the rumors are true?",
        "content": "So with rumors increasing about Angelo Stiller potentially being on Madrid’s radar, I’m curious what everyone here thinks in terms of fit and role.\n\nStiller is interesting because he’s not the typical flashy signing. I think he is more of a deep, intelligent midfielder with composure on the ball, very positionally aware, and strong in build-up phases.\n\nIf Madrid actually went for him:\n\n* **Where would he realistically play?** Is he someone you see rotating with Tchouaméni as a 6, or more like a Kroos-style left-sided pivot? Could he function as a double-pivot in certain matches?\n* **How would he be used tactically under our current system?** More of a possession controller? Press-resistant recycling guy? Or someone who could unlock play with vertical passes?\n* **Do we think he’d get minutes right away or be a “slow integration” type of signing?** There’s already a crowded midfield, so is this more of a depth/future-planning move or something that would actually change line-ups?\n\nI want to hear from people who watch him regularly like what’s his ceiling, and does he actually make sense for us going forward?\n\nCurious to hear thoughts from the community.",
        "upvotes": 30,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pflbl6/whats_the_outlook_on_angelo_stiller_at_real/"
    },
    {
        "id": "1pf363o",
        "author": "FlyingWaterMen",
        "title": "[as.com]Alonso has decided to give Vini Jr a new role on the pitch that makes him more comfortable. Instead of playing him as a pure winger, the coach will give him freedom to drift inside and play as a 2nd striker with Mbappé. The player is happy now and regains his confidence in the project",
        "content": "",
        "upvotes": 266,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Kr8q33wMX4WwU57OYqxZb0hwFeSX234k8cjmzaAlVvA.jpeg?auto=webp&amp;s=5706e87a6435959b3070d8a45dfb02e65c07a1b1"
        },
        "permalink": "/r/realmadrid/comments/1pf363o/ascomalonso_has_decided_to_give_vini_jr_a_new/"
    },
    {
        "id": "1pf1jsj",
        "author": "More-Judgment-9253",
        "title": "Real Madrid players with the most tackles in La Liga so far this season.",
        "content": "Apparently Jude's a striker according to some people though",
        "upvotes": 301,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j1q9j6jcaf5g1.jpeg?auto=webp&amp;s=9c56f42ab3c40309049e726265027f219adc949e"
        },
        "permalink": "/r/realmadrid/comments/1pf1jsj/real_madrid_players_with_the_most_tackles_in_la/"
    },
    {
        "id": "1pfcukn",
        "author": "Blue_WaffIe",
        "title": "I want to see Camavinga get more minutes",
        "content": "I was on the phone to my nan earlier this evening when we were discussing the 0-3 victory from earlier this week. She said Camavinga provides the aggression, ball-carrying skills, and press resistance we’ve been lacking recently. I tend to agree. He’s made 2starts in recent weeks, and both games have been our strongest yet. The man is in great form, while others are not. We should give him a chance.  My brother thinks the same and my neighbour, who is a Valladolid fan, didn’t really have an opinion. What do you guys think x",
        "upvotes": 68,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pfcukn/i_want_to_see_camavinga_get_more_minutes/"
    },
    {
        "id": "1peylb6",
        "author": "RMCFZIZ",
        "title": "Help me distinguish these autographs!",
        "content": "¡Hola Madridistas!\n\nCan you help me identify these autographs and whether they are legitimate? I don’t know what year it is from other than the shirt which is 03-04 I believe?\n\nI was gifted this shirt many years ago so don’t know the providence but it did come from my brother who lives in Madrid so hoping it is legit. \n\n¡Gracias por su ayuda!",
        "upvotes": 296,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y4s7ubufqe5g1.jpeg?auto=webp&amp;s=7e7e13fd546ef4fb620d9ff0b85aacab45ef5c78"
        },
        "permalink": "/r/realmadrid/comments/1peylb6/help_me_distinguish_these_autographs/"
    },
    {
        "id": "1pex3pu",
        "author": "AlekhineAl",
        "title": "Is anyone else worried about our creative output and set pieces without Trent Alexander Arnold for the next two months?",
        "content": "Trent’s range of passing and long balls were the main reason behind our first two goals last match. Alexis Mac Allister described Trent AA as the best passer he has ever seen. The Elche draw was secured due to his set pieces. How do you think Xabi tackles this issue? Should we use Mastantuano again in the lineup on the right side and he also took set piece duty for River Plate, so he could be handy. Or do you think we should trust Rodrygo again for the starting role?",
        "upvotes": 64,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pex3pu/is_anyone_else_worried_about_our_creative_output/"
    },
    {
        "id": "1pexo36",
        "author": "MugiwaraLobo",
        "title": "It’s time now to try the 3-5-2 formation against Celta Vigo.",
        "content": "Given Carvajal and Trent are out I think this would be a great time to move to this formation specially now that we have Militao and Rudiger back. Play them both back with Asencio. Carreras as a LM and Valverde as RM because we know they can handle covering goal to goal. Tchouameni as CDM to further reinforce the midfield and defense. Guler and Bellingham as CM or even both CAMs if we are dominating possession. Vini and Mbappe up top, me personally I would shock everyone and put Mbappe as LW and start Brahim or Gonzalo as RW. ",
        "upvotes": 54,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pexo36/its_time_now_to_try_the_352_formation_against/"
    },
    {
        "id": "1pdy28v",
        "author": "vil727",
        "title": "8 goals need in 4 games to move to 2nd all time after today's masterclass.",
        "content": "",
        "upvotes": 1154,
        "comments": 160,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9t76la7he65g1.jpeg?auto=webp&amp;s=b74e9da83db8041fd83b3929f7417ef56261a404"
        },
        "permalink": "/r/realmadrid/comments/1pdy28v/8_goals_need_in_4_games_to_move_to_2nd_all_time/"
    },
    {
        "id": "1pdx9dn",
        "author": "More-Judgment-9253",
        "title": "Teamwork for the second goal",
        "content": "That trent and fede connection on the right flank is beautiful btw",
        "upvotes": 1084,
        "comments": 55,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5rwyn7wz565g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pdx9dn/teamwork_for_the_second_goal/"
    },
    {
        "id": "1pefhww",
        "author": "CETERIS_PARTYBUS",
        "title": "It really feels like Camavinga and Trent help glue this system together",
        "content": "I hope I am so wrong. I hope I am the wrongest I've ever been, because as we know, they're both injured. \n\n\nIt's been an awful November in terms of football quality, dressing room drama and coaching decisions. \n\nYesterday we saw a glimpse of a light at the end of the tunnel. I just re-watched the match and the conclusion I'm drawing from it is that Trent's and Camavinga's quality is the difference between looking toothless and looking lethal. \n\nLike I said, I hope I'm wrong. \n\nDiscuss away",
        "upvotes": 89,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pefhww/it_really_feels_like_camavinga_and_trent_help/"
    },
    {
        "id": "1pdyvmg",
        "author": "leftnut106",
        "title": "Is this our best midfielder formation?",
        "content": "",
        "upvotes": 472,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/73zahao5m65g1.jpeg?auto=webp&amp;s=2378f8dcb25f667652888fc303304af8c137f3f8"
        },
        "permalink": "/r/realmadrid/comments/1pdyvmg/is_this_our_best_midfielder_formation/"
    },
    {
        "id": "1pe43q9",
        "author": "Chance-Weather-8157",
        "title": "Mbappé is 5 goals away from breaking Cristiano’s 59-goal calendar-year record… and he has 4 games left.",
        "content": "We may be living through something historic soon.\n\nAs of **Dec 4, 2025**, **Kylian Mbappé has 55 goals** for Real Madrid in the 2025 calendar year — and he’s officially hunting the untouchable: **Cristiano Ronaldo’s 59-goal masteryear of 2013**.\n\n**The math is simple:**  \n• **4 goals** = tie Ronaldo  \n• **5 goals** = break the record  \n• **4 matches remaining**\n\n==\n\n**The remaining fixtures:**  \n• **Celta Vigo (H)** – the ideal match to bag 2-3 goals  \n• **Manchester City (H)** – Champions League night at the Bernabéu  \n• **Alavés (A)** – the classic trap game  \n• **Sevilla (H)** – will be tough\n\nHe needs **5**. His form says he can do it (**7 goals in his last 3 matches**).  \nThe Bernabéu is ready. The calendar-year throne Cristiano built in 2013 is shaking.\n\nIf Mbappé pulls this off, he becomes the first Madrid player *ever* to touch **60 goals** in a calendar year \n\n**We might be 17 days away from witnessing the passing of an era.**\n\n",
        "upvotes": 239,
        "comments": 61,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pe43q9/mbappé_is_5_goals_away_from_breaking_cristianos/"
    },
    {
        "id": "1pe3aak",
        "author": "Tiften11",
        "title": "My small oil painting of the undisputed GOAT. Oil on wood panel",
        "content": "",
        "upvotes": 192,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cg9gxmg2k75g1.png?auto=webp&amp;s=f71465c4b6c45338b7bdd8debd7d1e930481a65f"
        },
        "permalink": "/r/realmadrid/comments/1pe3aak/my_small_oil_painting_of_the_undisputed_goat_oil/"
    },
    {
        "id": "1pdz0g9",
        "author": "No-Independent2522",
        "title": "[Arancha Rodríguez] Trent has suffered a muscular injury in the anterior rectus of the quadriceps in his left leg. He will be out for around 2 months.",
        "content": "",
        "upvotes": 242,
        "comments": 96,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pdz0g9/arancha_rodríguez_trent_has_suffered_a_muscular/"
    },
    {
        "id": "1pe45js",
        "author": "Laytnkr",
        "title": "You guys need to chill",
        "content": "Whenever I open this sub after a match it's madness.\n\nWe play decent at best and win: holy shit we are so back. This is the perfect system for Madrid!! \n\nWe play decent at best and lose: holy shit, idk what's going on with \"insert player/coach\".\n\nHave you not seen how after the first 10 minutes bilbao had incredible chances to score goals and courtois saved us like he always does? \n\nStop seeing everything black and white. One day we are incredible and SOO BACK next day we are horrible and Xabi needs to go.\n\nSame thing for Vini and Xabi, they hugged and this sub: yeah see the media was lying they love each other. \n\nAre you seriously this delusional? There are things going on behind the scenes and it's obvious. Maybe they talked and found a solution. But don't act like there has never been something going on\n\nBe happy about our win but stop acting like everything went fine. It didn't. Mbappe turned up and decided he wanted us to win the match. This didn't look as convincing as most of you act. A more lethal striker of the opponent would have changed this game incredibly fast \n\n",
        "upvotes": 97,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pe45js/you_guys_need_to_chill/"
    },
    {
        "id": "1pddoir",
        "author": "No-Independent2522",
        "title": "Mbappe scores from outside the box 3-0",
        "content": "",
        "upvotes": 3418,
        "comments": 132,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yuq4m59mh15g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pddoir/mbappe_scores_from_outside_the_box_30/"
    }
]