[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 700,
        "comments": 5161,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nwfelp",
        "author": "InsaneCookies21",
        "title": "Just to put this in perspective. Breaking Bad had 62 episodes in 5 1/2 years.",
        "content": "While Stranger Things will have 20 FEWER episodes at 42 in 9 1/2 years... absolutely ridiculous. So in nearly double the time, Stranger Things produced two-thirds the amount of content.",
        "upvotes": 299,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1nwfelp/just_to_put_this_in_perspective_breaking_bad_had/"
    },
    {
        "id": "1nwcu16",
        "author": "SmartStar65",
        "title": "Elon Musk Doubles Down On Netflix-Bashing Over Trans Cartoon Character Park'",
        "content": "",
        "upvotes": 155,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1nwcu16/elon_musk_doubles_down_on_netflixbashing_over/"
    },
    {
        "id": "1nwk2h5",
        "author": "Ember_Grove20",
        "title": "What’s the first show or movie you ever watched on Netflix?",
        "content": "I was just thinking about how long I’ve been using Netflix and realized I honestly can’t remember what the very first thing I watched was. Now I’m curious if anyone here actually remembers theirs. What was your very first Netflix watch, and do you still think about it?",
        "upvotes": 17,
        "comments": 125,
        "media": null,
        "permalink": "/r/netflix/comments/1nwk2h5/whats_the_first_show_or_movie_you_ever_watched_on/"
    },
    {
        "id": "1nwbl5v",
        "author": "pogonotomy_lover",
        "title": "I liked Wayward and I don't understand the criticism",
        "content": "The series premiered exactly a week ago, I watched it, and I enjoyed it. I didn't once think the actors were bad, a criticism I've seen a couple of times in reddit discussions. I was also very surprised by how they managed to make the dialogue between Leila and Abbie sound realistic and natural compared to how they've made teenagers speak in other Netflix shows, and I appreciated that.\n\nI definitely have no experience in entertainment criticism or analysis; the only way I judge whether the acting was good or bad is how much I believe the actors, and therefore how much I can focus on the plot. This is, of course, very subjective, but the only time I felt a little disconnected from the plot was with Abbie's father. I didn't fully believe his character's outburst or his overall persona, but I don't think he had more than 15 minutes of screen time, and I don't consider it \"bad\" acting—just less compelling. I truly don’t think this show had \"bad actors\". \n\nI think most of the criticism I’ve read comes from people that aren’t the show's target audience, which, from my perspective, seems to stem from their personal biases against queer people or from not connecting with or relating to the show's theme, which is intergenerational trauma and how it can cause children, teens, and eventually adults to feel the weight of their parents' unresolved grief or trauma, resulting in deep guilt and a sense of being \"bad kids\", even before they’ve developed a moral compass or an integral sense of self. \n\nAs for the protagonist, I can’t thank Mae Martin enough for the representation they gave the trans community in this series. I’ll save that aspect of this review for another subreddit though, as I have read very ignorant and rude comments regarding Mae Martin’s character, Alex, and I hope to minimize that aspect of the discussion in this post. \n\nI think the show does an incredible job of showing that there are no \"bad kids,\" but rather they are a direct result of their environment and the extremes parents or families go to in order to \"cope\" with their children, rather than working on themselves or simply trying to connect with them from a place of love, understanding, and empathy. I think all parents should go to therapy at least a few times, which I recognize is a statement that stems from and leads to something much deeper from a historical, sociopolitical, and evolutionary perspective. But, I think many parents should have gone to therapy before having children, and the series does a great job of taking that feeling and amplifying it to a psychological thriller level, while also depicting the dangers of retreats, programs, and poorly researched and unethical therapeutic methods for minors.\n\nOne of Sydney Topliffe's (Abbie) lines from Episode 1, \"When you had kids, what the f\\*\\*\\* did you imagine it would be like?\" that she says to her dad in an outburst, really struck me. I think it captures the incomprehension and frustration that so many children and teenagers feel: \"Why did my parents even have kids?\" Meaning, \"Why did this person or these people bring me into the world only to make me feel every day that they wish they hadn't?\" or “Did they create an idea or expectation of children and family, if any, in their heads that I'm not living up to, or do they simply not like me as a person?” Even though it could never be the kid’s fault truly, they are made to feel as though it is. Another line that captures this sentiment is Toni Collete's (Evelyn) line in Episode 7: \"Birth is... nonconsensual.\" \n\nI've also seen criticism that there are plot holes. I finished the series today, and I can't say with complete certainty that I found any plot holes per se, but I did feel that some things were left “up in the air”. For example, I think some character's subplots felt a bit rushed; it would have been interesting to know more about many of them (e.g., Riley and Maurice), but I also understand that it's a miniseries and covers topics that could give much more screen time in order for them to thrive.\n\nAs for the toads (I think cane toads), I do think they're simply symbolic. They're an invasive species that has taken over the town, and in one way or another, they're everywhere, just like Evelyn. Depending on the culture, they also represent different things, such as fertility and abundance, transformation and rebirth, healing and purification, among others (Logan, 2024). All of the articles I found about toad and frog symbolism can be closely associated with the series, including those that presented a negative and evil interpretation of frogs and toads, as most of the characters have different or opposite perspectives of Evelyn, many having both throughout the series and their character's development. Also, I'm sure the show implies that the toads have a role in the making of the drug used on the graduates, which isn't so far fetched in a science-y fiction way as there are psychedelic amphybians. The fact that the phase is called \"The Leap\", is probably also a play on the fact that frogs jump or \"leap\" from one place to another. I also think it could symbolize the term \"leapfrog\", which according to Cambridge Dictionary, can also be used as a verb to describe: \"to improve your position by going past other people quickly or by missing out some stages\". Maybe this could be interpreted as wanting to heal and become your new self with Evelyn's drug quickly, without going through a much longer process of healing and learning to live with your trauma, by facing your past, yourself and others, but that could just be a personal interpretation.\n\nI also read some reviews that said the series dragged on too long, something I personally disagree with. I think almost every aspect of the series contributed to the plot and deserves analysis from an entertainment perspective, but also from a psychological one. If anything, I sometimes felt it was fast paced and I hope they decide to renew for a second season.\n\nIn the future, I would love to rewatch this series with even more attention to detail, as I thoroughly enjoyed it and believe it has incredible potential, I hope Mae Martin takes up more production and acting roles as well.",
        "upvotes": 35,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1nwbl5v/i_liked_wayward_and_i_dont_understand_the/"
    },
    {
        "id": "1nwp130",
        "author": "Catevagreen",
        "title": "Another Wayward Post. I liked it.",
        "content": "It was really nice to see the kids come from Toronto. I’m Canadian and I could understand these teenagers. We don’t really have reform schools here. I think they were banned. We made conversion therapy illegal a few years ago. So sending young girls to America is plausible.  \n\nI completely remember having a sketchy friend for a ride. He had a car like that. The whole scene where ditches Lelie is on point. Sketchy guys were never far behind. But she does make it across the border. That’s some guts without back up. \n\nI kept watching because that griped me. I was a fucked up Canadian teenager. I’d be terrified in the states. You don’t have the same laws and I would feel much more in danger. This to me more of harrowing tale just from that perspective.  \n\nIf you don’t like Mae Martin I find that disheartening. They he/she wrote an award winning show called ‘Feel Good’ for Netflix a few years back. It’s all about how hard it is be different and hurting inside. I think it was very good and taught me a lot about Trans people. I was glad to see Netflix give them another show. \n\n\n\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nwp130/another_wayward_post_i_liked_it/"
    },
    {
        "id": "1nwr8ig",
        "author": "charlotte_marvel",
        "title": "A Netflix original series that I saw on my account without using VPNS is now no longer showing up",
        "content": "I can't find the summer hikaru died and the fragrant flower blooms with dignity despite the fact they have been accessible in my country up untill this point \n\nHelp me I'm confused ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nwr8ig/a_netflix_original_series_that_i_saw_on_my/"
    },
    {
        "id": "1nwr4mg",
        "author": "relicmaker",
        "title": "Monsters Ed Gein",
        "content": "Monsters Ed Gein. What happened? It’s been showing as Coming Soon but now it’s gone? I’ve been looking forward to watching this show! Does anyone know what’s happened?",
        "upvotes": 2,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1nwr4mg/monsters_ed_gein/"
    },
    {
        "id": "1nwu5fr",
        "author": "alwaysaloneinmyroom",
        "title": "My netflix showing the same trailer for 3 or 4 different movies",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nwu5fr/my_netflix_showing_the_same_trailer_for_3_or_4/"
    },
    {
        "id": "1nw0no9",
        "author": "asdfghanjkl",
        "title": "thoughts on Wayward",
        "content": "here's mine: it could've been a 2-hour movie.\n\nloose ends, plot holes, has so much potential but the plot is struggling and scrambling. I thought the acting was great (especially Toni's and all the Tall Pines Academy kid(?) actors), however the flow was a bit too draggy. I sat through the whole thing and binged without any skips, but I wished I did, or at least watched it in a faster speed. I saw a lot of people having so many questions after watching, and I get it. I feel the same way too, and how I truly wish it could've been a movie instead. not the best series, but it's dragging me to watch it enough even though with a very loose thread. interesting concept though!",
        "upvotes": 50,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1nw0no9/thoughts_on_wayward/"
    },
    {
        "id": "1nwsnc6",
        "author": "Ok-Assist5226",
        "title": "Does Netflix purposely download their originals/exclusive content when you turn on Downloads for You?",
        "content": "Each time I turn on Downloads for you on Netflix, I say about 90%(thats being generous it could be more) of the content that gets downloaded is their Netflix originals/exclusive content. And the to be honest I wouldn’t mind if they at least they download the content they curated to my ratings and content I have watched. 100% of the time they release an Netflix original it’s gets downloaded so that’s why I think they are purposely doing it but I just want to see if any other people feel the same ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwsnc6/does_netflix_purposely_download_their/"
    },
    {
        "id": "1nwsk3w",
        "author": "zoeiszesty",
        "title": "Why is this show taking up my comedy search?",
        "content": "https://preview.redd.it/4gf5l86jmusf1.png?width=1847&amp;format=png&amp;auto=webp&amp;s=c97f26522e4818cd2a39e7a7bada3eb5436b3f22\n\nI'm beyond confused? It's an Indian comedy show, but they're showing it as 2 minute clips and its all i'm seeing when i look up comedy, just beyond confused about this, I don't even speak any Indian languages.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nwsk3w/why_is_this_show_taking_up_my_comedy_search/"
    },
    {
        "id": "1nweex3",
        "author": "National-Poet-9165",
        "title": "Dark hits completely different on the second watch.",
        "content": "https://preview.redd.it/2j34fra29rsf1.png?width=480&amp;format=png&amp;auto=webp&amp;s=74fa63368f29e7da0c24f7f37531da3ae8544d18\n\nThe first time through, my brain was just in survival mode trying to keep up with who’s who. On my rewatch, it feels like a completely new show, I catch so many subtle details and emotional setups that flew over my head before.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nweex3/dark_hits_completely_different_on_the_second_watch/"
    },
    {
        "id": "1nwp2ta",
        "author": "Joylar7",
        "title": "Alice movie spoilers",
        "content": "Spoiler: how is Alice’s husband alive at the end. Wasn’t he shot dead after running away? \n\nI was so confused or did I get it wrong. He has a crutch and was standing on one leg ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwp2ta/alice_movie_spoilers/"
    },
    {
        "id": "1nwjxvp",
        "author": "laurlu",
        "title": "Netflix on Roku TV",
        "content": "Is anyone else’s Netflix App on their Roku TV absolutely horrible? I don’t know if it’s my tv getting old or what, but the Netflix app is god awful. It’s extremely quiet compared to the rest of my streaming services, it glitches out if I try to pause/fast forward/rewind, it will literally make my tv crash back to the main menu. And if it makes my TV freeze, it takes like 10 minutes for the app to close out and take me back to my home screen. None of the other streaming apps do this on my Roku tv so that’s why I’m thinking it’s a Netflix-only issue. I’m so annoyed!!!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nwjxvp/netflix_on_roku_tv/"
    },
    {
        "id": "1nwes3c",
        "author": "Turbulent_Pipe_2391",
        "title": "need recommendations for dual subtitles and larger font",
        "content": "hi, total newbie to netflix. literally installed it to learn another language by watching movies. do you have any good recommendations to display subtitles in two different languages? what about showing the subtitles in a larger font (I know that netflix allows to change font, but the largest is still not enough because I'm sitting far from the screen and the screen is not big)\n\nwould be great if the recommended browser extensions were free",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nwes3c/need_recommendations_for_dual_subtitles_and/"
    },
    {
        "id": "1nwkwvk",
        "author": "pocketrob",
        "title": "Billionaire's Bunker Inconsistency",
        "content": "When Asia is playing her sister's phone videos, and they show a shot of her and Max... Does anyone else get the urge to shout at the screen: Who's filming them?! 😂",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwkwvk/billionaires_bunker_inconsistency/"
    },
    {
        "id": "1nvncdg",
        "author": "lil_sass-a-frass",
        "title": "Wayward was addictive. Kept me hooked throughout.",
        "content": "Admit I thought it was gonna be boring during the first episode but really had me guessing and almost watched the whole series in one sitting just to see what was next. Sometimes Netflix hits good with with a show like that. Was a bit disappointed that the ending did not turn out how I expected! Definitely made it even more thought provoking though.. ",
        "upvotes": 89,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1nvncdg/wayward_was_addictive_kept_me_hooked_throughout/"
    },
    {
        "id": "1nw215d",
        "author": "Significant-Fun-4235",
        "title": "Please dont make this a trend for all non-US shows!!!",
        "content": "*Processing img 71tjd244wosf1...*\n\nI swear I was already pissed when Squid Game America was announced, but to even see someone is actually thinking about an Alice in Borderland spinoff is baffling! If this happens, maybe the future will show us Stranger Things China, Wednesday Korea, or Bridgerton South Africa. ",
        "upvotes": 9,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1nw215d/please_dont_make_this_a_trend_for_all_nonus_shows/"
    },
    {
        "id": "1nvnqx2",
        "author": "lil_sass-a-frass",
        "title": "Unpopular opinion: House of Guinness was shite.",
        "content": "Script, screenplay and directing all seemed really lacklustre . Almost like a Bridgerton version of peaky blinders. Everything about the lady from cloonboo, the fenians, raffertys fake accent, even the affair with him and Anne (the cat thing was just cringe) and Arthur’s secret.  It all just felt so fake, put on and farcical to be believed.  Like the titanic love story or something. They could have done it so much better but it just fell so flat to me. ",
        "upvotes": 71,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1nvnqx2/unpopular_opinion_house_of_guinness_was_shite/"
    },
    {
        "id": "1nvumgb",
        "author": "daniellim1121",
        "title": "Alice in Borderland Season 3 Summary in 3 Photod",
        "content": "",
        "upvotes": 24,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1nvumgb/alice_in_borderland_season_3_summary_in_3_photod/"
    },
    {
        "id": "1nwhjq3",
        "author": "mooman413",
        "title": "List of available movies/shows available anywhere?",
        "content": "Is there a way to see a list of all the movies on Netflix or are the only movies/series available just on my login screen?  For example, if I'm not in the mood for any of the shows that pop up my home screen, is there a master list I can surf through to find something I'm in the mood for?  Not necessarily the search function because often I don't know what I want to watch until I see the title.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwhjq3/list_of_available_moviesshows_available_anywhere/"
    },
    {
        "id": "1nw97nh",
        "author": "WallT73",
        "title": "iOS26 and sound sync off?",
        "content": "Anyone has any info on either what to do or something official from Netflix about problem with sound sync (I have an iPhone 15 plus) after upgrade to iOS26 ? ... It's super annoying",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nw97nh/ios26_and_sound_sync_off/"
    },
    {
        "id": "1nvydju",
        "author": "mgepark",
        "title": "Angela - new series",
        "content": "I binged it in under one day and thought it was great. Veronica Sanchez put in a great performance. 6 fast moving episodes. Thank you Netflix for another great series. ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nvydju/angela_new_series/"
    },
    {
        "id": "1nwkdgd",
        "author": "Beaudoiin",
        "title": "Netflix cutting portions of film",
        "content": "I have watched several movies and shows where there is about 2 to 5 seconds that appear cut right before the movie switches scenes. Almost as if at each chapter you would see on a DVD version looses a few seconds before it cuts to the next.\nIt's cutting mid sentences. I have seen it in dozens of movies! Not just like rated and unrated versions, it's even when nothing seemingly important is happening. If I rewind it, it does the same teeming at the same moment! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwkdgd/netflix_cutting_portions_of_film/"
    },
    {
        "id": "1nw892h",
        "author": "TheWrestlingGod_2004",
        "title": "I need help finding the ID for a show",
        "content": "I was looking through the viewing activity when I saw one of the shows I watched was gone. I know Netflix will remove shows so I try to see what was removed but I couldn't check. I did get it's ID number: 70176308. If someone here can help me, thank. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nw892h/i_need_help_finding_the_id_for_a_show/"
    },
    {
        "id": "1nwp2dg",
        "author": "Wylershipper09",
        "title": "If Wyler Had Their Own Episode in Season 3…🖤",
        "content": "Here are two pictures, the first is fan-made (credit: @viviwonders01 on TikTok), and the second is from the show. Had to include both to set the mood.\n\n\nOkay, I can’t stop thinking about Wyler, so I pulled together my dream scenes for Season 3. These are just fan ideas (no S2 spoilers), not in order, just the moments I’d die to see between them.\n\nScene 1: Jealousy Sparks – First Encounter (Final Version)\nWednesday is tracking Enid through the woods when she stumbles upon a remote encampment, a hideout for Hydes. She stops dead when she sees Tyler among them. He’s older, harder, but those eyes are unmistakable.\nWednesday (cold, guarded): “You’re the last person I expected to find here.”Tyler (half-smirk, but there’s a flicker of something softer): “Guess the woods like throwing surprises.”\nHe steps closer, voice low.Tyler: “I can help you find Enid.”Wednesday (flat): “How could I possibly trust you?”\nTyler doesn’t answer immediately. Out of the corner of his eye, he catches a Hyde pack member approaching to give Wednesday directions. He watches the man speak to her, muscles in his jaw tightening, jealousy flickering with something darker.\nInside Tyler’s head: That guy. And a hundred others. They’re all better for her than me. I’ll never deserve her, not after what I’ve done. But I’m not letting anyone else have her.\nTyler’s hand brushes a pot plant on the table. With a sudden flick, it crashes to the ground.Tyler (dry, almost mocking): “My hand slipped.”\nThe Hyde lingers a moment too long, and Tyler’s eyes darken.Tyler (voice even lower, dangerous): “Who does he think he is? You’re mine, Little Braids.”Wednesday (smirking, arching an eyebrow): “Is that… jealousy?”Tyler (smile fading, eyes dark): “Jealousy doesn’t begin to cover it.”Wednesday (quiet, but cutting): “Then stop looking at me like I’m yours, Tyler. That’s not how you earn your way back.”\n\nScene 2: The Woods, North of the Canadian BorderEnid is missing in her wolf form. Wednesday won’t stop searching, and Tyler refuses to let her go alone.\nTyler: “She said the woods would always keep me safe. Feels like they’ve turned on me.”Wednesday: “The woods don’t betray. People do. Trees are indifferent, like me. Learn from them if you want to survive.”Tyler: “Trust you to turn survival into poetry.”\n\nScene 3: The Angry Love ConfessionWhen someone insults Wednesday, Tyler loses control. His fury spills into the truth he’s been hiding.\nTyler: “Say it again and I’ll bury you for it.”Wednesday: “You didn’t have to—”Tyler: “Of course I did. Because I love you. You’ve haunted me since the day we met. Whether you accept it or not, you’re mine, Little Braids. I only have eyes for you.”\nWednesday (after a beat, low voice): “Possession doesn’t scare me, Tyler. It excites me… and if I’m being honest with myself, I’ve thought about saying your name when I shouldn’t. You’re a danger I can’t resist… my Monster.”\n💋 Their kiss is sharp, dark, inevitable.\n\nScene 4: Wednesday’s Narration“Love is a disease I thought I’d never catch. Feelings expose you, weaken you. But Tyler saw everything I swore to bury. And despite every reason not to… I love him. Without him, every day feels hollow.”\n\nScene 5: Tyler’s Grief &amp; ApologyTyler: “You’re the only one left who really sees me. And I can’t lose you too.”Wednesday: “Pathetic. You sound like every grieving soul clawing at the dirt.”Tyler: “I don’t deserve forgiveness. But I need to know one day you’ll give it to me… or I’ll never stop hating myself.”Wednesday (quiet, firm): “Don’t beg for forgiveness. Earn it. And if you do… maybe I’ll let you keep me.”\n\nScene 6: Favourite TortureTyler: “You’re the kind of pain I’d bleed for.”Wednesday: “The kind you won’t survive.”Tyler: “Then let me die happy… in your hands.”Wednesday: “Careful, Tyler. I enjoy making promises like that come true.”\n\nScene 7: Kidnapping/DangerIf Wednesday is captured:Tyler: “Touch her and you’re already dead.”Wednesday: “Wednesday Addams doesn’t die, Tyler. I’ll write your eulogy before my own.”\nIf Tyler is trapped:Tyler: “You could’ve left me. But you didn’t.”Wednesday: “No. I couldn’t. Because monsters deserve someone who won’t run.”\n\nScene 8: Wednesday Takes ControlAfter betrayal, Tyler submits to Wednesday’s lead. The power shift only makes their bond sharper, darker, and undeniable.\n\nScene 9: Proving HimselfTyler protects Enid, then later risks his life for Wednesday’s family. In doing so, he finally proves he deserves a place at her side.\n\nScene 10: Gothic Romance Moments\n* A kiss to the haunting sound of Wrong by Chris Grey.\n* A Phantom of the Opera dance, starting with Tyler kissing her hand.\n* Wednesday finds a hidden sketch of herself in Tyler’s notebook. Proof she’s consumed him too.\n\nScene 11 (The Unspoken Truth – updated):\nTyler: “Tell me the real reason you missed.”Wednesday (quiet, almost a whisper): “Because even I can’t help caring for someone like you. Even when I wish I didn’t. It eats me alive that I still care for you. You’re someone I shouldn’t care for. I never get eaten alive, Tyler. Other people get eaten alive by me.”Tyler (smirking, but there’s pain behind it): “Then hate me forever. At least it means you’ll never forget me.”Wednesday (soft, almost dangerous): “I don’t forget monsters, Tyler. I study them. And one day… I decide what to do with them.”\n\nScene 12: Choosing Her Over the PackTyler: “You think she’s not worth it? She’s worth more than every secret you’re hiding. She’s worth everything. I’m choosing her. You never mattered.”Wednesday: “Finally, the Hyde made one smart decision. Don’t make me regret it.”Tyler: “I won’t. Not when it’s you, Little Braids.”\n\nBonus Scene: The CaveSearching for Enid, they get trapped inside a cave. By torchlight, Wednesday carves sharp symbols into the stone while Tyler watches.Tyler: “You make even the dead feel alive.”For a heartbeat, she almost lets herself smile.\nBonus Scene: Featherweight in My ArmsWednesday stretches for something just out of reach, and Tyler swoops in, gripping her waist to lift her effortlessly.Tyler: “You weigh nothing in my arms… like a feather.”Her eyes widen for just a second at his arms and abs before she quickly looks away.\nWhich of these moments would you want to see most in Season 3? Drop your favorites in the comments so we can scream together lol.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nwp2dg/if_wyler_had_their_own_episode_in_season_3/"
    },
    {
        "id": "1nwazsg",
        "author": "notyouratul",
        "title": "Is it me or the subtitle of new series on Netflix hard to read?",
        "content": "I mean I all the new series or movies, the subtitle are pails, not pure white. It's hard to read.\n\nBut when I watch old series/movies, It's pure white.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nwazsg/is_it_me_or_the_subtitle_of_new_series_on_netflix/"
    },
    {
        "id": "1nwj18g",
        "author": "Therian_alexis",
        "title": "This is the type of stuff on Netflix that pmo.",
        "content": "won’t let me leave, won’t let me refresh, and just won’t work",
        "upvotes": 0,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5e5t86km5ssf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nwj18g/this_is_the_type_of_stuff_on_netflix_that_pmo/"
    }
]