[
    {
        "id": "1if0swi",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1if0swi/la_piola_friends_meetup/"
    },
    {
        "id": "1if0swb",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1if0swb/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1imab6p",
        "author": "Wonderful_East_5741",
        "title": "unpopular opinion, la gtt fa schifo perchè ci sono TROPPE macchine",
        "content": "okay non è solamente quello il problema ma sicuramente la grande maggioranza d'esso è rappresentata dalla moltitudine di macchine presenti nelle strade torinesi. \n\nbasti pensare ad i tram che non riescon a passare per macchine posteggiate sui binari oppure bus che rimangono bloccati nel traffico. \n\ntorino deve iniziare, a mio avviso, a prendere decisioni forti per quanto riguarda le macchine. è una città super vivibile a piedi.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1imab6p/unpopular_opinion_la_gtt_fa_schifo_perchè_ci_sono/"
    },
    {
        "id": "1ima6h4",
        "author": "Legitimate-Boss4807",
        "title": "Paradosso torinese: ci sono molti ansiosi da fare amicizia, ma allo stesso tempo nessuno riesce a trovare persone ansiose da fare conoscenza",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vvg6reaf9cie1.jpeg?auto=webp&amp;s=ea4bc65d786bc474702a1fed069687bc82c9a302"
        },
        "permalink": "/r/torino/comments/1ima6h4/paradosso_torinese_ci_sono_molti_ansiosi_da_fare/"
    },
    {
        "id": "1im78zv",
        "author": "Careless_Way_3818",
        "title": "Fare amicizia a Torino",
        "content": "Salve gente sono campano, ho 25 anni e da poco mi sono trasferito a Torino zona Millefiori sud per lavoro, tuttavia noto che è abbastanza difficile fare amicizia o comunque conoscere persone con cui scambiare due chiacchiere. Vorrei chiedere se ci fosse qualche gruppo di persone che organizza party di dnd o comunque qualche gruppo whatsapp/telegram o simili dove poter conoscere persone per una birretta e/o scambiare due chiacchiere. Qualsiasi consiglio e ben accetto.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1im78zv/fare_amicizia_a_torino/"
    },
    {
        "id": "1im60pg",
        "author": "everythingisplanned",
        "title": "Gioiellerie a Torino",
        "content": "Ciao, cerco gioiellerie a Torino che abbiano marchi italiani locali con design moderni. Niente di troppo costoso, cerco solo argento sterling o placcato oro. Grazie!!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1im60pg/gioiellerie_a_torino/"
    },
    {
        "id": "1im8afz",
        "author": "mo_one",
        "title": "Amicizie queer a Torino?",
        "content": "Ehilà, sono un ragazzo auDHD bi di 21 anni, abito a Torino da circa due anni, e vorrei fare più amicizie nella comunità queer dato che non uscivo molto lol\n\nFaccio informatica alla UniTo, mi piacciono i giochi da tavolo ed GdR, ed altre cose nerd in generale. A volte scrivo, e vorrei imparare a disegnare. Mi piace quardare serie TV, anime, e film. E ho un interesse nelle lingue. Se vi va di fare conoscenza, commentate pure al post o scrivetemi in DM 🤗",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1im8afz/amicizie_queer_a_torino/"
    },
    {
        "id": "1im7b9c",
        "author": "Careless_Way_3818",
        "title": "Aprire gruppo whatsapp/telegram per conoscerci",
        "content": "Cosa ne dite se apriamo un gruppo whatsapp/telegram per conoscerci a Torino o se già esiste qualcosa di simile potete linkarmelo?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1im7b9c/aprire_gruppo_whatsapptelegram_per_conoscerci/"
    },
    {
        "id": "1ilkx1q",
        "author": "TheMagneto18",
        "title": "La situazione affitti mono-bilocali a Torino. - cuccolandia - post sfogo",
        "content": "Raga post sfogo,\n\noggi dopo aver visto l'ennesimo annuncio immobiliare (in inglese prima lingua!) dove si chiedevano 2200 euro al mese per un MONOLOCALE di 50mq...bello eh, ristrutturato di pacca, bagno cieco, primo piano zona vicino porta nuova....\n\nse si va verso sansalvario la situazione migliora di poco, cifre vicine a 1000 euro per appartamenti decenti e a 800 per dei \"buchi\". \n\nSe si va vicino a porta susa la situzione peggiora ulteriormente...manco a parlarne. \n\nLe agenzie squalo ormai chiedono 3 (TRE!) mensilità di caparra e 2 (due!) mensilità di commissione...della serie che se io domani voglio entrare in una casa devo \"cagare\" 5000 euro se va bene...\n\nMa un pendolare cosa deve fare per non mangiarsi tutto lo stipendio e vivere vicino alle stazioni? (potrei andare in aurora o lingotto o zone degradate...ma qualità della vita?) \n\nA sto punto conviene davvero fare un mutuo e comprare con la bolla in atto anche se devi vendere tra 2-3 anni finisce che ci guadagni...\n\n",
        "upvotes": 31,
        "comments": 96,
        "media": null,
        "permalink": "/r/torino/comments/1ilkx1q/la_situazione_affitti_monobilocali_a_torino/"
    },
    {
        "id": "1ilumb4",
        "author": "Active_Quail_6520",
        "title": "Andare in giro",
        "content": "Ciao a tutti! \nAndrò presto a Torino e mi piacerebbe un po' di vita notturna.\nPotreste consigliarmi dei luoghi come bar/pub dove si può fare amicizia?.\n(F+30)\nGrazie ragga",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ilumb4/andare_in_giro/"
    },
    {
        "id": "1ilbqjg",
        "author": "CryingAlwaysCrying",
        "title": "Guidare a Torino è un pericolo",
        "content": "Perché sembra che a Torino si guidi come in un folle videogame? Sorpassi azzardati, precedenze ignorate, anziani di 90 anni al volante… Non è solo fastidioso, è pericoloso.   \n  \nOgni volta che esco, sono terrorizzato: le macchine volano, superano i limiti di velocità senza pensarci due volte. È un incubo. E sapete qual è la parte più divertente? La maggior parte di loro sono anziani o signori, non ragazzini come tutto dicono a sotto voce. \n\n**E non finisce qui**: le auto normali parcheggiano regolarmente nelle aree di ricarica per i veicoli elettrici, e delle piste ciclabili non importa nulla a nessuno, tanto che vengono invase continuamente.\n\nMa come, seriamente?   \n  \nNon è accettabile che chiunque, a qualsiasi età o con qualsiasi stile di guida, continui a circolare senza alcun controllo.   \n  \nNon sarebbe meglio un sistema per rivalutare le capacità di guida dopo una certa età, o almeno un modo chiaro e facile per segnalare chi mette a rischio gli altri? **Dimmi: si può fare qualcosa? Si può segnalare questo problema in un'app o qualcosa del genere?**",
        "upvotes": 112,
        "comments": 138,
        "media": null,
        "permalink": "/r/torino/comments/1ilbqjg/guidare_a_torino_è_un_pericolo/"
    },
    {
        "id": "1im2hjv",
        "author": "Learn_new_things_",
        "title": "Infissi",
        "content": "Ciao, qualcuno ha da consigliare una ditta dove rifare gli infissi? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1im2hjv/infissi/"
    },
    {
        "id": "1ilcc0r",
        "author": "LuxJupiterian",
        "title": "Cattive persone",
        "content": "Parcheggi, torni, bestemmi.\nOvviamente scappati senza lasciare un bigliettino.\n\n",
        "upvotes": 22,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d78z673eh3ie1.jpeg?auto=webp&amp;s=12d7afa2fc0d269cfd5bd761df61d0cd945acebd"
        },
        "permalink": "/r/torino/comments/1ilcc0r/cattive_persone/"
    },
    {
        "id": "1ilu71n",
        "author": "Rigel_e3",
        "title": "Musicisti???",
        "content": "C'è qualche batterista metalcore/emo che sappia usare il doppio pedale a torino o provincia? Sembra che non esistessero ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ilu71n/musicisti/"
    },
    {
        "id": "1ilnz8y",
        "author": "akunamatattaa",
        "title": "tennis a torino",
        "content": "ciao a tutti, sono uno studente universitario che vorrebbe riprendere un po' a giocare a tennis magari nei campi del cus. Qualcuno che ha più o meno la mia età che vorrebbe unirsi?\nlivello tra il principiante e l'intermedio.\nP.s. La mia idea sarebbe quella di creare un gruppo tg o wp dove organizzare per anche altri sport",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ilnz8y/tennis_a_torino/"
    },
    {
        "id": "1ilpbkb",
        "author": "MaitreRostam",
        "title": "Le vostre opinione su San Donato Basso (dopo corso Regina)  ?",
        "content": "Buongiorno a tutti, sono in ingegnere stragnero a Torino per un anno a minima.\nHo trovato un Buon bilocale nella zona San Donato doppo il corso Regina Margarita, non conosco bene I quartiere di Torino.\nChe ne pensate di questo luogo, è tranquillo ? ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1ilpbkb/le_vostre_opinione_su_san_donato_basso_dopo_corso/"
    },
    {
        "id": "1ilgaui",
        "author": "TheArcaneKnight",
        "title": "Quest'anno mi trasferisco a Torino. Spero.",
        "content": "Vorrei chiedervi alcune domande semplice. Probabilmente potrei leggere qualche articoli per chiarire i miei dubbi ma preferirei ascoltare quello che gli abitante della città hanno da dire.\n\nCome è la sicurezza?\n\nCome vanno gli affitti ultimamente?\n\nCome siete i Torinesi al volante? Com'è il traffico? Preferirei non dipendere del transporte pubblico.\n\nQuanto lavoro c'è? Prima di lavorare come operaio facevo il cameriere, quanta richiesta c'è per lavori come questi?\n\nQuale quartiere consigliate per abitare/affittare? Guardando una mappa mi piace un sacco Borgo Po, Gran Madre, Borgo Crimea ma non so niente di com'è vivere li ne quanto puo costare.",
        "upvotes": 3,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1ilgaui/questanno_mi_trasferisco_a_torino_spero/"
    },
    {
        "id": "1ilajj6",
        "author": "GardenSure8482",
        "title": "Qualcuno conosce una persona che offra un servizio di preparazione pasti a domicilio?",
        "content": "Sto cercando qualcuno che possa venire a casa mia 2 volte a settimana per circa 3-4 ore a sessione e preparare i pasti per i 3 giorni successivi.\n\nNon so bene dove cercare, quindi provo a chiedere qui. Se avete consigli o esperienze, fatemi sapere!\n\nGrazie!\n",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ilajj6/qualcuno_conosce_una_persona_che_offra_un/"
    },
    {
        "id": "1ilmxco",
        "author": "miesraadgever",
        "title": "Looking for housing in Torino!!",
        "content": "Salve!\n\n//English below\n\nCiao a tutti!\n\nIo e un amico stiamo pianificando di trasferirci a Torino quest’estate.  \nAvete qualche consiglio per trovare un alloggio?  \nProbabilmente saremo a Torino verso la fine di marzo e vorremmo organizzare alcune visite per gli appartamenti.\n\nHo letto online che la maggior parte delle agenzie immobiliari a Torino preferisce essere contattata telefonicamente in italiano. Il nostro italiano è molto, molto base, quindi questa opzione non sembra fattibile.\n\nAvete suggerimenti su come affrontare la ricerca o qualche contatto utile? Ogni aiuto è ben accetto!\n\nGrazie mille! Ciao! 😊\n\n//\n\nHey all! Me and a friend are planning to move to Turin somewhere this summer.   \nDoes anyone have some tips in finding accommodation?   \nWe will probably be in Turin end this march and would like to arrange some viewings for apartments. I read online that most realtors in Turin need to be called in Italian.   \n  \nOur Italian is very very basic, so that doesn't seem like an option. Any tips how to approach this or any leads are more than welcome!!   \n  \nCiao!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ilmxco/looking_for_housing_in_torino/"
    },
    {
        "id": "1ilk9xt",
        "author": "UglycoreIT",
        "title": "AMA: Tutto ciò che vuoi sapere su Torino e i torinesi ma non hai mai osato chiedere",
        "content": "",
        "upvotes": 0,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1ilk9xt/ama_tutto_ciò_che_vuoi_sapere_su_torino_e_i/"
    },
    {
        "id": "1iljal7",
        "author": "Dry-Ad-4478",
        "title": "Looking for good karaoke bars in Torino",
        "content": "Hi, Im an international student in turin, looking for good karaoke bars in Torino to visit with friends, preferably who play English music as well. Hmu with your thoughts.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1iljal7/looking_for_good_karaoke_bars_in_torino/"
    },
    {
        "id": "1ileakf",
        "author": "Patient_Clerk_2314",
        "title": "Fitactive Grugliasco",
        "content": "Ciao a tutti. Ho intenzione di tornare ad allenarmi in palestra e sto valutando le opzioni disponibili vicino a casa e lavoro. L'attenzione è caduta sulla fitactive di Grugliasco, aperta da poco. Contando di andarci la mattina presto (tra le sette e le otto), sapete com'è l'affluenza generale di questa palestra? \n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ileakf/fitactive_grugliasco/"
    },
    {
        "id": "1ilbeqv",
        "author": "Inevitable-Bad5953",
        "title": "Buoni Studi di Piercing",
        "content": "Ciao a tutti, \n\nPotete raccomandarmi alcuni buoni studi di piercing a Torino? Vivo in zona Santa Rita però studi anche in centro/non troppo lontani vanno bene. Ho visto online LouisStudio però volevo chiedervi le vostre opinioni prima di decidere. \n\nNaturalmente quando dico “buoni studi” voglio dire puliti, non troppo costosi (preferibilmente), con opzione di metallo perché sono allergico al nichel quindi cerco i piercing al titanio di grado chirurgico. \n\nGrazie in anticipo 🙂",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ilbeqv/buoni_studi_di_piercing/"
    },
    {
        "id": "1ikv4gd",
        "author": "CryingAlwaysCrying",
        "title": "Dove mangiare cibo non troppo “junk” fuori dal centro di Torino?",
        "content": "Ciao!   \n  \nMi sapreste consigliare un posto a Torino (possibilmente fuori dal centro) dove si possa arrivare comodamente in macchina, trovare parcheggio senza impazzire e mangiare qualcosa di veloce ma non troppo “junk food”?   \n  \n**Sto cercando qualcosa di un po’ più salutare rispetto ai classici fast food, ma che sia comunque pratico e informale.**   \n  \nAvete suggerimenti?  \n  \nGrazie!",
        "upvotes": 11,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1ikv4gd/dove_mangiare_cibo_non_troppo_junk_fuori_dal/"
    },
    {
        "id": "1iks82x",
        "author": "No-Calligrapher-4884",
        "title": "cerco gente con cui uscire a torino",
        "content": "Napoletano e vivo qui a torino da un anno e fare amicizia sembra sempre più impossibile, certo qualche uscita su tinder capita ma fin ora non ho ancora trovato persone con cui trascorrere del tempo dopo il lavoro. ho 20 anni e sono un hippoppettaro metallaro",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1iks82x/cerco_gente_con_cui_uscire_a_torino/"
    },
    {
        "id": "1ikubfy",
        "author": "New-Frosting-3636",
        "title": "Mercato del lavoro a Torino",
        "content": "Buonasera! Con il mio ragazzo stavamo valutando di trasferirci a Torino il prossimo autunno. Io un lavoro ce l’ho ma lui dovrebbe trovarselo. Mi chiedevo quindi se il mercato del lavoro a Torino e limitrofi fosse vivace e navigabile ed eventuali consigli in merito. Si parla principalmente di lavori unskilled/generici finche non avra finito l’università. Altra cosa, su idealista gli affitti sembrano molto buoni per bilocali/trilocali ma leggevo un post qui che diceva diversamente. Grazie a chiunque risponda!",
        "upvotes": 5,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1ikubfy/mercato_del_lavoro_a_torino/"
    },
    {
        "id": "1ikr5kj",
        "author": "Complex_Lynx_8546",
        "title": "SUSHI DA ASPORTO??",
        "content": "Ciao ragazzi \n\nMi sono trasferito da poco a Torino città, abito dietro porta palazzo e volevo chiedervi se ci fosse qualche sushi d’asporto. Prima di solito prendevo da Sushiko i 7 piatti a 22€ ma ho visto che a Torino non c’è. Ci sarebbe qualcosa di simile nei dintorni?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ikr5kj/sushi_da_asporto/"
    },
    {
        "id": "1ikohg4",
        "author": "voxxr1",
        "title": "Bars Showing the Super Bowl",
        "content": "Ciao, Im an American studying in Turin for the semester, wondering if theres any bars where I can watch the superbowl tomorrow night? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ikohg4/bars_showing_the_super_bowl/"
    },
    {
        "id": "1ik7yj9",
        "author": "Dandolod",
        "title": "Personal trainer",
        "content": "Ciao a tutti, da un po' di mesi ho iniziato ad allenarmi in palestra ed ogni tanto al parchetto vicino casa con l'obiettivo di aumentare la massa muscolare. Volevo dedicarmici un pochino più seriamente anche tramite l'aiuto di un personal trainer ed eventualmente di un nutrizionista. Conoscete persone qualificate o comunque palestre che seguano in tal senso? Ad oggi mi sono limitato ai pt di sala ed ai video YouTube, però mi farebbe piacere essere seguito per un po' di mesi da qualcuno ed assicurarmi di essere sulla strada giusta. Grazie in anticipo per le risposte.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ik7yj9/personal_trainer/"
    },
    {
        "id": "1ik1xc9",
        "author": "_tempesta",
        "title": "Comprare casa in via Principe Oddone (vicino Piazza Statuto): com’è viverci?",
        "content": "Ciao a tutti! Sto valutando l’acquisto di un appartamento **all'inizio di via Principe Oddone, lato Piazza Statuto**, e vorrei qualche opinione da chi conosce la zona o ci vive.\n\nNon sono di Torino e ho vissuto solo a Vanchiglia, quindi non conosco bene questa zona né la frequento abitualmente (a parte il fantastico mercato di Piazza Benefica nelle vicinanze)\n\nAlcuni dubbi che ho:\n\n* **Sicurezza**: Com’è la zona di sera? È tranquilla o ci sono situazioni spiacevoli? Mi interessa soprattutto per quando devo tornare a casa da sola.\n* **Rumore e vivibilità**: Essendo vicino alla stazione, il traffico o la movida possono essere un problema?\n* **Qualità della vita**: Qualcuno sa di percorsi in cui andare a correre nelle immediate vicinanze? È una zona comoda per chi ci abita?\n\nUn’altra cosa che mi ha colpita è che i vani scala del palazzo siano completamente aperti. Forse è normale per i palazzi di ringhiera a Torino, ma potrebbe creare problemi?\n\nSe qualcuno ha esperienza diretta o conosce bene la zona, ogni feedback è super apprezzato!   \nGrazie in anticipo :)",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1ik1xc9/comprare_casa_in_via_principe_oddone_vicino/"
    },
    {
        "id": "1ik78zn",
        "author": "Affwind",
        "title": "Any bar that will stream the super bowl?",
        "content": "Title sums it all. I wanna watch the super bowl but I could not find a bar that will stream it. Any suggestions?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ik78zn/any_bar_that_will_stream_the_super_bowl/"
    },
    {
        "id": "1ik0n7n",
        "author": "dkroods",
        "title": "Take It Easy Torino Launch",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U5WfoArZmKHMlNMhgh2zOlYsC0P6i_kT4kbvoBp-olA.jpg?auto=webp&amp;s=38938d5d82a7d435832b11deac9130069ec8a692"
        },
        "permalink": "/r/torino/comments/1ik0n7n/take_it_easy_torino_launch/"
    }
]