[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 12,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 65,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1ljevku",
        "author": "Gnnz",
        "title": "The Good Place worth watching?",
        "content": "This pops up constantly on my Netflix and I am considering starting. For those of you that have watched it or are currently watching it, is it worth the watch?",
        "upvotes": 216,
        "comments": 163,
        "media": null,
        "permalink": "/r/netflix/comments/1ljevku/the_good_place_worth_watching/"
    },
    {
        "id": "1ljoc5n",
        "author": "Vashknives",
        "title": "Any way to get Netflix for cheaper?",
        "content": "Was wondering if theres any way to get the Netflix subscription for cheaper? Currently paying around $25 and looking to see if theres any discounts or promos for the premium plan. Any help would be greatly appreciated!",
        "upvotes": 134,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1ljoc5n/any_way_to_get_netflix_for_cheaper/"
    },
    {
        "id": "1ljj0a1",
        "author": "OkStretch9367",
        "title": "Dept Q",
        "content": "Me and my partner loved this. I just hope the do a season 2. So many unanswered question about what happened to the main character. Anyone who loves police shows should give this watch",
        "upvotes": 57,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ljj0a1/dept_q/"
    },
    {
        "id": "1ljrcp2",
        "author": "Blue-Steel1",
        "title": "Anyone actually like Netflix with ads ?",
        "content": "I switched because of the most recent price jump.  I actually like it because I can take a quick bathroom break without having to pause the current show.  Plus there aren’t too many ads ",
        "upvotes": 2,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1ljrcp2/anyone_actually_like_netflix_with_ads/"
    },
    {
        "id": "1ljfzhf",
        "author": "intelerks",
        "title": "Martin Kove allegedly bites co-star of ‘Cobra Kai’ Alicia Hannah-Kim at fan convention in Washington",
        "content": "",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ljfzhf/martin_kove_allegedly_bites_costar_of_cobra_kai/"
    },
    {
        "id": "1ljtfw9",
        "author": "IloveFootball2027",
        "title": "Download link for K-pop Demon Hunters",
        "content": "Hi!! Would someone be able to send the link of the dowloaded version of KPop Demon Hunters. I really wanna watch it but my Netflix isn’t working. I was hoping someone would be able to send me the download link to be able to watch it. I really wanna watch it 😭😭😭😭\n\nThank you! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljtfw9/download_link_for_kpop_demon_hunters/"
    },
    {
        "id": "1ljsszz",
        "author": "superpowers335",
        "title": "Is there a downside to setting your default playback quality to high?",
        "content": "I have my settings for my playback quality set to high instead of default. I assume that this is the better option but I was just wondering if there was maybe a reason the default option would even exist. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljsszz/is_there_a_downside_to_setting_your_default/"
    },
    {
        "id": "1ljsrbc",
        "author": "MamaCass",
        "title": "Netflix on Roku now breaks after ads",
        "content": "We've got Netflix with ads for the first time, and I hate it. Not because of the ads but because they've somehow broken the Roku app. After every 2-3 ads, the show doesn't come back on. It just hangs at a black screen.\n\nI've updated the Roku, deleted and reloaded the app, etc. None of it helps. Do I need to just spring for the ad-less plan or is there something I'm missing?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljsrbc/netflix_on_roku_now_breaks_after_ads/"
    },
    {
        "id": "1ljsnlj",
        "author": "Square_Community_812",
        "title": "Animal Kingdom",
        "content": "In Season 5.  Really enjoying the show. Does anyone else dislike J? I can’t stand him. I don’t understand why they let him get away with his shit. \nAnother thing. The time line and nick name Smurf don’t Jive. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljsnlj/animal_kingdom/"
    },
    {
        "id": "1lj3xi4",
        "author": "Logos1789",
        "title": "PSA About “Leaving Soon” Labels",
        "content": "Depending on the platform you’re watching Netflix on, the “Leaving Soon” labels may not appear on the thumbnail of the show or movie. \n\nInstead, you’ll only see the note about the movie leaving Netflix on X date after selecting the thumbnail to view more info.\n\nI happened to be browsing Netflix on my phone when I noticed that a movie on my list had the “Leaving Soon” label. Upon using my gaming console to pull up the movie, I noticed that the label wasn’t displayed.\n\nIn case this is a one-off mistake, the movie is The Net.",
        "upvotes": 25,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lj3xi4/psa_about_leaving_soon_labels/"
    },
    {
        "id": "1ljplom",
        "author": "Rich-Ambassador9683",
        "title": "Is Anne with an E and the gentlemen worth watching",
        "content": "One of my friend is pushing me to watch it \nIs it worth anne with an e .\nI have watched you and derry girls recently \nNeed a show to start \nWas thinking about the gentlemen but idk",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ljplom/is_anne_with_an_e_and_the_gentlemen_worth_watching/"
    },
    {
        "id": "1ljml0e",
        "author": "Strange_Motor2261",
        "title": "Video quality",
        "content": "I have the best Netflix plan, a fast internet connection, the app is set to the highest quality and yet the video playback quality seems to be practically 480p. However, on the Netflix app from the Microsoft Store, on the computer, the quality is incredible. How can I solve this problem? I'd like to watch TV programmes on the mobile app in the best quality, since I'm paying for it (my mobile phone is a Xiaomi Redmi Note 11).",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljml0e/video_quality/"
    },
    {
        "id": "1ljctdm",
        "author": "Indoril-Nerevar337",
        "title": "First Look: Cillian Murphy Leads Reimagining of 'Shy' in Upcoming Drama 'Steve'",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljctdm/first_look_cillian_murphy_leads_reimagining_of/"
    },
    {
        "id": "1ljf8fu",
        "author": "Trent-Popverse",
        "title": "KPop Demon Hunters is the perfect introduction to KPop for anyone curious about it",
        "content": "Considering that it is a third of the title, KPop Demon Hunters needed to deliver on the KPop to feel worthwhile. I have some issues with some of the animation and the plot has a few inconsistencies, but one thing [I have no problems with is the music itself.](https://www.thepopverse.com/movies-netflix-kpop-demon-hunters-soundtrack-perfect-k-pop-introduction-huntrix-bts-twice/) Every song is solid and represents a trope or genre within KPop. The first song feels like it could be on a Blackpink record. The Saja Boys song was inspired by BTS. The big confrontational song is sung by members of Twice during the credits. \n\nWhat I'm saying is that KPop Demon Hunters is very good and has a great soundtrack. Highly recommend it for anyone wanting a gateway drug to KPop.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ljf8fu/kpop_demon_hunters_is_the_perfect_introduction_to/"
    },
    {
        "id": "1lje4en",
        "author": "JDeLiRiOuS129",
        "title": "Is there a way to block changing the plan on the app?",
        "content": "So basically my friend/roommate keeps changing the plan as I have a free plan through T-mobile. He really isn’t very tech savvy and doesn’t realize he’s even changing it as the pop up keeps popping up when he watches certain movies and I don’t know if he just tries to skip them or he can’t read what it actually says as he needs glasses but doesn’t own a pair but it’s getting annoying because it’s already happened 3 times and every time it happens, T-mobile changes me for the whole month regardless, even though I change it back right away. I feel like it shouldn’t have that opinion to change it without putting the account password in or something. Please tell me there’s a way to stop that pop up from coming up?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lje4en/is_there_a_way_to_block_changing_the_plan_on_the/"
    },
    {
        "id": "1ljhqe9",
        "author": "Adventurous_Song6623",
        "title": "Was it real in monsters: the lyle and erik menendez story",
        "content": "In monsters: the lyle and erik menendez story was the shower scene between erik and lyle real or not? Because it would be if it was from lyle or erik but it was only the guy thinking up ideas so did it happen or not? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ljhqe9/was_it_real_in_monsters_the_lyle_and_erik/"
    },
    {
        "id": "1ljh0pz",
        "author": "Gloomy_Stage",
        "title": "Apple billing",
        "content": "I am currently on the standard plan and this is billed by Apple and has been since 2016.\n\nI now want to upgrade to the premium plan but I cannot upgrade this as Apple doesn’t allow this anymore.\n\nThe Netflix help wasn’t particularly clear and Apple wasn’t any help either. I contacted Netflix via chat and they said to contact Apple.\n\nSo can anyone point me in the right place. I am wondering if I change payment method from Apple to credit card, would this convert account management from Apple to Netflix? If so, would I be able to upgrade the plan immediately?\n\nWe have a 21 hour flight coming up so would like to have this plan in place before the next billing cycle (which is after the flight) so that my family can download films on their devices.\n\nThanks",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ljh0pz/apple_billing/"
    },
    {
        "id": "1ljkrfv",
        "author": "Ionenschatten",
        "title": "Sure am looking forward to enjoying a basic feature... oh well",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljkrfv/sure_am_looking_forward_to_enjoying_a_basic/"
    },
    {
        "id": "1lje2j3",
        "author": "MindFlourish2919",
        "title": "The latest Trainwreck review",
        "content": "Trainwreck: Poop cruise\n\nI watched the full thing and I was shocked and relieved that no one went crazy and a bigger disaster occurred. I really liked how the passengers and crew handled the whole situation. Overall very good documentary.\n\n9/10",
        "upvotes": 1,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1lje2j3/the_latest_trainwreck_review/"
    },
    {
        "id": "1ljd1g3",
        "author": "AmphibianDeep9212",
        "title": "Most anticipated for the rest of the year?",
        "content": "The second half to 2025 is going to be incredible for Netflix and us, the fans. \nStranger Things, Wednesday, Squid Game. I’m\nSure there are others, but I guess those are the big 3. \n\nhttps://apopcornmovieblog.blogspot.com/2025/06/most-anticipated-upcoming-tv-shows.html\n\nWhat are you most looking forward to? For me, it’s Stranger Things. ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ljd1g3/most_anticipated_for_the_rest_of_the_year/"
    },
    {
        "id": "1liqhyd",
        "author": "SometimesWitches",
        "title": "The Waterfront",
        "content": "Got through it in a couple days.  It is intriguing enough.   If you compare everything to your favorite family goes bad shows then it ranks somewhere in the middle.    It’s not going to blow anyone away but it has good actors and it is worth it just for Maria Bello who plays the matriarch.   She has come a long way from Coyote Ugly but I have enjoyed her in the last few projects i have seen her in.   The story has a few good twists and I do hope it has a second season.   ",
        "upvotes": 31,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1liqhyd/the_waterfront/"
    },
    {
        "id": "1ljcjc7",
        "author": "Lopsided-Pop3120",
        "title": "What to base your ratings on?",
        "content": "This is somewhat tricky because the algorithm of Netflix suggesting new titles to you is a black box. But should you, for best results, rate based on the quality (meaning objective rating - acting, camera work, writing, cinematography etc.) or on the content (the genre, topic, setting, story etc.)?\n\nFor example if you had two movies  \nA) A sci-fi action comedy movie that has amazing camera work, acting and writing.   \nB) A medieval murder mystery thriller that has miscast actors, useless subplots stapled on with horrible acting and amateur cinematography.\n\nNow if you really really like a medieval setting, thrillers and especially murder mysteries are 100% you jam and you really don't care for action, sci-fi or comedy, how should you rate the movies? \n\n* If you go for the objective rating of A+ B- will you now see more sci-fi action stuff that you don't really care for? Or will you be treated to highly rated cinematic masterpieces of every kind? \n* On the other hand if you try and curate your stuff and go for the subjective rating of A- B+, will you get more of the themes you are looking for or will you be flooded with borderline unwatchable straight to DVD crap?\n\nThe \"I love this\" option made it a bit easier so if it's something that is both objectively and subjectively great for you, you know how to vote, but if I don't like something for the quality but not the setting or other way around, I often don't dare \"dislike\" it, because of how it might misunderstand *what* I disliked.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ljcjc7/what_to_base_your_ratings_on/"
    },
    {
        "id": "1lj45mh",
        "author": "behelidt",
        "title": "Sex and the City gone on German Netflix",
        "content": "I had started watching Sex and The City (the original 1998 series) on Netflix about a week ago and yesterday noon it got removed and now it’s nowhere to be found. I know it’s been up since April, but it surely couldn’t have been up for barely three months. I know it got removed by noon, because I was watching up until that point in the morning and suddenly the stream stopped and I roundly play anymore. \nHas anyone experienced the same thing? \n\nI can’t find any information that in would only be up until June and Netflix also didn’t mention anything. Usually it says something like “last chance to watch”",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lj45mh/sex_and_the_city_gone_on_german_netflix/"
    },
    {
        "id": "1ljc4sz",
        "author": "JustARandomTomboy",
        "title": "Why are some seasons not on here?",
        "content": "Context: I just downloaded and bought the 7.99 plan so I'm still pretty new to Netflix\n\nI downloaded Netflix so I could watch some of the shows I've been wanting to watch, Squid Games, MHA, ect. I started watching MHA and realized there is only two seasons on here. Is this just me or is this for everyone? I thought that was odd so I clicked on another title. It was also missing a season. Is this because I bought the 7.99 plan and not the other expensive plan or is something everyone experiences? And no, I don't have any filters on. I already checked. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ljc4sz/why_are_some_seasons_not_on_here/"
    },
    {
        "id": "1ljnis6",
        "author": "Kaifighter13",
        "title": "Is kpop demon hunters worth watching now that I saw spoilers?",
        "content": "Saw a spoiler yesterday on twitter it kinda wasn't a big deal thought I'd forget about it but my brain keeps repeating it over and over in my head finally it started to calm down I forgot I wasn't supposed to be on Twitter (why is twitter the worst place for spoilers?!) And I saw another spoiler now I'm convincing myself I shouldn't watch this movie I've been waiting to see because I feel like it isn't special anymore:(",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ljnis6/is_kpop_demon_hunters_worth_watching_now_that_i/"
    },
    {
        "id": "1lj3h1m",
        "author": "woovrsqt",
        "title": "does anybody know what’s going on/is anyone having similar issues?",
        "content": "The first photo is me trying to sign in on the website and the second is me trying to sign into the app. I know I used the correct password so idk what’s going on. The email address I used is an old one my mother had so sending a code to it would be pointless unless I can dig up some old phone that just so happens to be signed into it. I tried signing in on my tv and it just says I’m using the wrong password, but I’ve used this password any other time signing into the same devices and it’s worked just fine. Any suggestions?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lj3h1m/does_anybody_know_whats_going_onis_anyone_having/"
    },
    {
        "id": "1li6s5y",
        "author": "ispankoldpeople",
        "title": "What is your fave hidden gem on Netflix?",
        "content": "\nLooking for recommendations of what you believe to be the most underrated shows that you have watched on  Netflix/Prime apps. My only hard no is anything dubbed, it’s just way too distracting for my tiny little mind.",
        "upvotes": 455,
        "comments": 544,
        "media": null,
        "permalink": "/r/netflix/comments/1li6s5y/what_is_your_fave_hidden_gem_on_netflix/"
    },
    {
        "id": "1ljd2na",
        "author": "No-Advance8976",
        "title": "anybody else unable to stream services?",
        "content": "Netflix crashed on me last night and it still isn’t working this morning. should i maybe uninstall and then reinstall it on the tv, or should i sign in and maybe sign back out? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ljd2na/anybody_else_unable_to_stream_services/"
    },
    {
        "id": "1liphjc",
        "author": "Significant-Skill156",
        "title": "Where's \"coming soon\" gone?",
        "content": "Sorry if this has already been answered but since Netflix changed the OS a few weeks ago, where has \"coming soon\" &amp; \"worth the wait\" gone? I don't understand why they've got rid of it?",
        "upvotes": 19,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1liphjc/wheres_coming_soon_gone/"
    },
    {
        "id": "1ljn8ad",
        "author": "Ok-Pangolin-837",
        "title": "Parental control editing of movies instead of full blocking?",
        "content": "Why can't there be a way to select editing of movies as a form of parental control?  For example if you could select \"remove nudity/violence levels/sexuality/language\", a parent could control which portions of a movie are edited as if for general TV.\n\nThere are so many movies I watched growing up that were really good for kids, but one certain scene makes it R or MA, etc.  I didn't know this until I watched some classics on streaming and found out it was edited for TV.  I might recommend something as safe without even knowing if it really was.\n\nAs an adult I hate censorship, but for certain ages it has a place.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ljn8ad/parental_control_editing_of_movies_instead_of/"
    }
]