[
    {
        "id": "1hkx7rr",
        "author": "SanderSo47",
        "title": "December 20-22 Box Office Recap: 'Sonic the Hedgehog 3' tops 'Mufasa: The Lion King' in the domestic market. While 'Mufasa' leads overseas, its $122.2 million worldwide debut is very underwhelming. Meanwhile, 'Kraven' and 'War of the Rohirrim' collapsed 72% and 73%, respectively.",
        "content": "https://preview.redd.it/pa090wakvn8e1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=bad30e582d782417c82593228c0a7bf97e777c0f\n\nThere was a new box office king, and it wasn't Mufasa or any other lion.\n\nThat honor belonged to ***Sonic 3***, which managed to outgross ***Mufasa*** to top the box office. The latter still won the foreign box office, even if the numbers are way below the expectations. In limited release, A24's ***The Brutalist*** had one of the best per-theater averages of the year so far. While last week's newcomers, ***Kraven*** and ***The Lord of the Rings: The War of the Rohirrim*** had poor drops after their anemic starts.\n\nThe Top 10 earned a combined $139.7 million. That's up a massive 62% from last year, when ***Aquaman and the Lost Kingdom*** topped and flopped.\n\nDebuting in first place, Paramount's ***Sonic the Hedgehog 3*** earned $60.1 million in 3,761 theaters. That's below the $72 million debut from the previous film, but that's not really a cause for concern as of now; December titles are often known for decreasing openings but strong legs.\n\nWhile not a franchise best, this is still a very solid debut. As the previous film teased, the introduction of Shadow was key to the hype. Adding Keanu Reeves to the mix was also a strong choice to get the Internet going wild. It's a film where Paramount aggressively campaigned and got people talking. The fact that there were 3 ***Sonic*** films in the span of almost five years is impressive, especially when the third film has the strongest reviews so far. While it might sound disappointing that the film didn't outperform the second film, at least it has the December excuse. \n\nAccording to Paramount, 59% of the audience was male and 43% was in the 18-34 demographic. They gave it a strong \"A\" on CinemaScore, which is the same score as the previous films. Despite its lower-than-expected opening, it's gonna have some legs through the holidays. For now, $200 million should happen. Paramount clearly believes in the franchise; they already announced development on a fourth film before the film even opened. \n\nHaving to settle for second place, Disney's ***Mufasa: The Lion King*** earned just $35.4 million in 4,100 theaters. That's down a massive 82% from the 2019 film, which broke so many records back then. Even if we have to accept that December lowers the opening weekend numbers, that's still a horrible drop.\n\nDisney clearly believed in the potential of the 2019 ***Lion King*** remake. After all, it earned $1.6 billion worldwide. But the thing is that the film's reputation is not the same as it was 5 years ago. The audience liked the film and ate it up, but like a lot of live-action remakes, the audience moved on afterwards. All while the criticism for the 2019 film just increased. \n\nBut still, how can it explain a 82% drop? Even if we have to ignore the fact that people moved on from the 2019 version, there's the fact that this is completely new story with new songs. There's no nostalgia to be milked here, and the prequel aspect is also a double-edged sword; we already know Mufasa and Scar will live and eventually become enemies. Audiences can simply skip the film and won't really miss anything, unless you're insanely passionate to learn questions like... how did Rafiki got his staff? Even with the presence of a fantastic filmmaker like Barry Jenkins, you can tell this was just a paycheck; it's sitting at a weak 57% on RT. So if you didn't care or forgot about the 2019 film, there are no reasons to check this out.\n\nAccording to Disney, 54% of the audience was female and 39% was in the 18-34 demographic. They gave it a fine \"A–\" on CinemaScore, which is lower than the previous film. Even if the film legs out to a 6x multiplier, that would still be just $212 million, which is like 60% down from the previous film. Needless to say, it's unlikely there will be a third ***Lion King*** film.\n\nUniversal's ***Wicked*** was on third place, easing just 38% and adding $14.1 million. That takes its domestic total to $384.5 million, and it should continue holding incredibly well through the holidays.\n\nAfter topping the box office for three weekends, ***Moana 2*** was hit by ***Sonic*** and ***Mufasa***. The film fell to fourth place, and it had another rough drop, officially losing to ***Wicked*** on the weekends. This time, it fell 50%, adding $13.2 million this weekend. While the film has had a huge opening weekend, the legs are leaving a lot to be desired. The film has made $359.1 million, and it has zero shot at hitting $450 million domestically. That's quite disappointing, signaling that the film was very front-loaded.\n\nAngel Studios also released ***Homestead*** this weekend. Opening in 1,886 theaters, it earned a solid $6 million. While critics lambasted the film, the audience gave it a middling \"B\" on CinemaScore. It should hold well thanks to the holidays, but it would be a surprise if it came anything close to $30 million by the end of its run.\n\n***Gladiator II*** is still showing some legs, even if they arrived a little too late to make a difference. The film dropped 40%, adding $4.5 million this weekend. The film has made $154 million so far, and the holidays should get it to around $170 million.\n\nAfter its pathetic debut, ***Kraven the Hunter*** didn't save face on its second weekend. The film earned just $3 million, which marks a horrible 72% drop, almost on par with ***Morbius***. Through ten days, the film has made a poor $17.3 million so far, and with four films opening in wide release, it will continue falling. Even with the holidays, it'd be a surprise if it made much more than $25 million domestically.\n\nAmazon's ***Red One*** had its worst drop so far, falling 65% and earning only $1.4 million. With more theater drops on the way, it's now guaranteed to finish below $100 million, which is quite disappointing.\n\nSo ***Kraven*** had a horrible drop, yet ***The Lord of the Rings: The War of the Rohirrim*** was ready to introduce itself. It made just $1.2 million this weekend, which is a horrible 73% drop and the worst drop in the franchise. The film has earned a meager $7.3 million, and it's gonna struggle to hit $10 million lifetime, which is just pathetic. Just a few minutes ago, it was announced that the film will hit digital at home on December 27, just 2 weeks of theatrical exclusivity. Ouch.\n\n***The Best Christmas Pageant Ever*** rounded up the Top 10, earning $780,000 this weekend. That takes its domestic total to $38.4 million. It has a few more days to make money before completely free falling.\n\nA24's ***The Brutalist*** debuted in 4 theaters. Despite its commanding 215-minute runtime, the film earned $266,791, which translates to a very strong $66,698 per-theater average (third best of the year). With strong awards buzz on the way, the film will continue expanding in the coming weeks.\n\n#**OVERSEAS**\n\nIn some consolation, ***Mufasa*** topped the foreign box office. Even though that's by default; ***Sonic*** didn't debut in any market, opting to start its international run on Christmas.\n\nWith that out of the way, ***Mufasa*** debuted with $87.2 million in the overseas markets, for a $122.2 million worldwide debut. That's far below the projected $180 million debut, and a far cry from the original. It had soft debuts across the world, with its best numbers in China ($7.8M), France ($7.7M), Mexico ($7.1M), the UK ($5.5M) and Germany ($5M). Even with the benefit of holidays, it's tough to see the film making much more than $600 million worldwide, more than $1 billion below the 2019 title. Which means it will break the record for the biggest sequel-to-original drop.\n\n***Moana 2*** added $32.8 million this weekend, as its worldwide total is nearing $800 million. The best markets so far are France ($46M), UK ($37.6M), Germany ($29M); Mexico ($26.2M) and Brazil ($24M). That billion is gonna take a few more weeks.\n\n***Wicked*** added $12.6 million this weekend, taking its worldwide total to $572 million. The best markets are the UK ($60.8M), Australia ($22.5M), Korea ($13.1M), Mexico ($9.6M) and Germany ($8M). \n\nIn some notable news, ***Gladiator II*** has finally crossed $400 million worldwide, with a $416.3 million run so far.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**THIS WEEK**\n\nWe'll have four films hitting wide release.\n\nThe first is Robert Eggers' new film ***Nosferatu***, a remake of the 1922 film. Eggers is coming off ***The Northman***, which was his highest grossing film. Even though it wasn't theatrically successful, it was reported that it broke even through ancilliaries, which is why this film exists. Pre-sales are very strong for its opening day, and with fantastic reviews so far, it looks like Eggers might have a new highest grossing film.\n\nAnother release is Searchlight's ***A Complete Unknown***, which stars Timothée Chalamet as Bob Dylan. The film has earned very good reviews, but Chalamet has received acclaim so far, building strong awards buzz. Perhaps we're looking at another sleeper hit.\n\nA24 is also releasing ***Babygirl***, which stars Nicole Kidman and Harris Dickinson. Once again, another title with decent reviews so far, and Kidman earning Oscar buzz for her performance.\n\nThe final title is Amazon's ***The Fire Inside***, which marks Rachel Morrison's directorial debut, written by Barry Jenkins. The film stars Ryan Destiny and Brian Tyree Henry, and follows the true story of American professional boxer Claressa \"T-Rex\" Shields as she trains for the 2012 Summer Olympics. Amazon's ***The Boys in the Boat*** performed quite well last year, so perhaps this could surprise.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 203,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wFGUs2fqXnoz34Csnmk0CxkDpAHLyF8g1YQUCh8Lvq0.png?auto=webp&amp;s=b09b32366c077c8ba739f38a3628063c4640d380"
        },
        "permalink": "/r/movies/comments/1hkx7rr/december_2022_box_office_recap_sonic_the_hedgehog/"
    },
    {
        "id": "1hlsind",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (A Complete Unknown / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n**Nosferatu discussion coming on the 25th @9pm CST**\n\n**Babygirl discussion coming on the 25th @9pm CST**\n\n# Streaming Releases\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hlsind/official_discussion_megathread_a_complete_unknown/"
    },
    {
        "id": "1hlf0g2",
        "author": "Amaruq93",
        "title": "25 years ago, \"Galaxy Quest\" (a One-of-a-Kind Sci Fi comedy), captured the hearts of Star Trek fans everywhere",
        "content": "",
        "upvotes": 6113,
        "comments": 433,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4XqL8g8wUAl0kzgeuew3NBodGkq09e9LC9FKLuY65Ng.jpg?auto=webp&amp;s=1e0b6fdeddf27ce60af174a6cc9cbd8359a288e7"
        },
        "permalink": "/r/movies/comments/1hlf0g2/25_years_ago_galaxy_quest_a_oneofakind_sci_fi/"
    },
    {
        "id": "1hlow2x",
        "author": "Open-Platform9637",
        "title": "Is there a dystopian movie about if it dosent stop snowing",
        "content": "Imagine everyday and every night it continuesly snows in this city, causing a natural disaster, apocalypse and catastrophe. The entire infrastructure would collapse, buildings would rumble under all the weight of the snow. Power failure, Electricity and water shortages. Moral sinking. People fighting over food etc. The government trying to find solutions. I thought of this idea because we want to go to Bosnia for the holiday, where it’s been snowing for the past 3 days, so it’s going to be hard driving there. There’s also been a power out today. Hopefully tap water will stay and power will probably come back tomorrow. That made me think what if it just dosent stop snowing, how would civilisation survive. I would love see my imagined scenario visualized to watch a movie, if there isn’t one there definelty should be one.",
        "upvotes": 666,
        "comments": 457,
        "media": null,
        "permalink": "/r/movies/comments/1hlow2x/is_there_a_dystopian_movie_about_if_it_dosent/"
    },
    {
        "id": "1hlsi27",
        "author": "LiteraryBoner",
        "title": "Official Discussion - A Complete Unknown [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/vNt33aq3Cw3i)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/vNt33aq3Cw3i)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nIn 1961, unknown 19-year-old Bob Dylan arrives in New York City with his guitar. He forges relationships with music icons of Greenwich Village on his meteoric rise, culminating in a groundbreaking performance that reverberates worldwide.\n\n\n**Director:**\n\nJames Mangold\n\n**Writers:**\n\nJames Mangold, Jay Cocks, Elijah Wald\n\n**Cast:**\n\n* Timothee Chalamet as Bob Dylan\n* Edward Norton as Pete Seeger\n* Elle Fanning as Sylvie Russo\n* Monica Barbaro as Joan Baez\n* Joe Tippett as Dave Van Ronk \n* Eriko Hatsune as Toshi Seeger\n* Scoot McNairy as Woodie Guthrie\n\n**Rotten Tomatoes:** [78%](https://www.rottentomatoes.com/m/a_complete_unknown)\n\n**Metacritic:** [70](https://www.metacritic.com/movie/a-complete-unknown/)\n\n**VOD:** Theaters",
        "upvotes": 331,
        "comments": 141,
        "media": null,
        "permalink": "/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/"
    },
    {
        "id": "1hllvi2",
        "author": "Amaruq93",
        "title": "How \"the Grinch\" stole Hollywood | The crazy story behind Ron Howard's 2000 adaptation",
        "content": "",
        "upvotes": 851,
        "comments": 187,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GMaQTDmKwoR1KbJC4mI0n8y4siuf0jFr9N1BEUc3FvE.jpg?auto=webp&amp;s=283e81ebcb3ea8a53126257939b33da359b887ee"
        },
        "permalink": "/r/movies/comments/1hllvi2/how_the_grinch_stole_hollywood_the_crazy_story/"
    },
    {
        "id": "1hluoh6",
        "author": "mattybgcg",
        "title": "Aerosmith showing up at the end of Polar Express is highly jarring",
        "content": "We've watched this a handful of times now with the 7yo, and this movie has gotten better with multiple viewing. I haven't seen the end more than once or twice due to sleep, and every time I do and Aerosmith shows up, it's from way out of left field. I know the animation turns a lot of people off and it's one of the things I've learned to accept, but Aerosmith really takes me out of it. ",
        "upvotes": 157,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1hluoh6/aerosmith_showing_up_at_the_end_of_polar_express/"
    },
    {
        "id": "1hltzum",
        "author": "No-Zookeepergame5954",
        "title": "Movies with an opening scene that is vastly superior to the rest of the film?",
        "content": "To me, what comes to mind is La La Land.\n\nDon't get me wrong, I think it is a very good movie. But by far, the best scene (in my opinion) is the opener of \"Another Day of Sun.\" The singers and dancers are stronger than Emma Stone and Ryan Gosling and the camerawork is simply on a whole other level than the rest of the film.\n\nWhat other films fit this criteria of having a decline (slight or massive) after the opening scene?",
        "upvotes": 166,
        "comments": 553,
        "media": null,
        "permalink": "/r/movies/comments/1hltzum/movies_with_an_opening_scene_that_is_vastly/"
    },
    {
        "id": "1hlrcnz",
        "author": "AntawnSL",
        "title": "Hundreds of Beavers: the most original movie experience of the year",
        "content": "It was a slow start, and a bit of a wilder ride than expected, but it held my attention for the whole 108min runtime (with ads on prime) as a mostly silent film. A major accomplishment in the year of our lord 2024. A couple laugh out loud moments. A couple big ideas that deserve a little more consideration. 100% would recommend this weird, goofy movie.",
        "upvotes": 195,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1hlrcnz/hundreds_of_beavers_the_most_original_movie/"
    },
    {
        "id": "1hlhb1v",
        "author": "JannTosh50",
        "title": "When Goldfinger Essentially Rebooted the James Bond Franchise",
        "content": "",
        "upvotes": 859,
        "comments": 124,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/v9zkf7fp-9004tc8sQX9keOBs8JhtPlnfg1i5BRYCKU.jpg?auto=webp&amp;s=e6e5ad6d3d066d8fa3e7c531bdc2b0feca668ed1"
        },
        "permalink": "/r/movies/comments/1hlhb1v/when_goldfinger_essentially_rebooted_the_james/"
    },
    {
        "id": "1hlg77m",
        "author": "SweetTeaRex92",
        "title": "Lines that live rent free in your head?",
        "content": "*\"Check it out. Dustin Hoffman, 'Rain Man,' look retarded, act retarded, not retarded. Counted toothpicks, cheated cards. Autistic, sho'. Not retarded. You know Tom Hanks, 'Forrest Gump.' Slow, yes. Retarded, maybe. Braces on his legs. But he charmed the pants off Nixon and he won a ping-pong competition. That ain't retarded. He was a goddamn war hero. You know any retarded war heroes? You went full retard, man. Never go full retard. You don't buy that? Ask Sean Penn, 2001, \"I Am Sam.\" Remember? Went full retard, went home empty-handed.\"*",
        "upvotes": 968,
        "comments": 1344,
        "media": null,
        "permalink": "/r/movies/comments/1hlg77m/lines_that_live_rent_free_in_your_head/"
    },
    {
        "id": "1hl29op",
        "author": "MarvelsGrantMan136",
        "title": "Alec Baldwin Manslaughter Case Is Over, as ‘Rust’ Prosecutor Drops Appeal",
        "content": "",
        "upvotes": 14656,
        "comments": 1692,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/96tYviSJwfPyEriLFcKOffr_Km6PjzaMbfJKTUBdJXs.jpg?auto=webp&amp;s=41f4d703bf826fcbae3e5bfd13129ec7bd30d8a3"
        },
        "permalink": "/r/movies/comments/1hl29op/alec_baldwin_manslaughter_case_is_over_as_rust/"
    },
    {
        "id": "1hlsi4b",
        "author": "LiteraryBoner",
        "title": "Official Discussion - The Order [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/KQEnIFL5mSTl)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/KQEnIFL5mSTl)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nA series of bank robberies and car heists frightened communities in the Pacific Northwest. A lone FBI agent believes that the crimes were not the work of financially motivated criminals, but rather a group of dangerous domestic terrorists.\n\n**Director:**\n\nJustin Kurzel\n\n**Writers:**\n\nZach Baylin, Gary Gerhardt, Kevin Flynn\n\n**Cast:**\n\n* Jude Law as Terry Husk\n* Nicholas Hoult as Bob Mathews\n* Tye Sheridan as Jamie Bowen\n* Marc Maron as Alan Berg\n* George Tchortov as Gary Yarbrough\n\n**Rotten Tomatoes:** [90%](https://www.rottentomatoes.com/m/the_order_2024)\n\n**Metacritic:** [76](https://www.metacritic.com/movie/the-order-2024/)\n\n**VOD:** VOD",
        "upvotes": 66,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/"
    },
    {
        "id": "1hlih4o",
        "author": "Strange_Depth_3247",
        "title": "The Beauty of It’s a Wonderful Life",
        "content": "Detailing the circumstances that led to this miracle movie and why it continues to endure. \n“And old George, standing in that same living room as he had an hour ago wanting to take his own life, is overjoyed. But not a thing has changed in George’s life, he is not loved anymore than when he wished to die. He simply knows, now, how much he is loved.\nAnd if you can have sympathy and forgive old George for ever letting himself feel down, do the same for yourself. This world would not be the same without you in it. Take the time to enjoy it, and to let those you love your world would not be the same without them in it.”\nI’d love to hear what this movie means to you. ",
        "upvotes": 372,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-F4kjIqucatcLnY-Kd8pR8r1GVNSw9YPhKm5GGjwntA.jpg?auto=webp&amp;s=5fe3a3b2bb344152c7edae8af77b947d18a38955"
        },
        "permalink": "/r/movies/comments/1hlih4o/the_beauty_of_its_a_wonderful_life/"
    },
    {
        "id": "1hkytk8",
        "author": "MarvelsGrantMan136",
        "title": "Christopher Nolan’s Next Movie is an Adaptation of Homer’s 'The Odyssey'",
        "content": "",
        "upvotes": 27652,
        "comments": 2877,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aII8wcddxsfzksSiagxGj6JKRFQA8yQVH28t-bHWmsE.jpg?auto=webp&amp;s=01b2449f0602ec09416d4e83589cbd5390455e07"
        },
        "permalink": "/r/movies/comments/1hkytk8/christopher_nolans_next_movie_is_an_adaptation_of/"
    },
    {
        "id": "1hlo6ye",
        "author": "Evil_Spike",
        "title": "Revival House is Australia's only cinema dedicated to exclusively showing films on film",
        "content": "",
        "upvotes": 119,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MVVEDv6PViDr2IC1zJiuV27ckDeMGDUG-IaWs9afOw8.jpg?auto=webp&amp;s=01df853d2999fb27f72585e557d12d5fca67f81a"
        },
        "permalink": "/r/movies/comments/1hlo6ye/revival_house_is_australias_only_cinema_dedicated/"
    },
    {
        "id": "1hlhnws",
        "author": "tangledapart",
        "title": "The Way of the Gun is the grandfather to so many projects since.",
        "content": "From not so likeable characters you do in fact like. A labyrinth of a plot. The unique percussive score goes for broke. The violence is surprising. This film would've had major legs as a miniseries. It created a new tone for noir. And since then, I don't think one film has come close to matching this blend of genres. A tin of TV shows have tried their hand. And some are quite brilliant (Better Call Saul, Poker Face, Ozark). I promise you if you seek this flick out, you will thank me. And if you don't like Sarah Silverman, the start of this movie is just for you.",
        "upvotes": 227,
        "comments": 123,
        "media": null,
        "permalink": "/r/movies/comments/1hlhnws/the_way_of_the_gun_is_the_grandfather_to_so_many/"
    },
    {
        "id": "1hl4rde",
        "author": "jdcmopwjdmw",
        "title": "Why aren’t we talking about The Green Knight more?",
        "content": "I just rewatched The Green Knight at a screening, and it's absolutely astounding about how absolutely gorgeous this movie is. Every single frame looks like it belongs in a museum - from the opening shot, the blocking, compositions, lighting, mind-blowingly masterful. The cryptic, unexplored elements of the universe (the giants!). The Green Knight himself. \n\nBut seriously, why don’t more people bring this one up when they’re talking about A24’s best? It’s weird in all the best ways, super ambitious, and just unapologetically doing its own thing. I get that it’s not for everyone—it’s slow and kinda cryptic, but that’s what makes it so good, IMO. It feels like an old-school myth come to life, and it’s just dripping with atmosphere. Anyone else feel the same? Also, kind of a Christmas movie in a strange way.",
        "upvotes": 1802,
        "comments": 498,
        "media": null,
        "permalink": "/r/movies/comments/1hl4rde/why_arent_we_talking_about_the_green_knight_more/"
    },
    {
        "id": "1hl2iu2",
        "author": "Odd_Advance_6438",
        "title": "The whole opening montage of Watchmen is incredible, and I forgot how tragic it really is",
        "content": "One of my favorite opening scenes, and one of the best sequences Snyder has ever directed. Condenses a really in depth alternate history into a 5 minute sequence set to “the times they are a changin”\n\nWe see the rise and fall of costumed heroes, and after reading the “before Watchmen comics” the fate of the Minutemen seems even sadder. Dollar Bill is killed from his cape getting stuck in a revolving door. Silhouette is killed in a hate crime after revealing her homosexuality. Mothman is forcefully sent to a mental hospital after a mental breakdown. In the corner of the last supper scene, you can see Hooded Justice and Captain Metropolis confiding in one another, a little Easter egg to their own relationship that they always had to keep secret\n\nThere’s something incredibly disturbing to me seeing the images of these cheesy golden age parodies having such dark ends, which I think is really well done. The contrast of Dollar Bill’s bright blue and red starred suit being covered with blood in a very unceremonious situation",
        "upvotes": 1897,
        "comments": 211,
        "media": null,
        "permalink": "/r/movies/comments/1hl2iu2/the_whole_opening_montage_of_watchmen_is/"
    },
    {
        "id": "1hkx04d",
        "author": "DemiFiendRSA",
        "title": "‘Lord Of The Rings: The War Of The Rohirrim’ Heading Into Homes on December 27 After 14-Day Theatrical Window",
        "content": "",
        "upvotes": 2963,
        "comments": 324,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GrjtM2b4BkvkJ0R74xDGNam5x93ifp_5ySmnpd8UwOY.jpg?auto=webp&amp;s=2ef8a0fe3b7d0ab3a895b18e1c624d738743beec"
        },
        "permalink": "/r/movies/comments/1hkx04d/lord_of_the_rings_the_war_of_the_rohirrim_heading/"
    },
    {
        "id": "1hl2ujf",
        "author": "Cockhero43",
        "title": "J.K. Simmons has played Santa Clause in two unrelated movies, is there another actor who has played the same character in unrelated films with such a different reception to the films?",
        "content": "Klaus and Red One are two movies where JK Simmons plays Santa Claus. One is a heart warming film with amazing art, sound, script, and acting, that used Simmons amazing voice to bring Santa to life. The other is Red One. \n\nObviously many actors have played the same character in a series like Mission Impossible, 007, Marval/DC, etc. and the quality of those movies can vary within the series. And also, some actors just have a \"theme\" that they are well known for like Matt Damon playing \"Guy who is lost and needs to be rescued by others\" or The Rock always playing \"Intense Adventure Guy\". \n\nBut as I ask in the title, has any actor played basically the same role in unrelated movies, something specific as \"CIA agent attempting to prove himself innocent of a terrorist plot\" or similar and had such VASTLY different reviews as JK Simmons got for Klaus and Red One?\n\nSorry for such a specific question, I just realized I can't thing of very many similar things to this where it seemed like a home run for him to play Santa, but then he does in live action... And it's bad. \n\n\nClaus* not clause ",
        "upvotes": 1114,
        "comments": 843,
        "media": null,
        "permalink": "/r/movies/comments/1hl2ujf/jk_simmons_has_played_santa_clause_in_two/"
    },
    {
        "id": "1hknmwz",
        "author": "MarvelsGrantMan136",
        "title": "Burt, Reptilian Star of ‘Crocodile Dundee,’ Dies at More Than 90 Years Old",
        "content": "",
        "upvotes": 14219,
        "comments": 265,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Wn3OiPKG4SNCYhlIDIlqgq_zeFQFBBKJOp7r_wnTGrM.jpg?auto=webp&amp;s=9c2e1616b90220a5a809f9440b74568da2f93c98"
        },
        "permalink": "/r/movies/comments/1hknmwz/burt_reptilian_star_of_crocodile_dundee_dies_at/"
    },
    {
        "id": "1hlkaud",
        "author": "JorReno",
        "title": "Why didn't Santa Claus choose Ernest P Worrell as his replacement in Ernest Saves Christmas(1988)?",
        "content": "Santa says to Ernest \"It's nice to find someone who has such an appreciate for Christmas\", after Ernest causes a traffic jam whilst trying to save a stray Christmas tree. Ernest proceeds to tell Santa how he has always loved Christmas since he was a kid. Ernest also let's Santa go without paying for the cab fare, because it's Christmas... which causes him to lose his job. Harmony asks him why he didn't lie to keep his job... because Ernest is an honest person.\n\nErnest spends the whole movie trying to rescue Santa and save Christmas. He knows how to fly the sleigh. \n\nOn the other hand... Santa's choice; Joe. Spends most of the movie thinking Santa is crazy. Says that he doesn't want the job. Shaves his beard. \n\nEven when Joe becomes Santa... he seems hesitant and awkward. Ernest naturally has a love and understanding of Christmas. Ernest is also a master of impressions; so he could easily pull off a convincing Santa if needed.\n\nWhy wasn't Ernest picked as Santa's replacement?",
        "upvotes": 44,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1hlkaud/why_didnt_santa_claus_choose_ernest_p_worrell_as/"
    },
    {
        "id": "1hljefx",
        "author": "RevolutionaryYou8220",
        "title": "Is Ridley Scott the best living director of horses?",
        "content": " *Robin Hood*, *Gladiators 1 &amp; 2*, *Kingdom of Heaven*, *Napoleon*, and *The Last Duel* were all made in the second part of Scott’s career and they all feature extremely impressive equestrianism on sometimes massive scale. \n\nEven considering that he is aided by modern digital technologies, I feel like you have to go back to the days of John Ford and David Lean before any decent comparison. \n\nWho else living and actively making movies can shoot a horse like Ridley Scott?",
        "upvotes": 39,
        "comments": 94,
        "media": null,
        "permalink": "/r/movies/comments/1hljefx/is_ridley_scott_the_best_living_director_of_horses/"
    },
    {
        "id": "1hlc5es",
        "author": "joesen_one",
        "title": "First poster for 'Diane Warren: Relentless', a documentary of the prolific hitmaker and 15-time Oscar nominee",
        "content": "",
        "upvotes": 112,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h7b7fqmrcs8e1.png?auto=webp&amp;s=3a6c2496f2ef3057243af70092a5424c8def3954"
        },
        "permalink": "/r/movies/comments/1hlc5es/first_poster_for_diane_warren_relentless_a/"
    },
    {
        "id": "1hlwsl7",
        "author": "yourkindhere",
        "title": "Are there any movies about pre-helmet era American football other than Leatherheads (2005)?",
        "content": "I like football movies. I like history movies. Are there any good movies about historic football? Most football movies only cover the 70s era at the earliest. Leatherheads is the only football movie I know of that has an older time setting as its set in the 1920s, but it’s a comedy and not very good. What I really want to see is an earnest biopic showing a piece of football history. There’s all these stories from Pre-War football especially in College Football history, with many of the big ticket rivalries spanning well over 100 years. Does anybody know if this has been portrayed in film?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1hlwsl7/are_there_any_movies_about_prehelmet_era_american/"
    },
    {
        "id": "1hl6vdm",
        "author": "simondufresne",
        "title": "The Great Mouse Detective Was Incredible",
        "content": "I mean what?!\n\nI had never seen GMD but assumed it was fine like most of the movies from Disney's \"Dark Age\" but I finally saw it this week as part of a new project to watch and rank every disney and pixar movie and holy crap was this an unexpected gem.\n\nEverything in this movie worked for me - I thought it's tone masterfully balanced it's comedic elements and it's much darker elements (there's straight up murder in this movie y'all), I thought Basil made a fantastic protagonist, and I think Professor Ratigan is one of the best Disney Villains I've seen in their movies.\n\nHe is able to be both hilarious and terrifying - the juxtaposition from him gleefully taunting Basil to his monstrous feral form chasing him down Big Ben in the climax is just a wonderful showcase for the character and Vincent Price's vocal talents.\n\nI saw it today and just want to watch it again immediately - How did this one slip under the radar for me for so long?\n\nAny other fans out there? Anyone like me who hasn't seen it yet (you should!)\n\nHere's my current rankings for the project so far &lt;3\n\n1. The Great Mouse Detective\n2. Robin Hood\n3. The Emperor's New Groove\n4. Strange World\n5. The Fox and the Hound\n\nNext week's movie is Atlantis the Lost Empire &lt;3\n\nIf you wanna follow along on my journey by all means  - here's today's thoughts on [Great Mouse Detective](https://www.youtube.com/watch?v=VQGOvLvlrH0)",
        "upvotes": 260,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ymQcHiOSEV7gGlMCQkmXM4ReCWT5mkVuCTNKIhEguaM.jpg?auto=webp&amp;s=b7dacc2a8e2496357c12eacdbe655049f2d5bc54"
        },
        "permalink": "/r/movies/comments/1hl6vdm/the_great_mouse_detective_was_incredible/"
    },
    {
        "id": "1hla3o3",
        "author": "l_l_l-illiam",
        "title": "Spin-offs, Sequels, Prequels and Remakes coming in 2025",
        "content": "#January\n\n##Star Trek: Section 31\n\nA spin-off film from **Star Trek: Discovery**, this film is the 14th Live-Action **Star Trek** film and the first of the expanded Star Trek Universe\n\n##Peter Pan's Neverland Nightmare\n\nA retelling of the Peter Pan story and the 3rd film in the Twisted Childhood Universe series of the 6 total planned currently\n\n##Wolf Man\n\nThis horror is a reboot of the 1941 film series, this was initially intended to be part of the Dark Universe franchise\n\n##Dog Man\n\nBased on the Dav Pilkey series, this is both a spin-off of, and a story within a story, of the **Captain Underpants** franchise\n\n#February\n\n##Captain America: Brave New World\n\nThe 4th Captain America film will be the first of the Sam Wilson Captain America films, and the 35th MCU Theatrical Film\n\n##Last Breath\n\nA theatrical remake of the 2019 Documentary of the same name\n\n##Bridget Jones: Mad About the Boy\n\nThe fourth film in the series, which started in 2001, is based on the book series of the same name\n\n#March\n\n##Snow White\n\nBased on the 1812 Brothers Grimm Book, this is Disney's Live Action version of **Snow White and The Seven Dwarves** (1937)\n\n#April\n\n##A Minecraft Movie\n\nBased on the hugely successful video game, this film comes off the back of other video game movies seeing great success in recent years\n\n##The Amateur\n\nA remake of the 1981 film, which was based on the book of the same name\n\n##The Accountant 2\n\nA sequel to the 2016 film, **The Accountant**\n\n##The Passion of the Christ: Resurrection\n\nA sequel to Mel Gibson's **The Passion of the Christ** (2004), a film based on the Passion of Jesus from the Gospels Matthew, Mark, Luke, and John\n\n##Until Dawn\n\nBased on the video game series of the same name which has had a spin-off, prequel and spiritual sequel\n\n##The King of Kings\n\nAn adaptation of Charles Dickens' **The Life of our Lord**, comes after the success of the inspired 2015 stage play **To Begin With**\n\n#May\n\n##Lilo &amp; Stitch\n\nA Live-Action remake of the 2002 film of the same name, which spawned a franchise of TV Shows, Films and Specials\n\n##Final Destination: Bloodlines\n\nThe sixth film in the **Final Destination** series\n\n##Mission: Impossible The Final Reckoning\n\nA direct sequel to **Mission: Impossible Dead Reckoning** and the 8th film in the series which was based on the TV Series of the same name\n\n##Thunderbolts*\n\nThe newest ensemble film in the MCU will be the 36th film in the series, and combines many different characters from the franchise's projects\n\n##Karate Kid: Legends\n\nThe sixth film in the **Karate Kid** franchise comes off the back of the success of the TV show **Cobra Kai**, after a reboot was already attempted in 2010\n\n##Hurry Up Tomorrow\n\nA film based on _The Weeknd_'s album of the same name\n\n#June\n\n##28 Years Later\n\nSequel to **28 Days Later**, **28 Weeks Later**\nAlso upcoming in the franchise, **28 Days Later: The Bone Temple** and an untitled sequel\n\n#Ballerina\n\nThe first Theatrical Spin-off of the **John Wick** Franchise, and its 5th Film. The film already has plans for a sequel, and there is currently another sequel and prequel in the works in the universe, as well as another TV show\n\n##How To Train Your Dragon\n\nThe Live-Action remake of the **How To Train Your Dragon** trilogy (2010 - 2019) which was based on the book series of the same name\n\n##M3GAN 2.0\n\nA sequel to **M3GAN** (2020) and a prelude to the spin-off **SOULM8TE** (2026)\n\n#July\n\n##Superman\n\nJames Gunn's **Superman** is the newest adaptation of the comic book character, making it the 10th Live-Action Theatrical Adaptation of the character\n\n##Jurassic World: Rebirth\n\nThis stand-alone sequel to **Jurassic World: Dominion** will be the 7th movie of the **Jurassic Park** franchise and the start of the 3rd series of films\n\n##The Fantastic Four: First Steps\n\nThe Fourth Remake of the characters based on the comics, and the 5th Movie, this film will serve as the 37th film in the MCU and their introduction to it\n\n##The Smurfs Movie\n\nAn upcoming animated musical, based on *The Smurfs* comic, will be the 13th film based on the books which has spawned crossovers and multiple TV shows, the first of which from 1961\n\n#August\n\n##Freakier Friday\n\nA sequel to **Freaky Friday** (2003), a film based on the 1972 book, this is the seventh film in the franchise which has also seen a musical based on the book\n\n##The Naked Gun\n\nA reboot of the **The Naked Gun** trilogy from 1988 which was based off the show **Police Squad!**\n\n##The Bad Guys 2\n\nA sequel to the first film, which was based on the comic book of the same name, this will be the 4th installment overall\n\n##Nobody 2\n\nA sequel to the action-drama **Nobody** (2021), which has had discussions about crossing over with the **John Wick** franchise\n\n#September\n\n##The Conjuring: Last Rites\n\nThe direct sequel to **The Conjuring: The Devil Made Me Do It**, this will be the 4th film in the universe, which has spawned 9 films in total including spin-offs, shorts, comic books and an upcoming TV show\n\n##The Bride!\n\nA musical adaptation of the 1935 film **Bride of Frankenstein**, which is adapted from the 1818 Frankenstein novel\n\n##Downton Abbey 3\n\nThe third film in the **Downton Abbey** franchise, which started as TV show which ran for six seasons and has inspired an upcoming American prequel series **The Gilded Age**\n\n##Saw XI\n\nThe 11th film in the **Saw** series, which has extended to short films, video games and theme parks, and is set to spin-off to a TV show\n\n#October\n\n##Mortal Kombat 2\n\nA sequel to the rebooted franchise from the 90s, the series is based on the game series, which has over 2 dozen games, this film joins many other adaptations, including TV shows and animated films\n\n##Tron: Ares\n\nThe third in the Tron trilogy, the last of which was 15 years ago, which spawned a franchise of video games as well as a TV show\n\n##The Black Phone 2\n\nA sequel to **The Black Phone** (2021), an adaptation of the short story of the same name, which spawned the short film **Dreamkill** (2023) spin-off\n\n#November\n\n##Wicked: For Good\n\nA sequel to 2024's **Wicked**, the film adaptation of the stage musical based on the 1995 book, which was inspired by **The Wizard of Oz**, which was based on the book *The Wonderful Wizard of Oz* (1900)\n\n##I Know What You Did Last Summer\n\nThe fourth film in the franchise based on the book by the same name, this legacy sequel comes nearly 20 years after the last but only a few years after the TV series was poorly received and quickly cancelled\n\n##Zootopia 2\n\nA sequel to the 2016 film, which had a spin-off series, **Zootopia+**\n\n##The Running Man\n\nA remake of the 1987 film, based on the Stephen King novel of the same name, released under his pseudonym\n\n##Predator: Badlands\n\nThe ninth film in the **Predator** series serves as a standalone story in the franchise, which has spawned Video Games, Short Films and Comic Books\n\n##Now You See Me 3\n\nThe 3rd in the **Now You See Me** series is reported to not necessarily be the end of the films\n\n##Bugonia\n\nAn English-language remake of the South Korean **Save the Green Planet!** (2003)\n\n#December\n\n##Avatar: Fire &amp; Ash\n\nThe 3rd in James Cameron's **Avatar** film series which has already earned over $5 billion dollars, it sits in the middle of the 5 movie series\n\n##Return of the Living Dead\n\nA reboot of the five film franchise from 1985\n\n##Five Nights at Freddy's 2\n\nThe second of the currently planned **FNaF** film trilogy, based on the second game, FNaF 2, a series which has more than 20 games including spin-offs\n\n##The SpongeBob Movie: Search for SquarePants\n\nThe fourth theatrical film based on the long-running show **SpongeBob SquarePants**, which has spawned spin-off shows, video games, theme park rides and $13 billion in sales\n\n#Unconfirmed Release Dates\n\n##Frankenstein\n\nThis star-studded retake on the 1818 novel will add to the 100+ films to have done so\n\n##Wake Up Dead Man\n\nThe 3rd in the Knives Out Franchise, this ensemble film is promised to not be the last in the series\n\n##Return to Silent Hill\n\nThe 3rd film in the **Silent Hill** series, based on the video game *Silent Hill*, a franchise unto itself, is an adaptation of **Silent Hill 2** \n\n##Untitled Predator film\n\nA secret film in the **Predator** franchise that will be released prior to **Predator: Badlands**, will be the 8th film in the series\n\n##Popeye The Slayer Man\n\nFollowing the release of several notable characters into the public doman, this slasher film will see an alternate history to Popeye\n\n##Greenland: Migration\n\nA sequel to **Greenland** (2020)\n\n##Pinocchio: Unstrung\n\nThe fifth film in the Twisted Childhood Universe, and the second in 2025, this film retells the premise of the novel *The Adventures of Pinocchio*, which has spawned dozens of films, shows and shorts, the last of which was in 2022\n\n##The Strangers: Chapter 2\n\nThe fourth film in **The Strangers** franchise, a story initially based on a series of real-life break-ins, and a direct sequel to **The Strangers: Chapter 1**, the third film in the series\n\n##The Strangers: Chapter 3\n\nA direct sequel to **The Strangers: Chapter 2**\n\n##Dirty Dancing 2\n\nA direct sequel, starting Jennifer Grey, to the 1987 film **Dirty Dancing**, which had a prequel, a TV show in 1988, a made-for-TV remake and inspired many reality competitions\n\n##Last Friday\n\nThe 4th film in the **Friday** Franchise, a series of stoner-comedies which also has a spin-off series",
        "upvotes": 113,
        "comments": 108,
        "media": null,
        "permalink": "/r/movies/comments/1hla3o3/spinoffs_sequels_prequels_and_remakes_coming_in/"
    },
    {
        "id": "1hlk8a1",
        "author": "beingzen01",
        "title": "Paterson (2016)",
        "content": "Just saw this yesterday and looks like it hasn’t been discussed here in a couple years. Never knew this movie existed somehow! \n\nI really enjoyed it for the most part, but I could see how you could find it boring, or pointless.\n\nMy main question is:\n\nDo people think Paterson was actually content? \n\nYou could look at it like, this guy lives a simple life with a woman he loves, and creates just for the sake of creating. He doesn’t need anything more.\n\nOr you could look at as a somewhat depressing story. This guy, and his wife, want to do more, want to live a bigger life, but they’re stuck. \n\nIn my mind it’s somewhere between the two. Like, there is part of him that wants more. But he also realizes he’s lucky in the grand scheme of things, and he doesn’t take his nice, quiet life for granted. \n\nMaybe his military experience has something to do with it. He saw some shit over there, and now he just wants to live a peaceful, if unremarkable life, far away from the chaos of war. \n\nAnyway, just curious what others think since I have seen a bunch of different interpretations around. ",
        "upvotes": 19,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1hlk8a1/paterson_2016/"
    },
    {
        "id": "1hlsi3n",
        "author": "LiteraryBoner",
        "title": "Official Discussion - The Fire Inside [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/AWsSIX5HkCnr)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/AWsSIX5HkCnr)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nThe story of Claressa 'T-Rex' Shields, a boxer from Flint, Michigan who trained to become the first woman in her country's history to win an Olympic gold medal in the sport.\n\n**Director:**\n\nRachel Morrison\n\n**Writers:**\n\nBarry Jenkins\n\n**Cast:**\n\n* Ryan Destiny as Claressa Shields\n* Brian Tyree Henry as Jason Crutchfield\n* Jazmin Headley as Young Claressa\n* Kylee D. Allen as Young Claressa\n* De-Adre Aziza as Mickey\n* Chrystian Buddington as Corey\n* Teanna Weir as Keisha\n\n**Rotten Tomatoes:** [95%](https://www.rottentomatoes.com/m/the_fire_inside)\n\n**Metacritic:** [82](https://www.metacritic.com/movie/the-fire-inside/)\n\n**VOD:** Theaters",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/"
    },
    {
        "id": "1hlwtov",
        "author": "Severe_Extreme_4364",
        "title": "Does anyone know this movie?",
        "content": "I can’t find it. The movie is a Sci-Fi kind of movie. I only remember a few pieces of details from the movie and I’ll try my best to describe. The movie starts with some military team on a mission. One of the soldiers of the team sees a weird blue/whiteish thing in the middle of a room and cant figure out what it is. The white thing turns out to be ghost-like being that is really powerful. Later in the movie, the military tries to kill these ghosts with a tank and the ghosts destroy the tank like it’s nothing. The military then discovers that they can use some sort of black sand like material that weakens these ghosts. At the end of the movie. They discover a really big place that turns people into these ghosts. I don’t know what the purpose is for turning people into these ghosts is. I hope this made sense and I tried my best to describe it without it sounding funny. If you have more questions please ask in the comments I’ll reply pretty quick ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1hlwtov/does_anyone_know_this_movie/"
    },
    {
        "id": "1hlbde6",
        "author": "Sanaan01",
        "title": "Grave of the fireflies is not something you should watch the day before your birthday",
        "content": "I had been putting off this movie since like forever but I gave it a watch today and I hated the movie, hated how real it felt, hated knowing this was a real story. The movie seems like it will stay in my life forever.\n\nI have watched other depressing movies like Manchester by the Sea. But this movie truly changed my perspective of life. Setsuko didn't deserve to be brought up in such a time.&gt;! Seita didn't deserve the stress of becoming orphaned and taking care of his sister alone.!&lt; I've been reflecting a lot life can really change soo fast. Also definetly do not watch this movie a day before your birthday.\n\n&gt;!Knowing that the siblings will die from the start I thought would ruin the movie but when ever something good happens I knew the eventual fate of these siblings which made me sad even at the happy moments.!&lt;\n\nSeita was a flawed individual no doubt the sense of pride he had led to the eventual events of the movie. &gt;!I wonder if he just stuck it up helped the aunt, cleaned the dishes etc but ig he was too prideful being the son of a navy soldier!&lt;\n\nI found out that the poster shows a bomber if you up the brightness which is evermore sad.  \nThis was truly an horrific time, all the things in school that I have learnt about WW2 they only showed statistics some of the horrors the alied nations went through, but nothing relating of how the innocent japenese civilians suffered",
        "upvotes": 42,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1hlbde6/grave_of_the_fireflies_is_not_something_you/"
    }
]