[
    {
        "id": "1qt3t6k",
        "author": "JaredBushOfficial",
        "title": "Hi /r/movies! I'm Jared Bush, director of ZOOTROPOLIS 2 &amp; ENCANTO and Chief Creative Officer of Walt Disney Animation Studios. Ask me anything!",
        "content": "Hi r/movies! I'm Jared Bush, director of ZOOTROPOLIS 2 &amp; ENCANTO, I wrote the screenplay for MOANA and I was a writer on ZOOTROPOLIS, MOANA 2 and the upcoming live-action adaptation of MOANA. Since 2024, I've also served as Chief Creative Officer of Walt Disney Animation Studios. Ask me anything! I'll be back on Monday at 5pm GMT/12pm ET/9am PT to answer any of your questions, see you there!",
        "upvotes": 576,
        "comments": 644,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i8pckvb1twgg1.jpeg?auto=webp&amp;s=ca86a453424f26b0a5ef16d77b4100aa940bceee"
        },
        "permalink": "/r/movies/comments/1qt3t6k/hi_rmovies_im_jared_bush_director_of_zootropolis/"
    },
    {
        "id": "1qu02rd",
        "author": "SanderSo47",
        "title": "January 30-February 1 Box Office Recap – 'Send Help' over-performs and tops the box office with $20M. Markiplier's 'Iron Lung' also over-performs, hitting second place with $17.8M. 'Melania' flops with just $7M, against a $40M budget and a $35M marketing campaign.",
        "content": "https://preview.redd.it/lk486fgxz3hg1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=f4cc7b57feebdba9eaddf1db2dbb19fca001d003\n\nIt was quite a busy weekend to cap off the January box office, with two titles vastly outperforming projections.\n\nWith strong reviews and seizing on a very weak horror landscape, Sam Raimi's ***Send Help*** took the top spot. But in second place, Markiplier's directorial debut ***Iron Lung*** also outperformed projections with a strong debut. But there were two losers this weekend; ***Shelter*** marked one of Jason Statham's worst debuts as leading man, while the documentary ***Melania*** also flopped despite a bizarrely extensive marketing campaign.\n\nThe Top 10 earned a combined $74.3 million this weekend. That's down a very marginal 0.3% from last year, when ***Dog Man*** over-performed, while ***Companion*** struggled to break out.\n\nDebuting at #1, 20th Century Studios' ***Send Help*** earned a pretty good $20 million in 3,475 theaters. That's Sam Raimi's highest horror debut unadjusted, finally dethroning ***Drag Me to Hell*** ($25 million). \n\nGiven how 20th Century Studios has been struggling in theaters outside ***Avatar***, this is a very much needed win for the studio. And all credit goes to a great marketing campaign; a woman and her dick boss are stranded in an island, and crazy shit happens. An easily accessible premise, and with the lack of momentum for horror titles this year (***The Bone Temple*** was expected to be a major horror attraction, but it has been playing worse than expected), the film greatly benefitted from Sam Raimi's return to his horror roots. Great reviews (93% on RT) also helped. \n\nAccording to 20th Century Studios, 53% of the audience was male, and 78% was 25 and over. They gave it a solid \"B+\" on CinemaScore, a pretty good grade for a horror. Given the lack of horror competition till ***Scream 7*** (***The Strangers*** is absolutely zero competition), it seems like the film could have a healthy run through February. Raimi's ***Drag Me to Hell*** closed with $42.1 million back in 2009; similar legs would put ***Send Help*** at $55 million or so, but it can go higher.\n\nHaving to settle for second place, but still outperforming projections, was Markiplier's directorial debut ***Iron Lung***, which earned a great $17.8 million in 3,015 theaters. That's an incredible debut considering the film was independently financed and it was only slated to debut in 100 theaters.\n\nYouTubers moving to filmmaking rarely works out; Chris Stuckmann's ***Shelby Oaks*** faded out quickly last October. But an advantage that ***Iron Lung*** had was how massively popular Markiplier is; he currently has 38.2 million subscribers, and his videos are still very popular. Compared to other YouTubers from that era, Markiplier has managed to maintain relevancy when others lose steam.\n\nBut still, $17.8 million is quite a lot for a film like this, especially when it was an adaptation of an indie game and lacked any major names or distributor. Sometimes films can surprise you by the level of a fanbase; as previously said, this was supposed to play in 100 theaters, but it kept adding more screens due to insane demand in pre-sales. This is on Markiplier's credit only, cause he's pretty much the face of the film. The fact that it can get this high is a testament to his brand power.\n\nAccording to Markiplier, 61% of the audience was male, and 62% was 25 and under. Definitely an incredible debut. And don't expect great legs on this film; films with specific fanbases often crash hard after opening weekend, and it'd be surprising if ***Iron Lung*** was any different. It's already seen on its opening weekend; Friday represented over half of the audience. But given that this cost a low $3 million budget, this is already a big success story.\n\nIn third place, Amazon MGM's documentary ***Melania*** earned $7 million in 1,778 theaters. This marked the biggest ever debut for a documentary since ***Chimpanzee*** ($10.6 million) back in 2012.\n\nSo why is this is a poor start? The bar may not be high for a documentary, as those aren't as popular as other films. But ***Melania*** has a higher bar to clear because it cost higher than usual for a documentary; it cost $40 million to produce, along with $35 million more in marketing. Basically Amazon MGM has a $75 million investment, and it only made 10% out of it in its opening weekend. We can spin it all we want, but that's definitely a flop. I mean, Amazon MGM's ***Mercy*** opened higher and with a mid-range budget and it was widely proclaimed as a flop. Why should this be any different?\n\n***Melania*** flopped for one reason and one reason only: there's absolutely nothing interesting about this \"documentary\". Putting aside how these are tough times for politics, was there a big audience for a pro-Trump propaganda following Melania Trump on the 20 days before Trump's second presidential inauguration? $7 million may be something, but it's still not a lot of people, especially considering the investment.\n\nAnd because it wasn't enough, the film was directed by none other than Brett fucking Ratner. His career stalled back in 2017 when he was accused by multiple women of sexual assault and harassment. This is his first project in years,  just as new images emerged showing him hanging out with Jeffrey Epstein and Jean-Luc Brunel. And you could tell it was directed by Ratner because it sucked, it's sitting at an abysmal 10% on RT.\n\nAccording to Amazon MGM, 72% of the audience was female, and 72% was 55 and over. They gave it a great \"A\" on CinemaScore, but this is not a surprising score. If you willingly walked into this, you knew what you were getting. Given how often titles like these perform, this will probably drop over the next few weeks. It'd be a surprise if it made it past $20 million domestically. Whatever purpose it was, it's clear Ratner is planning his Hollywood comeback. And it's working, because he was recently confirmed to direct ***Rush Hour 4***, because Trump himself played a big role in that. Man, these are depressing times.\n\n***Zootopia 2*** continues showing some damn fantastic legs. It actually increased 9% this weekend, for a $5.8 million take. That took its domestic total to $408.9 million, and it looks like it will try to challenge ***A Minecraft Movie*** ($424 million) for the 2025 domestic crown.\n\nDebuting in fifth place, there's Black Bear's action thriller ***Shelter***, which flopped with just $5.5 million in 2,726 theaters. That's Jason Statham's worst debut as lead star since ***Operation Fortune: Ruse de guerre*** ($3.1 million), and his fourth worst of all his wide debuts.\n\nNow, a number like this has less to do with Statham, and more with its distributor, Black Bear. These are tough times to launch a big studio in Hollywood, and Black Bear did not have much luck last November with its first title, ***Christy***. They were just a production company, before deciding to fully embrace distribution, and now ***Shelter*** shows they are not in a strong position to launch titles. If this was helmed under Lionsgate or Amazon MGM like Statham's past films, the film could've opened with at least $10 million. The fact that it made $5 million despite the terrible marketing and launch really shows that Statham is a draw.\n\nAccording to Black Bear, the film skewed heavily male, as it's typical with Statham, and 44% was 45 and over. Clearly a dad movie. They gave it an okay \"B+\" on CinemaScore, and the film could hold well over the empty competition. Although it's unlikely that it can keep these screenings for long.\n\nSeems like ***Avatar: Fire and Ash*** is losing steam, even though it had its best drop yet. It eased just 14%, adding $5.5 million this weekend. Yes, it's officially losing to ***Zootopia 2*** in daillies, and even in per-theater average despite the amount of PLF screens. The film has earned $386.1 million domestically, and it seems like it will hit $400 million after all.\n\nAmazon MGM's ***Mercy*** was hit hard by the winter storm last week, despite reaching #1. Well, the excuses are over, as the film fell all the way to seventh place. It dropped a rough 56%, earning just $4.7 million this weekend. Through 10 days, the film has earned a meager $19.4 million, and it will close with just a tad above $25 million.\n\nIn eighth place, Lionsgate's ***The Housemaid*** eased just 11%, earning $3.5 million. The film's domestic total stands at $120.6 million.\n\nA24's ***Marty Supreme*** is still fighting to reach the $100 million milestone. It eased 18%, for a $2.9 million weekend. That takes its domestic total to $90.8 million.\n\nRounding out the Top 10 was ***28 Years: The Bone Temple***. It lost 1,464 theaters this weekend, and it's showing to be fizzling out. It collapsed a further 53%, earning just $1.6 million on its third weekend. The film has earned an abysmal $23.6 million, and it has zero shot in hitting $30 million domestically.\n\nJust outside the Top 10, Focus Features' ***Hamnet*** eased 19%, earning $1.5 million. The film has amassed $20.2 million so far.\n\nUnsurprisingly, ***Return to Silent Hill*** collapsed on its second weekend. A steep 70% drop, which amounts to a very poor $980,833. That takes its domestic total to just $4.2 million after 10 days, and it won't make it much further than $5 million.\n\nAhead of its wide debut, A24's ***The Moment***, a mockumentary starring Charli XCX, got off to a strong debut in 4 theaters. It earned $427,940, which translates to a very strong $106,985 per-theater average. An impressive debut, although with mixed reviews (62% on RT), the film will probably fail to connect with non-fans once it goes wide.\n\n#**OVERSEAS**\n\n***Avatar: Fire and Ash*** debuted with $19.3 million overseas, taking its worldwide total to $1.413 billion. In the process, it passed ***Avengers: Age of Ultron*** to become the 18th highest grossing film of all time. Does it still have enough steam to hit $1.5 billion? It will be a bit complicated, but it's not impossible.\n\n***Zootopia 2*** added $17.3 million overseas, for a $1.698 billion worldwide run. The best markets are China ($631.2M), Japan ($90M), France ($74.6M), Korea ($56.2M), Germany ($48.5M), UK ($43.5M), Mexico ($40.2M), Australia ($27.9M), Brazil ($24.6M), and Taiwan $23.3M). It's about to crack the $1.7 billion milestone.\n\n***Send Help*** debuted with $8.1 million overseas, for a $28.1 million worldwide debut. Its best debuts were Mexico ($1M), Australia ($800K), Germany ($500K), Japan ($400K), Italy ($400K), South Korea ($400K), Spain ($400K), Netherlands ($300K), and Brazil ($200K). It's a modest debut, but it seems the domestic market will heavily carry the film.\n\n***Shelter*** debuted with $7.5 million overseas, for a $13 million worldwide debut. Its best markets were China ($2M), the UK ($1.3M), Saudi Arabia ($928K), and UAE ($707K). While it has some more markets left, it's very unlikely it can recoup its steep $50 million budget.\n\n***Mercy*** is fizzling out, as it dropped 56% overseas, earning just $5.6 million for a very disappointing $41 million worldwide total. The best markets are China ($5.7M), Mexico ($1.6M), the UK ($1.5M), Australia ($1.2M), Japan ($1.1M), Germany ($943K), Spain ($753K), Netherlands ($570K), and France ($560K). South Korea is its last major market, but don't expect it to save this.\n\n***Iron Lung*** debuted with $3.9 million overseas, for a $21.7 million worldwide debut. The best debuts were in the UK ($1.2M), Australia ($1.2M), and Germany ($300K). A very impressive debut, considering it didn't have a lot of screenings in these markets.\n\nBelieve it or not, Amazon also decided to release ***Melania*** in many countries. As of this moment, there's no box office data for this.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Wicked: For Good* | Nov/21 | Universal | $147,004,640 | $342,915,090 | $526,587,764 | $150M\n*Five Nights at Freddy's 2* | Dec/5 | Universal | $64,007,430 | $127,730,290 | $238,701,161 | $36M\n\n- For the money, and nothing more. Universal's ***Wicked: For Good*** has closed with $526 million worldwide. A definite success, given that it surpassed its $150 million budget. But it marked a rough 31% drop from ***Wicked***, which was one of 2024's biggest box office successes. In this case, ***For Good*** was left out of the year's Top 10. While it opened with a dazzling $147 million, suggesting it would have a very strong run, the film would prove to have terrible legs, losing steam at a quick pace thanks to very lukewarm word of mouth. Sure, the second half of the musical is weaker, but the film still failed to try and fix those aspects. Perhaps the final touch was the fact that while the original was nominated for many awards and won 2 Oscars, ***For Good*** was completely rejected by the Oscars in every single category. Did Universal make a good decision in splitting the musical? Financially, yes. But they might want to reconsider that planned cinematic universe they were planning to develop.\n\n- Universal/Blumhouse's ***Five Nights at Freddy's 2*** has closed with $238 million worldwide. After the very rough year that Blumhouse had, they finished it with their biggest hit since the prior ***Freddy's*** film. But despite releasing it during holiday season, the film still had poor legs, failing to hit the 2x mutliplier. Perhaps that can be attributed to its incredibly low quality, as the film somehow had worse reception than the original. Blumhouse will easily make a third film, but if it continues the same trajectory with the quality, their biggest IP could lose steam.\n\n#**THIS WEEKEND**\n\nIt's Super Bowl weekend, and studios always avoid releasing big stuff in here. Barring some disaster, it'd be a surprise if ***Send Help*** lost the top spot.\n\nThe only wide release is ***The Strangers – Chapter 3***, the final film in this reviled franchise. The plot is... and the actors are. Yeah, definitely. There's not much to say here because... there's simply no good will left in here. Nothing on its favor. It's only a matter of seeing how low it will go.\n\n#**STREAMING DATA**\n\nHow did Netflix do last week?\n\nFigures for the week of January 19 to January 25:\n\nNo. | Movie | Year | Studio | Weeks in Top 10 | Views | Runtime | Hours Viewed\n----------|----------|:--------:|:--------:|:--------:|:--------:|:--------:|:--------:\n1 | *The Rip* | 2026 | Netflix | 2 | 40,400,000 | 1:53 | 78,300,000\n2 | *Kidnapped: Elizabeth Smart* | 2026 | Netflix | 1 | 15,900,000 | 1:31 | 24,100,000\n3 | *No Time to Die* | 2021 | MGM | 1 | 9,600,000 | 2:44 | 26,200,000\n4 | *People We Meet on Vacation* | 2026 | Netflix | 3 | 9,300,000 | 1:58 | 18,300,000\n5 | *KPop Demon Hunters* | 2025 | Netflix | 32 | 7,000,000 | 1:40 | 11,700,000\n6 | *The Magnificent Seven* | 2016 | Sony | 1 | 6,500,000 | 2:13 | 14,500,000\n7 | *SPECTRE* | 2015 | MGM | 1 | 4,300,000 | 2:28 | 10,600,000\n8 | *Max* | 2015 | Warner Bros. | 1 | 4,300,000 | 1:51 | 7,900,000\n9 | *Tere Ishk Mein* | 2025 | AA Films | 1 | 3,800,000 | 2:45 | 10,500,000\n10 | *Suitcase Killer: The Melanie McGuire Story* | 2026 | Netflix | 2 | 3,700,000 | 1:27 | 5,300,000\n\n***The Rip*** stayed at #1 with 40.4 million views, a very marginal drop from its impressive opening weekend. That takes its 10-day total to 82 million views. It needs another 56 million views to crack Netflix's Top 10 of all time, and it must achieve it in 3 months. Let's see where it stands next week.\n\nThe documentary ***Kidnapped: Elizabeth Smart*** cracked the second spot with 15.9 million views.\n\nIn fourth place, rom-com ***People We Meet on Vacation*** added 9.3 million views, taking its 17-day total to 49.8 million views. \n\nAs you notice, Netflix added all the 25 Eon-produced James Bond films globally on January 21. Clearly, audiences were interested in rewatching Daniel Craig's era, as ***No Time to Die*** and ***SPECTRE*** were the third and seventh most watched films during the week.\n\n#**ANNOUNCEMENT**\n\nWeekend Actuals will return to the usual schedule, on Monday afternoons, next week.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 268,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1qu02rd/january_30february_1_box_office_recap_send_help/"
    },
    {
        "id": "1qudjpj",
        "author": "MarvelsGrantMan136",
        "title": "Brandon Sanderson will write the screenplay for Apple TV's ‘Mistborn’ movie",
        "content": "",
        "upvotes": 9798,
        "comments": 991,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EslggFnoCtfqT62jJK17d5nzKd-l0D2NnNVLzzmo-bQ.jpeg?auto=webp&amp;s=9c9e32dccc9638b178e12f23c8367db08da390f8"
        },
        "permalink": "/r/movies/comments/1qudjpj/brandon_sanderson_will_write_the_screenplay_for/"
    },
    {
        "id": "1qu8yoh",
        "author": "OverPotato2322",
        "title": "Project Netflix: MAGA’s Plan To Sandbag Warner Bros Deal; Streamer Called “Biggest Political &amp; Ideology Messaging Machine In Human History”",
        "content": "",
        "upvotes": 7807,
        "comments": 353,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QXQ2zthtL_j6Abe2OmHiynsjxYic951njlK6CKHGWK4.jpeg?auto=webp&amp;s=4aad437a75d79ef55632e48987fa6529e583f914"
        },
        "permalink": "/r/movies/comments/1qu8yoh/project_netflix_magas_plan_to_sandbag_warner_bros/"
    },
    {
        "id": "1qu9c15",
        "author": "kkayden",
        "title": "New Poster for the 2026 Oscars",
        "content": "",
        "upvotes": 4100,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mm3aa08im5hg1.png?auto=webp&amp;s=9458883f1037b24737c85aa71c42d4bb633d4035"
        },
        "permalink": "/r/movies/comments/1qu9c15/new_poster_for_the_2026_oscars/"
    },
    {
        "id": "1qu40tm",
        "author": "Interactive_CD-ROM",
        "title": "Alamo Drafthouse faces backlash after ditching no-phones policy",
        "content": "Moviegoers, critics and even some industry insiders are blasting Alamo's new mobile ordering system which seems to go against decades of brand-building as a distraction-free cinema.\n\nGuests looking to order concessions will now be required to use their phones to do so, even during the movie. Fans worry they’ll also use them to text and scroll through social media.",
        "upvotes": 7102,
        "comments": 755,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KzUK4IuVwKuQ3lq5_FPCe6xvq5cVZEhY9QLRx6MiTzY.jpeg?auto=webp&amp;s=1b4caf47dacf0c061274bb914b48640cc77a05e5"
        },
        "permalink": "/r/movies/comments/1qu40tm/alamo_drafthouse_faces_backlash_after_ditching/"
    },
    {
        "id": "1quk1j9",
        "author": "dathon8462",
        "title": "Train Dreams (2025) is 90 minutes of pure humanity",
        "content": "Just finished watching Train Dreams, and I have to say, I haven't had a movie affect me like this is a long long time. It really hit home, probably because I grew up in the PNW, and I've had a lifelong interest in the historical logging industry here, but also because the wife and I had our first child, and, well, having a kid makes you put some things into perspective. \n\nIf you haven't seen it, it's definitely worth a watch, but more than being just a solid movie, it's a deeply personal reminder of the complex humanity of all of us. Robert in the film is literally a nobody. He doesn't know how his parents are, he leaves no mark on the world, but the depth of his joys and despairs are only heightened by the sheer mundanity of them. \n\nI noticed this in my own life. The joy of falling in love is paired with the fact that it's actually pretty mundane. It happens to literally billions of people on this planet. And I don't think that lessens it, in fact the fact that so many people experience joys and despairs like Robert does in the film just underscores their emotional impact. \n\nThe movie reminds us that everyone deserves deep empathy, and understanding. A nameless logger in Spokane at the turn on the century, who left no mark on the world, that person on the bus or the train who you've never seen and you'll never see again, or that lone person behind the Reddit account responsible for the comment your reading...each and every one of those people has hopes, dreams, fears, joys, and regrets that are like just as deep and emotionally complex as you do. \n\nAnyway, take a moment to remember the complex life of those strangers on the street, or the commenters on the Internet. Even though we don't know them, just like Robert, they deserve some empathy and understanding too. ",
        "upvotes": 314,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1quk1j9/train_dreams_2025_is_90_minutes_of_pure_humanity/"
    },
    {
        "id": "1qukzl5",
        "author": "BiggieSmallz98",
        "title": "What is the biggest actor payday all-time for one movie ??",
        "content": "I was surprised to learn it was Bruce Willis for \"Sixth Sense\" --- he had a backend deal that got him 17% of the worldwide gross and the film was a gigantic surprise hit in 1999 --- Bruce reportedly made $129 million!  He took a reduced upfront salary of $14 million and made an additional $115 million from the backend deal.  In 2026 inflation-adjusted dollars, this would be around $184 million !!  Dude got PAID.\n\nThe 2nd highest payday was for Tom Cruise in \"Top Gun: Maverick\" where he reportedly made $115 million for that blockbuster film.\n\nKeanu Reeves was paid $138 million for the two Matrix sequels.",
        "upvotes": 253,
        "comments": 106,
        "media": null,
        "permalink": "/r/movies/comments/1qukzl5/what_is_the_biggest_actor_payday_alltime_for_one/"
    },
    {
        "id": "1qttsv1",
        "author": "MarvelsGrantMan136",
        "title": "‘Zootopia 2’ Has Grossed $630M In China, The Highest Tally There By A Hollywood Film, Disney Says",
        "content": "",
        "upvotes": 7066,
        "comments": 300,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qwz9HGCI481L9g0K8PnUMoVBmnsl3QDvKPyyN-DGPHU.jpeg?auto=webp&amp;s=6c9e7e31fc5318f22fbc477bb45a6e9b79edb08e"
        },
        "permalink": "/r/movies/comments/1qttsv1/zootopia_2_has_grossed_630m_in_china_the_highest/"
    },
    {
        "id": "1qtz028",
        "author": "MarvelsGrantMan136",
        "title": "New Poster 'Good Luck, Have Fun, Don't Die'",
        "content": "",
        "upvotes": 2249,
        "comments": 139,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/us153u3pt3hg1.jpeg?auto=webp&amp;s=7c9a8c4ab734b586e1134e5e6d8e30705fcf9e02"
        },
        "permalink": "/r/movies/comments/1qtz028/new_poster_good_luck_have_fun_dont_die/"
    },
    {
        "id": "1quaa0s",
        "author": "Kryodamus",
        "title": "Star Trek II: The Wrath Of Khan (1982) | Khan's Introduction | Dir. Nicholas Meyer",
        "content": "",
        "upvotes": 561,
        "comments": 127,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u0hiv196t5hg1/CMAF_270.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1quaa0s/star_trek_ii_the_wrath_of_khan_1982_khans/"
    },
    {
        "id": "1qtvtzv",
        "author": "MarvelsGrantMan136",
        "title": "New Posters for 'The Drama' Starring Zendaya &amp; Robert Pattinson",
        "content": "",
        "upvotes": 2224,
        "comments": 151,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jqjr2n6b83hg1.jpeg?auto=webp&amp;s=51ba8e68619e8a6bcdc736fe53018f52904c7a46"
        },
        "permalink": "/r/movies/comments/1qtvtzv/new_posters_for_the_drama_starring_zendaya_robert/"
    },
    {
        "id": "1qu6iw8",
        "author": "Somanynamestochossef",
        "title": "What’s a movie that wins you over in the first 20 minutes?",
        "content": "We’ve all had those experiences when you are we’re an hour into a film and still waiting for it to start. But then there are those rare movies where, within the first 20 minutes, you find yourself leaning back, putting your phone away and realizing: \"Oh I’m in good hands here\" or something like that.\n\nFor me it’s that perfect mix of world building and confidence. No clunky dialogue, no forced exposition just pure visual perfect storytelling that sets the tone and makes the stakes clear quickly.\n\nIt’s the kind of opening that makes you realize you’d probably watch another two hours of just those characters existing in that world or hell maybe wish that the movie never ended.\n\nWhat is the one movie that had you 100% sold before the first 20 minutes even ended?\n\n  \n**Edit:** Wow, didn't expect this to blow up like it did! Appreciate everyone jumping in. Reading through the comments, I'm seeing a lot of love for the usual suspects like *Saving Private Ryan* and *Mad Max*,up, etc... but a few lesser talked about ones mentioned in here definitely deserve more credit:\n\n* **28 Weeks Later:** That opening run across the fields is pure anxiety.\n* **Baby Driver:** The \"Harlem Shuffle\" coffee run is basically a masterclass in sync and editing.\n* **The Matrix:** Trinity’s introduction still hits just as hard 25+ years later.\n* **And others**\n\n",
        "upvotes": 641,
        "comments": 852,
        "media": null,
        "permalink": "/r/movies/comments/1qu6iw8/whats_a_movie_that_wins_you_over_in_the_first_20/"
    },
    {
        "id": "1quauf5",
        "author": "Minifig81",
        "title": "'Mystery Science Theater 3000': Rifftrax, Shout Team for New Episodes",
        "content": "",
        "upvotes": 359,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x0RYkniEJvp9aYhJWongUmjWTtNag5KBMbD8eLl1U-M.jpeg?auto=webp&amp;s=5561155f8ad6a67d30737b04574266eaba615890"
        },
        "permalink": "/r/movies/comments/1quauf5/mystery_science_theater_3000_rifftrax_shout_team/"
    },
    {
        "id": "1qtw7fo",
        "author": "DemiFiendRSA",
        "title": "New official poster for ‘Scream 7’",
        "content": "",
        "upvotes": 1770,
        "comments": 511,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b7xplysya3hg1.jpeg?auto=webp&amp;s=8bc966ce16980983e2d8c66baa0c446cbb8f9f77"
        },
        "permalink": "/r/movies/comments/1qtw7fo/new_official_poster_for_scream_7/"
    },
    {
        "id": "1qu0qoy",
        "author": "MoneyLibrarian9032",
        "title": "‘The Odyssey’ Director Christopher Nolan Takes on the Industry’s Troubles as DGA President",
        "content": "",
        "upvotes": 737,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sq4A8oF9DTWBCPuaqMHsec-VKs56EusIn4NQo7NXzDE.jpeg?auto=webp&amp;s=1428e80cd990da03b3a5b14cd4d0a2a81cf24f3b"
        },
        "permalink": "/r/movies/comments/1qu0qoy/the_odyssey_director_christopher_nolan_takes_on/"
    },
    {
        "id": "1qubah3",
        "author": "Kissfromarose01",
        "title": "I love \"Dumb\" Protagonists.",
        "content": "I was just watching the new HBO show Knight of the Seven Kingdoms and (Minor Spoilers)\n\nIt got me thinking how much I love Dumb protagonists- meaning, a character who clearly is bent on doing the right thing, but having no idea how to go about it and sort of being clueless in spite of being an unflappable good.\n\nAnother great example is Bruce Willis in Unbreakable. Guy is depressed and experiencing things he can't explain, finally another character has to lay out he may be essentially a Superhero. If no one had told him he probably never would have even figured this out and even when he is told he still has to be told what to do about it. I just love that. He's a GOOD guy whos willing to do anything to be that but just is kinda dumb. There's a sheer straight forward earnestness to them and despite lack of brains a charm.\n\nSamwise is probably a good example as well. Kinda even the Raimi spiderman a little.Anyway it's a trait I love seeing in film.\n\nAny other great examples anyone can think of?",
        "upvotes": 228,
        "comments": 164,
        "media": null,
        "permalink": "/r/movies/comments/1qubah3/i_love_dumb_protagonists/"
    },
    {
        "id": "1qu4lyf",
        "author": "Nillows",
        "title": "Bugonia (2025) is the funniest movie I have seen in a long time",
        "content": "Spoiler warning, I honestly don't reccomend reading my post if you haven't seen this film; for all the same reasons that explaining a joke no longer makes it as funny, or knowing the punchline preemptively does.  \n.\n.\n.\n.\n.\nThe ending of this movie had me cackling for a good 15 minutes. It's been days since I saw it, and it still makes me smirk to think about the amount of effort and care that went into the punchline. It was like the film equivalent of a long Norm MacDonald joke.  \n\nThe entire time. Hidden beneath the phenomenal performances from Jesse Plemmons and Emma Stone that had me on the edge of my seat **fully** convinced that I was watching a bonafide  psychological thriller not unlike many other movies I have seen in the past; 10 Cloverfield Lane came to mind as an influence and I was constantly comparing Goodman's performance to Plemmons. I was expecting another run of the mill intricate game of cat and mouse between a raving lunatic and their innocent captured prey. Some of the scenes were so visceral and intense that I completely forgot the film I had chosen was classified as 'black comedy'.  \n\nLike a lot of you, it wasn't until very near the end of the movie when the full scope of the trick that had been played on the audience (and myself) became apparent. All at once, it dawned on me that this masterpiece of a film was the comedy equivalent of the sixth sense. The entire time, in retrospect, it is blatantly and unabashedly a comedy. The police officer continuously and intentionally bringing up his past **molesting** Teddy, the 'would be heroes' chemically castrating themselves, the 'over the top' gore in some of the scenes, the bumbling and inept abduction scene, the comically bad special effects when Teddy's vest explodes, even the font that the movie uses is foreshadowing the end...the movie was screaming absurdities from the rooftop the entire time - it's entire premise is hilarious at its surface level, but the actors trick you and push their performances so far it blinds you to the fact that a very very funny story is unfolding before your eyes.  \n\nI can't wait for my second watch through, I'll enjoy looking for all the other extremely blatant clues that I ignored or missed. It's so rare that a movie has the kind of rewatch value that Bugonia does and the fact I get to enjoy the ride twice in completely different ways really speaks to how well the vision of the film was executed.  \n\nBravo.",
        "upvotes": 362,
        "comments": 119,
        "media": null,
        "permalink": "/r/movies/comments/1qu4lyf/bugonia_2025_is_the_funniest_movie_i_have_seen_in/"
    },
    {
        "id": "1qtx20v",
        "author": "Maleficent-Term-126",
        "title": "An Exorcism Movie Set in The White House, Co-Produced By Blumhouse &amp; James Wan's Atomic Monster",
        "content": "",
        "upvotes": 748,
        "comments": 88,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YP-E7eQfPUP6ZPSFnpFgydWeSOA2-Afds4_QPf2fepU.jpeg?auto=webp&amp;s=9ef55c93d25642232ea99b5247e75b58d25af966"
        },
        "permalink": "/r/movies/comments/1qtx20v/an_exorcism_movie_set_in_the_white_house/"
    },
    {
        "id": "1qtsebw",
        "author": "vought-CEO",
        "title": "The Prestige (2006) | \"Man's reach exceeds his imagination\" | Dir. Christopher Nolan",
        "content": "",
        "upvotes": 1215,
        "comments": 261,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rn2forv4f2hg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qtsebw/the_prestige_2006_mans_reach_exceeds_his/"
    },
    {
        "id": "1qtvr0d",
        "author": "SpeedForce2022",
        "title": "Michael (2026) Official Trailer - Jaafar Jackson",
        "content": "",
        "upvotes": 742,
        "comments": 425,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xTvlnXK8Mwl3heT8DZghK_h_uNSmztPTJ-bknZkCOjY.jpeg?auto=webp&amp;s=cfd536cd13c5946c3d27a3d813d1bee6cf634330"
        },
        "permalink": "/r/movies/comments/1qtvr0d/michael_2026_official_trailer_jaafar_jackson/"
    },
    {
        "id": "1quk8kf",
        "author": "oogaboogahooha",
        "title": "Are there any movies that feel like Lawrence of Arabia?",
        "content": "Any old movies that have extremely amazing cinematography that feel or hold similar essence of Lawrence of Arabia?    It doesn’t have to be an Arabian set film or setting. Just a really good cinematography? \n\nAlso it doesn’t have to be an old movie, it can be from any time line !   I was mainly in love with the feeling of loneliness and “lost” essence that Lawrence had for a decent amount of the film.  It very unique and was done so well with the world feeling so vast in the film. ",
        "upvotes": 35,
        "comments": 96,
        "media": null,
        "permalink": "/r/movies/comments/1quk8kf/are_there_any_movies_that_feel_like_lawrence_of/"
    },
    {
        "id": "1qubdr5",
        "author": "bullymcquired",
        "title": "Sunshine (2007) Deserves A Rewatch",
        "content": "This movie seems to have received a lukewarm response from audiences when it was released, and failed at the box office, but I find myself coming back to it often. \n\nI feel like it stands out from that era of space/sci-fi films as a bleak, unforgiving experience.\n\nThe special effects have aged well, the cast have all become more popular over the years, so it feels like a star-studded movie, and the visuals are out of this world (literally). \n\nDanny Boyle and Alex Garland operating at their best. I would recommend this to anyone who is a fan of the classic space exploration films I.E. 2001: A Space Odyssey. ",
        "upvotes": 115,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1qubdr5/sunshine_2007_deserves_a_rewatch/"
    },
    {
        "id": "1qu746q",
        "author": "PeneItaliano",
        "title": "To mark its 25th anniversary, A Knight’s Tale rides back into cinemas with a new 4K restoration. In cinemas across the UK and Ireland from 20 February.",
        "content": "",
        "upvotes": 173,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9fagwafd85hg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qu746q/to_mark_its_25th_anniversary_a_knights_tale_rides/"
    },
    {
        "id": "1quitqn",
        "author": "SnooCapers2774",
        "title": "HERETIC is a Must See!! One of best movies I've watched in a long time.",
        "content": "This film crawls under your skin. It’s tense, smart, uncomfortable in the best way, and it actually respects the audience’s intelligence. No lazy jump-scare shit.. Just dread, atmosphere, and ideas that stick around long after the credits ended!! \nThe performances are unreal, especially that central one. Calm, controlled, tense without needing to shout. The dialogue alone could carry the movie, but the direction and pacing turn it into something way up there!! \nHugh Grant did a really great performance in this film!!",
        "upvotes": 40,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1quitqn/heretic_is_a_must_see_one_of_best_movies_ive/"
    },
    {
        "id": "1qufei2",
        "author": "Morgan-Moonscar",
        "title": "Japanese director Kazuhiko Hasegawa (\"The Youth Killer\", \"The Man Who Stole the Sun\") has passed away at age 80",
        "content": "",
        "upvotes": 56,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-cCueZP60oTNr9oYTvf44NOjfBYLkSZjfSm98ttNqSI.png?auto=webp&amp;s=63edd45a97b119d352cbb4b55db802a727a69c24"
        },
        "permalink": "/r/movies/comments/1qufei2/japanese_director_kazuhiko_hasegawa_the_youth/"
    },
    {
        "id": "1qtwwba",
        "author": "Contcos",
        "title": "First image of Woody Harrelson and Kristen Stewart in Full Phil, directed by Quentin Dupieux",
        "content": "",
        "upvotes": 417,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/85wz9jkvf3hg1.jpeg?auto=webp&amp;s=1c5c4f64504aaece905b8abafbc606f803a3d799"
        },
        "permalink": "/r/movies/comments/1qtwwba/first_image_of_woody_harrelson_and_kristen/"
    },
    {
        "id": "1qudeh4",
        "author": "Muted-Low-5303",
        "title": "Naomi Scott in smile 2",
        "content": "So I’m late watching this movie so I apologize if it’s been posted here before… but my GOD how did Naomi Scott not get at least nominated for all the big awards! What a performance from start to finish.. I get its horror but still the golden globes or academy had to give some credit.. what a descent into madness ",
        "upvotes": 64,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1qudeh4/naomi_scott_in_smile_2/"
    },
    {
        "id": "1qtc9m8",
        "author": "MarvelsGrantMan136",
        "title": "Steven Spielberg Achieves EGOT Status After Landing First Grammy Win",
        "content": "",
        "upvotes": 10050,
        "comments": 432,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hW4x-O6KYOTxkApye50SopOLBrcKgnify3-_MfojUmA.jpeg?auto=webp&amp;s=da0f414a69b3617753fdeb36ac869c63b7c51f7c"
        },
        "permalink": "/r/movies/comments/1qtc9m8/steven_spielberg_achieves_egot_status_after/"
    },
    {
        "id": "1qtgnjx",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Devil Wears Prada 2'",
        "content": "",
        "upvotes": 4169,
        "comments": 453,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qb89c1k8dzgg1.jpeg?auto=webp&amp;s=18640aab45b7a1c4e399b73fe99228a302750334"
        },
        "permalink": "/r/movies/comments/1qtgnjx/new_poster_for_the_devil_wears_prada_2/"
    }
]