[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1j7l770",
        "author": "Aseae",
        "title": "Just the woman I am: cringiata vera",
        "content": "Sono stata alla manifestazione JTWIA a Torino.\n\n Tolta la disorganizzazione generale, alla partenza hanno speso qualche parola sull'evento, sebbene non una sulle donne. Hanno iniziato salutando il pubblico: \"ciao a tutti!!! ... e a tutte!” (maccome?) \nPoi hanno continuato con i ringraziamenti, va bene. Segue un breve discorso del sindaco, ma ancora nessun accenno alla questione femminile, mm..  Grandi applausi e poi si è passati al riscaldamento con una tizia che gridava \"su le mani popolo!\" (popolo?) \"marciamo popolo!!\" (già, proprio così). \nIl riscaldamento di grazia si conclude e un ragazzo prende la parola, inizialmente armeggiava con qualcosa e si scusa con il pubblico \"scusate, sapete, sono un uomo... \" (aiuto), boh! poi prosegue e inizia a dire che c'è un fuori programma... Nel frattempo, da un altro microfono, in mezzo alla folla un tizio gli parla sopra rivolgendosi al pubblico (o popolo come dir si voglia) :  ”Dovete sgomberare l'area della partenza, scusate! Spostatevi!\" \nOk. Quell'altro sul palco prova a riprendere la parola ed ecco, colpo di scena: chiede alla ragazza che aveva esortato il \"popolo\" ad alzare le braccia e a marciare di sposar... Ma non fa in tempo a fare la proposta (di cui onestamente non ci importava nulla) perchè, di nuovo, l'altro in mezzo alla folla riprende: \"Spostateviii!! Dobbiamo iniziare, forzaa\" Ancora qualche protesta da parte del palco che aveva deciso ormai di tenere in ostaggio il suo \"popolo\", ma niente, parte il countdown: \" Tre..  Due..\" - \"Sì lo voglio\" - \"... Uno... Bang!”\nLa folla parte: impossibile correre, perchè la maggior parte della gente avrebbe fatto il percorso camminando. Perciò chi voleva correre ha iniziato a farlo su per le collinette del parco del Valentino, tutto completamente a caso. \n\nC'era tanta gente, qualcuno vuole spendere una parola a proposito di ciò che è stato detto e non detto sul palco? Era la prima volta che partecipavo, davvero cringe.\n\n Trovo che abbia avuto molto più senso la manifestazione dell'8 organizzata da Non Una Di Meno. \n\nCosa ne pensate? ",
        "upvotes": 83,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1j7l770/just_the_woman_i_am_cringiata_vera/"
    },
    {
        "id": "1j7thar",
        "author": "SuddenElection7379",
        "title": "Musica dal vivo?",
        "content": "\n\nDopo essere stato a Parigi mi sono preso bene con la musica dal vivo, ho visto un sacco di locali che fanno serate jazz, o pub con gruppi country/rock/indie, e lo trovo un modo molto piacevole di passare la serata, anche senza aver necessariamente il \"gruppo famoso\".\n \n Per caso conoscete dei locali a Torino che fanno musica dal vivo? Musica jazz, o gruppi emergenti, o pub con musica?",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1j7thar/musica_dal_vivo/"
    },
    {
        "id": "1j82xyh",
        "author": "Ok-Path6614",
        "title": "Feste alternative con musica elettronica, discoteca italiana, musica brasiliana, ecc.",
        "content": "Vengo da San Paolo dove ci sono molte feste alternative con musica elettronica varia e non commerciale. Volevo sapere se posso trovarlo a Torino, faccio il dj e suono per divertimento, è possibile trovarlo?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j82xyh/feste_alternative_con_musica_elettronica/"
    },
    {
        "id": "1j82knt",
        "author": "Intelligent-Bell-120",
        "title": "Photo e video",
        "content": "Sono un produttore di musica hard techno e sto cercando un artista emergente nel suo campo per collaborare alla realizzazione di cover per album, foto promozionali e immagini per eventi. C'è qualcuno qui interessato?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j82knt/photo_e_video/"
    },
    {
        "id": "1j81opn",
        "author": "Antiquityyy",
        "title": "consigli disco",
        "content": "io e le mie amiche staremo a torino per 3 giorni e stiamo cercando una disco non troppo cara (per questo sabato), possibilmente non techno o trap e in una zona abbastanza sicura, qualcuno ne avrebbe da consigliare? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1j81opn/consigli_disco/"
    },
    {
        "id": "1j7ygo3",
        "author": "eventi_del_tano",
        "title": "KARAOKE",
        "content": "Buongiorno ci sono appassionati di Karaoke nella community?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j7ygo3/karaoke/"
    },
    {
        "id": "1j7vya3",
        "author": "Alarmed-Carpenter975",
        "title": "Torino Spazio Pubblico | Turin",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/W_Qhq_ISXcWi5X6sY_MzH-fvur9Q0V7KCH7pT-XrXww.jpg?auto=webp&amp;s=9d355132b60566887e62c3c5798e7a99f159052d"
        },
        "permalink": "/r/torino/comments/1j7vya3/torino_spazio_pubblico_turin/"
    },
    {
        "id": "1j7uqwl",
        "author": "MonPorridge",
        "title": "Negozio informatica / assistenza per Surface Microsoft?",
        "content": "Come da titolo, avete un negozio da consigliarmi per portare il mio surface laptop in assistenza? Purtroppo è fuori garanzia da un po', e credo che la batteria vada sostituita.\n\nPunti in più per luoghi in centro.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j7uqwl/negozio_informatica_assistenza_per_surface/"
    },
    {
        "id": "1j6r7cn",
        "author": "selalleroo",
        "title": "\"Si affitta a solo studenti\"",
        "content": "Nel pieno della disperazione da lavoratrice in cerca di una stanza decente e con prezzi decenti in cui stare, vi chiedo: perché molti padroni di casa prediligono gli studenti per fare contratti di affitto? Ma poi, fanno pure i controlli per vedere se effettivamente la persona che vuole affittare è studente o meno? No perché io sto cominciando a pensare seriamente di fingermi tale, non ne posso più. ",
        "upvotes": 38,
        "comments": 49,
        "media": null,
        "permalink": "/r/torino/comments/1j6r7cn/si_affitta_a_solo_studenti/"
    },
    {
        "id": "1j7attj",
        "author": "dani-foxy",
        "title": "Mobili usati",
        "content": "Qualcuno conosce opzioni valide per recuperare mobili di seconda mano in buone condizioni? Parlo in particolare di mercatini dell'usato specifici di arredamento o simili, che vendano divani, letti, tavoli ecc, di qualità. Una cosa che non sia\" mobili destinati alla discarica\" ma neanche \"mobili di design dell'800 che costano più di uno nuovo\".\n\nGrazie mille 🙏",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1j7attj/mobili_usati/"
    },
    {
        "id": "1j73aj5",
        "author": "ivlia-x",
        "title": "Auto Moto Turin Show - ne vale la pena?",
        "content": "Ciao, ho visto che fra un paio di settimane ci sarà questo evento. I prezzi sono alti (18€ per un giorno, 35€ abbonamento per tre giorno). \n\nQualcuno di voi ci è già stato? Ne vale la pena o è una truffa?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j73aj5/auto_moto_turin_show_ne_vale_la_pena/"
    },
    {
        "id": "1j74xyl",
        "author": "_L_-",
        "title": "Corso di Teatro: lezione di prova",
        "content": "Ciao, qualcuno conosce dei corsi di teatro validi come passatempo da ventenne?\nE in genere fanno una prima lezione di prova? \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j74xyl/corso_di_teatro_lezione_di_prova/"
    },
    {
        "id": "1j75qdx",
        "author": "IlKayMosca",
        "title": "Boati zona centro commerciale lingotto",
        "content": "Ciao a tutti, stanotte tra mezzanotte e l'1 di notte si sono sentiti 4/5 forti boati in zona centro commerciale lingotto.\nQualcuno sa cos'è stato?",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1j75qdx/boati_zona_centro_commerciale_lingotto/"
    },
    {
        "id": "1j74mzz",
        "author": "gbbarbaro",
        "title": "Gran Baloon",
        "content": "Oggi a porta palazzo c'è il Gran Baloon: vale la pena farci un giro?\nGrazie in anticipo 🙂",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j74mzz/gran_baloon/"
    },
    {
        "id": "1j73b91",
        "author": "giokim77",
        "title": "Insegnante bachata cercasi",
        "content": "Ciao, \nConoscete qualche insegnante di bachata disponibile per lezioni private? Non ho trovato nulla online. Livello base.\n\nGrazie ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j73b91/insegnante_bachata_cercasi/"
    },
    {
        "id": "1j72nfd",
        "author": "fabi-to",
        "title": "Cerco educatore cinofilo",
        "content": "Ciao :) io e il mio compagno abbiamo adottato un cucciolo un paio di settimane fa. Ora stiamo cercando un educatore/educatrice cinofilo/a che ci dia delle guide generali e ci supporti nel crescere un cucciolo felice e tranquillo. Per caso qualcuno ha una persona da raccomandare? Grazie!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1j72nfd/cerco_educatore_cinofilo/"
    },
    {
        "id": "1j756jw",
        "author": "Pretty_State_1913",
        "title": "Ultima sciata dell'anno",
        "content": "M25, è da un po' che non scio più, ma prima che termini la stagione sciistica mi piacerebbe ritornare a fare qualche discesa sulla neve. A qualcuno interesserebbe? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1j756jw/ultima_sciata_dellanno/"
    },
    {
        "id": "1j6lzna",
        "author": "No-Nobody584",
        "title": "Getting to Sacra Di San Michele?",
        "content": "Hi! I am visiting Turin this weekend and am curious if anyone knows how to get to the Sacra Di San Michele. Of course I picked the weekend b fore the shuttle services are actually running 🙄 so I'm curious if anyone can offer advice on how to reserve a taxi for this and roughly how much it should cost (the official Sacra website says taxi by reservation and about 25 euros). Any help is appreciated!",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1j6lzna/getting_to_sacra_di_san_michele/"
    },
    {
        "id": "1j6d7mv",
        "author": "dkroods",
        "title": "Stiamo aggiungendo news sui trasporti GTT in Take It Easy TO! 🚋📢",
        "content": "Ciao a tutti! 👋\n\nSiamo il team di Take It Easy TO e stiamo lavorando a una nuova funzionalità: presto sarà possibile visualizzare notizie sui trasporti pubblici GTT, come scioperi, interruzioni del servizio e altre informazioni utili direttamente nell’app.\n\nCosa ne pensate? Vi sembra una funzione utile? Avete suggerimenti su cosa vi piacerebbe vedere? Fatecelo sapere nei commenti! 😊\n\nGrazie per il vostro supporto! La funzionalità sarà disponibile presto! 🚀\n\nAndroid: https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app&amp;hl=it",
        "upvotes": 17,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nnQwOdFPDhG66upzOUX8tpygSBrrCbAym8Jn9SOS4gI.jpg?auto=webp&amp;s=44e52737a24a4ce0d5f7adb7f20f5ea1e5f986e6"
        },
        "permalink": "/r/torino/comments/1j6d7mv/stiamo_aggiungendo_news_sui_trasporti_gtt_in_take/"
    },
    {
        "id": "1j6edqk",
        "author": "mario_grondaia",
        "title": "Cercasi compagnia per serata tranquilla",
        "content": "Come da titolo stasera pensavo di fare un giro in centro o zona lingotto se qualcuno non avesse niente da fare e volesse aggiungersi mi scriva pure, niente di impegnativo anche soltanto fare due passi e fermarsi in un locale a prendere due birre a parlare del più e del meno. \n\nVi lascio un po' di info personali così capite se vi faccio schifo o abbiamo interessi in comune ahah.\nM22 quasi 23, da poco a Torino, fuorisede per la magistrale, appassionato di cinema, videogiochi (anche se principalmente tutti singleplayer), gareggio nel powerlifting quindi conosco bene l'ambito palestra, mi piace molto disegnare ma sono autodidatta (non manga ahimè per quello ho zero interesse ma sono disposto a ricredermi), ascolto musica tipo Gorillaz, Daft Punk, Strokes, Nirvana per citarne alcuni e sono Toscano se ci sono altri compaesani ahah",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1j6edqk/cercasi_compagnia_per_serata_tranquilla/"
    },
    {
        "id": "1j6g6xs",
        "author": "CristianPiovano",
        "title": "Negozio di casalinghi di alta qualità",
        "content": "Ciao a tutti! Mi serve aiuto su dove comprare piatti, bicchieri da whisky smerigliati e tazzine da caffè di qualità a Torino o dintorni: magari un posto di forniture per ristoranti? Mi servono molto belli, quindi non il classico Casanova o Coin Casa, e possibilmente dove non sia necessaria partita IVA per comprare. Qualche suggerimento?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1j6g6xs/negozio_di_casalinghi_di_alta_qualità/"
    },
    {
        "id": "1j6nagj",
        "author": "Icy_Opposite7696",
        "title": "Yarn for crocheting",
        "content": "Hey I’m pretty new in Turin and I love crocheting. I wanted to ask fellow crocheters where I can buy nice affordable yarn. Suggestions of stores that might have a lot of variety?\n\nI looked for “merceria” on maps and found “Merceria Di tutto”. (I don’t speak Italian so idk what that means)\n\nFor my last project I used yarn from action 💀",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1j6nagj/yarn_for_crocheting/"
    },
    {
        "id": "1j6nb2v",
        "author": "newbydoob",
        "title": "Safe and family friendly parts of the city",
        "content": "Hey, I have booked travel to Turin with my family for the Easter holidays and was wondering if there are any areas to look for/avoid when booking accomodation (most likely Airbnb)? I've read Milan Barrier should probably be avoided, but I'd love some local thoughts. My children are both under 10 and we won't have a car, so I'd prefer to avoid any problematic neighborhoods when walking back in the evening. \n\nTIA\n\n--\n\nCiao, ho prenotato un viaggio a Torino con la mia famiglia per le vacanze di Pasqua e mi chiedevo se ci sono delle zone da cercare/evitare quando si prenota un alloggio (molto probabilmente Airbnb)? Ho letto che Milan Barrier probabilmente andrebbe evitata, ma mi piacerebbe avere qualche idea locale. I miei figli hanno entrambi meno di 10 anni e non avremo un'auto, quindi preferirei evitare quartieri problematici quando torno a piedi la sera.\n\nGrazie mille",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1j6nb2v/safe_and_family_friendly_parts_of_the_city/"
    },
    {
        "id": "1j5ty43",
        "author": "Convi96",
        "title": "Torino+ | Nuovo aggiornamento 📱",
        "content": "Ciao a tuttii 🙂  \n  \nPer chi di voi aveva visto il post precedente (ma anche per chi non l'aveva visto, o si è solo dimenticato visto che sono passati un po' di mesi), volevo dirvi che ho rilasciato un aggiornamento di Torino+ con un po' di correzioni e migliorie che mi avevate suggerito!  \n  \nIn particolare, una nuova sezione dove potete pubblicare direttamente eventi che organizzate o che volete far conoscere ad altri utenti 🙂  \n  \nNel caso in cui non sappiate di cosa sto parlando, Torino+ è un'app che sto sviluppando per centralizzare le informazioni su tutti gli eventi/mostre/musei e info generali della città, su mobilità e turismo  \n  \nVi lascio i link per scaricarla, mentre [qui](http://torinopiu.it) potete trovare qualche info in più!  \n..e nel caso voleste darmi altri suggerimenti/consigli/idee sono sempre super apprezzati, scrivetemi un commento qui o un dm, o se volete ci andiamo a prendere un caffe insieme 😂  \n  \n🍏 [https://apps.apple.com/it/app/torino/id6547848251](https://apps.apple.com/it/app/torino/id6547848251)  \n🤖 [https://play.google.com/store/apps/details?id=it.torinopiu](https://play.google.com/store/apps/details?id=it.torinopiu)",
        "upvotes": 38,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j5ty43/torino_nuovo_aggiornamento/"
    },
    {
        "id": "1j62uxz",
        "author": "deadboyy",
        "title": "GY!BE alle OGR",
        "content": "Sarei dovuto andarli a vedere domani con la mia compagna ma si è presa la polmonite quindi ci vado da solo.\n\nHo un biglietto in più, non credo si riesca rivendere perché non è sold out. Se qualcuno vuole venire con me (o senza di me) scrivesse.\n\nEDIT: Biglietto regalato ad un redditor. Per chi volesse beccarsi al concerto mi scriva pure in chat.",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j62uxz/gybe_alle_ogr/"
    },
    {
        "id": "1j6h7vv",
        "author": "iiamgabriiele",
        "title": "Serata a Torino",
        "content": "Ciao a tutti cerchiamo persone con la quale passare una serata tranquilla in un pub dalle parti di mirafiori nord. \nSe siete interessati contattatemi io e un mio amico siamo entrambi M21 e siamo disposti molto conoscere nuove persone. \nFateci sapere, grazie :) \n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j6h7vv/serata_a_torino/"
    },
    {
        "id": "1j6h0tq",
        "author": "veleno111",
        "title": "dimagrire",
        "content": "ciao qualcuno conosce un medico che può prescrivere pillole per dimagrire o sa falsificare le ricette?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1j6h0tq/dimagrire/"
    },
    {
        "id": "1j605d8",
        "author": "mario_grondaia",
        "title": "Cercasi compagno di mercatini",
        "content": "Buonasera, sono uno studente fuorisede di 22 anni e mi sono trasferito recentemente da novembre a Torino. Venendo da un paesino della Toscana non sono abituato per niente allo stile di vita da città e tra le mille cose inesistenti per le realtà di \"campagna\" ci sono proprio i mercatini dell'usato. Solitamente se compro/vendo qualcosa di usato lo cerco su vinted ma mi piacerebbe girare appunto fra i mercatini anche solo per curiosità, non perforza con l'idea di farci profitto.\n \nQuindi niente cerco chiunque abbia voglia di fare un giro fra i mercatini, preferibilmente qualcuno di Torino o che ci viva da un po' così da introdurmi anche alla vita da città ahah ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j605d8/cercasi_compagno_di_mercatini/"
    },
    {
        "id": "1j5rfy0",
        "author": "chickenwithmuchsauce",
        "title": "RAGAZZI DAI CAPELLI LUNGHI, da chi andate a farvi tagliare i capelli?",
        "content": "Domanda semplice. Sono un ragazzo ed è la prima volta nella mia vita che mi faccio crescere i capelli e \nho raggiunto una certa lunghezza (lunghezza spalle). Vorrei dei suggerimenti per sapere dove poterli andare a farmeli tagliare a Torino, visto che il classico barbiere che usa i rasoi elettrici non è più adatto.",
        "upvotes": 7,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1j5rfy0/ragazzi_dai_capelli_lunghi_da_chi_andate_a_farvi/"
    },
    {
        "id": "1j6089l",
        "author": "Used_Scar_2043",
        "title": "Cinese a Torino",
        "content": "Ciao a tutti!\n\nMi sono trasferita a Torino dà poco tempo dopo essere vissuta en Cina parecchi anni per studio e lavoro. Mi piacerebbe trovare amicizie/language partner di cinese (普通话). Io offro Spagnolo (native) e Inglese (fluent). Il mio italiano è conversational ma non ancora fluent. \n\nSpero trovare qualcuno, non vorrei dimenticare la lingua!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1j6089l/cinese_a_torino/"
    }
]