[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mbxvig",
        "author": "BeckettWilderness",
        "title": "Happy Gilmore 2 … rate it",
        "content": "I have seen so many great reviews for this movie and I know taste is completely subjective but I just didn’t like it - am I the only one? I am happy to see a lot of classic actors in this film though. \n\nPost Edit* After a little bit of reflection: I think it wasn’t horrible but the original is such a great classic - maybe subconsciously I had a very high expectation. ",
        "upvotes": 47,
        "comments": 169,
        "media": null,
        "permalink": "/r/netflix/comments/1mbxvig/happy_gilmore_2_rate_it/"
    },
    {
        "id": "1mbi3pw",
        "author": "restrictednumber1996",
        "title": "I can’t lie anymore. The Hunting Wives is sleazy, twisty and a hell of a summer binge.",
        "content": "Look, it isn’t Emmy award winning TV. The acting only ranges slightly fair. The characters are terrible people. \n\nBut I’d be lying if I said I wasn’t sucked in from the very first episode. It’s got everything a good summer binge should have for me. Like a trashy beach read. A mystery, sex, lies, and twists. It’s a super fun romp. \n\nAlso: I see some comments stating that Brad and Jamie are underage, thus making some scenes uncomfortable. Idk about the book, but they are 18 years of age on the show. Still taboo because he is a student, but I did want to mention that. Malin did an interview on it recently. \n\nAll in all, if you want a quick and breezy watch with some bonkers moments, take a watch. ",
        "upvotes": 214,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1mbi3pw/i_cant_lie_anymore_the_hunting_wives_is_sleazy/"
    },
    {
        "id": "1mbhoob",
        "author": "Nexfinity",
        "title": "Bad Influence Season 2 - Passes",
        "content": "Has anyone else heard rumors of Netflix doing a second season and covering all the child exploitation and CSAM legal troubles that Passes is facing? Would be interesting to see how they handle as I thought season 1 was fascinating and abhorrent. \n\n\n\nI like how they focused on the blame the parents share, which would be interesting with Passes since they required parental consent for the under 18 creators, though there's claims they allowed a few creators around that. Also a platform making $$$ off of selling bikini pics of 12-year-old girls is wild. Would be pretty explosive as Alec Celestin recruited and partnered with Lucy Guo who is now the \"youngest self-made female billionaire\".\n\n  \nAny other ideas for a second season?",
        "upvotes": 142,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mbhoob/bad_influence_season_2_passes/"
    },
    {
        "id": "1mc523p",
        "author": "Neat_Suit3684",
        "title": "Trainwreck Area 51",
        "content": "Im just finding this series and I gotta say rewatching the Area 51 madness is making me howl! 😂 like Im loving how crazy people got into this.\n\nIdk what the other trainwreck documentaries are but im hoping theyre as funny as this.\n\nI still can't believe a dude made this whole thing up outta boredom. Like that just blows my mind how crazy it got and he wasnt even trying to do anything serious 😂 ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mc523p/trainwreck_area_51/"
    },
    {
        "id": "1mc2fcb",
        "author": "Mapl3nt",
        "title": "A Good Girls Guide to Murder",
        "content": "I was reading a lot of reddit discussions about AGGGTM and a lot of them complained about the show and how unrealistic it was for a 17 year old girl to be getting herself involved with r*pist and drug dealers ect. and IDK I loved the show so much and I can’t wait for a second season. \nWhy, if any reason, do you not like any part of the show? \nalso what was your favorite part of the show?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mc2fcb/a_good_girls_guide_to_murder/"
    },
    {
        "id": "1mb0szl",
        "author": "wayowayooo",
        "title": "Cruise director in Amy Bradley documentary receiving tons of backlash",
        "content": "Looks like Kirk Detweiler is getting tons backlash for his comments in the Amy Bradley is Missing documentary. He’s completely deleted his social media. I was surprised to see he didn’t express more empathy and remorse for how the situation has unfolded - so I think the criticism is deserved. What do you think?",
        "upvotes": 750,
        "comments": 300,
        "media": null,
        "permalink": "/r/netflix/comments/1mb0szl/cruise_director_in_amy_bradley_documentary/"
    },
    {
        "id": "1mbv0s3",
        "author": "Alive-Side2551",
        "title": "Scandal and Grey’s Anatomy disappeared off of Netflix today",
        "content": "\nFINAL UPDATE: well I uninstalled and reinstalled the apps on my phone and iPad, signed out of the tv and turned everything off and back on and no change when I booted it all back up. I gave up and went back to living my life and about an hour later came back to check and it all reappeared. Thank you everyone for coming on this very unimportant journey with me 😂\n\nEDIT/UPDATE: this does appear to just be my Netflix account (US West Coast) and it’s just slowly removing all the shows in my “Continue Watching” list from my Netflix altogether. I can’t find them at all searching for them in Netflix. It will only give me shows “like” the one I’m searching for. This is consistent across all devices: iPhone, iPad Pro, and a LG OLED tv. Very strange. I hope I get my shows back eventually 😭\n\nOriginal text:\nI was watching Scandal through again as a passive watch while doing chores and such, and after this last episode (I was somewhere in season three) it didn’t play the next episode and it just…went away completely off of Netflix. Off my continue watching list, and I can’t find it searching either. I googled it and there was a Netflix link announcement from last month, that it was coming back, and that link took me to a “remind me” page for the show on Netflix, essentially saying they will remind me when it’s available. I also noticed (though I don’t watch it) that Grey’s Anatomy is gone too. \n",
        "upvotes": 6,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1mbv0s3/scandal_and_greys_anatomy_disappeared_off_of/"
    },
    {
        "id": "1mbssy8",
        "author": "BeckettWilderness",
        "title": "Sirens Show - help me settle something please",
        "content": "My gf and I were watching it together and when the scene comes on where Devon has a dress and makeup on, I said “she cleans up well” and my gf said it was judgemental. I said well in the beginning she looked a little frumpy because she had travelled a good distance and had no clean clothes and my gf got very offended like I was calling her ugly or something. I said this was not the case and now she is mad at me. Would anyone agree she looked kind of frumpy in the intro pilot episode or am I a judgemental ahole?\n",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mbssy8/sirens_show_help_me_settle_something_please/"
    },
    {
        "id": "1mbyrre",
        "author": "Disastrous-Major-442",
        "title": "Mid way through Building the Band",
        "content": "i feel like i am about to have a VERY unpopular opinion here...does anyone else feel like half of these people dont need a band and really should go solo? like Nico, Cameron, Elise, etc; like they are absolutely amazing, sure the band part is helping in support and fun and a family, but i truly feel like if they break up after this show or anything similar, they absolutely should be making their own music?!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mbyrre/mid_way_through_building_the_band/"
    },
    {
        "id": "1mc4xla",
        "author": "Mikes1992",
        "title": "Is there any way to create a subscription using the pricing from another country?",
        "content": "I noticed you can get the basic 720p ad free plan in India for ₹199 which is around £1.72/month\n\nWe currently pay £4.99/month with ads. I was wondering if it'd be possible to choose different pricing models in other countries? \n\nI've heard that netflix takes into account your billing address so I'm not really sure if it would be possible to get around this. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mc4xla/is_there_any_way_to_create_a_subscription_using/"
    },
    {
        "id": "1mc4tjy",
        "author": "skia_excalibur",
        "title": "KPDH loophole?",
        "content": "I recently watched the movie and had this question stuck in my mind. So, Rumi has patterns and that's why she covers her arms and neck in the outfits and doesnt go to the bath house with the others, right? But she wears croptop in the performance. Are there no patterns in the midriff region? 🙃",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mc4tjy/kpdh_loophole/"
    },
    {
        "id": "1mbvv6g",
        "author": "NSquared3131",
        "title": "Did they switch back to the old layout?",
        "content": "I watch Netflix on Roku and over the weekend my app updated and I hated the new layout. Today I opened the app and it went back to the original style that I’m used to. What version does everyone have right now?",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mbvv6g/did_they_switch_back_to_the_old_layout/"
    },
    {
        "id": "1mc2fnt",
        "author": "Superb_City8645",
        "title": "Animal Kingdom, The end? Spoiler Alert",
        "content": "I just finished Animal Kingdom and I have to say I’m very disappointed in the ending. They had such a good run the whole show. Why would it end like this? It’s like no thought went into the end at all. \nThe way I thought it would have ended is; Pope meeting up with J, Adrian. Then of course J meeting his demise. Karma. \n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mc2fnt/animal_kingdom_the_end_spoiler_alert/"
    },
    {
        "id": "1mbvnbj",
        "author": "Equivalent_Phrase_25",
        "title": "Season 5 YOU (spoiler)",
        "content": "Something about the last season is bothering me and just doesn’t make sense to me. Kate asked joe to kill her uncle bob after he threatened to expose her after the pipe job that killed children and such. \n\nJoe does what she asks, but then she loses her shit and gets mad at him for killing him when she literally asked him too?. It doesn’t make sense. Then after she tries to take the kid and separate herself and call him a psychopath when they are both in the same boat lol. \n\nAnd also the ending of the show low-key sucked. I’m sorry but bronte literally being shot and still running away makes ZERO sense. Also I’m not 100% sure but I think she got shot in the liver so there’s that. Joe tried to drown her but apparently that didt work. Like what dude ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mbvnbj/season_5_you_spoiler/"
    },
    {
        "id": "1mbycet",
        "author": "guywho_try-tobe-nice",
        "title": "New layout",
        "content": "How do you access new and upcoming shows with this new format also the old format seemed more convent I mean its a nice Jestuer and all but why would they do this",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mbycet/new_layout/"
    },
    {
        "id": "1mbx65n",
        "author": "Definitely_NotHer",
        "title": "Does anyone know if “The One” is getting a second season?",
        "content": "I watched this show during the pandemic and I recently watched it again out of boredom; now I’m sitting here wondering if there’s a season 2 coming. I’m reading mixed things on the internet and just wanted to know if anyone has a good source or idea whether there will be more to come. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mbx65n/does_anyone_know_if_the_one_is_getting_a_second/"
    },
    {
        "id": "1majx8l",
        "author": "K1mbacat",
        "title": "Netflix cancelling shows after one season is making me want to cancel my subscription",
        "content": "Is anyone else frustrated about this? I’ll watch a new show (released within the past few months), finish the season and get invested, only to find out they’ve cancelled it a month later. I’ve found articles saying it’s due to “low viewership”, but they didn’t even recommend the shows to me, no advertising, etc, and then cancel it shortly after, before most people have even heard of the series. I’m starting to consider cancelling my subscription because of this.",
        "upvotes": 846,
        "comments": 194,
        "media": null,
        "permalink": "/r/netflix/comments/1majx8l/netflix_cancelling_shows_after_one_season_is/"
    },
    {
        "id": "1mb3ksh",
        "author": "gena5445",
        "title": "Untamed",
        "content": "I felt this show was decent but one thing that really annoyed me was the trope of ‘character being saved at the last second’. This show did this literally 3 times! One character was being choked to death.. at the last second, he/she is saved. Another was trapped in a cave in the middle of nowhere. As water is pouring in,he/ she is saved. The last one, when a character was shot and the shooter was doing yet another annoying trope ( talking too much, it’s time for you to die etc), the good guy/girl was miraculously saved…By ANOTHER trope … you hear the gun shot…the victim looks pained. And wait what? The killer is shot instead!! And the ‘friend’ just happened to show up at ‘just the right time’ and in ‘just the right place’ so they can shoot the shooter! 🤦‍♀️🤦‍♀️\n\nOn another note~ Eric Bana is 🔥",
        "upvotes": 50,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1mb3ksh/untamed/"
    },
    {
        "id": "1mbuuld",
        "author": "silentpassion1",
        "title": "Shows like love and anarchy?",
        "content": "I recently finished watching ‘love and anarchy’ and I absolutely loved it. I love the quirkiness, casualness, and of course the romance aspect of the show. I would really like to find a show similar to it, it can be on or off Netflix. Please let me know if you have any recommendations!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mbuuld/shows_like_love_and_anarchy/"
    },
    {
        "id": "1mbku0n",
        "author": "HehroMaraFara",
        "title": "Hightown",
        "content": "Had to give up halfway through season 2. I don’t know what the concept was, but if it wa to give us anyone to give a shit about, they failed miserably. \n\nThe show synopsis: Shitty, selfish people do shitty, selfish things to other shitty, selfish people. The “protagonist” is an annoying spoiled child who constantly acts tough but can’t even take on a junky in rehab without begging for mercy. \n\nIt’s bad. You won’t care if anyone dies and will cringe at all the long, unnecessary sex scenes and horrible “romantic” dialogue and deliveries. ",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mbku0n/hightown/"
    },
    {
        "id": "1mbtoqm",
        "author": "Keymera94",
        "title": "Restaurant Wars Thailand. Thoughts on episodes so far?",
        "content": "I’m really enjoying the show but sad to see very less chatter about it here on Reddit. What do you guys think about the episodes, judges, and Chef Leong so far? \nOne thing that i really wanted to get off my chest was that I adore and love Chef Pam for being so calm but I truly felt the wasted opportunity of her having the most amount of talented individual cooks in her team but failing when it came to strategies and executions. Also agree with the other two chefs that she’s played the safest so far and hardly experimented or pushed her cooks beyond their comfort zone unlike the other two teams where I can visibly see growth of some contestants. It’s sad that she’s down to three members now as all 3 of them are much more deserving than most others in the competition right now.\n \nChef Ton is my fav so far. He’s been getting the most challenging ingredients but does well. Also, no specific standout individual cook in his green team esp after the dessert guy left and yet they’re acing most of the challenges under his brilliant guidance. Regarding Chef Art, even tho I’m not a fan of his constant yelling, I’ll still credit him for pushing his team beyond their comfort zones. Off used to annoy me but his and Aomsin’s growth in the show is undeniable. As of now, I’m rooting for Nokky 💪 \n\nOn Chef Leong - maybe it’s just me but he rubs me off the wrong way sometimes. Find him unnecessarily rude soemtimes and esp hated the way he was so tone deaf with Dear’s appeal of leaving the competition. \n\nThis was my personal take on the show so far. Please share yours as well!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mbtoqm/restaurant_wars_thailand_thoughts_on_episodes_so/"
    },
    {
        "id": "1mbg25c",
        "author": "IcyAd6894",
        "title": "rant",
        "content": "For the past month, I've been trying to put on a show daily hoping that I find something that's barely interesting to watch. Man, the quality absolutely sucks!! They're not even 1% engaging, totally bland. Forget a good storyline, the characters are dull, the conversations they have are no more interesting than my neighbours. There's nothing that's gripping about them. I remember a couple of years ago, there were shows that would suck you into their world, no matter what other tasks you were doing and lure you to binge-watch entire seasons. Now, I'm trying so hard to focus my mind and giving it a chance to barely excite me, but I'm getting bored every passing minute. Please give me suggestions ! ",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mbg25c/rant/"
    },
    {
        "id": "1mbp3rb",
        "author": "BreadfruitNo9500",
        "title": "Poseidon, D 70",
        "content": "I recently bought a Poseidon D7 sound bar and connected it to my TV. It appears to be working fine however I’ve noticed that movie stopped appearing as 5.1. In Netflix, does anyone have any specific settings? I should do? I have a Roku ultimate I don’t know if that helps.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mbp3rb/poseidon_d_70/"
    },
    {
        "id": "1mbo7qg",
        "author": "LoneRedLobster",
        "title": "Is it just me or y'all too find this series bit wonky? (Rant)",
        "content": "So yeah, finally My Life with the Walter Boys Season 2 is landing on Netflix August 28. I watched Season 1 when it came out and while it was kinda bingeable, it felt super formulaic at times. Jackie moving in with a house full of brothers after a tragedy? That’s solid teen drama setup, but I personally don’t think they did enough with it.\n\nThe whole Cole vs. Alex triangle got tiring. Like, I get the appeal of the two-opposites dynamic, but Jackie’s character development felt kind of all over the place. And some of the Walter boys basically existed just to fill background chaos. I didn’t feel that emotionally connected by the end it felt more like a CW drama dressed up with a Netflix budget.\n\nThe characters just didn't do much tbh and the story looked little floppy to me as it went on.\nThat said, I’m still curious about Season 2. Jackie’s heading back to Silver Falls,(what a move after wrecking up) and they’re bringing in new characters like a “mysterious rodeo rider” and some new senior guy who’s supposed to shake things up. Could be good if they give more attention to the side cast and let the characters actually grow instead of just bounce between emotional decisions.\n Kinda wild they’ve already greenlit Season 3, like, really? Was this series that famous?After one season that got mixed reviews? Netflix seems way more confident in this show than I am. I’ll probably give the new season a shot, but it needs to step up with stronger writing and less trope-heavy drama. Just feels like a show still figuring out its tone.\n\nPS: I posted this on the og sub with spoiler tag and still good removed, idk wtf is wrong.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mbo7qg/is_it_just_me_or_yall_too_find_this_series_bit/"
    },
    {
        "id": "1mb9hj3",
        "author": "lovemyhoodedsweaters",
        "title": "Can Americans usually tell if actors in U.S. shows are actually from Australia?",
        "content": "Not necessarily Netflix related, but I just watched Untamed and just found out this lead actor Eric Bana is actually from Australia. I'm from the Netherlands and I don't notice the accent, but I was just wondering... isn't it annoying for Americans that they can hear the accent and can tell he's not from the US? Or is it so well done that it's hard to notice?   \nIn the Netherlands actors shouldn't try to do a Flemish accent or even another accent within the Netherlands, 'cause you can immediately tell they are not from that area. ",
        "upvotes": 6,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1mb9hj3/can_americans_usually_tell_if_actors_in_us_shows/"
    },
    {
        "id": "1mb08ti",
        "author": "Meinov",
        "title": "Squid Game kinda lost its original theme in season 2 and season 3.",
        "content": "**A bit of context first:** I was one of those people who watched *Squid Game* as soon as it dropped back in October 2021. I was genuinely thrilled that the show was getting the attention it deserved, and I was really hyped for the upcoming seasons.\n\nThat said, I have to admit—I’m disappointed with how *Season 2* and *Season 3* turned out. Don’t get me wrong, I’m not saying they’re outright bad, but they lost the original theme and depth that made *Season 1* so impactful. The first season was a sharp commentary on Korean society, particularly capitalism. It portrayed a world where the lives of the poor were reduced to entertainment for the ultra-rich—a brutal but honest reflection of societal inequality.\n\nIf Netflix plans to create a U.S. spinoff—or one based in any other country—I hope they do more than just swap Korean actors for American ones. They need to research and present social commentary that fits that country’s context. Otherwise, it’ll just feel hollow.\n\n*Season 1* worked because it explored the darker side of capitalism and the widening gap between rich and poor. Even the twist with Player 001 being the mastermind added a layer of complexity that elevated the story. *Season 2* tried to pivot toward themes like democracy and how easily the masses can be manipulated when money is involved, which had potential, but the execution fell flat. By *Season 3*, the games didn’t feel as engaging, and the characters were far less memorable. It felt like people were dying left and right without much emotional weight.\n\nEven the subplot involving the soldier with PTSD, which initially added a sense of mystery, ended up being disappointing—especially when it turned out he was lying the whole time. The police officer, who had so much intrigue in the first season, felt completely useless across the next two. And Gi-hun’s death, all for the sake of the baby—only for him to never meet his daughter—felt like a bitter conclusion that didn’t land emotionally.\n\nNow there’s talk of a *Squid Game USA* and even a whole cinematic universe. Honestly, I think that’s a bad idea, especially considering how the quality dipped in *Season 2* and *3*. I don’t want this to turn into a franchise where the core idea becomes nothing more than “rich people watch poor people suffer,” stripped of any real message or nuance.\n\nI can talk about this more",
        "upvotes": 21,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mb08ti/squid_game_kinda_lost_its_original_theme_in/"
    },
    {
        "id": "1mbdigb",
        "author": "No_Forever1304",
        "title": "There must be a separate genre for shows like Walter boys, ransom canyon and motorheads",
        "content": "What is the genre called? It all feels the same. Terrible cliche acting, a certain amount of righteousness, very predictable storylines. All of them give the same vibe. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mbdigb/there_must_be_a_separate_genre_for_shows_like/"
    },
    {
        "id": "1mbvqh1",
        "author": "Iam_MoshPotato",
        "title": "Why does Netflix want you to pay so much for a subscription but their smart tv app almost never works?",
        "content": "So my Netflix app on my smart tv only works about every other day sometimes it won’t work for days on end then will suddenly start working then you can close it an it will stop working I’ve got a Visio smart tv I haven’t found many solutions for this problem if anyone has any suggestions on how to fix this.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mbvqh1/why_does_netflix_want_you_to_pay_so_much_for_a/"
    },
    {
        "id": "1mbf04y",
        "author": "ThoughtExtreme165",
        "title": "Bug on LG CX Netflix App: Unable to Scroll Through Seasons/Episodes",
        "content": "Hey everyone,\nI'm having a persistent issue with the Netflix app on my LG CX and was wondering if anyone has seen this before or found a fix.\nWhen I go into a show with multiple seasons (like \"One Piece\" in the video), I can't [properly scroll through them](https://youtu.be/s0LjJvWXvp8?si=RhuVeYrJjWhkoMIr). I can move up and down the season list on the left, but the episode list on the right doesn't update to match the selected season. It's just stuck on the episodes from the first season I clicked on.\nI recorded a short video demonstrating the problem: Https://youtu.be/s0LjJvWXvp8?si=RQeNgfSwKKHNd84e\nSo far, I've tried the usual troubleshooting steps:\n * Closing and relaunching the Netflix app\n * Restarting the TV\n * Checking for updates for both the app and the TV's firmware\nHas anyone else with an LG CX or another WebOS TV run into this? Any known workarounds would be greatly appreciated!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mbf04y/bug_on_lg_cx_netflix_app_unable_to_scroll_through/"
    },
    {
        "id": "1mbe95o",
        "author": "anonymoose373",
        "title": "Why are some movies discoloured?",
        "content": "Some movies on netflix appear with a pink and green tint, as if it has lost all blue colour (Happy Gilmore 2 and Game Over, Man!) while others are unaffected (true memoirs of an international assassin and Pineapple Express). I assume this ins't a hardware issue as it only affects certain titles, but this is happening on a chromecast with google TV, playing on a Toshiba TV",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mbe95o/why_are_some_movies_discoloured/"
    }
]