[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1ot3vhz",
        "author": "Lower_Toe3514",
        "title": "What is that one movie which everyone loves unanimously but you hate it with all your heart?",
        "content": "For me it's Leon - The Professional.\nExcept the opening sequence and Gary Oldman's performance, nothing else felt quite compelling to me as most made it out to be. The pedophilic thread was the boiling point for me as I've never been this uncomfortable in even a disturbing movie, let alone a so-called \"action\" film. I'm familiar with the director's personal life as well as the extended cut and the disgust relating to it just goes on more by the day. Do let me know what is your opinion on this film as well as the films you hate which received critical acclaim.",
        "upvotes": 39,
        "comments": 256,
        "media": null,
        "permalink": "/r/netflix/comments/1ot3vhz/what_is_that_one_movie_which_everyone_loves/"
    },
    {
        "id": "1osywvk",
        "author": "GeneralIronsides2",
        "title": "Finished Death by Lightning and....",
        "content": "It is so well put together, and I was blown away by the fact that a lot of what happened in the show was pretty faithful to what actually happened, Charles Guiteau did become apart of a free loving commune, and was a failure at everything he did in life. Garfield was a Civil War hero and a abolitionist, and he didn't initially want his parties nomination, and is considered one of the last 'log cabin' Presidents, because he like Lincoln was born in a log cabin. Guiteau had hidden the gun in his pocket and the police only found it after taking him to the police station, and the first metal detector was used on Garfield. Guiteau's brain was actually studied, and its thought that his actions may have been due to syphilis, though of course in the 1880s medical tests like that were very unreliable. And Chester Arthur passed a lot of Garfield's corruption reforms. The score was great, made by the same composer that did Game of Thrones and Iron Man. I also thought they nailed Michael Shannon's look, his beard looks very similar to Garfield's pictures. Betty Gilpin's performance was so convincing.",
        "upvotes": 33,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1osywvk/finished_death_by_lightning_and/"
    },
    {
        "id": "1ot0cdi",
        "author": "Scenora",
        "title": "Would you recommend Frankenstein to others?",
        "content": "Hey everyone! I just finished watching Frankenstein and really enjoyed it. \n\nDo you think it’s worth recommending to others? Would love to hear what you all think!",
        "upvotes": 8,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1ot0cdi/would_you_recommend_frankenstein_to_others/"
    },
    {
        "id": "1ot7z4m",
        "author": "purple_jelly30",
        "title": "Can someone suggest me shows similar to Derry girls ?",
        "content": "I really loved the show and also I enjoyed the accent so I’m looking for something as refreshing , funny and light as Derry girls. Please do recommend me some ! ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ot7z4m/can_someone_suggest_me_shows_similar_to_derry/"
    },
    {
        "id": "1ot5b3c",
        "author": "AccurateWin9104",
        "title": "Suggestions please",
        "content": "Have watched Breaking bad, Haunting of hill house, Better call Saul, Osama bin laden documentary, Boston bombings, currently watching John Wayne Gacy tapes.\nAny suggestions for suspense, thriller series on Netflix?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ot5b3c/suggestions_please/"
    },
    {
        "id": "1ostvhi",
        "author": "StandardConscious140",
        "title": "just finished Adolescence",
        "content": "I honestly wasn’t ready for this show.I thought *Adolescence* was just another teen Netflix drama but halfway through, I had to pause it because I started crying. As a mom, watching that boy get bullied, isolated, and then drift into those dark online spaces hit me *hard*. My son is 13, and lately he is been quieter, more defensive about his phone, and sometimes I catch glimpses of mean comments on his messages. The show made me realize how blind we parents can be when it comes to what happens behind screens. The way social media, group chats, can turn toxic so fast… it honestly scares me.\n\nSo now I am looking for real advice, What do you all actually use to protect your kids online?(tools, apps,research)please suggest in the comments",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ostvhi/just_finished_adolescence/"
    },
    {
        "id": "1osagjd",
        "author": "crazyirish71",
        "title": "End credits of House of Dynamite reveal what happened",
        "content": "Spoilers ahead…\n\nWe watched HoD and were loving the suspense but really disappointed by the ending.\n\nWe have the subtitles on all the time and if have English CC subtitles turned on around 1:44:00 when the “Music By” credits appear you hear an explosion in the distance and the subtitles say “explosion” so we took it as Chicago was hit.\n\nAnyone else hear this in the credits?",
        "upvotes": 160,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1osagjd/end_credits_of_house_of_dynamite_reveal_what/"
    },
    {
        "id": "1ot7w0w",
        "author": "___enthusiast",
        "title": "Old show about MK ULTRA?",
        "content": "In 2017/2018 I watched a series in Netflix about a small town and something to do with MK ULTRA. There was a young boy who's father was in the army, and his mother was a nurse I think? \nI can't remember for the life of me what the show was called and I can't find it anywhere online. \nDoes anyone know what it could be?? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ot7w0w/old_show_about_mk_ultra/"
    },
    {
        "id": "1ot772n",
        "author": "theartdepartmentntx",
        "title": "\"Girls Incarcerated - WHERE Are The Brushes?\"",
        "content": "I know I am super late to the party, and this is actually my second watch through. I once again find myself thinking, rudeness and aggression aside, does not one girl own a brush? Maybe it's because I have a daughter but it baffles me that none of these girls are being told to brush their hair regularly. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ot772n/girls_incarcerated_where_are_the_brushes/"
    },
    {
        "id": "1ose2y2",
        "author": "Curious_Natural_1111",
        "title": "Guillermo del toro Frankenstein is an aesthetic sight",
        "content": "One of the most cinematic movie I have watched this year. Right from the beginning, the way flame was captured in the frozen night was breathtaking. Loved he costumes, the lightening, the set, just brilliant. Oscar Isaac really pulled off the role of mad scientist. \n",
        "upvotes": 63,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ose2y2/guillermo_del_toro_frankenstein_is_an_aesthetic/"
    },
    {
        "id": "1ot2u2h",
        "author": "1mountaingoat",
        "title": "Error (-121) \"Please make sure your device has Internet connectivity and the Date and Time settings are accurate\"",
        "content": "Recurring error. Started appearing randomly and won't go away. I have factory reset the TV, reinstalled the app, hard reset modem/router. I have connected the TV via Ethernet and i have verified that the date/time are correctly set. This is the only app on the TV that doesn't work. I'm at a loss; what can i try next? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ot2u2h/error_121_please_make_sure_your_device_has/"
    },
    {
        "id": "1osr7lq",
        "author": "JettaLove",
        "title": "I loved The Asset! What should I watch next?",
        "content": "I really loved the series The Asset and am trying to find something else to watch now. Any suggestions??? I am watching Lazarus now but can’t quite get into. I love a good detective/cop “catch the killer” show. My favorite is probably The Killing. Anyway would love to hear your opinions! TIA",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1osr7lq/i_loved_the_asset_what_should_i_watch_next/"
    },
    {
        "id": "1ot3ew4",
        "author": "Original_Giraffe_830",
        "title": "infinity train: book 1",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ot3ew4/infinity_train_book_1/"
    },
    {
        "id": "1ot1l90",
        "author": "rp2784",
        "title": "Interface main show skipping past the next show.",
        "content": "As scroll through the shows. I find that the main window will skip past the next show that is just to the right of it. Is that a bug or planned design?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ot1l90/interface_main_show_skipping_past_the_next_show/"
    },
    {
        "id": "1osjh0f",
        "author": "Historical-Egg-9194",
        "title": "Million dollar secret was a great reality show.",
        "content": "Loved it alot won't spoil anything but the way they build up the characters emotions and relationships every elimination dinner you wouldn't be sure who would get voted out and there was never a clear favourite to win it. The show was well done and very good. Recommend it to anyone who likes reality tv.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1osjh0f/million_dollar_secret_was_a_great_reality_show/"
    },
    {
        "id": "1oswzdv",
        "author": "Dr_Valen",
        "title": "How does Netflix determine a household?",
        "content": "My Netflix has been giving me popups about not being in the household even tho I'm at home and have never used it outside my house for months now. I tried chatting with support but they're basically useless how does Netflix determine the household? Is it IP based cause all the devices getting the issues are in the same network? Is this stupid program just broken? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oswzdv/how_does_netflix_determine_a_household/"
    },
    {
        "id": "1ostnni",
        "author": "mavgirl777",
        "title": "the deadly american marriage kids",
        "content": "i think we all agree molly is the type to befriend a pregnant lady to then take the baby and off the mother. she’s no saint.. Her dad and her def got off easy, she’s not even crying in the documentary..\n\nhowever i find it hard to understand the kids.. i understand wanting a mom.. as i lost a parent.. and tho molly took that roll it’s just crazy in that they chose to lie for her. I think she def played her victim role setting up the recordings. but a dad youve had your whole life over the new wife? It’s just hard to grasp..and them deciding to interview him over zoom was pure laziness, and i can see why they thought it was coerced. the government dropped the ball on this case! I feel she’s good at manipulating her father for sure, as he’s been around longer to her games so he’s probably brain washed to her antics since she was young… she cried wolf and her dad fell for it and they over did it. her constantly saying my kids is so cringy too.. \n\nit’s just a sad situation all around! however she’s free i do think karma will spin the block and she will either try again with another family or slip up and tell on herself and opening up the case again. but i feel so bad for their dad, not protected in life and wasn’t even after death! \nbut the center block being there coincidentally just looks bad. but the motive was there. i also can’t imagine him being bold enough to try to kill her with her dad being there. and why allegedly would he try to strangle her when all he had to do was take his kids? i just dnt see why he’d make that attempt on her. so what do yall think? is it over kill of self defense or out right premeditated murder? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ostnni/the_deadly_american_marriage_kids/"
    },
    {
        "id": "1osnjtp",
        "author": "ilovefamboys",
        "title": "I need movies or shows",
        "content": "So I don't know what to watch and I hope yall have some recommendations, also I like Action based movies, maybe some drama, or Like Teen humor (more modern movies basically) also I'm up for Romance but it has to be GAY romance (Bl, Gl any is fine as long as it's LGBTQ or anything LGBTQ related)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1osnjtp/i_need_movies_or_shows/"
    },
    {
        "id": "1osds3g",
        "author": "thequirkysquad",
        "title": "Netflix is too quiet",
        "content": "I watch Netflix on my web browser on my Mac. I turn up the volume to as high as it goes. It's still very quiet, especially the voices.\n\nI've read about how you can switch from English 5.1 to something else, and that this makes it louder, but I don't see English 5.1, just English \\[Original\\].\n\nI am at a loss as to what to do. Any help would be appreciated. I'd hate to cancel on account of something so seemingly fixable.",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1osds3g/netflix_is_too_quiet/"
    },
    {
        "id": "1osn5a4",
        "author": "Weak-Illustrator2609",
        "title": "Brightness",
        "content": "On mobile, my screen gets super dark watching big mouth, I’ve tried many other shows or movies. Alas, it only happens on big mouth. I’ve tried a few methods to resolve this issue, it only started happening today.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1osn5a4/brightness/"
    },
    {
        "id": "1osw6kk",
        "author": "harpreetthind",
        "title": "Have a question",
        "content": "Just subscribed to Netflix premium is it worth it? What does everybody think for $23 a month Canadian or should I downgrade to standard and save a bit of money since the TV I have in the family room is 4K but we don’t have a spatial audio system or surround sound what’s everybody’s thoughts thanks.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1osw6kk/have_a_question/"
    },
    {
        "id": "1osn9ht",
        "author": "justpotato7",
        "title": "My brother got Netflix for a month and is letting me use the account. What some of the best horror movies on it.",
        "content": "I already watched frankenstien i loved that and it'a not horror but planning on watching k pop demon hunters today. Also I will say am not a fan of found footage horror and want to watch some of the big horror movies from this year.\n\nAlso he did the basic version.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1osn9ht/my_brother_got_netflix_for_a_month_and_is_letting/"
    },
    {
        "id": "1orin66",
        "author": "Budget_Lavishness707",
        "title": "Guillermo Del Toro Frankenstein",
        "content": "I just finished watching Del Toro’s Frankenstein adaptation. The monster is one of my most beloved OG horror characters, so I consume ALL the things related to said subject. So I was looking forward to this movie release for quite some time. And I have thoughts…\n  My husband fell asleep after an hour due to the slow pace of the story 😂, &amp; now I have no one to currently talk me through thoughts &amp; opinions I have.\n   Has anyone else watched this?",
        "upvotes": 371,
        "comments": 213,
        "media": null,
        "permalink": "/r/netflix/comments/1orin66/guillermo_del_toro_frankenstein/"
    },
    {
        "id": "1osk26v",
        "author": "Chemical_Count5054",
        "title": "Looking for a series with orcs",
        "content": "Hello, I had Netflix a couple of years ago and watched a series with orcs in. I can’t remember the name or the plot but I’m sure that orcs were fighting to save the planet against a man with one arm or a robotic arm I think. They had a fight and the man fell from something then it ended but it did say that there was going to be a season 2 but I lost my account before that was released. I’ve signed back up today and would love to watch season one and two. Does anyone know what the show is called please ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1osk26v/looking_for_a_series_with_orcs/"
    },
    {
        "id": "1osjoqy",
        "author": "littlebluecat92",
        "title": "Netflix is so buggy on chromium",
        "content": "Is this a me problem or has someone else encountered this problem too? Whenever I try to watch Netflix on a chromium based browser, the image turns incredibly grainy. Like can barely see the characters' facial expressions grainy. The same thing on Chrome and Vivaldi. It starts out fine and then it buffers a bit and the image quality worsens, then buffers again and the image quality goes down, rinse and repeat a couple of times until the image is so grainy it's an unwatchable mess. Has anyone else had this problem and figured out a fix? Now I watch Netflix on Firefox because it doesn't have that problem. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1osjoqy/netflix_is_so_buggy_on_chromium/"
    },
    {
        "id": "1osssz9",
        "author": "nutnbetter2do",
        "title": "No refund",
        "content": "After many years I decided to try Netflix again.  I purchased a plan and attempted to set up my account.  After putting in the required code the system hung up and would allow me to go forward.  I called customer service but they said they were unable to help.  I asked them to cancel my account.  They stopped payment a month from today.  I said no I want an immediate cancelation and refund since they were unable to help with a problem that was occurring at thier end. So they canceled but did not refund my money.  So I basically gave free money ey to Netflix. I am so mad at myself for even thinking of giving them another chance.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1osssz9/no_refund/"
    },
    {
        "id": "1osgc59",
        "author": "Wide_You_4626",
        "title": "\"We are unable to complete your action at the moment please try later\" error prompt upon signing up with payment method.",
        "content": "Quick Summary,\n\nOn friday 7th November i received a notification from Netflix to update my payment method. Reason? the mastercard attached with my netflix account since 2023 had a problem because of which it stopped working.\n\nI didn't knew at the time so i tried adding it 2 or 3 times manually but it kept giving \"there is something wrong with payment method please try a different method\". but when i switched to a different payment method (this one was Visa card), the error now has changed to \"we cannot complete the action at the moment please try later\". \n\nSince then i have tried multiple things with 4 different payment methods from different banks (1 mastercard and 3 visa debit cards).\n\n1. I have deleted my account, tried to signup with same email again.  \n2. used a different gmail to signup.  \n3. used multiple payment methods, and FYI i have tried these payment cards on different other services like spotify, crunchyroll, EA play even and they are working. even the mastercard that started this whole drama.  \n4. Used different device, used incognito. no solution.  \n5. i've even waited more than 48 hours.\n\n  \nive contacted neflix support team and they say all of my payment methods are not eligible which is why its failing, despite the error stating \"we cannot complete the action at the moment please try later\". I've contacted the banks of all 4 cards, and they say that:  \n1. They have not received any transaction request from Netflix.  \n2. All banks are saying that they allow their customers to pay for their netflix subscription through their payment methods.  \n3. The cards have allowed online transactions.\n\nThe payment methods i've used:  \n1. HBL conventional account mastercard (debit).  \n2. Bank Alfalah Visa (debit).  \n3. Nayapay virtual debit Cards visa both.  \n\n\nwhat am i supposed to do here?\n\nThe banks are claiming no issues on their end and that all their customers are able to and eligible to pay for netflix subscriptions. The netflix support team is keep on insisting to use different payment methods all are giving:\n\n\"We cannot complete the action at the moment please try later\".",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1osgc59/we_are_unable_to_complete_your_action_at_the/"
    },
    {
        "id": "1osa5al",
        "author": "katiebabie333",
        "title": "Show Recommendations Like ‘The Hunting Wives’",
        "content": "I just finished The Hunting Wives and now I’m on a country binge. I watched Echoes and I really liked that! The country vibe is what I’m searching for!! Does anyone have a country movie or show that is:\n\nSensual. \nMurder. \nMystery. \nRomance. \n\nAt least one of these. Or none. Whatever. Something country?!\n\nPlease help before I go through country withdrawal 😫 Any rec is appreciated!\n",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1osa5al/show_recommendations_like_the_hunting_wives/"
    }
]