[
    {
        "id": "1kl0wm0",
        "author": "lionsgate",
        "title": "Hi! I'm Ana de Armas, star of the upcoming movie From the World of John Wick: Ballerina. Ask me anything!",
        "content": "Hi! I’m Ana de Armas, an actor, dog lover, and occasional stuntwoman. You might know me from Knives Out, Blonde, Knock Knock, or No Time to Die. I’ve been lucky to play a wide range of characters over the years, and I’m here to talk about all of it. From my first roles to what’s next, including From the World of John Wick: Ballerina, which hits theaters June 6. Ask me anything!",
        "upvotes": 20635,
        "comments": 3854,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8nnrisflde0f1.png?auto=webp&amp;s=1536a4a05d4e94b4febe2a311869257955e216f4"
        },
        "permalink": "/r/movies/comments/1kl0wm0/hi_im_ana_de_armas_star_of_the_upcoming_movie/"
    },
    {
        "id": "1l4gyyk",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Ballerina / The Phoenecian Scheme / Dangerous Animals) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[From the World of John Wick: Ballerina](https://old.reddit.com/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/?)\n\n[The Phoenecian Scheme](https://old.reddit.com/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/?)\n\n[Dangerous Animals](https://old.reddit.com/r/movies/comments/1l4gwso/official_discussion_dangerous_animals_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Dogma](https://old.reddit.com/r/movies/comments/1l4gwu2/official_throwback_discussion_dogma_spoilers/?)\n\n[Big Momma's House](https://old.reddit.com/r/movies/comments/1l4gwuy/official_throwback_discussion_big_mommas_house/?)\n\n\n# Still in Theaters\n\n[Karate Kid: Legends](https://old.reddit.com/r/movies/comments/1kyson2/official_discussion_karate_kid_legends_spoilers/?)\n\n[Bring Her Back](https://old.reddit.com/r/movies/comments/1kysoob/official_discussion_bring_her_back_spoilers/?)\n\n[Tornado](https://old.reddit.com/r/movies/comments/1kysore/official_discussion_tornado_spoilers/?)\n\n[Mission: Impossible - The Final Reckoning](https://old.reddit.com/r/movies/comments/1kt8b6m/official_discussion_mission_impossible_the_final/?)\n\n[Lilo &amp; Stitch](https://old.reddit.com/r/movies/comments/1kt8b83/official_discussion_lilo_stitch_spoilers/?)\n\n[Friendship](https://old.reddit.com/r/movies/comments/1kt8b9q/official_discussion_friendship_spoilers/?)\n\n[Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n\n\n# On Streaming\n\n[Predator: Killer of Killers](https://old.reddit.com/r/movies/comments/1l5aczx/official_discussion_predator_killer_of_killers/?)\n\n[Mountainhead](https://old.reddit.com/r/movies/comments/1l0u3hy/official_discussion_mountainhead_spoilers/?)\n\n[Lost in Starlight](https://old.reddit.com/r/movies/comments/1l0u3kg/official_discussion_lost_in_starlight_spoilers/?)\n\n[Fountain of Youth](https://old.reddit.com/r/movies/comments/1ku0tg1/official_discussion_fountain_of_youth_spoilers/?)\n\n[Fear Street: Prom Queen](https://old.reddit.com/r/movies/comments/1ku0thn/official_discussion_fear_street_prom_queen/?)",
        "upvotes": 24,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1l4gyyk/official_discussion_megathread_ballerina_the/"
    },
    {
        "id": "1l6q1i3",
        "author": "diablothe2",
        "title": "Did Meryl from the truman show have a life outside the show?",
        "content": "Did she? because how is it even possible to have a life when your work is being the wife of someone 24/7. I guess she could go on a vacation during a time of the year but it really doesn't make a lot of sense. This also goes for his best friend Marlon, because even though it's to a lesser extent he would still have to be inside the set pretty consistently. And if they don't have a life outside the show, what is even the point, they would be throwing their lives for a show, what would be the reason, money? but if you are on set everyday how would they enjoy the money they are making. Idk it just seems so weird.\n\nI haven't seen the movie in a while, so maybe I don't remember, but if the movie doesn't explain this what do y'all think is the answer",
        "upvotes": 1269,
        "comments": 174,
        "media": null,
        "permalink": "/r/movies/comments/1l6q1i3/did_meryl_from_the_truman_show_have_a_life/"
    },
    {
        "id": "1l6fs7u",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Zach Cregger's 'Weapons'",
        "content": "",
        "upvotes": 4564,
        "comments": 292,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/abnuibou8q5f1.jpeg?auto=webp&amp;s=d34e1296dfdc2fa5c28170ae3b7cd145073074d8"
        },
        "permalink": "/r/movies/comments/1l6fs7u/new_poster_for_zach_creggers_weapons/"
    },
    {
        "id": "1l6p2zl",
        "author": "Martipar",
        "title": "Jokes in films that have aged suspiciously well.",
        "content": "I am watching Wayne's World 2 from 1993 and they make a joke about how sleeping upside down adds 10 years to your life, if was taught to Del by Keith Richards which is why Keith cannot be killed by conventional means. It's been 32 years, Keith Richards is still \"alive\" and the joke is still very relevant, possibly even more so than it was. \n\n\n\n",
        "upvotes": 1082,
        "comments": 185,
        "media": null,
        "permalink": "/r/movies/comments/1l6p2zl/jokes_in_films_that_have_aged_suspiciously_well/"
    },
    {
        "id": "1l6qonx",
        "author": "CrippledKidneys",
        "title": "That ending for the Truman Show…",
        "content": "Spoilers if you haven’t watched the movie in its entirety yet.\n\n\n\n\nTHE ENDING OF THIS MOVIE IS MAGNIFICENT. The last moments of the movie in particular are what I find brilliant. As Truman leaves the set, the movie comes to a close. We never get finality on what happens to him in the real world, and it’s an amazing parallel to how the people watching the show are no longer under full observation of Truman himself. It’s one of the best endings to a movie I’ve ever seen, even if it is a cliffhanger.",
        "upvotes": 845,
        "comments": 144,
        "media": null,
        "permalink": "/r/movies/comments/1l6qonx/that_ending_for_the_truman_show/"
    },
    {
        "id": "1l6pd1k",
        "author": "BroccoliVendetta",
        "title": "What movies have fantastic opening scenes that they don’t get enough credit for?",
        "content": "\nWe all know the famous ones - but who deserves more credit? Which ones get more hate than they deserve?\n\nHere’s my two:\n\n-Star Trek (2009): Chris Hemsworth gave a better performance in 10 minutes of screen time than his entire run at Thor(Not that he wasn’t fantastic as Thor). I tear up on every rewatch.\n\n-Baby Driver (2017): I can’t get enough of it. The perfect song choice, the scene moving to the beat of the music. I need more movies like this.\n\nEdit: typo",
        "upvotes": 931,
        "comments": 795,
        "media": null,
        "permalink": "/r/movies/comments/1l6pd1k/what_movies_have_fantastic_opening_scenes_that/"
    },
    {
        "id": "1l6euh5",
        "author": "BunyipPouch",
        "title": "First Image from 'I Am Frankelda', Mexico's First-Ever Stop-Motion Feature Film - Made by proteges of Guillermo del Toro (Rodolfo and Arturo Ambriz) - A young Mexican woman, a frustrated writer of the 19th century, travels in the form of a ghost to a realm of her own invention inhabited by scares.",
        "content": "",
        "upvotes": 3674,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/51nv0us41q5f1.png?auto=webp&amp;s=aec9f4733feed751a7b1280095acb5c4db240528"
        },
        "permalink": "/r/movies/comments/1l6euh5/first_image_from_i_am_frankelda_mexicos_firstever/"
    },
    {
        "id": "1l6smk3",
        "author": "methodwriter85",
        "title": "Movies that were incorrectly/deceptively marketed",
        "content": "The New Karate Kid Legends movie opened soft and it's dropping pretty hard. Personally I thought it was good enough to not flop the way that it is, but I also think the movie suffered from the way it was marketed as being a team up between Jackie Chan and Daniel LaRusso to teach Ben Wang. I mean, that does happen, don't get me wrong, but it takes a LONG time to get there, because they spend the first half of the movie setting up the actual conflict. The daughter and Joshua Jackson seem to have much more screentime than Jackie Chan does; just saying.\n\nI think if it had been a bit more honest about what the movie was actually going to be, it would be doing better.",
        "upvotes": 266,
        "comments": 501,
        "media": null,
        "permalink": "/r/movies/comments/1l6smk3/movies_that_were_incorrectlydeceptively_marketed/"
    },
    {
        "id": "1l6va3o",
        "author": "SodaCake2",
        "title": "In the movie 300, what does Leonidas shout while he's 'kneeling' to Xerxes?",
        "content": "He's 'kneeling' on the ground, reflecting on his wife, then he shouts something, and the Spartan shield/spear ball formation breaks and dude comes out to spear the messenger in front of Leonidas.\n\nI've replayed the scene so many times but I can't make out what he says. Obviously something to initiate their battle 'plan'. Please help, it's bugging the hell out of me lol\n\n  \nEDIT/ANSWER: **\"STELIOS!!!!\"**",
        "upvotes": 162,
        "comments": 55,
        "media": null,
        "permalink": "/r/movies/comments/1l6va3o/in_the_movie_300_what_does_leonidas_shout_while/"
    },
    {
        "id": "1l6pfgd",
        "author": "GenButter",
        "title": "Pippa Scott Dead: ‘The Searchers,’ ‘Auntie Mame’ Actress Was 90",
        "content": "",
        "upvotes": 310,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gxP00Kafr8BasHgX-5x3VgN0PMOPFw6PLtIPy7BNMHI.jpg?auto=webp&amp;s=04ce1057686f3da81e1c29d327a44a7b66e88811"
        },
        "permalink": "/r/movies/comments/1l6pfgd/pippa_scott_dead_the_searchers_auntie_mame/"
    },
    {
        "id": "1l6s81o",
        "author": "facebookboy2",
        "title": "Anybody interested in watching a Japanese movie?  Oshin (2013) free movie on Youtube with English sub",
        "content": "Every Japanese knows Oshin.  It was a very famous novel and later broadcasted on TV in the 80s.  The novel was based on the true story of the Supermarket owner of Yaohan.  Now its made into a movie.  Its a story of a girl who was contracted to work at a rich man's house when she was only 7.  (year 1907)  She grew up in the rich man's house and learned how to do business.  Survived ww2 and lost 2 sons to the war.  Later opened up the most famous supermarket chain in Japan.",
        "upvotes": 184,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Coh9cyaKKA1WUxQMLAOgyWVw-Qf6cTD7qDkjUXbODrI.jpg?auto=webp&amp;s=6d29c4766004b9636e0d3449b11fab0802ed4940"
        },
        "permalink": "/r/movies/comments/1l6s81o/anybody_interested_in_watching_a_japanese_movie/"
    },
    {
        "id": "1l6jj42",
        "author": "CinemaWilderfan",
        "title": "What is an ending that isn’t as ambiguous as people make out to be, and what is an ending that deserves more credit for being ambiguous?",
        "content": "The Graduate is often mistaken for being deeply ambiguous, but this opinion came from Mike Nichols’ decision not to yell “cut” at the end of the final scene, allowing the characters to fade silent and stare at the camera to show uncertain expressions. This tonal shift feels profound, but it’s more of an aesthetic flourish than a true narrative or thematic ambiguity. The story itself is quite clear: Benjamin rebels against a future he doesn’t want, chases Elaine, and gets what he wants, and they laugh happily at each other when they board the bus. They look into the camera because they are looking into their future.\n\nOn the other hand, Rear Window is more genuinely ambiguous. While the murder is solved, the film raises unresolved ethical questions about voyeurism and whether Jeff's decisions are ethical or not. Was he a hero for stepping in and helping others solve a problem or was he stepping into peoples' boundaries? Even we don't know how Jeff and Lisa would end up.",
        "upvotes": 582,
        "comments": 490,
        "media": null,
        "permalink": "/r/movies/comments/1l6jj42/what_is_an_ending_that_isnt_as_ambiguous_as/"
    },
    {
        "id": "1l6t0cl",
        "author": "Odd_Advance_6438",
        "title": "If the upcoming Animal Farm movie with Seth Rogen actually does follow the book and lets him be evil, I think it’s going to be insanely cool",
        "content": "Im super intrigued by the trailer. It uses kind of a cutesy art style and has that standard kid movie humor, but there’s definitely a sinister undercurrent. Seth Rogen has never really played a villain to my knowledge, and while a lot of people pointed out that it’s a weird casting choice, I think it could be super smart overall. People are so used to him as a goofy good guy that it would be extra crazy to see Napoleon become the tyrant of the farm.\n\nSince it’s directed by Andy Serkis, I have a hard time believing he would make the movie more sanitized. Even with the jokes at the end, there’s a very sinister undercurrent to the scene, especially with the music. Napoleon saying “pigs should stick with pigs” definitely foreshadows his cruel intentions",
        "upvotes": 146,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1l6t0cl/if_the_upcoming_animal_farm_movie_with_seth_rogen/"
    },
    {
        "id": "1l6tagy",
        "author": "Existing_Switch_4995",
        "title": "Tyler Perry’s Trauma Machine: When Storytelling Becomes Exploitation",
        "content": "I hate how Tyler Perry has moved over the years. And I say this not to tear down a Black creative — but to question why someone with so much power, influence, and access consistently chooses to recycle the same painful narrative over and over again, to the point where it feels less like representation… and more like exploitation.\n\nIt feels like his movies don’t just touch on trauma — they traumatize Black audiences.\n\nYes, Black people have endured and survived unimaginable things. Yes, there are deep-rooted issues in our communities that deserve to be spoken about. But there’s a difference between storytelling and trauma-dumping. There’s a line between bringing awareness and dragging your people through hell just because you can.\n\nTake his latest movie as an example — a single Black mother at the center, and every horrible thing imaginable happens to her. Her landlord kicks her out. Her boss fires her. A cop runs her off the road and threatens her. Her child gets taken away. And just when you think maybe she’ll catch a break… her child dies too.\n\nWhy? For what?\n\nAt what point does this stop being a story and start becoming suffering as spectacle? It’s not just emotionally exhausting — it’s deeply disturbing.\n\nThere’s a pattern here. In nearly all of Perry’s films and series, Black women are abused, broken, or abandoned. Black men are either abusers, cheaters, or saviors — never something in between. The characters lack depth. The pain is constant. The message? That suffering is part of being Black. That pain is our destiny. That endurance is our only virtue.\n\nBut that’s not true.\n\nWe are so much more than our trauma.\n\nWe are joy. We are excellence. We are innovators, leaders, healers, artists, and dreamers. We are breaking generational curses. We are loving each other. We are making it. And those stories deserve to be told just as loudly, just as boldly, just as frequently.\n\nWhat’s most disheartening is that someone like Tyler Perry could tell those stories. He has a studio. He has funding. He has a loyal audience. He has access to some of the best Black talent in the world. But instead of evolving his storytelling, he keeps feeding us the same pain — dressed up as entertainment.\n\nWhen I look at the landscape of Black film and television, I can name dozens of shows and movies that uplift, that stretch beyond trauma, that imagine something better for us: shows like Queen Sugar, Insecure, Abbott Elementary, Black Panther, The Photograph, The Harder They Fall. These works show that we can tell layered stories — ones that reflect struggle and joy.\n\nBut I truly cannot name a single Tyler Perry production that left me feeling uplifted.\n\nAt some point, we have to ask: Who is this really for? Who benefits from a never-ending loop of Black pain? And when will it be enough?\n\nBecause we deserve more than to see ourselves repeatedly battered by life, by each other, and by scripts that refuse to imagine us as anything but victims.\n\nWe deserve healing stories, hopeful stories, and whole stories.\n\nWe deserve better from someone who claims to love us.",
        "upvotes": 120,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1l6tagy/tyler_perrys_trauma_machine_when_storytelling/"
    },
    {
        "id": "1l67cqw",
        "author": "mrjohnnymac18",
        "title": "'Slumming in a vision of hell': Why Requiem for a Dream is still so divisive, 25 years after its release",
        "content": "",
        "upvotes": 2497,
        "comments": 515,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uALkrXEDArqjOR8BkTywESxDeEGG6EvlB8_9oblOWRQ.jpg?auto=webp&amp;s=902856555b17834a4929b40f48ccf1c2d7c2514d"
        },
        "permalink": "/r/movies/comments/1l67cqw/slumming_in_a_vision_of_hell_why_requiem_for_a/"
    },
    {
        "id": "1l6ywyb",
        "author": "FilmWaffle-FilmForum",
        "title": "What “bad” movies have pretty good action scenes?",
        "content": "Clash of the Titans (2010) has always been a perfect fit to this question in my opinion. Admittedly, I haven’t seen it in a while but from what I can remember the action is actually good when compared to the abysmal character development, dialogue and storytelling. The sequel fits as well. \n\nWhat other “bad” movies have strong action scenes? ",
        "upvotes": 27,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1l6ywyb/what_bad_movies_have_pretty_good_action_scenes/"
    },
    {
        "id": "1l6oos0",
        "author": "DerpAntelope",
        "title": "The Best Stunts of All Time, Over Nearly 100 Years of the Oscars",
        "content": "",
        "upvotes": 146,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7PuQ_PEsa_vNeiY3kcP5Yz9q963wFux9FRctphxEO0I.jpg?auto=webp&amp;s=3ea57917e967d8184b984803a1da95141012718f"
        },
        "permalink": "/r/movies/comments/1l6oos0/the_best_stunts_of_all_time_over_nearly_100_years/"
    },
    {
        "id": "1l6foy0",
        "author": "MarvelsGrantMan136",
        "title": "The Lost Bus — Official Teaser | Apple TV+ (Directed by Paul Greengrass)",
        "content": "",
        "upvotes": 376,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EZPKrdZqQZOdH65fJmVesnLjRcbGDEETct0PMmlyRAs.jpg?auto=webp&amp;s=e3e95933c10cdacdfbbe97f83b3110b4cd6102f0"
        },
        "permalink": "/r/movies/comments/1l6foy0/the_lost_bus_official_teaser_apple_tv_directed_by/"
    },
    {
        "id": "1l6f4uz",
        "author": "TheGrumpyre",
        "title": "What are some movies that break with the convention and have a sequel where the stakes are lower than the first movie?",
        "content": "I noticed when rewatching all the Mission Impossible films that the first 1996 entry was fairly down to earth, with Ethan fighting to clear his name and protect the agency. Whereas most of the sequels put the entire world at risk of nuclear obliteration or a bio-weapon that would kill billions.  What are some good movies that flip the convention and don't raise the stakes to higher and higher levels in their sequels?",
        "upvotes": 273,
        "comments": 181,
        "media": null,
        "permalink": "/r/movies/comments/1l6f4uz/what_are_some_movies_that_break_with_the/"
    },
    {
        "id": "1l6bvgz",
        "author": "einsteinfrankenstein",
        "title": "scenes where mood shifts quite suddenly? Like funny become serious?",
        "content": "I like scenes with gradual or sudden mood shifts. You know like toward the end in Mrs Doubtfire in the restaurant and the guy begins choking on the overly spicy shrimp or whatever? Suddenly the movie gets all serious. \n\nSo any mood changes like that interest me, esoecially when handled skillfully. \n\nCould be frightening to funny, funny to sad, sad to angry, etc.\nExamples that stand out for you?  ",
        "upvotes": 323,
        "comments": 459,
        "media": null,
        "permalink": "/r/movies/comments/1l6bvgz/scenes_where_mood_shifts_quite_suddenly_like/"
    },
    {
        "id": "1l6u4k2",
        "author": "Jujubegirl23",
        "title": "What did you all think of “Skinamarink?”",
        "content": "I was initially intrigued by this movie\nwhen I saw the trailer and read the synopsis, but I couldn’t get through it. It was too bizarre and didn’t make sense. Although I thought the directing style was unique and somewhat interesting, there were also too many random camera shots of nothing….I tired of looking at shots of the floor, ceiling, and tops of door jambs. ",
        "upvotes": 19,
        "comments": 121,
        "media": null,
        "permalink": "/r/movies/comments/1l6u4k2/what_did_you_all_think_of_skinamarink/"
    },
    {
        "id": "1l6a6fz",
        "author": "plot-wit",
        "title": "Been diving into time loop movies lately — got some favorites, what about you?",
        "content": "Time loop movies are such a wild ride — that feeling when the day just keeps resetting and the characters have to figure it out. I’ve been watching a bunch recently, from classics like *Groundhog Day* and *Edge of Tomorrow* to some underrated gems like *Palm Springs* and *Happy Death Day*.\n\nWhat’s your favorite time loop movie? Or one you think everyone should watch but doesn’t talk about enough?\n\nWould love to swap recommendations and see what’s out there!\n\n**Update: You all seriously delivered!** 🌀  \nI went in looking for a few underrated time loop movies… and came out with enough to loop through multiple lifetimes. Here's a running list of everything folks have recommended so far — across movies, anime, TV, even games:\n\n# 🎬 Movies\n\n* *Run Lola Run*\n* *12 Monkeys*\n* *Primer*\n* *Triangle*\n* *Timecrimes* (aka *Time Crimes*, Spanish)\n* *12:01*\n* *Source Code*\n* *Coherence*\n* *Omni Loop*\n* *Looper*\n* *Predestination*\n* *Project Almanac*\n* *Frequently Asked Questions About Time Travel*\n* *The Endless*\n* *ARQ*\n* *The Map of Tiny Perfect Things*\n* *Donnie Darko*\n* *Before I Fall*\n* *Boss Level*\n* *Beyond the Infinite Two Minutes*\n* *River* (2023)\n* *Time Lapse*\n* *About Time*\n* *Memento* (or *Momento* as someone wrote 😅)\n* *Maanadu* (Tamil)\n* *Deja Vu*\n* *Tenet*\n* *Re/Member*\n* *Until Dawn*\n* *Room 0*\n* *Timechasers*\n* *The Infinite Man*\n* *Premonition*\n* *Arrival*\n* *The Butterfly Effect*\n* *Round and Round*\n* *Resolution*\n* *Flashback* (2020)\n* *Caddo Lake*\n* *Hot Tub Time Machine*\n* *1994: A.P.E.X.*\n* *Two Distant Strangers*\n* *Happy Monday(s)*\n* *Detention*\n* *The Final Countdown*\n* *Peggy Sue Got Married*\n* *Doctor Strange*\n* *The Time Traveler’s Wife*\n* *Fetching Cody*\n* *Things Will Be Different*\n* *Inside Llewyn Davis*\n* *In the Tall Grass*\n* *Dead of Night* (1945)\n* *Mulholland Drive*\n* *The Girl Who Leapt Through Time*\n* *The Father*\n\n# 📺 TV Shows / Episodes\n\n* *Russian Doll*\n* *Dark*\n* *Lost*\n* *Bodies*\n* *X-Files* – “Monday” (S6E14)\n* *Window of Opportunity* – *Stargate SG-1*\n* *Twin Peaks: The Return*\n* *Twin Peaks: Fire Walk with Me*\n\n# 🎌 Anime\n\n* *Melancholy of Haruhi Suzumiya*\n* *Re/Member*\n\n# 🎮 Games\n\n* *Outer Wilds*\n\nLet me know what I missed — I’m still working my way through replies. Some of these blur the line between time loop and time travel, but hey, if it bends time and breaks your brain, it counts in my book.\n\nMassive thanks again to everyone who dropped a rec 🙌  \nThis list’s a goldmine.",
        "upvotes": 357,
        "comments": 497,
        "media": null,
        "permalink": "/r/movies/comments/1l6a6fz/been_diving_into_time_loop_movies_lately_got_some/"
    },
    {
        "id": "1l6hde4",
        "author": "Purple_Monkey34",
        "title": "What is one of your favorite Juxtapositions of music used in a movie?",
        "content": "There are so many it could be something as simple as a murder set to an upbeat happy song or or a high speed chase set so something that changes the tone completely\n\nBut I'll say one of my favorites is the Movie A Knight's Tale that uses the Juxtaposition of more modern muic in the setting of Medieval Times",
        "upvotes": 102,
        "comments": 168,
        "media": null,
        "permalink": "/r/movies/comments/1l6hde4/what_is_one_of_your_favorite_juxtapositions_of/"
    },
    {
        "id": "1l6zbqr",
        "author": "crazyhomlesswerido",
        "title": "What are the movies you can watch over and over again?",
        "content": "What are the movies you can watch over and over again? Maybe even as soon as the credits roll your ready to watch again. Mine would be Dolores Claiborne. I just love the way Kathy Bates plays a mother who loves her daughter no matter how muchthe daughter  blames her for everything and shows how Dolores did everything for her daughter. Jennifer Jason Leigh was amazing as well playing the roll of emotionally mess up woman who had yet to face the trauma of her past. Really a deep good movie. Also read Kathy Bates said it was her favorite roll because of the non linear timeline of the story\n\nThe other used to be before I got sober requiem for a dream. I used to love watching that movie again I was so obsessed with it the DVD I had of it I watched all the special features of including listening to the directors commentary over the movie. I loved it. But it also was the movie I loved to get high too so I cut it out of my life after I sobered up.\n\nMy final one was as kid because a pretty girl I rode the school bus with told me she would watch this over and over again and I had a huge crush on her at the time I did the same but also really liked the movie was the original Wayne's World. I still remember the VHS copy we had was from a promo Mc Donald's was running where they where selling a few select movies at the restaurant for I think like five bucks. I do remember another they where selling with Wayne World was Field of dreams. ",
        "upvotes": 6,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1l6zbqr/what_are_the_movies_you_can_watch_over_and_over/"
    },
    {
        "id": "1l6zoh9",
        "author": "nekminnit4",
        "title": "What's a film that had both a great director and a great script yet somehow failed?",
        "content": "My personal pick from more contemporary times would be Martin Campbells film Memory with Liam Neeson. Great premise with a story that on paper should be very interesting to watch yet it turned out somehow very so-so and forgettable. Michael Keatons recent film Assassins Plan had a  similar premise and was alot more successful at it.",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1l6zoh9/whats_a_film_that_had_both_a_great_director_and_a/"
    },
    {
        "id": "1l5rh8q",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Seann William Scott in ‘Bad Man’ - Follows a wild man state cop (Scott) who shows up in a small town with a big meth problem and immediately butts heads with a strait-laced local deputy as they attempt to solve a murder.",
        "content": "",
        "upvotes": 5701,
        "comments": 454,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5g285qvnrj5f1.jpeg?auto=webp&amp;s=2e55ce0bfc88e13dfda74bdd95fe1f8baa6843b2"
        },
        "permalink": "/r/movies/comments/1l5rh8q/first_image_of_seann_william_scott_in_bad_man/"
    },
    {
        "id": "1l6pu5j",
        "author": "lennonhickstead",
        "title": "seeking a friend for the end of the world",
        "content": "i just watched this movie for the first time (i’m not sure how i’ve never seen it before given my love for apocalyptic, end of the world themed movies) and it was generally a great movie throughout, i was hooked watching it, BUT THAT END SCENE, that was one of the most intense, heartbreaking but also beautiful scenes i have seen in a good while. i wasn’t expecting it to be a movie that i know now ill be thinking about for a while because i was just looking for some background noise while i scrolled endlessly window shopping online but wow, i will cry myself to sleep tonight. if you haven’t seen it, i’d definitely recommend watching it! \n\nif anyone knows of any movies with a similar feel to this one, please recommend.",
        "upvotes": 25,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1l6pu5j/seeking_a_friend_for_the_end_of_the_world/"
    },
    {
        "id": "1l5w8ty",
        "author": "Double-decker_trams",
        "title": "Discussion on \"based on a true story\" movies. \"Erin Brockovich\" (2000) is very realistic while \"Catch Me If You Can\" (2002) is not realistic at all. What are some other \"based on a true story\" movies that are either very realistic or not realistic at all?",
        "content": "\"Catch Me If You Can\" (2002) isn't realistic because the guy who wrote (using a ghostwriter ofc) the book (i.e the conman Frank Abagnale Jr) actually made most of it up. So the movie follows the book, but the book is not that much based on reality. He's very convincing though - like in his speech at [Talks at Google](https://youtu.be/vsMydMDi3rI). But in reality it's [bullshit](https://en.wikipedia.org/wiki/Catch_Me_If_You_Can_(book)#Veracity:~:text=In%202020%2C%20journalist,%5B5%5D).\n\nI've also heard that in \"Argo (2012)\" there's no mention of how important Canadians were (I haven't seen it though).",
        "upvotes": 1957,
        "comments": 1292,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xbgdZ-e04y2pVl0m0sf6-7_JMjLEIKTtr0xPphWfGpY.jpg?auto=webp&amp;s=eb84c7663dd5bbdbb57771fb79e0fe34087a4718"
        },
        "permalink": "/r/movies/comments/1l5w8ty/discussion_on_based_on_a_true_story_movies_erin/"
    },
    {
        "id": "1l6zfoy",
        "author": "Business_Address_780",
        "title": "Death of Stalin - Why did the committee conduct their meetings like that?",
        "content": "Sorry this is a repost, my previous post got removed because apparently it contained spoilers in the title. I thank the replies in that removed post.\n\nWatched the movie a few years ago, but I kept thinking about the details involving their meetings.\n\nWhen Malenkov held the meeting to give out assignments after Stalin died, the committee members always looked at each other before raising their hands to vote on a motion, and every motion was passed \"unanimously\". Even when khrushchev was obviously against some of those motions, he had to reluctantly raise his hand.\n\nI'm not exactly sure what it was poking at, it was incredibly funny. I'm guessing this was something that happened regularly in Soviet era, because nobody wanted to be seen outside of the official party stance?\n\nAnother example, when the doctors were giving a conclusion on the medical conditions of Stalin, they kept emphasizing this was a collective finding.",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1l6zfoy/death_of_stalin_why_did_the_committee_conduct/"
    },
    {
        "id": "1l60m1b",
        "author": "BunyipPouch",
        "title": "Ben Stiller, Robert De Niro, Jay Roach Tease New ‘Meet The Parents’ As Original Has Audience In Stitches At 25th Anniversary Tribeca Film Festival Screening",
        "content": "",
        "upvotes": 632,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cuc9N8RasPBMLz7DJjgHCUWsxquTkLCcTjKi1EFW0eM.jpg?auto=webp&amp;s=476d5425239bac66a0ec685fbac686315c0d9985"
        },
        "permalink": "/r/movies/comments/1l60m1b/ben_stiller_robert_de_niro_jay_roach_tease_new/"
    },
    {
        "id": "1l6wt1v",
        "author": "Former_Dragonfly_435",
        "title": "If you had to pick one summer release to see in theaters, which would it be?",
        "content": "I feel like there are a lot of movies coming out for the summer that I myself would be interested in seeing in theatres! However, the theatre is expensive, so I’m trying to decide on only one or two. Just wondering what everyone has them ranked to prefer seeing in theatre vs at home. \n\nMy personal list of must-watches I’m currently attempting to choose from includes:\n\n- Jurassic Park Rebirth\n- Thunderbolts (this one has already been out for a bit)\n- How to Train Your Dragon\n- Fantastic Four\n- Superman\n- 28 Years Later\n",
        "upvotes": 3,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1l6wt1v/if_you_had_to_pick_one_summer_release_to_see_in/"
    }
]