[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1igr62h",
        "author": "DemiFiendRSA",
        "title": "Cobra Kai: Season 6 Part 3 | Final Trailer | Netflix",
        "content": "",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1igr62h/cobra_kai_season_6_part_3_final_trailer_netflix/"
    },
    {
        "id": "1igpkrg",
        "author": "pontiuspilate01",
        "title": "The Night Agent – Great Writing, Wooden Acting?",
        "content": "I’m currently on Season 1, Episode 7, and I’m still trying to understand the hype. The writing is slightly engaging—it knows how to keep you hooked with well-paced cliffhangers. But the acting? Yikes. It feels wooden, overly staged, and completely devoid of nuance, like a table read that somehow made it to the final cut. Some scenes are so stiff it’s almost impressive.\n\nI’m pushing through because I want to see if there’s a real payoff, but so far, it feels like a show that succeeds despite its cast rather than because of it. \n\nDoes it get better, or is this just what I signed up for?",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1igpkrg/the_night_agent_great_writing_wooden_acting/"
    },
    {
        "id": "1ifxqvy",
        "author": "dailystar_news",
        "title": "Squid Game star Lee Joo Sil dies in hospital after cancer battle as tributes paid to actress",
        "content": "https://www.dailystar.co.uk/showbiz/breaking-squid-game-star-dies-34599173",
        "upvotes": 438,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ifxqvy/squid_game_star_lee_joo_sil_dies_in_hospital/"
    },
    {
        "id": "1igl9aw",
        "author": "Royal-Emu5226",
        "title": "Logged Out Due to Diff IP Address. Any Similar Issues Here?",
        "content": "Our Netflix account was locked out due while attempting to update the Netflix Household. The account was accessed from a different IP address and we couldn’t proceed to making the update despite going through multiple SMS approvals (see attached screenshots). Note that despite many approvals via SMS, we were not able to make any changes to the said account. We also indicated that we’re “traveling” \n\nHas anyone had any similar experiences? May I ask how you resolved the issue? Thanks",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1igl9aw/logged_out_due_to_diff_ip_address_any_similar/"
    },
    {
        "id": "1iggrok",
        "author": "Pll_dangerzone",
        "title": "A Good Girls Guide to Murder is a pretty decent Murder Mystery",
        "content": "I gave this a shot as it was a short series and I was pleasantly surprised. It could have played it safe and cookie cutter but there were some real shocks and it did not shy away from touching on some pretty mature subject matter. These kids are supposedly in high school man. The acting was all excellent, with the main girl a real standout. Only annoying bit was in the last few episodes that girls self preservation went out the window. Never read the books and don’t know where the story goes from here but I hope it gets a season 2",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iggrok/a_good_girls_guide_to_murder_is_a_pretty_decent/"
    },
    {
        "id": "1igfkt2",
        "author": "flyingrummy",
        "title": "How do you find new shows to watch on Netflix?",
        "content": "I check Netflix once month maybe (I don't pay that bill since I cover other bills.) for something new and maybe find one show I want to watch on there a year. How do you find new random stuff to watch? Aside from finishing shows I didn't finish when I had cable in the early 2000s, everything else just seems to be a cheaply made cookie cutter clone of an idea done to death (Magic academy for kids, detective with a weird quirk, special ops guy beats up street criminals, foreign soap opera.) The homepage shows the same shows/movies in 6 different categories, and pretty much after 2 hours of browsing I just end up putting on a documentary I half-watch while browsing reddit.\n\nTLDR: Any tips on how to navigate Netflix and find new stuff? It really seems designed layout-wise to advertise a small selection of shows Netflix wants you to watch instead of letting me discover something truly new to watch.",
        "upvotes": 14,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1igfkt2/how_do_you_find_new_shows_to_watch_on_netflix/"
    },
    {
        "id": "1ifkjbm",
        "author": "Thin-Plantain4721",
        "title": "Netflix has seriously harmed it's reputation with how often it is now cancelling shows",
        "content": "Netflix has seriously harmed it's reputation with how often it is now cancelling shows. What used to be seen as the go-to service for saving cancelled shows, has now become the very thing it swore to destroy {Hello There Obi-Wan Kenobi reference). Netflix likes to repeat it's standard line that they have never cancelled a successful show, but they conveniently never tell us how they measure success, because this doesn't ring true with their shows like Lockwood &amp; Co and Shadow &amp; Bone, that got to both Number 1 and Number 2 respectively in Netflix's own published streaming charts, and that still wasn't enough to save those shows from cancellation. Also Netflix clearly has favourites in terms of marketing, for example I enjoyed the show Everything Now, but you've probably never heard of it, and I searched Facebook - Netflix did one post about it when they dropped the trailer 3 weeks before it's worldwide release, and that was it; but other shows like Bridgerton, you can't fail to know it's there because they post daily about it on their socials for weeks up to and including release and for weeks after too. You even have actors in a new show saying they have to search their show to find it so they can watch and it's not even advertised on Netflix's own home screen, let alone anywhere else, so no wonder these shows get cancelled as they are never given a fair shot to succeed.\n\nIt seems unless you go viral or break Netflix's own streaming records, like Stranger Things or Wednesday, then even getting the number one or number two spot is not good enough to save a program from cancellation. Netflix needs to remember that not all releases are an overwhelming overnight success - even some of the best and most popular shows took a while to find their audience, like Breaking Bad, Game of Thrones, The West Wing, The Sopranos, but then when they did find their audience they became what everyone was talking about, and people who had never seen the show, still knew about them from it's impact on the cultural audience. Somebody else said, and I truly believe it, that if Netflix had made Breaking Bad today, they would have cancelled it after two seasons, and then think what great storytelling we would have missed out on, all because the show wasn't a record hit in it's opening week.\n\nAnd now Netflix finds itself in a self-fullfilling loop where they have now trained their audience to not try new shows and get attached as they'll likely be cancelled. Think about it, how many new shows can you think of on Netflix that got renewed last year. It only seems to be people will tune in for shows like Bridgerton, Emily in Paris, Outer Banks, as they have had time to grow with the characters, so now Netflix has got themselves in to a model where customers don't try a new show, like KAOS or Everything Now, and they'll wait and see if it's renewed, and when after only a month since it's release, it does indeed get cancelled, the consumer hasn't wasted time getting invested in a show &amp; characters that get cut short, especially nowadays when there is so much to watch across traditional TV and now streaming services too, that just because the audience doesn't come running to watch as soon as it drops, doesn't mean it's not there or interested.\n\n2025 see's the return of some of Netflix's biggest shows like Squid Game, Wednesday and Stranger Things, but 2 out of those 3 also end this year too and then what shows will be left that are associated with the Netflix brand - they had Stranger Things, House of Cards, Orange Is The New Black when Netflix first got going, it'll be hard to say by the end of this year what big shows Netflix will have left to draw customers in\n\nUnless Netflix, and the wider industry, change their perception to not only see massive, viral numbers as success and that shows with strong-moderate success are allowed to grow and widen their audience, then there will eventually reach a tipping point where they will cancel one show too many that either customers leave their service, or creatives will decide that Netflix isn't a good partner to work with where you put years of work in writing, filming, producing, editing a project just for it to be cancelled a month after it's release, so if you have a story that needs more than one film or a one and done series to tell it in, then Netflix probably isn't your best bet any longer.\n",
        "upvotes": 1992,
        "comments": 364,
        "media": null,
        "permalink": "/r/netflix/comments/1ifkjbm/netflix_has_seriously_harmed_its_reputation_with/"
    },
    {
        "id": "1igsyhr",
        "author": "theres1nlyone",
        "title": "Donno why am I confused what to start next on Netflix",
        "content": "I want to ask everyone here because I am not sure why am I not sure at all what to start next series in Netflix. Reason is recently started watching Dahmer and it was boring as hell, I have picked it up because I guess Netflix not sure kept on suggesting me this show but turns out to be awfully bad and boring I mean maybe the cast and the story is all good but the pace for me is really slow or not my type I like though slow burn as well, hence not sure what to watch next. Recently I watched Squid Games S2 liked it right now watching Kota Factory, BB Money Heist and Narcos have watched long back and Peaky also I have liked a lot. Trying to avoid long shows already with more than 2 season to start with and will take long time. There are lot of recommendations online but I want something good like you know Breaking Bad and all. S\\*x Ed is in watchlist maybe for later. I hope you all got it what I want? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1igsyhr/donno_why_am_i_confused_what_to_start_next_on/"
    },
    {
        "id": "1igsw01",
        "author": "Responsible-Clue1262",
        "title": "Changing profile icon changes parental settings",
        "content": "We just discovered that if our daughter changes her profile icon it unlocks the parental settings and makes the profile unrestricted. Has anyone else noticed this?? Clearly it’s a glitch. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1igsw01/changing_profile_icon_changes_parental_settings/"
    },
    {
        "id": "1igsu03",
        "author": "Zdog54",
        "title": "No audio on all Netflix content?",
        "content": "For whatever reason last night the audio on Netflix just completely stopped working. I've tried restarting the TV, uninstall and re-download Netflix and it still has zero audio for some reason. Can't figure it out for the life of me. I went into Netflix through the PS5 and the audio works perfectly fine so something is wrong with the TV netflix app. If anyone can help with this I would greatly appreciate it!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1igsu03/no_audio_on_all_netflix_content/"
    },
    {
        "id": "1igrjzg",
        "author": "JbreezyReviews",
        "title": "Top 5 shows on Netflix",
        "content": "Just a top 5 list of shows you probably haven’t watched on Netflix. I tried to stay away from the big 10 that everyone’s watched ( breaking bad, suits , prison break etc )",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1igrjzg/top_5_shows_on_netflix/"
    },
    {
        "id": "1ig8pzm",
        "author": "Nastia_dream",
        "title": "Is Ginny&amp; Georgia worth watching ?",
        "content": "I haven't heard anything about this show before and since next season is coming out in June, is this show worth the watch ? As I understand it's a teen drama and I'm not really into teen shows these days. Would you still recommend it as a one time watch on the weekend for example ? ",
        "upvotes": 20,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1ig8pzm/is_ginny_georgia_worth_watching/"
    },
    {
        "id": "1igav1s",
        "author": "Myboymetaknight",
        "title": "Forgotten tom and jerry like show",
        "content": "There was this show on netflix it was like Tom and Jerry, there was no talking but their sound effects and growls and other like emotion sound effects, it followed a young magician and his Rabbit in a blue and yellow stripped shirt and black shorts, the first episode was him audiencing to get into a magic's school in which he trys to pull his rabbit out of his hat but it doesnt want too so he still his carrot and blends it to a juice pissing him off and then its tom and jerry for the rest of the episode until he finally does but him and his rabbit get in, one episode their this new little cat girl that the others try to sway her to date them but she becomes really punk with a whip when she sneezes, if anyone knows what this show is please tell me i would love to watch it again",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1igav1s/forgotten_tom_and_jerry_like_show/"
    },
    {
        "id": "1ig3rfr",
        "author": "amazingspineman",
        "title": "The Recruit vs Night Agent",
        "content": "For once, Netflix is cooking and gave us two shows with tremendous potential to grow. But given that these shows have always released their seasons close to each other, it hard not to compare them. Especially that they are both spy/political shows. Which do you prefer? \n\nThe Recruit or Night Agent. \n\nI am leaning more toward The Recruit but I am not done with Night Agent season 2 yet so jury still out.",
        "upvotes": 16,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1ig3rfr/the_recruit_vs_night_agent/"
    },
    {
        "id": "1igi2dy",
        "author": "anonymous231722",
        "title": "Series that leaves impact and you miss them!!",
        "content": "Hey every one; so i am seaching for some shows which make you so connected to the characters and story that you keep missing them. \nI have watched The OA; pitty that it was cancelled ; I still miss it - I keep getting flashbacks. I recently watched Dark and still missing it. \nCan someone suggest some good to go scifi/thriller series!? ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1igi2dy/series_that_leaves_impact_and_you_miss_them/"
    },
    {
        "id": "1ighv4z",
        "author": "forevony_0904",
        "title": "Show recs",
        "content": "\n\nHey all, need ideas and recommendations for shows and vibes I like. Like the shows I recently watched and currently watching and like what shows y'all recommend that are like it. Shows I liked and watched are \n\nGinny and Georgia,\nAtypical, \nNever have I ever,\nHeartbreak high,\nSpinning out,\nEverything sucks\n\n\n\nSo any shows like them please let me know. Shorter series would be good. But any is fine. Thanks all ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ighv4z/show_recs/"
    },
    {
        "id": "1ignnf4",
        "author": "ellaa-4a",
        "title": "Dahmer: opinion",
        "content": "Yesterday me and my boyfriend started to watch the Dahmer series bc I was very interested.\nA little into the first episode and I felt like I’ve been watching for 10 hours straight, my bf also commented on this.\nSo my question is, is the whole series so slow?\nDon’t get me wrong tho, I usually like to watch documentaries or longer true crime videos on yt but I just feel like this series’ first episode was so dragging.\nIs the whole series like this? Does the action goes any faster?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ignnf4/dahmer_opinion/"
    },
    {
        "id": "1ig4vyw",
        "author": "indiewire",
        "title": "Best New Netflix Shows in February 2025",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ig4vyw/best_new_netflix_shows_in_february_2025/"
    },
    {
        "id": "1ighfu6",
        "author": "ArcadianEuphoria",
        "title": "Screen freezes but audio plays when watching Peaky Blinders only",
        "content": "I have been trying to watch Peaky Blinders on my phone, but it always freezes after playing for a few seconds. This is the only show that this is happening with, and I'm not sure why. \n\nI have restarted the app, restarted my phone, checked for updates, etc, but nothing has worked. \n\nI have a Samsung S24+ if that makes a difference. \n\nAny ideas?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ighfu6/screen_freezes_but_audio_plays_when_watching/"
    },
    {
        "id": "1igmp2h",
        "author": "Ditendra",
        "title": "What happens if you try to login canceled Netflix account?",
        "content": "I want to know what happens if you try to login account which is canceled. Does Netflix tell you that account is canceled when you try to login? Or what message do you get? \n\nI'm asking because I'm sharing my account with the member, but I don't want to share with them anymore, but I don't want to hurt their feelings by telling them that I no longer want to share my account with them, so I want to change my password and kick them out, but I don't want them to know about it, I want to tell them that I cancelled my account.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1igmp2h/what_happens_if_you_try_to_login_canceled_netflix/"
    },
    {
        "id": "1igktoj",
        "author": "Alternative_Dish4402",
        "title": "Non US Netflix alternatives.",
        "content": "In readiness for the US tariffs on the EU, I will be leaving Netflix. \n\nWhat non US alternatives are English speaking non US based people using? \n\nWe have the UK channels BBC Channel 4  etc but none of then have the range that Netflix has. \n\nHopefully when the tariffs are cancelled, I can come back with a new user discount. \n\n",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1igktoj/non_us_netflix_alternatives/"
    },
    {
        "id": "1ifvj5c",
        "author": "wendigooner69",
        "title": "Any good survival movies or shows?",
        "content": "I just really want something that isn't a competitive situation, like I'd rather someone unintentionally being in the woods and having to survive rather than willingly going for a prize and to compete. Any suggestions let me know asap!",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ifvj5c/any_good_survival_movies_or_shows/"
    },
    {
        "id": "1ifjv14",
        "author": "Alternative_Bid_360",
        "title": "What makes international shows such as Money Heist, Élite and Squid Game so popular?",
        "content": "I’ve been researching the production of a teen drama TV show in the style of *Élite*. While it is a Spanish series, it has gained a massive international following, proving that language isn't necessarily a barrier to global success.\n\nFor those of you who enjoy non-English films and TV shows, what makes you hit *play*? Is it the storytelling, cinematography, cultural uniqueness, or something else entirely?\n\nAnd in particular, I'd like to know what, in your opinion, makes the shows mentioned in the title so popular?",
        "upvotes": 43,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1ifjv14/what_makes_international_shows_such_as_money/"
    },
    {
        "id": "1igprhe",
        "author": "_idiosyncratic_",
        "title": "it’s not 2018 anymore",
        "content": "it’s not 2018 anymore.\n\nno one is getting home from their soul crushing 9-5 desk job and immediately hitting the couch and switching on Netflix.   and i’m also pretty sure no one watches netflix in general anymore. they removed like everything. i know i haven’t used it in years myself.\n\nso can we stop acting like this is still a thing? all the motivational posts i see are always like “You would have the time if you didn’t get off work and switch on netflix for a couple hours.”\n\nfirst of all, fuck that. if i’m coming home from an EIGHT hour work day just to not even be able to \n pay all my bills  which is fucking insane, (im anti work/employment.) i’m gonna do whatever i want. \n",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1igprhe/its_not_2018_anymore/"
    },
    {
        "id": "1ifrfop",
        "author": "Dependent_Big4782",
        "title": "Kristen Bell's Nobody Wants This co-star lays bare major details about season 2",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ifrfop/kristen_bells_nobody_wants_this_costar_lays_bare/"
    },
    {
        "id": "1ifux8u",
        "author": "ReadJohnny",
        "title": "Change primary profile for Premium plan",
        "content": "I'm using the primary profile for a Premium plan account that I share with others. I would like to choose another profile to be the primary one, so my profile could be removed. Is this possible to do?  \nA last resort would be to ask another person to rename and use my profile instead, and remove theirs. But that means their watch history would be lost. Thanks!",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ifux8u/change_primary_profile_for_premium_plan/"
    },
    {
        "id": "1if4333",
        "author": "EthanWilliams_TG",
        "title": "The Duffer Brothers Are Working on Two New Series for Netflix After 'Stranger Things'",
        "content": "",
        "upvotes": 231,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1if4333/the_duffer_brothers_are_working_on_two_new_series/"
    },
    {
        "id": "1ighdui",
        "author": "Johnny_Blaze_123",
        "title": "I feel robbed by Netflix",
        "content": "After years we decided to come back. Since day 1 the Netflix app on our TV and phones was giving us trouble. This is waaaaay worse than it ever was. Somehow we managed to start watching what we wanted. By the way we chose the cheapest option, ads and all. Midway through our watch the tv app didn’t work anymore. It kept saying there’s a storage issue when there isn’t. I can’t even cast the content from my computer to the tv. \n\nI can’t download the app on my iPhone because it needs to be at least version whatever the fuck. My wife can’t cast the shows from her top of the line android phone to the tv. WHAT THE HELL IS GOING ON?????????? What is this business model???? They really do want to push users away? We still have 20 days left in our subscription. Obviously after all the trouble we had today I cancelled it. \n\nWe still have until 22 of February and we can’t watch shit if not on a phone or computer. What is the point of this??????",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ighdui/i_feel_robbed_by_netflix/"
    },
    {
        "id": "1ifl8z6",
        "author": "Rare-Negotiation-151",
        "title": "What shows do you recommend? Need something to watch",
        "content": "I liked better call saul, breaking bad, peaky blinders, band of brothers, queen’s gambit, narcos, etc etc. Couldn’t watch the witcher, not really interested in Squid Game (or most of the new shows) I hate shows with too much drama.. What other great shows can be found in netflix? In desperate need of something to watch",
        "upvotes": 14,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1ifl8z6/what_shows_do_you_recommend_need_something_to/"
    },
    {
        "id": "1ifp05d",
        "author": "Southern-Brother5693",
        "title": "The Netflix TV User Interface Homepage",
        "content": "I watch Netflix through my Sony Bravia TV. Does anyone notice that the Netflix user homepage seems to have slightly changed.\n\nUsually, they put the pic of new and popular movies/show up large in front. But now they put our \"List\" and \"Still Watching\" in front instead. Which is convenient i guess, but i thought the old format was more aesthetically pleasing.\n\nAre the rest of you seeing the same thing?",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ifp05d/the_netflix_tv_user_interface_homepage/"
    }
]