[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 64,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1li6s5y",
        "author": "ispankoldpeople",
        "title": "What is your fave hidden gem on Netflix?",
        "content": "\nLooking for recommendations of what you believe to be the most underrated shows that you have watched on  Netflix/Prime apps. My only hard no is anything dubbed, it’s just way too distracting for my tiny little mind.",
        "upvotes": 153,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/1li6s5y/what_is_your_fave_hidden_gem_on_netflix/"
    },
    {
        "id": "1li2xbf",
        "author": "BarracudaJazzlike730",
        "title": "Forget the critics, Tires is extremely funny",
        "content": "Tires is a great show. Absolutely hilarious. I have no idea why the critics (look at metacritic) gave the show terrible reviews. It's like a mix of the office meets East Bound and Down. Am I alone in thinking this show is awesome? ",
        "upvotes": 169,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1li2xbf/forget_the_critics_tires_is_extremely_funny/"
    },
    {
        "id": "1lid639",
        "author": "MindFlourish2919",
        "title": "Should I watch Black Mirror?",
        "content": "I like anthology series because of the many stories it can bring. This show looks appealing because it focuses on technology and the flaws that humans have. Should I give it a shot?",
        "upvotes": 18,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1lid639/should_i_watch_black_mirror/"
    },
    {
        "id": "1lifkfh",
        "author": "30HummingbirdLane",
        "title": "Favorite Monologue",
        "content": "What’s your favorite movie/TV monologue scene? \n\nPapa Pope from Scandal probably has some of the most memorable monologues for me. \n\nAdd your favorites. \n\n\n",
        "upvotes": 9,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xdgg82vw9o8f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lifkfh/favorite_monologue/"
    },
    {
        "id": "1liav4r",
        "author": "kuromisparkles",
        "title": "Suggest me your favorite documentary film!",
        "content": "I’ve been in a documentary mood lately and would love to hear your favorites. I recently watched AM: Laci Peterson documentary.\n\nWhat’s a documentary you really loved or that stuck with you long after watching? Could be about food, true crime, history, art, anything, really. I’m open to all kinds! Thanks.",
        "upvotes": 21,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1liav4r/suggest_me_your_favorite_documentary_film/"
    },
    {
        "id": "1li5zd2",
        "author": "Tell-Uh-Tubbie",
        "title": "Sirens could be better",
        "content": "My review........it was....OK.  Julianne Moore was great...as expected.  I feel like she's super hot these days....very deserved!.  Milly Alcock...also great! Both held their part of the bargain...great actresses!   The storyline was ...meh if I'm gonna be honest.   The success of this series was really based on the cast...not the story line.  I felt that the real interest was in Meghann Fahy and Felix Solis' characters. Their chemistry was amazing and I wanted to see more! Her and his backstory, ,  how this cult started, who was the first wife, \"hey hey\"? Josh Segarra's character? Like wtf is that about? There is soooo much more to unpack here that is bigger than this storyline! PLEASE MAKE A PREQUEL  or a spinoff with Meghann Fahy and Felix Solis!.  So many questions unanswered!",
        "upvotes": 22,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1li5zd2/sirens_could_be_better/"
    },
    {
        "id": "1lijn8y",
        "author": "JustReading321-",
        "title": "Straw Ending",
        "content": "Omg I just finished watching it and I’m sat here frustrated because this movie had so much potential. I really wish they tied up the ends better because it was all so confusing… like where was her daughter’s body after she carried her out of the hospital since the events take place the very next day? What did the FBI agent mean when he said “make it happen”? Also, if her boss knew her daughter was dead why was he so rude? What about her co-worker who she seemed so close to? Why would her mother leave Janiyah alone when she knew Aria was dead? Was the scene with the racist cop reality or is it all just delusion???\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lijn8y/straw_ending/"
    },
    {
        "id": "1lhqury",
        "author": "Afraid_Orange6762",
        "title": "3 body problem is one of the best sci-fi shows I’ve watched in a while",
        "content": "The show is beautiful. The cinematography, how the plot advances and how the characteristics of each person is introduced to the viewers in a very subtle but definitive way. I love the show and I hope to god that they don’t discontinue. I’ve never posted a review in my life but knowing Netflix and how they’ve cancelled a lot of the shows I was eagerly  waiting for, I just wanted to post my opinion on this subreddit so that even if there was a 0.01% chance that this post could make the show gain some traction I had to do it.",
        "upvotes": 151,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1lhqury/3_body_problem_is_one_of_the_best_scifi_shows_ive/"
    },
    {
        "id": "1li3fww",
        "author": "LectureJaded1233",
        "title": "Is “The Waterfront” worth watching?",
        "content": "Thinking about starting “The Waterfront\" but haven't heard much about it. For those who've seen it, is it worth watching? Any quick thoughts or recommendations are appreciated!\nThanks!",
        "upvotes": 23,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1li3fww/is_the_waterfront_worth_watching/"
    },
    {
        "id": "1lih3e2",
        "author": "Gluefactory22",
        "title": "New This Week/Next Week tab",
        "content": "Trying to embrace the new interface…\n\nIn the past I would use the “New Next Week” section to save things to my list to watch when things popped up.  \n\nIs there a place on the new interface where all the upcoming stuff is in available to browse?  I can’t seem to find it. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lih3e2/new_this_weeknext_week_tab/"
    },
    {
        "id": "1lik13t",
        "author": "Safi42112",
        "title": "The waterfront season 2…",
        "content": "Whilst initially the tone of the show was hard to get into by the third episode I absolutely loved the soapiness and drama of the show. \n\nIt’s doing really well in terms of appearances on the top 10 daily and it’s the number one show in many countries currently on Netflix.\n\nDo you think it will get picked up for a second season.✌️",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lik13t/the_waterfront_season_2/"
    },
    {
        "id": "1lijkxt",
        "author": "Klutzy-Violinist-522",
        "title": "Playback Speed Option?",
        "content": "A while ago, I believe Netflix had playback speed options up to 1.5x on PC. However, I am no longer able to find it.\n\nIs it still available and if so, where can I find it?\n\nhttps://preview.redd.it/hh8ixhse3p8f1.png?width=1921&amp;format=png&amp;auto=webp&amp;s=f41c55c0a5b3239bea357ee66efaec168e50699d\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lijkxt/playback_speed_option/"
    },
    {
        "id": "1liinjq",
        "author": "iPhone13pm",
        "title": "Top 10 Most Popular Shows (Global All Time English Language)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1liinjq/top_10_most_popular_shows_global_all_time_english/"
    },
    {
        "id": "1liidvy",
        "author": "MrShadowKing2020",
        "title": "Define a “unique view”",
        "content": "So one of the main metrics Netflix looks at for success is “unique views” of a film or movie? Does that mean separate accounts watching a film or movie for the first time? Does this mean they don’t care about a film or show getting rewatched?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1liidvy/define_a_unique_view/"
    },
    {
        "id": "1liddt6",
        "author": "juiceybox4602",
        "title": "Chinese audio in squid game",
        "content": "So I was just watching squid game and I saw mandarin as one of the options for audio of squid game. I think this might be because I’m in an Asian country right now but for people in America can yall check for me?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1liddt6/chinese_audio_in_squid_game/"
    },
    {
        "id": "1ligcxq",
        "author": "Max_Laval",
        "title": "Quality seemingly keeps gettitng worse - Will it get better; ever?",
        "content": "Image quality has been deteriorating steadily, and it appears to have reached an all-time low. Even when watching a show at a relatively low resolution, such as DS9, the reds appear completely blown out and pixelated, even though the bitrate should be able to handle this resolution with ease.  \nIt's so awful, I've thought about cancelling my subscription multiple times already.\n\nDo you think this will be getting better anytime soon, or ever?  \nI feel like Netflix is offering an awful service atm.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ligcxq/quality_seemingly_keeps_gettitng_worse_will_it/"
    },
    {
        "id": "1li4e6c",
        "author": "Fragrant_Peanut_9661",
        "title": "3 Body Problem",
        "content": "To whoever posted earlier about this show, THANK YOU! Based on that post, I decided to give it a rewatch. (I've already watched it once, when it first came out.) And now I remember why I loved it so much. ",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1li4e6c/3_body_problem/"
    },
    {
        "id": "1libpae",
        "author": "Own_Cause523",
        "title": "La Révolution",
        "content": "I ran out of shit to watch that interested me.  Scrolling through I see this show.  I like period shows, I like supernatural / horror theme shows - great mix, let’s give it a go.  \n\nStarted watching with English dub, and had to switch back to native French with subs.  Every dub I watch I can’t stand that the voices are flat and don’t match the atmosphere.  \n\nThe show has a great premise and was decently made, great dark atmosphere with historical context!  How come we can’t get a decent English show like this?  The production was waaay more watchable than say the Prime Wheel of Time show.  \n\nToo bad they cancelled it and we don’t get the climax we all knew was going to happen…. 🫤",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1libpae/la_révolution/"
    },
    {
        "id": "1liexbj",
        "author": "Alan_Stamm",
        "title": "Animated K-drama 'Lost In Starlight' shoots its sappy love story into space",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1liexbj/animated_kdrama_lost_in_starlight_shoots_its/"
    },
    {
        "id": "1lijeny",
        "author": "MrShadowKing2020",
        "title": "Likelihood of Fear Street 5?",
        "content": "So does anyone else think we’re not getting a fifth Fear Street movie? The talk and hype around Prom Queen seemed to taper out after 1 week after we all agreed it was a disappointment that missed everything the original trilogy did right. I’m not sure how long the film even stayed on the top 10 list. At this point, we’re more likely to get a sequel to Straw given it’s still on the top 10 after three weeks (let’s hope KPop Demon Hunters lasts at long, but apron Queen feels like a disappointing number to go out on.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lijeny/likelihood_of_fear_street_5/"
    },
    {
        "id": "1lhynfp",
        "author": "PeskieBrucelle",
        "title": "Can we talk about kpop demon hunters?",
        "content": "When I first saw the title I was like, eh this is weird. However the animation caught my eye. With nothing else to watch I gave it a shot. \n\nI had to stop watching to go to an appointment but when I came back I restarted it to show my significant other and.... \n\nWow. Just wow. The animation was unique and hilarious the singers voices were beautiful and just, flawless. The music was catchy, the feels were Feely. As a kid who loved power puff girls it gave me that same thrill I had as a kid. I never really got into kpop I read some web toons but my significant other and I now get the appeal why these kpop teens love it. \n\nThe story was unique and authentically pleasing rich with culture and life and I need a plushy of that blue tiger with his bird friend. ",
        "upvotes": 14,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lhynfp/can_we_talk_about_kpop_demon_hunters/"
    },
    {
        "id": "1lidu3o",
        "author": "vizzy_vizz",
        "title": "Why are some good movies/shows not promoted like others?",
        "content": "I noticed there are some hidden gems on Netflix that are not promoted by Netflix. I’ve been recommended new/old movies and shows by friends and even Reddit strangers, that never show up on top 10 or recently added (and most of them should show up for me cos they fit my algorithm). \nHow or rather what r the criteria’s Netflix uses to rate top 10 and why are certain movies or shows heavily promoted and some just gets lost in the pile? Thank you ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lidu3o/why_are_some_good_moviesshows_not_promoted_like/"
    },
    {
        "id": "1lhs33k",
        "author": "Expensive-Energy-818",
        "title": "Molly Martens is a psycho - A Deadly American Marriage",
        "content": "The first wife died of an asthma attack. It's possible to die of asthma as a non asthmatic. And the prosecutors was presenting is as if Janson had strangled her, with no marks on her neck. It's crazy because strangulation can be seen on the outside and not be seen on the outside but have a full on  impact from inside the neck. But what makes this whole case a mystery is that Tom ( the father) and Molly hade bearly any scratches or woundes on them. But parts of Jansons brain was out. If Molly really had been struggled there would have been injuries from inside the neck.He was much bigger and stronger. \n\n I don't believe ether that she was unconscious. Every woman pees while being nervous or it's something she looked up for her story.   \n\nI believe that it was all pre planned. She read about the first wife and made up a story that would fit. Intoxicated him weak and begun hitting him with the bat. Then shouted out so that the father could come up and help her finish the story. Why was there a whole brick in their bedroom?  And why was it so easy for the to hit him with it? Why was blood splattered on the backside of the door ? Was  Mollys mother on the other side the door, preventing him from running out? \n\nIf Tom was there while Janson was alive... he could have them stop the altercation and calm things down, run or even right then call 911 ? \n\nNOOOO ! Tom was an ex FBI agent. He knew how to save his daughter and work around the crime she hade committed. Tom was educating students on investigation after his job at FBI.  \n\nI feel sorry for them kids. Me, myself and I have also been manipulated as a child and used as a spokes person. I understand. They are grown now and can recall memory better.",
        "upvotes": 24,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lhs33k/molly_martens_is_a_psycho_a_deadly_american/"
    },
    {
        "id": "1lh9ft8",
        "author": "Less_Manufacturer218",
        "title": "Dept. Q on Netflix best show",
        "content": "One of the best shows I’ve seen in a while. Characters, plot and ending all really stuck with me. Almost as much as Young Wallander. Hoping for a second season. ",
        "upvotes": 448,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1lh9ft8/dept_q_on_netflix_best_show/"
    },
    {
        "id": "1lhnz54",
        "author": "HurricaneLogic",
        "title": "The new format",
        "content": "This new format is absolutely awful. \n\nPreviously, all categories were in subcategories, to make it easy to navigate through. \n\nNow it's a jumbled mess, with everything thrown together. I have lost interest in watching, and am seriously considering canceling. ",
        "upvotes": 31,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lhnz54/the_new_format/"
    },
    {
        "id": "1li7481",
        "author": "Plastic-Reveal505",
        "title": "What is the best Canadian netflix horror movie?",
        "content": "My partner and I are trying to have a spooky Sunday! So far we are thinking about the Wailing but I figured it cannot hurt to ask !! \n\nI dont mind paranormal, slasher, thriller or anything! Just need good recs :) ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li7481/what_is_the_best_canadian_netflix_horror_movie/"
    },
    {
        "id": "1li9a9k",
        "author": "New_Opportunity_742",
        "title": "Is there any size chart for the products in the Shop?",
        "content": "So, just as the title says. \n\nI just found out there is a shop and that is has some merch that I want, but none of the products have a size chart and I’m freaking out thinking that if I buy one its going to arrive in the wrong size. I'm not from the US so, even if the shop offered the possibility to change it after I would not be able to do it. Soo, help pls???\n\nEnglish is not my first language so sry if I made a mistake.\n\nPD: Here are the links to the items, if it helps somehow: \n\n[https://www.netflix.shop/en-ar/collections/avatar-the-last-airbender/products/avatar-the-last-airbender-fire-nation-wide-leg-pants?variant=43556908007471](https://www.netflix.shop/en-ar/collections/avatar-the-last-airbender/products/avatar-the-last-airbender-fire-nation-wide-leg-pants?variant=43556908007471)\n\n[https://www.netflix.shop/en-ar/collections/avatar-the-last-airbender/products/avatar-the-last-airbender-water-tribe-wide-leg-pants](https://www.netflix.shop/en-ar/collections/avatar-the-last-airbender/products/avatar-the-last-airbender-water-tribe-wide-leg-pants)\n\n[https://www.netflix.shop/en-ar/collections/k-pop-demon-hunters/products/k-pop-demon-hunters-huntrix-oversized-faded-t-shirt?variant=43856807198767](https://www.netflix.shop/en-ar/collections/k-pop-demon-hunters/products/k-pop-demon-hunters-huntrix-oversized-faded-t-shirt?variant=43856807198767)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li9a9k/is_there_any_size_chart_for_the_products_in_the/"
    },
    {
        "id": "1lico0x",
        "author": "catastrophic_blues_",
        "title": "Kpop Demon Hunters (I swear this movie has Queer Allegory/Queer Coding, pls tell me I'm not the only one. If you disagree, which you can, please be kind)",
        "content": "Okay I just finished watching this movie and I just felt it and have seen how queer coded it is, not a way that the characters are actually queer and i dont wanna be assuming that but the plot and the experiences of the characters relate to how I'm experiencing being gay rn and I'm pretty sure other queers out can see it to some degree. The exchange of Celine and Rumi in the final scenes where Rumi's marks got revealed and they talked about it must hidden, \"out faults should be hidden until theyre destroyed\" non-vertatim, it hits me, it's too close to home. And then scenes where Rumi  finally accepted who she is and ready to show everyone that just because she's born as \"half-demon\" she should be ashamed, AND THE SONG—oh my god the songs. Im rambling a bit here u get the idea right? I'm really the most eloquent so perhaps that does see my vision can explain it better than I can. 'Cause if one queer like me watched this show and had a eureka moment where I'm like, \"okay wtf this is so familiar, I swear I had this conversation before\" while sobbing, I'm sure there are others. And of course you can completely disagree with me, I know this is just a movie, it can completely just about kpop idols fighting demons and about friendships. But please remain respectful and let's have civil conversations. I'm very sensitive 🥹, just, just dont be rude 🥺",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lico0x/kpop_demon_hunters_i_swear_this_movie_has_queer/"
    },
    {
        "id": "1li8zj4",
        "author": "Comprehensive-Gate37",
        "title": "Kpop Demon Hunters SONG HELP",
        "content": "While listening to the song 'What It Sounds Like' in the movie game *Kpop Demon Hunters*, I noticed that it left some words in the back of my throat like the song sounds like another pop song. PLEASE SOMEONE listen to 'What It Sounds Like' and the part is 37 seconds to 48 seconds. I CANT PUT MY FINGER ON IT. IT'S KILLING ME! ;-;",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li8zj4/kpop_demon_hunters_song_help/"
    },
    {
        "id": "1li5r0e",
        "author": "South_Break6321",
        "title": "Why I think K-pop Demon Hunters could have been soooo much better",
        "content": "I think there was so much potential but they honestly fumbled so bad. at first I thought i really liked it but the more i think about it, the more i feel like i just liked the idea of it. The animation and music was awesome but i feel like it was rushed and it didn't have as much of an impact as it could have. And don't get me wrong it was still good and enjoyable but i think it genuinly had the potential to be like insanly perfectly awesome.\n\nMy reasons and how they could have fixed it:\n\n1.) The rest of the Saja boys had literally no personality, its unrealistic that Jinu was the only demon with a backstory and personality. It would have been so much more fun to see and connect to all the boys, i wanted to love them but they were practically background characters. It would have been a lot more emotional to see them die if they had actually seemed like real people who had emotions, instead of just zombies.\n\n2.) Rumi and Jinu's romance thingy was so weird and the chemistry was definetly there but we saw so little of it. Again it just felt rushed, they barely met and then all of a sudden they were singing some love song about how being with each other was so freeing and how no one else sees them like they do. I can't imagine who's dumb idea it was to take out the aquarium date and kiss, it wouldn't have fixed everything but they seriously needed a few more quite romantic moments.\n\n3.) Rumi's reaction after Jinu's death seemed so like unemotional. Like she was more upset when she found out that Juni had betrayed her than when he literally died to save her. She shed like 3 individual tears and then started smiling and hugging her friends. That scene honestly ruined everything that they had for me, because it made it seem like she didn't care. The emotion before he died, was fairly on point but after he died it just seemed to completely ignore the fact that the boy who she supposedly loved had just died. I mean I've lost people I love before and it has taken months if not years to heal, and they hadn't even died they just left me.\n\n4.)The actual villain (whats his face, the fire dude) was just sooo boring, like he had no personality the fire persona was eh, honestly pretty bad. It wasn't scary and it wasn't unique or iconic. I mean i looveee a good iconic villain, just a good character design will take it a long way. I mean, take HTTYD as an example, Drago, Grimmel, and even Viggo, they all had unique character design and complex personalities. And i think there would have been soooo many possibilities to make the demon lord dude have an epic design, like hes a demon lord they did awesome with Jinus demon design i don't know why they started slacking off with the fire dude.\n\n5.) Why did Jinu and the other boy band member look and act differently than all the other demons? I feel like all the other demons were literally just ugly zombies who couldn't talk and then you have Jinu who isn't said to have anything special about him whos hawt and talks quite a lot and is capable of emotion. It's inconsistent and it feels lazy.\n\n6.) Mystery and Romance's hair to face proportion bothered me, like why is their head so big? Idk I didn't like it.\n\n7.) Also why could the Saja boys hide their marks but Rumi couldn't?\n\nI have a lot more i could say and suggestions on how they could have made it better but i've already written a lot and doubt anyone will even read this much. Anyways i think we were robbed of a really amazing, complex story that would have been much better as a series than it was a movie. So if netflix actual reads these and needs help making the next movie amazing, because there is going to be another movie obviously, then like ask for a few teenager to read the script, look at the character designs, and watch it before you release it. Try to find some that are really judgy and good writers, Ao3 is a great place to find em, i also volunteer.\n\nAlso was i the only person who was reminded of Zuko and Katara by Jinu and Rumi?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1li5r0e/why_i_think_kpop_demon_hunters_could_have_been/"
    }
]