[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iv2f9k",
        "author": "ellissabain",
        "title": "This is what the police officer who stopped Gabby Petito said after she was murdered",
        "content": "",
        "upvotes": 914,
        "comments": 373,
        "media": null,
        "permalink": "/r/netflix/comments/1iv2f9k/this_is_what_the_police_officer_who_stopped_gabby/"
    },
    {
        "id": "1ivgkx5",
        "author": "Legitimate_Ad3625",
        "title": "Pantheon Season 2 Is Finally Available to Watch Worldwide – Finds New Home on Netflix",
        "content": "",
        "upvotes": 21,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ivgkx5/pantheon_season_2_is_finally_available_to_watch/"
    },
    {
        "id": "1ivko3t",
        "author": "S4v1r1enCh0r4k",
        "title": "Ben Affleck Reportedly ‘Thrilled’ to Star with Longtime Crush Gillian Anderson in New Netflix Thriller!",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivko3t/ben_affleck_reportedly_thrilled_to_star_with/"
    },
    {
        "id": "1iv4n3f",
        "author": "Seismic_Salami",
        "title": "Can we remove the games section? Or at least hide it?",
        "content": "I'm willing to bet over 99% of users don't gaf about the games section. It's just bs cash farm mobile games, nothing actually fun. Netflix is for movies and shows. If someone wants to play a bs mobile game, they'll play it on mobile. If someone wants to play a real game worth playing, they'll play it on Steam. No one wants this section. It's dumb af. Remove it or allow users to at least hide it. I'm considering just dropping netflix entirely at this point the way they've been going recently. This is like adding local weather to pr0nhub. makes no f\\*\\*\\*ing sense",
        "upvotes": 100,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1iv4n3f/can_we_remove_the_games_section_or_at_least_hide/"
    },
    {
        "id": "1iv8xbd",
        "author": "Artdiction",
        "title": "As a breast cancer survivor, watching belle gibson in apple cider vinegar makes me sick to my stomach, how can these people exist preying on vulnerable cancer patients during their lowest time?",
        "content": "I don’t believe in ALTERNATIVE therapy but many cancer patients who need hope and become prone to this snake oil type of salesman fall into these scammers, and nowadays there are so many famous wellness influencers who keep giving out advices without even a degree in medicine. It’s sickening. ",
        "upvotes": 45,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1iv8xbd/as_a_breast_cancer_survivor_watching_belle_gibson/"
    },
    {
        "id": "1ivcypa",
        "author": "Keven250",
        "title": "American Murder Series - I Found A Theme...",
        "content": "I just finished the new docuseries on Gabby Petito.\n\nWhat reminded me of the Watts story was that both men seemed to be totally enabled by their parents.\n\nWhereas the men obviously committed the crime, you get a sense that their parents are pretty terrible people who \"created\" a narcissist.\n\nI then thought of the Laci Peterson Netflix docu, where I was stunned to hear Scott's family still believes he's innocent and is trying to prove it after all these years!\n\nThere's a theme here, that explains how these guys thought they would get away with gruesome murder - they've presumably been getting away with everything their whole lives, without consequences...",
        "upvotes": 15,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ivcypa/american_murder_series_i_found_a_theme/"
    },
    {
        "id": "1iuy7cj",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Reportedly Leading the Race for Scorsese’s $200M Crime Epic Starring DiCaprio, The Rock &amp; Blunt",
        "content": "",
        "upvotes": 101,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1iuy7cj/netflix_reportedly_leading_the_race_for_scorseses/"
    },
    {
        "id": "1ivf608",
        "author": "TerminalReaper",
        "title": "The Imperfects is a Great Show. [All]",
        "content": "I understand that the show may not have had great viewership numbers but I genuinely think this is one of the better \"Young Adult\" series I've seen. The writing is really well done and it's an interesting concept built upon the super power genre. The characters are all very interesting and don't feel completely forced like some shows do.\nI can see why the show might not have attracted some people but if Netflix had marketed the show better than maybe it would have done better because I think a lot of people I know would have been interested in it. \n     I'm a big fan of the themes tied to mythology and how ordinary people are altered to become beings with powers and aren't magically born that way. I think the show really did have a lot of potential to keep growing into a really great story if it had continued and it's a shame that it didn't. I'm even a big fan of the three main leads and how their powers are integrated into their daily lives and the burden of how their powers can affect those around them either negatively or positively.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ivf608/the_imperfects_is_a_great_show_all/"
    },
    {
        "id": "1iuk9mq",
        "author": "Baby_0il04",
        "title": "Gabby petito body cam footage is making me so mad rn",
        "content": "I’m only one episode in but the way these cops are talking have me so mad rn. They’re claiming he’s a victim of abuse, when the call was about him hitting her, and the marks he has are scratches, which are defensive marks meaning she was defending herself from him. You don’t attack someone by scratching/clawing at them. Brian is laughing and stubbing over his words as he tries to defend himself. While she’s crying and blaming herself. It’s so obvious who’s the victim in this situation. (Maybe that’s hindsight talking but ugh it gets my blood boiling) \n\nSorry just had to rant here, cuz I have no one to talking to about it \n\nEdit: i understand now how people do and can attack by scratching at someone. It was definitely just hindsight, knowing she was strangled And knowing strangle victims will try to scratch it get away. But I didn’t mean to invalidate anyone’s experiences, sorry if it came off that way. ",
        "upvotes": 663,
        "comments": 294,
        "media": null,
        "permalink": "/r/netflix/comments/1iuk9mq/gabby_petito_body_cam_footage_is_making_me_so_mad/"
    },
    {
        "id": "1ivg7is",
        "author": "MarionberryLong8547",
        "title": "Cozy movie recommendations",
        "content": "Hey Reddit!\n\nI need your help – I’m looking for cozy Netflix movie recommendations!\nIt can be a feel-good drama, a fantasy film, a lighthearted comedy… anything that gives off warm, comforting vibes! \n",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ivg7is/cozy_movie_recommendations/"
    },
    {
        "id": "1ivmc1v",
        "author": "Western_Remote8927",
        "title": "So with the add subscription?",
        "content": "So with the add subscription do u not get access to some of the newer stuff I want to have access to the new stuff as well and don't mind watching the ads for just 8 bucks. I may have to just get the more expensive one. Also if I want to upgrade can I do it by paying just the few extra bucks or do I have to pay the whole new amount. Thanks ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ivmc1v/so_with_the_add_subscription/"
    },
    {
        "id": "1ivl6i5",
        "author": "ian2345",
        "title": "Trying to log in on my laptop before going away",
        "content": "\"Something went wrong\n\nWe are having technical difficulties and are actively working on a fix. Please try again in a few minutes.\"\n\nI don't understand why I can't log in using my username and password on my own device in my own household. Can I even use my laptop now away or what do I even do?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ivl6i5/trying_to_log_in_on_my_laptop_before_going_away/"
    },
    {
        "id": "1ivjniz",
        "author": "northernblazer11",
        "title": "Netflix uk recommendations",
        "content": "Hello guys. \n\nI love a good detective show. \n\nI enjoyed the 1st part of the sinner but not the rest. I enjoy movies like 7, fight club etc. \n\nCan you give me a series or movie you guys think I will enjoy. Tried watching ozark but couldn't get into it. \n\nI will give most things a go. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivjniz/netflix_uk_recommendations/"
    },
    {
        "id": "1ivi97o",
        "author": "salaciousCrumble",
        "title": "Sister somehow changed the netflix account to her home wifi and I can only get temporary access to my own account.",
        "content": "Title says it all. How can I change it back to my wifi network? How the hell did she do this in the first place?  \n  \nUnder security I can sign out of any devices but I don't see an option to change the network.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ivi97o/sister_somehow_changed_the_netflix_account_to_her/"
    },
    {
        "id": "1ivbo3a",
        "author": "Drakonnen",
        "title": "The New App Layout on FireTV SUCKS",
        "content": "So rather than having multiple categories on the screen, where I could see like 20 or 30 programs, now I can only see 1 row at a time, and only 3 shows or movies at a time?\n\nThis is -EXTREMELY- annoying.\n\nThey need to change it back.  It wasn't broke, so why did they \"fix\" it?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ivbo3a/the_new_app_layout_on_firetv_sucks/"
    },
    {
        "id": "1iublcq",
        "author": "Demons_Butterfly",
        "title": "I can't believe David Fincher is making Squid Game remake for Netflix rather than Mindhunter S3",
        "content": "are we missing something? who wants an American squid game? and David Fincher of all people shouldn't be wasted on it. Just own up and renew Mindhunter, It's a classic. There's lot of material left too. I cannot think of 3 netflix originals better than it. \n\nI am sorry i am ranting here but why do you think Fincher wants to make squid game? ",
        "upvotes": 523,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1iublcq/i_cant_believe_david_fincher_is_making_squid_game/"
    },
    {
        "id": "1iv9p1r",
        "author": "NoCapJustTap",
        "title": "Me and my gf been looking for shows like the fosters and shameless, would anyone have any suggestions?",
        "content": "Me and my gf really liked the fosters and shameless and I feel like theres not really any show like those that really you feel attached to. So I've been wondering if you guys have any suggestions that would be cool to watch.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1iv9p1r/me_and_my_gf_been_looking_for_shows_like_the/"
    },
    {
        "id": "1iuyy08",
        "author": "TommyDiDario",
        "title": "Anna Cathcart discusses XO KITTY in new interview. Is #MINHO endgame?",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/od9wicrujjke1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iuyy08/anna_cathcart_discusses_xo_kitty_in_new_interview/"
    },
    {
        "id": "1iut84i",
        "author": "MysteriousDelay6266",
        "title": "Little Siberia | Official Clip | Netflix",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iut84i/little_siberia_official_clip_netflix/"
    },
    {
        "id": "1ivjcyg",
        "author": "Cailly_Brard7",
        "title": "Question for the show Never Have I Ever : Do you think the characters will became iconic in pop culture in the same veins that characters from Friends, Buffy The Vampire Slayer etc... ?",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ivjcyg/question_for_the_show_never_have_i_ever_do_you/"
    },
    {
        "id": "1iv7ood",
        "author": "pikachu771",
        "title": "Watch temporarily codes",
        "content": "Netflix no longer sends me codes to to watch temporarily ,they send me the codes on email, but do not send text on my phone number they used to do it but no longer they have just stopped it. Is there any way I can fix this as I prefer the codes being sent to me as text?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iv7ood/watch_temporarily_codes/"
    },
    {
        "id": "1iuszob",
        "author": "Beau_bell",
        "title": "Looking for Mexican TV Shows that are not drug cartel related, telenovela, or comedy",
        "content": "One example I thought was decent was Triptych, a thriller mystery about 3 sisters triplets alot like Orphan black. Worth a watch and the first season wrapped up pretty well and stands on it's own, almost seemed like a limited series.\n\nJust more stuff like this, thriller, mystery, sci-fi, fantasy, horror, adventure, etc anything like that I'm open to though.\n\n# \n\n# \n\n# ",
        "upvotes": 6,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1iuszob/looking_for_mexican_tv_shows_that_are_not_drug/"
    },
    {
        "id": "1iv0gs9",
        "author": "JenZen_2001",
        "title": "Anyone’s UK Netflix playing up?",
        "content": "WWE isn’t available for me anymore\n\nAnd even Lost which I was watching mere hours ago has disappeared on it too, is it glitching for anyone else?\n\nI signed it out of all devices and added security measures in case it was hacked or something but still nothing works. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iv0gs9/anyones_uk_netflix_playing_up/"
    },
    {
        "id": "1iv5hrx",
        "author": "Motor-Debate222",
        "title": "Picture Quality Issue on Netflix",
        "content": "Hi all,\n\nI'm getting an annoying issue on Netflix, either on Chrome, Edge or the PC app. TV shows and series are nice and sharp in HD, but movies are grainy, pixelated and blurry. Would attach screengrabs, but the rules say I can't! LOL. I was getting this before, but I would download them and then watch, but with the removal of this function, can't watch movies anymore. Last week I went to, cough, streaming site, to watch cocaine bear because it was grainy on Netflix.\n\n  \nChecked the bitrate quality - streaming Superstore its 1920x1080, streaming Cocaine bear it's 960x540.\n\nAnyone know why? Is this is a buffering thing? I can't watch movies on Netflix because of this. Pls help!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iv5hrx/picture_quality_issue_on_netflix/"
    },
    {
        "id": "1iv01j2",
        "author": "Noktis_Lucis_Caelum",
        "title": "Pantheon Season 2, when?",
        "content": "Hello everyone,\n\nPantheon Season 2 was supposed to BE aviable today (21.02.2025) globally.\n\nBut Here in Germany IT IS only Season 1 Till now (21:00).\n\nSo...what happened?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iv01j2/pantheon_season_2_when/"
    },
    {
        "id": "1iv554j",
        "author": "SaltyBoi3786",
        "title": "Laptop screen does whatever this is when I turn on a show",
        "content": "So I was trying to watch netflix on my laptop and i got this weird static screen. if I alt+f4 out of the browser, the screen goes back to normal. so far, i’ve:\n\nrun a RAM diagnostic - no problems \n\ndownloaded netflix app instead of browser, still same problem. \n\nI also updated my graphics drivers.\n\nwhat do i do!?\n\nhttps://preview.redd.it/euinvegmnlke1.jpg?width=2404&amp;format=pjpg&amp;auto=webp&amp;s=50fd21ad6110ebea4cb3422d7e9a27293617f466",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iv554j/laptop_screen_does_whatever_this_is_when_i_turn/"
    },
    {
        "id": "1iv4g6a",
        "author": "Cmgduk",
        "title": "Account problems",
        "content": "I'm trying to log into my account but it just says 'complete your subscription' even though I should have a valid subscription and I have charges on my bank account from Netflix. \n\nI tried to sign in and out again but that didn't work. Does anyone know what could be causing this? \n\nI'd like to contact Netflix customer support directly to resolve the issue, but I can't see how? There are no contact details on the website. \n\nAny help would be appreciated.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iv4g6a/account_problems/"
    },
    {
        "id": "1iul7wh",
        "author": "Robemilak",
        "title": "‘Nobody Wants This’ Season 2 Casts Leighton Meester, Miles Fowler (EXCLUSIVE)",
        "content": "",
        "upvotes": 19,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iul7wh/nobody_wants_this_season_2_casts_leighton_meester/"
    },
    {
        "id": "1iuzpn1",
        "author": "No-Needleworker-9422",
        "title": "Hi I need help finding a show",
        "content": "It was on Netflix, 19th century London aesthetic, one of the first episodes was about a murder or a male prostitute and it was overall crime, forensics pharmacology centered and I can’t recall the name for a long long time now ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iuzpn1/hi_i_need_help_finding_a_show/"
    },
    {
        "id": "1iuoxnu",
        "author": "Atlast_2091",
        "title": "The Life List | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iuoxnu/the_life_list_official_trailer_netflix/"
    }
]