[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hqxs0j",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1hqxs0j/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1idyfb7",
        "author": "NamelessNiner",
        "title": "GTT, perché?",
        "content": "\"A seguito del proseguimento dei lavori di migrazione al nuovo sistema digitale operati da Infra.To, il servizio della metropolitana modifica gli orari dal 2 febbraio al 16 aprile 2025\"\n\nE tornano agli orari di sempre, chiusura alle 21:30 in settimana. I turnisti che staccano alle 23? Possono fottersi. Era così bello poter credere di avere una metropolitana funzionante, degna di questa nome.\n\nUn mese è durato, ora torniamo alla barzelletta di sempre. &gt;!E hanno il coraggio di scioperare.!&lt;",
        "upvotes": 24,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1idyfb7/gtt_perché/"
    },
    {
        "id": "1idql37",
        "author": "No-Bit-2036",
        "title": "Le venti giornate di Torino",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3yk0ubffm5ge1.png?auto=webp&amp;s=15b1a2a03350cf03724957325a29638c968f2cac"
        },
        "permalink": "/r/torino/comments/1idql37/le_venti_giornate_di_torino/"
    },
    {
        "id": "1idvz9u",
        "author": "Alarmed_Lawyer400",
        "title": "Avete contatti di idraulici con prezzi onesti?",
        "content": "Ne approfitto per chiedere i prezzi medi per un intervento di spurgo qua a Torino.\n\nHo gli scarichi che non riescono più a tirare giù e ogni lavatrice mi si riempie la doccia di schifo (probabilmente per un problema di inclinazione degli scarichi o boh).",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1idvz9u/avete_contatti_di_idraulici_con_prezzi_onesti/"
    },
    {
        "id": "1idy97h",
        "author": "mandrake_55",
        "title": "Consiglio affitto stanza singola",
        "content": "Ciao ragazzi, secondo voi com'è come prezzo 400€ all-inclusive per una casa a mirafiori-sud (via quarello).\nLa casa è nuova e ben tenuta, la stanza carina ma non grandissima, con letto singolo.\nAttualmente vivo a mirafiori ma pago 350 per una situazione simile, non ho trovato peró nulla a questo prezzo, c'è stato un aumento generale?\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1idy97h/consiglio_affitto_stanza_singola/"
    },
    {
        "id": "1icq494",
        "author": "iannezluke79",
        "title": "Five Guys",
        "content": "Sicuramente lo saprete già ma non si sa mai\nSta aprendo a Porta Nuova",
        "upvotes": 343,
        "comments": 125,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jzwypgv8kwfe1.jpeg?auto=webp&amp;s=0cdc82f57bd30bde68d91c039c3cd9af69a0170d"
        },
        "permalink": "/r/torino/comments/1icq494/five_guys/"
    },
    {
        "id": "1idp0h0",
        "author": "Samsri719",
        "title": "Quanto costa la prima offerta per l'acquisto di una casa a Torino?",
        "content": "Voglio comprare una casa a Torino ma non sono sicuro di come funziona. Sono per metà italiano e per metà inglese, ma sono cresciuto nel Regno Unito. So che si può fare un'offerta inferiore al prezzo di vendita, ma cosa è normale per una prima offerta? Se l'appartamento è in vendita da più di 8-9 mesi? \nHo ricevuto un'eredità da mia nonna e voglio solo un piccolo appartamento, tra i 40 e i 60 metri, per viverci... cerco qualche consiglio.",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1idp0h0/quanto_costa_la_prima_offerta_per_lacquisto_di/"
    },
    {
        "id": "1idsba5",
        "author": "No-Ant-9038",
        "title": "Insegnatemi a rollare",
        "content": "Qualcuno a Torino mi vuole insegnare a rollare, in cambio ci smezziamo una j. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1idsba5/insegnatemi_a_rollare/"
    },
    {
        "id": "1iczmfw",
        "author": "Extra-Window7021",
        "title": "amicizie (si di nuovo)",
        "content": "avevo già fatto un post un pochetto di tempo fa, ma a causa di problemi miei ho lasciato tutto in standby e ho smesso di rispondere. cerco sempre amicizie qui a torino visto che da quando mi sono trasferita qui cinque anni fa non sono ancora riuscita a trovare una compagnia decente con cui uscire.\n\nsono una ragazza di 19 anni (al momento in cui sto facendo il post, mancano due giorni al mio compleanno), mi sono recentemente appassionata al mondo del cinema, mi piace vedere film di qualsiasi tipo purché abbiano una trama ispirante. ascolto moltissima musica, soprattutto musica latina, pop americano e k-pop (non è così male posso assicurarlo). mi piace molto anche studiare lingue, attualmente sto studiando lo spagnolo ma prossimamente inizierò anche con il portoghese e coreano. \n\nall’inizio sono una persona abbastanza silenziosa e riservata, ma appena prendo confidenza veramente sono molto più aperta e parlo con molta più facilità. ",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1iczmfw/amicizie_si_di_nuovo/"
    },
    {
        "id": "1iczjth",
        "author": "backdunflip",
        "title": "Consiglio ginecologa",
        "content": "Ciao a tutte, sapreste consigliarmi una ginecologa con cui vi siete trovate bene?   \nNel mio caso starei cercando una dottoressa con cui valutare una terapia ormonale per gestire meglio la sindrome premestruale",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1iczjth/consiglio_ginecologa/"
    },
    {
        "id": "1icsqh3",
        "author": "goodbyejimmy",
        "title": "Calzolaio per riparare dr Martens?",
        "content": "Ciao! Avrei bisogno di riparare le suole platform delle dr Martens, in particolare si tratta di sigillare la spaccatura. Conoscete qualche calzolaio in grado  di farlo o con esperienza con questo tipo di scarpe? ",
        "upvotes": 7,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vyjjnwt8gxfe1.jpeg?auto=webp&amp;s=66df80ff5d13ab733af112efe62903c8c8fd3a65"
        },
        "permalink": "/r/torino/comments/1icsqh3/calzolaio_per_riparare_dr_martens/"
    },
    {
        "id": "1id5u7v",
        "author": "Mistybluecat",
        "title": "Gift basket",
        "content": "Hi Turin locals.\nMy friend has just had a baby and I would love to send her a gift basket.  She lives in Torino. Does anyone have any suggestions of local places where I can purchase this from online? \nTIA ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1id5u7v/gift_basket/"
    },
    {
        "id": "1id3ll4",
        "author": "tnndaboss1",
        "title": "What's a popular bar/club that is open on a wednesday night?",
        "content": "I'm about to head out to maybe bar hop. Any good recommendations? I'd prefer younger bars, as I am in my early 20's",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1id3ll4/whats_a_popular_barclub_that_is_open_on_a/"
    },
    {
        "id": "1ict9wg",
        "author": "Lindanineteen84",
        "title": "cassette della posta per imbucare lettere e cartoline",
        "content": "Ho comprato una cartolina da spedire a dei miei amici in Inghilterra, cosa che non facevo veramente da anni, infatti mi sono accorta solo così che tutte le cassette della posta della mia zona, quelle rosse, sono sparite. Quindi ora mi chiedo, come la spedisco la cartolina? Devo per forza andare all'ufficio postale, o ne sono rimaste ancora in giro per Torino? Se ci sono, qualcuno sa indicarmi dove?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ict9wg/cassette_della_posta_per_imbucare_lettere_e/"
    },
    {
        "id": "1icwo48",
        "author": "_lostinthisworld_",
        "title": "Bollette elettriche",
        "content": "Ciao a tutti, ho una domanda riguardo l'elettricità in Italia. La bolletta del mese scorso è stata quasi 180 euro, e tra l'altro sono stato fuori casa per 10 giorni per motivi di viaggio. È normale per un appartamento di circa 25 metri quadrati?\n\n",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1icwo48/bollette_elettriche/"
    },
    {
        "id": "1icvw9y",
        "author": "Stock-Ad-4995",
        "title": "Sostituzione porta e allarme causa furto",
        "content": "Ciao a tutti, mi servirebbe se possibile un consiglio su chi chiamare per fare urgente sostituzione della porta di casa, ho avuto un furto in casa e la serratura è stata completamente sfondata, quindi immagino serva sostituire tutta la porta. \n\nConoscete qualcuno di affidabile e rapido? In questo momento ho la porta praticamente aperta. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1icvw9y/sostituzione_porta_e_allarme_causa_furto/"
    },
    {
        "id": "1icq6rp",
        "author": "LearnSodas",
        "title": "Scambi carte pokemon zona Santa Rita",
        "content": "Ciao a tutti! Ho iniziato a collezionare carte pokemon da pochissimo e già mi ritrovo con un po’ di doppioni. Volevo sapere se ci fosse un luogo in zona Santa Rita dove ci si incontra con altri collezionisti per poter scambiare carte e rendere più semplice completare i set\n\nNe conoscete?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1icq6rp/scambi_carte_pokemon_zona_santa_rita/"
    },
    {
        "id": "1icnzmm",
        "author": "bora907",
        "title": "Rowing in Torino",
        "content": "Hi! I will be in Torino for about 6 months. I know people do rowing in river Po, is there any rower here? I wonder how to join a club or do rowing in Torino.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1icnzmm/rowing_in_torino/"
    },
    {
        "id": "1icx3xi",
        "author": "Formal_Leadership_69",
        "title": "Consiglio di",
        "content": "Sono stato insieme 2anni  a una donna più grande di me di 16 anni e a letto non mi faceva impazzire ci vedevamo anche poco solo nei week, però ora che ci siamo lasciati ho ancora un po' di malessere generale. Potrebbe essere solo l abitudine o c'è dell altro? Cosa ne pensate? Ora io da che ci sentivamo molto giornalmente, ho iniziato a evitare di chiamarla e a volte è lei che mi cerca con la consapevolezza che nn va bene perché continuiamo a farci del male. La rottura è stata proprio per la questione della età perché lei è sempre stata molto bloccata (così dice) quindi nn si è mai lasciata andare più di tanto. Cmq io 47 anni e lei 63 portati ovviamente benissimo. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1icx3xi/consiglio_di/"
    },
    {
        "id": "1icbuzx",
        "author": "matbordaRnB",
        "title": "Revisione caldaia",
        "content": "Ciao\n\nMi consigliereste qualche revisore di caldaie di fiducia?\n\nGrazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1icbuzx/revisione_caldaia/"
    },
    {
        "id": "1ibqwvq",
        "author": "UccioDago",
        "title": "Carrefour corso Turati 75 Torino",
        "content": "Che si sappia: \n\nNel parcheggio del #Carrefour di corso Filippo Turati 75\nc'è un controllo all'ingresso mediante telecamere.\nSe superi le due ore di sosta arriva a casa un multone di 40€\n25€ di multa e 15€ per la gestione della stessa. La multa la emette una ditta tedesca con sede a Bolzano Parkdepot, la stessa che gestisce l'impianto di fotocamere. \n\nIo ne ho ricevute due oggi via posta. Non sono in grado di stabilire se sia lecito che un'azienda possa emettere multe.\n\nPer ora voglio ringraziare sentitamente  il Carrefour ",
        "upvotes": 27,
        "comments": 45,
        "media": null,
        "permalink": "/r/torino/comments/1ibqwvq/carrefour_corso_turati_75_torino/"
    },
    {
        "id": "1ic9j42",
        "author": "zero_redditer",
        "title": "Dubbio blocco smog",
        "content": "Ciao a tutti!\nCopio e incollo un post che ho fatto su /ItalyMotori per provare ad avere qualche info più precisa.\n\nDubbio blocchi smog\n\nCiao a tutti,\n\ntorno da voi dopo il mio post precedente per valutare un'altra auto: A1 SPB 1.6 TDI 105 CV Ambition (77 kw), 200000 km, Diesel Euro 5b.\n\nI km mi preoccupano fino ad un certo punto, la macchina sarebbe venduta da concessionario di fiducia che l'ha valutata perfetta, revisioni sempre effettuate. Inoltre, io farei veramente pochissimi chilometri all'anno.\n\nIl mio unico dubbio è legato ai blocchi smog: io vivo a Torino, dove gli Euro 5 vengono bloccati già al livello arancione (superamento del valore di 50 µg/m³ per 3 giorni consecutivi), ma non riesco a capire quanto potrebbe essere impattante. Frugando su Google news mi pare che nel 2024 sia stato attivato una sola volta per 3 giorni e comunque i livelli di inquinamento sono in diminuzione già da qualche anno.\n\nSecondo voi quanto me la andrei a cercare acquistandola? Ovviamente feedback in generale sull'auto sono apprezzatissimi, grazie mille!",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1ic9j42/dubbio_blocco_smog/"
    },
    {
        "id": "1ib3hq4",
        "author": "nullstuff",
        "title": "Ormea's loophole",
        "content": "",
        "upvotes": 575,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w1bnwdjzxhfe1.jpeg?auto=webp&amp;s=3f44d7005fd50397c4d8633d1354fedfec2f5dad"
        },
        "permalink": "/r/torino/comments/1ib3hq4/ormeas_loophole/"
    },
    {
        "id": "1ic2d5n",
        "author": "Pul_in",
        "title": "Sotterraneo piazza Vittorio",
        "content": "Ma il parcheggio sotterraneo di piazza Vittorio è aperto 24/7 per tutti o ci sono ancora lavori in corso?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ic2d5n/sotterraneo_piazza_vittorio/"
    },
    {
        "id": "1ic53cn",
        "author": "hellnom55",
        "title": "Weekend torinese",
        "content": "Ciao,\n\nIo e la mia ragazza (26M, 25F) abbiamo intenzione di trascorrere un weekend a Torino. Potete darci più consigli possibili su posti da vedere, locali in cui mangiare e cose da fare?\n\nGrazie mille!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ic53cn/weekend_torinese/"
    },
    {
        "id": "1ic7wj3",
        "author": "Ale17kk_",
        "title": "Trasferimento a Torino/Piemonte",
        "content": "Ciao a tutti, premetto che feci già un altro post simile qua riguardo a un possibile trasferimento a Torino o Piemonte in generale per lavoro. \n\nSono un sardo di 24 anni, esperienza di 4 anni come informatico/help-desk per un’azienda della Grande distribuzione organizzata. \nAttualmente disoccupato cerco una esperienza fuori Sardegna, sia come esperienza lavorativa che di crescita personale, ma noto qualche difficoltà nel farmi notare negli annunci o dalle aziende in generale. Sicuramente la distanza non aiuta. \n\nQualcuno ha fatto un percorso simile a quello che vorrei affrontare e può darmi qualche consiglio? Avrei anche la possibilità di trasferirmi con il mio mezzo proprio.\n\nGrazie a chi mi darà feedback :)",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1ic7wj3/trasferimento_a_torinopiemonte/"
    },
    {
        "id": "1ibjj7x",
        "author": "Kollop_",
        "title": "La guida degli autisti dei bus. Specialmente il 68",
        "content": "Ragazzi ma solo a me sembra che ultimamente gli autisti guidano come in una gara di formula 1? Frenate brusche, sterzate incontrollate e fermate saltate all'ultimo.\nSarà un problema dei nuovi bus? Quando ero ragazzino non ricordo che dovevo reggermi come se stessi su un idrovolante.",
        "upvotes": 25,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1ibjj7x/la_guida_degli_autisti_dei_bus_specialmente_il_68/"
    },
    {
        "id": "1iby5go",
        "author": "duckinlove",
        "title": "Zona ex-Gondrand",
        "content": "C'è qualcuno che vive vicino alla ex fabbrica?\nCome vi trovate? I tossici si fanno i fatti loro in fabbrica o rompono le scatole anche x strada?\nI miei vogliono acquistare casa, e hanno trovato questo appartamento niente male e a basso prezzo, scoprendo che costava poco perché appunto sta la gondrand vicino. \nTenete conto che i miei abitano in c.so Giulio di fronte al ponte mosca, con tossici e alcolizzati che fanno rissa quasi tutte le sere.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1iby5go/zona_exgondrand/"
    },
    {
        "id": "1ibx7b2",
        "author": "strawberryfairy97",
        "title": "Corso onicotecnica",
        "content": "Ciao amici torinesi, da un po' di tempo ho sviluppato una passione per le unghie che vorrei coltivare proprio facendo io stessa ricostruzioni ecc. Ma giustamente per avere delle basi concrete dovrei fare un corso, qualcuno di voi per caso ha fatto o conosce qualcuno che ha fatto un corso valido con prezzi non esagerati per diventare onicotecnica?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ibx7b2/corso_onicotecnica/"
    },
    {
        "id": "1ic6npk",
        "author": "zlatan9958",
        "title": "Cerco un amico nero a Torino",
        "content": "Ciao a tutti.\n\nHo sempre pensato di voler avere degli amici neri, non vuole essere minimamente una cosa razzista. Ma un opportunità per conoscersi. Magari giocare a basket o a calcio.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ic6npk/cerco_un_amico_nero_a_torino/"
    },
    {
        "id": "1ibtm5e",
        "author": "Illustrious-Clerk584",
        "title": "Butcher recommendation",
        "content": "Do anyone know english speaking butcher around corso peschiara or can give recommendation",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ibtm5e/butcher_recommendation/"
    }
]