[
    {
        "id": "1iar138",
        "author": "BunyipPouch",
        "title": "Upcoming /r/movies AMAs/Q&amp;As",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dhbezfcyoefe1.png?auto=webp&amp;s=7138e0803d55462d46163373a454ecb3c9530095"
        },
        "permalink": "/r/movies/comments/1iar138/upcoming_rmovies_amasqas/"
    },
    {
        "id": "1i8mkoh",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Presence / Flight Risk / Nickel Boys / The Room Next Door)",
        "content": "# New Theatrical Releases\n\n[Presence](https://old.reddit.com/r/movies/comments/1i8m8gp/official_discussion_presence_spoilers/?)\n\n[Flight Risk](https://old.reddit.com/r/movies/comments/1i8m8i2/official_discussion_flight_risk_spoilers/?)\n\n[Nickel Boys](https://old.reddit.com/r/movies/comments/1i8m8iz/official_discussion_nickel_boys_spoilers/?)\n\n[The Room Next Door](https://old.reddit.com/r/movies/comments/1i8m8ka/official_discussion_the_room_next_door_spoilers/?)\n\n\n# Still in Theaters\n\n[Wolf Man](https://old.reddit.com/r/movies/comments/1i36wh1/official_discussion_wolf_man_spoilers/?)\n\n[One of Them Days](https://old.reddit.com/r/movies/comments/1i36wmw/official_discussion_one_of_them_days_spoilers/?)\n\n[The Last Showgirl](https://old.reddit.com/r/movies/comments/1i36wob/official_discussion_the_last_showgirl_spoilers/?)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n# Oscar Rewind\n\n[Anora](https://old.reddit.com/r/movies/comments/1ggv4yg/official_discussion_anora_spoilers/)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n[Conclave](https://old.reddit.com/r/movies/comments/1gbjlm7/official_discussion_conclave_spoilers/)\n\n[Dune: Part Two](https://old.reddit.com/r/movies/comments/1b3jo9s/official_discussion_dune_part_two_spoilers/)\n\n[Emilia Perez](https://old.reddit.com/r/movies/comments/1grn0lz/official_discussion_emilia_p%C3%A9rez_spoilers/)\n\n[Nickel Boys](https://old.reddit.com/r/movies/comments/1i8m8iz/official_discussion_nickel_boys_spoilers/?)\n\n[The Substance](https://old.reddit.com/r/movies/comments/1fl1bpl/official_discussion_the_substance_spoilers/)\n\n[Wicked](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)",
        "upvotes": 27,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1i8mkoh/official_discussion_megathread_presence_flight/"
    },
    {
        "id": "1ib57qo",
        "author": "MarvelsGrantMan136",
        "title": "Christopher Nolan Set to Shoot Part of ‘The Odyssey’ on Sicilian ‘Goat Island,’ Where Ulysses Landed",
        "content": "",
        "upvotes": 2315,
        "comments": 219,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6yIGKJ-AKj044oP_xPv1DesUgQi2jWleo1PYT-zfH3w.jpg?auto=webp&amp;s=b1a51e9444e73fcd01faf92fe39bed169f3693ec"
        },
        "permalink": "/r/movies/comments/1ib57qo/christopher_nolan_set_to_shoot_part_of_the/"
    },
    {
        "id": "1iarpio",
        "author": "Ovid738",
        "title": "Rewatched Forrest Gump. Totally forgot how dark it is.",
        "content": "Great movie, but I hadn’t seen it since I was a kid myself. On rewatch it’s crazy just how many things fly under the radar when you’re young. From Jenny’s abuse, to all the characters suffering so badly that if you put yourself in your shoes for a moment, you wonder how they haven’t gone crazy.\n\nBiggest shock factor for me was the scene at the start where Mrs Gump is essentially coerced into sex with the principal to get her son into school. As a child I had no idea - for some reason I thought the principal was just having an asthma attack in the house, which explained the weird noises he made. \n\nAnyway, any other films you rewatched and were surprised at as an older person? ",
        "upvotes": 5847,
        "comments": 1080,
        "media": null,
        "permalink": "/r/movies/comments/1iarpio/rewatched_forrest_gump_totally_forgot_how_dark_it/"
    },
    {
        "id": "1iameli",
        "author": "Pyro-Bird",
        "title": "Steven Spielberg Says He Fought to Stop E.T. Sequel From Being Made",
        "content": "",
        "upvotes": 12501,
        "comments": 640,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JN4QcwpqybYvCZ-Xc2CrjgKiGQydv24CGgdslFoH4iY.jpg?auto=webp&amp;s=1263c53a6fc9ab3b517d85c1bc855cad2cbaba54"
        },
        "permalink": "/r/movies/comments/1iameli/steven_spielberg_says_he_fought_to_stop_et_sequel/"
    },
    {
        "id": "1iawzi5",
        "author": "KnewMedalPhan",
        "title": "What Movie Sex Scenes Are Etched Into Your Mind Permanently?",
        "content": "For me, it will always be Mulholland Drive, RIP to David Lynch. I will NEVER forget being like 12 and just flipping through channels with my mom. Stumbled upon that film RIGHT before the first lesbian scene. I was absolutely mesmerized but was also trying to fumble for the remote to turn the movie off. My mom (who ALWAYS jokingly gave me a hard time about that kind of thing, this also happened with movies like Bound and Love &amp; Other Drugs) quipped, as I frantically shut the TV off that I had to have been enjoying it... she wasn't wrong. I'm still so captivated by that whole scene and having the movie's full context later. It's so beautiful.\n\n\n\nEdit: Didn't expect this much engagement! I love seeing everyone's answers. Seems like someone needs to make a compilation of a lot of the top answers...",
        "upvotes": 2378,
        "comments": 3006,
        "media": null,
        "permalink": "/r/movies/comments/1iawzi5/what_movie_sex_scenes_are_etched_into_your_mind/"
    },
    {
        "id": "1ib6wfr",
        "author": "Most-Injury-9879",
        "title": "What is a movie that you wish you hadn't watched",
        "content": "Mine is Into The Wild (2007).\n\nI was about the same age as the main character, Chris McCandless, when I watched the movie for the first time. Although there weren’t many similarities between his life and mine, it had a profound impact on my thought process moving forward in life.\n\nI started looking at college, career, and friendships as options, and I didn’t really give them the importance they deserved. I did it all, but not wholeheartedly—not with purpose, the way other people did.\n\nJust like Chris, I started finding ways to be alone in any situation. No matter what the situation was, it was only being alone that brought me peace—whether it was being alone in my room, getting on a random bus and traveling without any purpose, writing a journal while sitting in the garden, or going to the roof to look at the stars. It was almost as if, whenever I was around people, I felt lonelier.\n\nJust like Chris realized in the end that “happiness is real only when shared,” I’ve realized in the last two years that friendships, love, and family are extremely important for a good life.\n\nYou cannot live an isolated life if you want to be successful—unless you’re a genius who is so good at what he does and so busy working that nothing else really bothers him. People skills are really important if you want to advance in your career. You need to be a good communicator to have a healthy relationship. You need to have connections with the right people when things get tough. Life has taught me these lessons the hard way.\n\nMy reluctance (unknowingly) to get along with people has resulted in many friendships ending or going stale. My fear of losing people and the belief that someone would take away my personal space kept me away from relationships. My preconceived notions of having zero expectations from others and thinking people are inherently bad stopped me from developing meaningful connections.\n\nI really wish I hadn’t watched that movie at that age. I was just starting to open up to people. I was at a stage in my life where I was still figuring out how life works, and I couldn’t get that movie out of my head for years.\n\nI’m doing well now. I hang out with people. I spend time with my family whenever I can. I’m still learning to make new friends and develop connections, but I’ll get better.\n\nWhat is a movie you wish you hadn’t watched, and why?\n\n\n\n\n",
        "upvotes": 261,
        "comments": 573,
        "media": null,
        "permalink": "/r/movies/comments/1ib6wfr/what_is_a_movie_that_you_wish_you_hadnt_watched/"
    },
    {
        "id": "1ib8i2h",
        "author": "West_Conclusion_1239",
        "title": "Lost Highway is David Lynch's most terrifying and evil film.",
        "content": "In honor of David Lynch's death, i revisited Lost Highway, and my God, this is arguably his most terrifying and most evil film.\n\nIt's probably my favorite film of his, and the insane thing is that i don't get it in the least but it made feel something, even if it's negative emotions, despair, paranoia, etc..\n\nI wonder what he wanted to say with this one, that paranoia can degenerate to senseless violence, and that it can literally cause you a psychic meltdown so intense that you morph into another person??\n\nLoool, i know i'm grasping for some meaning.\n\nAnd the Mystery Man??\n\nI still can't tell you what he represents, the meaning of his dialogues, or if he's actually the antagonist, he seems just a neutral ominous presence you would see in your dreams.\n\nPeople go for Mulholland Drive or Blue Velvet, but overall i love this film because i think it's David Lynch's most true depiction of a nightmare.\n\n",
        "upvotes": 146,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1ib8i2h/lost_highway_is_david_lynchs_most_terrifying_and/"
    },
    {
        "id": "1iat7ma",
        "author": "Throwaway921845",
        "title": "Hollywood Work Was Already Drying Up. Then the Fires Hit.",
        "content": "",
        "upvotes": 1255,
        "comments": 173,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dPyXciC4RAnd6J91aLDfab3scDdB2_f0yKKiKmbmQSQ.jpg?auto=webp&amp;s=8f02da8c5ed8214d281194062d19e19ba7ccd2e5"
        },
        "permalink": "/r/movies/comments/1iat7ma/hollywood_work_was_already_drying_up_then_the/"
    },
    {
        "id": "1ibd27b",
        "author": "NoCulture3505",
        "title": "'Parasite' Re-Releasing in IMAX on February 7th (5th Anniversary)",
        "content": "",
        "upvotes": 48,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/G7z_I9QKuFehrgoJL2sONJbRKRND8zE37jn38U-9IAc.jpg?auto=webp&amp;s=3fffdef09f949184430ce4639b68502239adf77e"
        },
        "permalink": "/r/movies/comments/1ibd27b/parasite_rereleasing_in_imax_on_february_7th_5th/"
    },
    {
        "id": "1ib88kv",
        "author": "Sisiwakanamaru",
        "title": "Bowen Yang, Lily Gladstone, Kelly Marie Tran Dramedy 'The Wedding Banquet' to Open London's LGBTQIA+ Film Fest",
        "content": "",
        "upvotes": 83,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L5EBt7xNoqCwgoBehju3hT7dvhIJjMDoPAWHHUZRT0w.jpg?auto=webp&amp;s=03ec40323131b5de6a4de86ae55d598f08551c86"
        },
        "permalink": "/r/movies/comments/1ib88kv/bowen_yang_lily_gladstone_kelly_marie_tran/"
    },
    {
        "id": "1ibbw6v",
        "author": "deckchair1982",
        "title": "Actors You Really Admire But Wish They Had Gone in a Different Direction",
        "content": "Harrison Ford was one of my favorite actors growing up yet I can't help feeling that was some lost opportunity in his career.\n\nHe made two amazing dramas with Peter Weir back to back (Witness, The Mosquito Coast) yet they never worked together again. A Weir-Ford collaboration akin to Scorsese-De Niro would have been something. I don't know the behind the scenes of it all and maybe Weir and Ford tried to make other projects but they fell through.\n\nFord was also heavily recruited for the Michael Douglas role in Steven Soderbergh's Traffic. I just don't get turning down Soderbergh, you know? And Soderbergh likes to collaborate with his actors he has worked with before. A Soderbergh-Ford pairing over multiple movies would have been something to see.\n\nI just think Ford lessened his dramatic ambitions and retreated to mediocre thrillers and callbacks to earlier roles that sometimes worked (Blade Runner 2049) and sometimes didn't (Indiana Jones and the Dial of Destiny.)",
        "upvotes": 34,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1ibbw6v/actors_you_really_admire_but_wish_they_had_gone/"
    },
    {
        "id": "1iaaskr",
        "author": "Kingkill66",
        "title": "Seriously, what better sequel is there than Terminator 2?",
        "content": "From the beginning of the movie, to the end, every scene is just perfect. Not to mention that this movie changed the whole dynamics of what Hollywood CGI could do, (Jurassic Park also did a lot) and won 4 Oscars for it. I’m just asking…. Am I wrong to think that this is the best sequel to ever been made? Aliens…maybe… Empire Strikes Back? But…. Seriously…. Can Terminator 2 be the best?\nAhh shit… I forgot about Paddington 2. 😂 \n",
        "upvotes": 5669,
        "comments": 3345,
        "media": null,
        "permalink": "/r/movies/comments/1iaaskr/seriously_what_better_sequel_is_there_than/"
    },
    {
        "id": "1ib7r5t",
        "author": "mrjohnnymac18",
        "title": "‘Uncomfortable truths’: controversial film challenges authorship of famous Vietnam photo | Sundance 2025",
        "content": "",
        "upvotes": 40,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ld2NcfjrrM863AJwC5SFkOyR6HBNWRoA-fM3UYk92AE.jpg?auto=webp&amp;s=83b08727964a3c86647a959a5a116553d8e0a301"
        },
        "permalink": "/r/movies/comments/1ib7r5t/uncomfortable_truths_controversial_film/"
    },
    {
        "id": "1iam9ii",
        "author": "1991mgs",
        "title": "Nosferatu (2024) compared side-by-side, shot-for-shot with the 1922 and 1979 films",
        "content": "",
        "upvotes": 947,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VCjz8TXDokwfF5DNdtRlhl9_CWEFsAUAUSHo4d5fghk.jpg?auto=webp&amp;s=1e35f74d0101f7e272fec003e056152912d41865"
        },
        "permalink": "/r/movies/comments/1iam9ii/nosferatu_2024_compared_sidebyside_shotforshot/"
    },
    {
        "id": "1iayraq",
        "author": "shortbusporkchop",
        "title": "Which Michael Crichton novel that isn't already a movie would you most like to see get made into one?",
        "content": "Jurassic Park, Sphere, Congo, Andromeda Strain, Disclosure, Rising Sun, and The Great Train Robbery are all excellent films. In a Hollywood that has run out of ideas, where could they go back to the well?\n\nI think I have to go with Prey. That is one of the most edge-of-your-seat suspense thrillers I have ever read. It would be beyond awesome if somebody got Villeneuve to direct it.\n\nBut Crichton was the master of writing the line where science stops and fiction begins. Next, Micro, State of Fear - in the hands of the right screenwriter &amp; director, any of those would be a badass film. Hell, even Pirate Latitudes would be a killer popcorn flick.\n\nPretty sure I read a studio has already optioned Eruption. Fingers crossed we don't get another Timeline.",
        "upvotes": 140,
        "comments": 139,
        "media": null,
        "permalink": "/r/movies/comments/1iayraq/which_michael_crichton_novel_that_isnt_already_a/"
    },
    {
        "id": "1iags3h",
        "author": "Expensive-Stuff3781",
        "title": "The Princess Bride is back in theaters for a limited time!",
        "content": "It’s showing at select theaters nationwide today and Wednesday!",
        "upvotes": 1377,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Cf1N50W5xLQHnpksiRksrgt5rbpZvvVriYsHpGZuXSA.jpg?auto=webp&amp;s=f03b8eb1e148634c4ae46b3bb3d5ceb5178fc489"
        },
        "permalink": "/r/movies/comments/1iags3h/the_princess_bride_is_back_in_theaters_for_a/"
    },
    {
        "id": "1iaxsuy",
        "author": "Waste_Opportunity408",
        "title": "The Equalizer trilogy with Denzel Washington is phenomenal",
        "content": "Denzel really owned this role, and made every film so enjoyable to watch, but these films absolutely delivered on the simple premise of a badass, retired ex D.I.A Vigilante delivering justice to the bad guys and being the guardian angel of death to the hopeless that need him. Im gonna do my best to avoid spoilers.\n\n  \nEqualizer 1- My personal favorite out of the trilogy. The mystique of robert Mcall was at it's highest due to how little we knew about him, and we see the duality of his character by how he could be such a wise, supportive, kind hearted person that pushes others around him to be the best they can be, but also an absolute, cold, calculating, menacing killer to the ones that deserve it. Great acting, despicable villians, feel good vigilante justice, and a good ending.\n\n  \nEqualizer 2- The theme of this is revenge, and this is really personal for Robert Mcall. Good classic vigilante justice, with also Robert being a great father figure to a young man that needed guidance. When that very tragic thing happens to robert, you want the bad guys to get the worst that could come to them, and boy oh boy does Robert do what robert does best. Honestly probably even more satisfying than the first on the justice side of things, but i prefer the overall story of the first.\n\n  \nEqualizer 3- I have mixed feelings on this one. It has the least action, and slowest pace out of the 3, but DAMN this has got to be my favorite portrayal of robert mcall out of all 3. Robert in equalizer 3 is basically a brutal, horror movie slasher with good morals that is genuinely terrifying and at his most violent by far. Even gave me Michael myers vibes in some scenes with ominous soundtrack.  However the italian mob in this is so evil, i enjoyed every scene when Robert gave them what was coming to them. It has a beautiful setting, awesome soundtrack, despite the lack of action when the action does happen it's a A+ and a satisfying conclusion to the trilogy.\n\n  \nOverall the equalizer series is my second favorite action series of all time (only behind the john wick series) and i really enjoyed my time with them, and consider them classic action films.\n\n  \nDenzel already revealed he is working on a equalizer 4 and 5, and although i feel Equalizer 3 ended the series perfectly, as long as Robert is portrayed the way he is in equalizer 3, i am looking forward to them.\n\n  \nWhat are your thoughts on the equalizer series?",
        "upvotes": 145,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1iaxsuy/the_equalizer_trilogy_with_denzel_washington_is/"
    },
    {
        "id": "1ibb9oy",
        "author": "BlaisePetal",
        "title": "Bad films you love: share lists",
        "content": "Please share your favorite bad films and tell us why. By bad film, I would define it as poorly received by critics and filmgoers and/or box office bombs. Basically, the opposite of greatest films ever made. But you enjoyed it and relish rewatching it.\n\nHere are mine:\n\n\n1. DOA: Dead or Alive (2006)\n\nOn its release it was dragged by 'serious' cinema people as schlock, the gamer fans disparaged Devon Aoki as not looking like Kasumi at all and yet the wire work and fight choreography was a lot of fun to watch, personally. Holly Valance brought charisma to her role as Christie, and Jaime Pressly was charming in an all-american way. The pre-covid aughts era involved a lot of mindless fun, and it is sorely missed today.\n\n2. Blood: The Last Vampire (2009)\n\nCriticised for not having the finesse of the anime, but still a serviceable action flick if rather silly.\n\n3. American Satan (2017)\n\nAndy Black and his rock troupe get supernatural assistance and the film needs refinement. But the costumes are stylish and the amateurish production adds to its appeal.\n\n4. Confessions of a Shopaholic (2009)\n\nSaccharine in all the right ways - mocked by critics on release for being a fluffy chick flick, but delves into materialist obsession. Isla is suitably comedic.\n\n5. The Wrong Missy (2020)\n\nDavid Spade plays a likeable dork who needs to shake an annoying weird girl and it's indeed formulaic, but it's appropriate as a romcom.\n\n6. Saltburn (2023)\n\nMany said it had nothing to say about class in the very end, but the dancepop song at the end uplifts like cinematic molly.\n\n7. Bangkok Dangerous (2008)\n\nNic cage tears it up in Thailand. Seedy, atmospheric and probably a deep cut in his filmography. All you really need is a guy and a gun.",
        "upvotes": 11,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1ibb9oy/bad_films_you_love_share_lists/"
    },
    {
        "id": "1ib7apt",
        "author": "Mysterious_Coach1591",
        "title": "What is your favorite villainous song from an animated movie?",
        "content": "From any animated movie. \n\nI think mine is Frollos Hellfire. I think because he's so real and there are people like him amongst us which is terrifying. Real evil shit.\n\nI hadn't seen Hunchback of Notre Dame in a really long time but remembered the song and decided to watch. Scary especially these days. ",
        "upvotes": 18,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1ib7apt/what_is_your_favorite_villainous_song_from_an/"
    },
    {
        "id": "1iasvp7",
        "author": "GeekyNiceGuy1985",
        "title": "John Carter",
        "content": "Just sat down and watched John Carter. Unfortunately, when it first came out, I listened to the opinions of critics instead of seeing it and forming my own opinions. If I remember correctly, it came out on the same date as another big movie and Disney lost money on it because of poor planning.\nI thought it was a solid stand-alone sci-fi movie, although I haven't read any of the source material by Edgar Rice Burroughs.\n\nJust my two cents.",
        "upvotes": 210,
        "comments": 132,
        "media": null,
        "permalink": "/r/movies/comments/1iasvp7/john_carter/"
    },
    {
        "id": "1ibce3k",
        "author": "Frank_and_Beanz",
        "title": "What's your favourite 'falling to earth' scene?",
        "content": "Inspired by the incredibly affecting scene in 2024's The Wild Robot, where Roz falls to earth with Brightbill in her arms. \"I have everything I need.\"\n\nIt got me thinking, and I have this love for these types of scenes for some reason, mostly the emotionality and peril involved and the cinematic awe it creates.\n\nI was reminded in that scene by another couple scenes, the most obvious being The Iron Giant, even though he is leaving earth in his moment. 'SUPERMAN' Still goes so hard emotionally for the character.\n\nAnd then lastly before I open it up to other choices, is the scene towards the end of Wreck It Ralph, where the title character is falling out of the sky and has his epiphany that he was born to play his part, and he owns it in that moment. \"I'm bad, and that's good. I will never be good, and thats not bad. There's nobody I would rather be, than me\"\n\nAll of these scenes have huge stakes and emotional weight and I'm sure there are others out there! Apparently I'm a sucker for main characters falling to their deaths and saying something powerful lol.",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1ibce3k/whats_your_favourite_falling_to_earth_scene/"
    },
    {
        "id": "1iaoy1a",
        "author": "G00bre",
        "title": "I wish Nolan would make another movie with Hugh Jackman.",
        "content": "Nolan's \"Oppenheimer\" and upcoming Odyssey movies are stuffed to the brim with every celebrity you can shake a stick at, but you know who's missing from those lists?\n\nHugh Jackman!\n\nJackman was the co-lead in \"The Prestige\" and he was great!\n\nBut while he ended up making two more movies with Christian Bale, Jackman hasn't gotten the same love.\n\nNolan obviously has a couple of actors he likes working with on multiple projects (Bale, Caine, Murphy, Hardy) and he often brings out the best in them, or at least some of the most interesting stuff.\n\nIt would be great to see what Nolan and Jackman could do together TWENTY DANG YEARS after their first and only collab.\n\nJackman is great as an actor in regular drama films, but also has lots of experience in genre movies. Same goes for Nolan as a director.\n\nSo what are you waiting for, Chris? Either announce Hugh's gonna play Poseidon, or that your next movie will give him a starring role!",
        "upvotes": 282,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1iaoy1a/i_wish_nolan_would_make_another_movie_with_hugh/"
    },
    {
        "id": "1ib4y0d",
        "author": "gilette_bayonete",
        "title": "Everytime I watch the ending credits to Kelly's Heroes tears run down my face",
        "content": "This movie has always had a special place in my heart. When I was a pup, my father and I used to rent movies on weekends (back when that was still a thing) and Kelly's Heroes was always a mainstay. My father and I both loved World War 2 and used to build dioramas that were historically accurate.\n\nAnyway, everytime the credits to KH roll up and they show the cast of characters with that incredible soundtrack I honestly just can't help but cry. The final scene is the final survivors as they drive off in the Army truck into the sunset. I always felt that the sunlight was a metaphor for all of the soldiers who died in the movie, the sunlight represents them being at peace as the movie comes to a closure.\n\nI also loved how they credited every character with a photo at the end along with the name of the actor. I always felt sad seeing the Americans that died in the movie seeing their faces one last time, again, to that beautiful music and outro song.\n\nI actually am starting to tear up right now posting this so I suppose I'll leave it at that. Thanks so much for reading.\n\nRIP dad, I would give anything to watch these movies with you again as an adult. ",
        "upvotes": 25,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1ib4y0d/everytime_i_watch_the_ending_credits_to_kellys/"
    },
    {
        "id": "1iar0c9",
        "author": "mildOrWILD65",
        "title": "Prey",
        "content": "I quite liked \"Prey\", in the Predator franchise. The female lead was strong. The Predator's behavior was consistent with the franchise. The scene with the bear was interesting (poor bear!)\n\nI won't speak to the veracity of the portrayal of Native American culture except that nothing seemed out of place and also seemed entirely respectful.\n\nAltogether, a very good movie, imo.",
        "upvotes": 195,
        "comments": 63,
        "media": null,
        "permalink": "/r/movies/comments/1iar0c9/prey/"
    },
    {
        "id": "1iban8s",
        "author": "ringjingle",
        "title": "Looking for popular movies with solid Turkish or Uzbek characters.",
        "content": "[I should clarify that I don't watch movies very often, am not a native English speaker and am not very knowledgeable on pop culture, so if you think any part of my wording in this post needs fixing, feel free to correct me.]\n\n[If this kind of post doesn't fit here, I'd be okay with deleting this post.]\n\nI'm looking for movies with well-written, or at least memorable characters that are from Türkiye (Turkey) or Uzbekistan. My main preferance is movies from the 80s or 90s, but movies or shows released before or after that are also acceptable.\n\nAnother preferance of mine is that this movie is from a series of films, a movie or show that has/had a relatively big impact on pop culture, but this is also optional.\n\nEx.: I watched From Russia With Love (1963) with one of my friends who likes agent films (I'm not sure if this is the correct term for those) &amp; I was surprised to see the Turkish character in this movie (Ali Kerim Bey) even if I think his actor wasn't Turkish. Even though I had not watched any of them except this one James Bond movies are very popular. Hopefully this example makes it more clear what I mean. \n",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1iban8s/looking_for_popular_movies_with_solid_turkish_or/"
    },
    {
        "id": "1ib9pf2",
        "author": "Powerful_Jury_2065",
        "title": "Train to Busan broke me",
        "content": "I’ve always heard good things about this film and I never knew anything about it until last year I learned it was zombies on a train and was like wow that’s such a good idea it sounds so fun! \n\nI love all genres like horror is probably one of my favourites so I’d been planning to watch this film for a long time and finally watched it yesterday and…\n\nI regret it\n\nNothing could have warned me how DEVASTATING it would be, I’ve never seen a movie in such a long time that’s just made me feel so sad all day even after 24 hours of watching it I still can’t get it out of my mind 😟 \n\nI enjoyed the movie but I am way too emotional to watch it again omg",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1ib9pf2/train_to_busan_broke_me/"
    },
    {
        "id": "1iarlw7",
        "author": "letsgopablo",
        "title": "Sing Sing is an anomaly",
        "content": "A prison drama that doesn't tread the same ground as the others in its genre. No scenes featuring gratuitous violence, homophobia or any of the other tropes. Instead it's about the healing and reforming power of art, and features one of the strongest depictions of male friendship and comraderie outside of a war movie. It subverts the typical toxic masculine energy of its genre and shows us real men who have been inside having the time of their lives playing dress up, communicating with emotional maturity, crying. As a young man growing up in the age of the redpill movement, i think movies like this are not only a breath of fresh air, but necessary. I found it incredibly moving and it currently stands as my movie of the year of 2024. Clarence Maclin was snubbed for a best supporting actor nom, but I would love if he won for Best Adapted Screenplay. A masterpiece in my opinion, and fully deserves every win it gets.",
        "upvotes": 126,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1iarlw7/sing_sing_is_an_anomaly/"
    },
    {
        "id": "1iayd6k",
        "author": "Training-Republic301",
        "title": "1984 - Real Coffee Scene",
        "content": "",
        "upvotes": 46,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GbmlnRiWson5orKAEyjKCVL-JjKrM8WydmbOVy-klbw.jpg?auto=webp&amp;s=fdd49d18431d6b9c6f08b6888660d6360c1c552e"
        },
        "permalink": "/r/movies/comments/1iayd6k/1984_real_coffee_scene/"
    },
    {
        "id": "1ial4v7",
        "author": "BunyipPouch",
        "title": "Poster for Body-Horror 'Grafted' - A bright but socially awkward exchange student takes her craving for popularity to horrifying heights.",
        "content": "",
        "upvotes": 254,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hjoetmgemdfe1.jpeg?auto=webp&amp;s=25613bbf4b49d74f60599e29d1f5688bb988c00b"
        },
        "permalink": "/r/movies/comments/1ial4v7/poster_for_bodyhorror_grafted_a_bright_but/"
    },
    {
        "id": "1iba2ha",
        "author": "WhatTheOnEarth",
        "title": "Local Color (2006) a very small budget coming of age film with quite a bit of heart in it.",
        "content": "I just watched Local Color written and directed by George Gallo. The movie is about a young painter trying to learn from a cranky, old, wise master who believes painting has become irrelevant. It's semi-autobiographical based on George Gallo's life (who also painted everything in the movie) \n\nIt's a fairly generic story with that classic 90s flair of subdued optimism that's very pervasive in many coming of age movies of the time. But that's not necessarily a bad thing if you enjoyed that style.\n\nThe cast is pretty impressive for a movie shot on 3 million or so. Ron Perlman, Ray Liotta. But the star of the show has to be Armin Mueller-Stahl a german actor who came out of retirement to play Nikolai Seroff (the master painter). I really enjoyed his performance.\n\nIt's not a movie that'll blow you away. But it's overall well made and well told. The big reason I'm recommending it is because this movie (according to IMDB) only grossed $32,788 and I think it deserves a bit better. The movie was entirely self-funded by the director who wanted to avoid publishers adding unnecessary sex scenes. It’s (from what I understand) completely independent.\n\nFor anyone that's fond of simple stories and character based movies I can recommend it if you have a free day and not sure what to watch.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1iba2ha/local_color_2006_a_very_small_budget_coming_of/"
    },
    {
        "id": "1ibdmxm",
        "author": "Davis_Crawfish",
        "title": "\"Cat on a Hot Tin Roof\" (1958): Was Brick (Paul Newman) gay/bissexual?",
        "content": "It's never explicitely said what kind of hold Skipper had on Brick but it's enough to be a point of contention between Brick and Maggie (Elizabeth Taylor). \n\nMaggie  spends the entire movie, horny and moody, because Brick won't have sex with her, ever since Skipper died. \n\nBrick won't have sex with Maggie because he believes she cheated on him with Skipper but the ambiguous question is, is Brick jealous because he thinks Maggie was two-timing him with his \"best friend\" or is it the opposite way around? It's interesting how the movie touches on such a taboo subject without ever going all the way.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ibdmxm/cat_on_a_hot_tin_roof_1958_was_brick_paul_newman/"
    }
]