[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1p23qlv",
        "author": "rightedo",
        "title": "Esiste qualcuno che davvero lavora in full remote a Torino? Quali aziende lo permettono ancora?",
        "content": "Ciao,\n\nCome da titolo mi chiedo se ancora esistono aziende che permettano di lavorare totalmente da casa.\n\nIo sono il solito ingegnere laureato al Poli, lavoro in consulenza per una azienda X e purtroppo sono vincolato ad andare in presenza. Ammetto di coprire un ruolo che fatica a conciliarsi con posizioni full remote, ma sarei tranquillamente disposto ad accettare posizioni entry level. Semplicemente non ce la faccio più a fare il pendolare tutti i giorni per dover poi stare seduto in un open space senza avere nulla da fare la maggior parte del tempo. \n\nVorrei raccogliere una lista di aziende dove l'ambiente di lavoro è sensibile alla qualità della vita e sappia giudicare gli effettivi risultati (perchè secondo me redigere documenti è la stessa cosa se fatto in presenza o a casa, l'importante è che il lavoro sia fatto).\n\nMi chiedo inoltre se esistono luoghi (anche virtuali) dove è possibile creare network con persone che lavorano in questo modo. Perchè non sto ricevendo feedback dai moltissimi annunci a cui contiuno a candidarmi, e pensavo di farmi notare con candidature spontanee provando a raggiungere direttamente le aziende.\n\n ",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1p23qlv/esiste_qualcuno_che_davvero_lavora_in_full_remote/"
    },
    {
        "id": "1p1i0dm",
        "author": "maschera84",
        "title": "Meloni + Trump in via Lagrange",
        "content": "",
        "upvotes": 66,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5mli1ujfr92g1.jpeg?auto=webp&amp;s=6b03b3b13da2c1fbd18523539fa9cf158e1f88de"
        },
        "permalink": "/r/torino/comments/1p1i0dm/meloni_trump_in_via_lagrange/"
    },
    {
        "id": "1p20ef9",
        "author": "SimoSian93",
        "title": "Perchè unirsi a gruppi Meetup a caso?",
        "content": "Ho un quesito per tutti voi, che è anche un mezzo sfogo. Gestisco su Whatsapp un gruppo di \"meetup\" in cui ognuno puó organizzare uscite di qualunque tipo, quando vuole, ovunque a Torino o provincia. L'ho pubblicizzato qua e si sono unite almeno una ventina di persone, ma di queste almeno 16/17 poi non si son mai fatte vive e almeno una decina nemmeno presentate. Ecco, la domanda è: perché unirsi ad un gruppo di uscite per poi nemmeno presentarsi o PROVARE ad uscire? 😅 ",
        "upvotes": 4,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1p20ef9/perchè_unirsi_a_gruppi_meetup_a_caso/"
    },
    {
        "id": "1p23cw3",
        "author": "FutureVirtual6811",
        "title": "Piemonte BIP Transportation Card",
        "content": "Guys if I order a brand new card to my hotels address, would it arrive until monday do you think? (I’m currently outside of Torino)",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p23cw3/piemonte_bip_transportation_card/"
    },
    {
        "id": "1p1vahl",
        "author": "Clan57",
        "title": "Aperitivo @ My Place - Saturday 22, 18:00",
        "content": "Hello! \n\nI am fairly new to the city, and have been attending some expat meetings to try to form a social circle. I will invite those that I have met so far to my home on Saturday for aperitivo. If you would like to join, and bring friends, then leave comment or send me a DM. \n\n  \nThe address is close to Monte Grappa, but I will share it directly with those interested.\n\n  \nThank you!",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p1vahl/aperitivo_my_place_saturday_22_1800/"
    },
    {
        "id": "1p1zyiv",
        "author": "Lollodoro",
        "title": "Taglio capelli a poco",
        "content": "Ciao, per caso qualcuno conosce qualcuno che taglia i capelli a poco? Mi rivolgevo a una signora che lo faceva a casa sua e per un taglio chiedeva 10 euro, ma ora non c'è più.",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1p1zyiv/taglio_capelli_a_poco/"
    },
    {
        "id": "1p1bocl",
        "author": "Organic-Rabbit3172",
        "title": "Tatuaggio Lovecraft Torino",
        "content": "Ciao a tutti, sono relativamente nuovo a Torino e per il mio prossimo tatuaggio pensavo a uno Cthulhu o comunque una creatura lovecraftiana sulla spalla nello stile delle immagini allegate. Qualcuno conosce un tatuatore bravo nel bianco e nero e in questo stile e soggetti a Torino e dintorni? Grazie in anticipo!",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p1bocl/tatuaggio_lovecraft_torino/"
    },
    {
        "id": "1p1j7rd",
        "author": "Character-Dance7919",
        "title": "Negozi libri usati",
        "content": "Passerò con la famiglia alcuni giorni in vacanza a Torino, tra musei e altro. Sono un collezionista di vecchi libri, non necessariamente rari o costosi. Mi piacerebbe recarmi in qualche libreria che possa fare al caso mio. Per non sbagliare, il tempo è sempre tiranno, potete consigliarmene qualcuna? Mi piacciono quelle dall’aria démodé e alla vecchia maniera, con pile di libri, poca luce… ☺️😇\nGrazie a chi volesse aiutarmi. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p1j7rd/negozi_libri_usati/"
    },
    {
        "id": "1p0v8os",
        "author": "punhatgclig",
        "title": "cos questo",
        "content": "",
        "upvotes": 48,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/igNjh0IfEjb_DqD_5T_OpN2zuy_w2Pb10erucpZ47iw.png?auto=webp&amp;s=376067d49fa2cabf82668b04eb89cdea0f9bd18e"
        },
        "permalink": "/r/torino/comments/1p0v8os/cos_questo/"
    },
    {
        "id": "1p1l6vu",
        "author": "Nervous-Chair6",
        "title": "Circolazione moto euro 2 a Torino",
        "content": "Con un motociclo a 4 cilindri Euro 2 posso circolare a Torino fuori dalla ZTL?\nE cosa cambia invece per quanto riguarda l’accesso alla ZTL?\n\nNon sono molto bravo con l’italiano e le informazioni sul sito del Comune mi hanno confuso, anche la traduzione non mi ha aiutato.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1p1l6vu/circolazione_moto_euro_2_a_torino/"
    },
    {
        "id": "1p14ncw",
        "author": "No_Fox_5545",
        "title": "Appartamento Piazza Pitagora",
        "content": "Ciao a tutti!  \nSto valutando un affitto in corso Orbassano (ma subito su Piazza Pitagora) lato Santa Rita. Sarebbe un primo piano ed e' molto carino. L'unica cosa che mi preoccupa e' il traffico che ho notato quando sono andato a visitarla (e' praticamente a 20 metri da Piazza Pitagora).  \nNon ho macchina quindi il problema parcheggi introvabili non si pone nel mio caso.  \nVolevo sapere quanto fosse secondo voi rumorosa come zona (l'appartamento ha gli infissi nuovi e moderni, pero' non vorrei comunque stare sempre con tutto chiuso causa rumore). Quando sono andado a vederla di sera verso le 18:30 era totalmente piena di macchine. Volevo sapere se fosse sempre cosi', o se a parte le ore di picco (pre / post orario lavoro) il traffico fosse un filo piu' tranquillo e vivibile.\n\nGrazie in anticipo per le risposte!",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p14ncw/appartamento_piazza_pitagora/"
    },
    {
        "id": "1p1kc1m",
        "author": "Kernel_907",
        "title": "Se ci sei batti un colpo",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p1kc1m/se_ci_sei_batti_un_colpo/"
    },
    {
        "id": "1p1gwid",
        "author": "RegularPast4758",
        "title": "Spazio concessionaria Torino",
        "content": "Ciao a tutti,\n\nVorrei sapere il vostro pensiero su questo video... poi vi dirò la mia. Vi ringrazio anticipatamente.\n\nhttps://www.youtube.com/watch?v=5xf1BYGjqgI",
        "upvotes": 1,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PkZQHqKqReK7gq-D6sneYJtyU2dfdrF19zuGLsr69gw.jpeg?auto=webp&amp;s=ddd0455440afc989d5b69a75257b30be5211e401"
        },
        "permalink": "/r/torino/comments/1p1gwid/spazio_concessionaria_torino/"
    },
    {
        "id": "1p1dwnp",
        "author": "Top-Analysis-887",
        "title": "Anche quest'anno, durante il periodo natalizio, in centro (in tutte le sottozone A) il parcheggio si pagherà anche nei giorni festivi. Prepariamoci!",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e7kvkwaq092g1.png?auto=webp&amp;s=f1848b93b9f656bb87bb5cf516466f96f6807abb"
        },
        "permalink": "/r/torino/comments/1p1dwnp/anche_questanno_durante_il_periodo_natalizio_in/"
    },
    {
        "id": "1p0eu04",
        "author": "DistributinOfWealth",
        "title": "Torino e il problema eterno delle cacche di cane",
        "content": "Perché a Torino ci sono così tante cacche di cane per strada?\n\nCamminare in Borgo Vittoria è impossibile: ogni dieci passi trovi una merda.\n\nNon capisco come sia accettabile che un quartiere debba convivere con questo schifo ogni giorno. Possibile che la gente non riesca a raccogliere ciò che il proprio cane lascia?\n\nVorrei davvero capire: perché siamo messi così male su una cosa tanto semplice?",
        "upvotes": 74,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1p0eu04/torino_e_il_problema_eterno_delle_cacche_di_cane/"
    },
    {
        "id": "1p149uh",
        "author": "gammaquarky",
        "title": "Cerco insegnante di batteria!!",
        "content": "Se date lezioni/conoscete qualcuno di fidato e non troppo fuori (mi muovo con i mezzi) possiamo scambiarci Instagram!! ((Da calcolare che sono una povera studentessa))",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p149uh/cerco_insegnante_di_batteria/"
    },
    {
        "id": "1p16xhm",
        "author": "Future_Doughnut5981",
        "title": "Prova Orange Rosselli",
        "content": "Ciao, cerco qualcuno abbonato a Orange che può invitarmi a fare la prova settimanale. Grazie\n\nPs: in generale com’è la situazione? È sempre affollata? \n\nGrazie a chi mi risponderà ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p16xhm/prova_orange_rosselli/"
    },
    {
        "id": "1p11mu7",
        "author": "Thin-Firefighter4373",
        "title": "Cosa fare venerdì 21 a Torino",
        "content": "Ho un gruppo abbastanza grande di persone che vengono a trovarmi per un compleanno e cerco qualcosa da fare post cena. Volentieri musica da ballare, anche dal vivo, ma in un posto in cui non si debbano fare tessere per entrare (tipo arci). Grazie mille per ogni consiglio! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p11mu7/cosa_fare_venerdì_21_a_torino/"
    },
    {
        "id": "1p107la",
        "author": "TraditionalTennis912",
        "title": "Tatuatore",
        "content": "Cerco un Tatuatore non troppo caro a Torino sud. Consigli?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p107la/tatuatore/"
    },
    {
        "id": "1p0chiz",
        "author": "Dariocc",
        "title": "CASE A TORINO",
        "content": "Ciao ragazzi, scusate l'annuncio qui, mi chiedevo come sia possibile che a Torino non fittano a coppie, se non per cifre spropositate (agenzia esclusa). O che comunque la maggior parte delle case sono destinate agli studenti.\nCioè un Barman, lavoratore regolare non potrà mai trasferirsi lì a meno che non frequenti l'università...\nHo vissuto un po' in giro per l'Europa, mai avuto tutti sti problemi",
        "upvotes": 18,
        "comments": 49,
        "media": null,
        "permalink": "/r/torino/comments/1p0chiz/case_a_torino/"
    },
    {
        "id": "1p0kn0a",
        "author": "Successful-Ant-8503",
        "title": "M20, Cercasi compagnia per visitare musei (e discorso su abbonamento agevolato)",
        "content": "Ciao a tutti!\nSono un ragazzo di 20 anni.\nUltimamente mi è tornata la voglia di riscoprire Torino anche sotto il punto di vista dei suoi musei.\n\nSono un amatore di questo tipo di ambienti perché mi affascina l’arte, l’architettura e la storia.\nSono sempre stato, fin da piccolo, un ragazzo/bambino che li apprezzava e che ne visitava molti (anche grazie all’interesse ereditato dai miei genitori) fino ad aver visitato la quasi totalità dei musei a Torino e parecchi anche nei miei viaggi all’estero e non solo. \n\nNegli ultimi mesi mi è tornata questa voglia dopo qualche anno di pausa, dovuta soprattutto agli impegni scolastici. Ora, con l’università, ho più tempo libero e mi piacerebbe visitare ad esempio un museo a settimana (in base agli impegni) . Tuttavia, dato che molti li ho già visti, vorrei farlo in compagnia. Purtroppo tra i miei amici questa idea non ha avuto molto seguito e riconosco che tra i giovani non è la cosa all’ultima moda, quindi eccomi qui a proporre:\n\nVisto che la città di Torino propone un Abbonamento Musei (di 32€ da rinnovare una volta l’anno se under 26 anni) che permette una formula “All You Can Visit” su il 99% di mostre temporanee o fisse e musei di Torino + molti musei di Piemonte e Valle d’Aosta, cercavo dei miei coetanei (poco più piccoli o grandi e di qualsiasi sesso) che magari possono diventare miei “Museum Buddy” e visitarli in modo tranquillo con me, senza la pretesa di essere esperti. \n\nTrovo che il prezzo dell’abbonamento sia davvero conveniente: con un solo biglietto completo per la Reggia di Venaria e uno per il Museo Egizio (entrambi difficili da visitare bene in un’unica giornata) te lo ripaghi ampiamente. Con l’abbonamento puoi visitare tutti i musei quante volte vuoi, così da poterti permettere di dare un’occasione magari a una mostra che non ti convince del tutto, e mal che vada te ne esci subito portandoti comunque a casa un’esperienza.\n\nPersonalmente prenderei la palla al balzo anche per conoscere nuove persone e magari creare nuove amicizie. Quindi se sei interessato/a perché ti piacciono i musei e non li hai ancora visitati, li vuoi rivedere come me o magari sei “fuori sede” e vuoi scoprire questo lato di Torino; scrivimi pure in privato che ci conosciamo 🙂",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p0kn0a/m20_cercasi_compagnia_per_visitare_musei_e/"
    },
    {
        "id": "1p0g5xi",
        "author": "Top-Analysis-887",
        "title": "La Sfilata delle Star al TFF: Voi chi vorreste intervistare? e perchè?",
        "content": "Attenzione, amanti del cinema! Mentre l'arrivo di Antonio Banderas per la \"Stella della Mole\" accende i riflettori sul **Torino Film Festival (TFF)**, sappiamo benissimo che la lista degli ospiti d'onore non finisce qui! Il TFF è famoso per portare in città talenti incredibili: registi, attori di culto, e nomi emergenti.\n\nImmaginate di avere in mano un microfono. Se poteste intervistare *chiunque* tra gli ospiti di quest'anno, chi scegliereste? E perchè?",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1p0g5xi/la_sfilata_delle_star_al_tff_voi_chi_vorreste/"
    },
    {
        "id": "1p08p7b",
        "author": "Few_Willingness_5198",
        "title": "lo sapevate che lo studentato RELIFE è già diventato un albergo 2 stelle?",
        "content": "mancava proprio un ennesimo albergo pubblicizzato tanto dai giornali come studentato e basta.",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p08p7b/lo_sapevate_che_lo_studentato_relife_è_già/"
    },
    {
        "id": "1p0iuim",
        "author": "DogEuphoric1196",
        "title": "Consigli macellerie a Torino",
        "content": "Ciao a tutti, in questo periodo in cui sta tornando il freddo vorrei cimentarmi con un bel brasato.\n\nSorpresa delle sorprese: sono passato in 3 macellerie e nessuno aveva la guacia o il cappello del prete. La cosa mi sembra strana, soprattutto visto che il brasato è un tipico piatto piemontese. Sicuramente sto sbagliando qualcosa e non vorrei finire in qualche boutique della carne a spendere fantastilioni. Consigli?",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1p0iuim/consigli_macellerie_a_torino/"
    },
    {
        "id": "1ozng50",
        "author": "ImpressionOk8195",
        "title": "What do we have in Turin?",
        "content": "",
        "upvotes": 155,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qprjdjlgqu1g1.jpeg?auto=webp&amp;s=8a7412470bef0ee7dca5fa3219294e3f7f6ac325"
        },
        "permalink": "/r/torino/comments/1ozng50/what_do_we_have_in_turin/"
    },
    {
        "id": "1p0ia26",
        "author": "maciofitness-8596",
        "title": "Pare che il carcere minorile Ferrante Aporti abbia appena ospitato le selezioni per le prossime Olimpiadi giovanili di Salto in Alto Senza Ostacoli...",
        "content": "Un atleta di 17 anni, in custodia, ha infatti approfittato del pomeriggio per fare un po' di cardio e, con una disinvoltura che neanche Zorro, ha semplicemente scavalcato il muro del campo sportivo sul lato Sisport. Evidentemente, i protocolli di sicurezza non prevedevano l'eventualità che un detenuto potesse... beh, *saltare* un muretto. Forse pensavano che il solo sguardo severo degli agenti penitenziari (sottopagati e in numero insufficiente, come prontamente e giustamente ricordato dai sindacati) fosse sufficiente come deterrente. Complimenti vivissimi alla direzione per aver trasformato una struttura detentiva in un **\"colabrodo\"** (cit.) o, come diremmo noi, in un'uscita d'emergenza con vista campo da gioco!\n\n**Domanda seria:** Ma il campo sportivo del Ferrante Aporti non è affiliato al CONI? Perché, se scappi da lì, ti meriti almeno una medaglia per l'agilità!",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IYpuuwKN4Ul6iLAc7M5WtxXg4mZMSFfNHw9tAmM0mZk.jpeg?auto=webp&amp;s=57994220d1468ef35d9fbc10f08f26e35da05d0e"
        },
        "permalink": "/r/torino/comments/1p0ia26/pare_che_il_carcere_minorile_ferrante_aporti/"
    },
    {
        "id": "1p0dlvq",
        "author": "DOG_EGG_06",
        "title": "I'm a university student from Bulgaria and I'm looking for a gym",
        "content": "Does anyone know good gyms around porta susa that don't require a 12 month subscription and I can just pay monthly? And the price isn't something absurd. ",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1p0dlvq/im_a_university_student_from_bulgaria_and_im/"
    },
    {
        "id": "1p07fyq",
        "author": "Portus-Studios",
        "title": "Portus Studios – Looking for a Creative Writer &amp; Video Editor (Turin-based), become part of a new growing team!",
        "content": "**ENG**\n\nHi everyone!  \nI’m building Portus Studios, an indie game studio based in Turin (Italy). We’re first-time developers working on a shoestring budget, so for now these roles are unpaid, but I’m absolutely open to discuss details, expectations, and how things may evolve as the project grows.\n\nI’m currently looking to bring two new collaborators onto the team:\n\n• Creative Writer: to help write the game script, narrative arcs, dialogues, and branching choices.  \n• Video Editor: to prepare short-form video content for our social media (Instagram, X, TikTok, etc.).\n\nA bit about the project:  \nWe’re developing a narrative-driven, open-map, isometric game where choices matter. The story is set in modern Southern Italy, blending crime and horror themes with grounded cultural elements. The goal is to create a story-rich experience shaped directly by the player’s decisions.\n\nWe’re based in Turin, so if you’re local I’d be more than happy to meet up for a coffee and chat.  \nOtherwise, feel free to DM me if you’re interested or want more details.\n\n**ITA**\n\nCiao a tutti!  \nSto costruendo Portus Studios, uno studio indie con sede a Torino. Siamo sviluppatori alle prime armi e stiamo lavorando con un budget molto limitato, quindi al momento queste posizioni sono non retribuite, ma sono assolutamente disponibile a parlarne, chiarire aspettative e spiegare come il progetto potrà evolversi.\n\nAl momento sto cercando due nuove figure da aggiungere al team:\n\n• Creative Writer / Sceneggiatore: per lavorare alla sceneggiatura del gioco, alle linee narrative, ai dialoghi e alle scelte ramificate.  \n• Video Editor: per montare contenuti video da pubblicare sui nostri social (Instagram, X, TikTok, ecc.).\n\nQualche informazione sul gioco:  \nStiamo sviluppando un titolo narrativo, open-map e isometrico, dove le scelte contano davvero. La storia è ambientata nell’Italia meridionale contemporanea, con un mix di crime e horror, radicato nella cultura locale. L’obiettivo è creare un’esperienza narrativa ricca e modellata dalle decisioni del giocatore.\n\nSiamo basati a Torino, quindi se siete in zona mi farebbe piacere incontrarvi per un caffè!  \nIn alternativa, potete tranquillamente scrivermi in DM per saperne di più o per candidarvi.",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h0l7q2eggz1g1.jpeg?auto=webp&amp;s=7d0f7fd69910f9b562518f264bd6bab0251be6b2"
        },
        "permalink": "/r/torino/comments/1p07fyq/portus_studios_looking_for_a_creative_writer/"
    }
]