[
    {
        "id": "1o1cp2z",
        "author": "shiruken",
        "title": "The Nobel Prize in Chemistry 2025: Awarded to Susumu Kitagawa, Richard Robson, and Omar M. Yaghi \"for the development of metal-organic frameworks\"",
        "content": "The Nobel Prize in Chemistry 2025 was awarded to [Susumu Kitagawa](https://en.wikipedia.org/wiki/Susumu_Kitagawa), [Richard Robson](https://en.wikipedia.org/wiki/Richard_Robson_(chemist)), and [Omar M. Yaghi](https://en.wikipedia.org/wiki/Omar_M._Yaghi) \"for the development of metal-organic frameworks.\"\n\n* [Official Press Release](https://www.nobelprize.org/prizes/chemistry/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/chemistry/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/chemistry/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=0d02ONEXWkc)\n\n&gt;Susumu Kitagawa, Richard Robson and Omar Yaghi are awarded the Nobel Prize in Chemistry 2025. They have developed a new form of molecular architecture. In their constructions, metal ions function as cornerstones that are linked by long organic (carbon-based) molecules. Together, the metal ions and molecules are organised to form crystals that contain large cavities. These porous materials are called metal–organic frameworks (MOF). By varying the building blocks used in the MOFs, chemists can design them to capture and store specific substances. MOFs can also drive chemical reactions or conduct electricity.\n\n&gt;“Metal–organic frameworks have enormous potential, bringing previously unforeseen opportunities for custom-made materials with new functions,” says Heiner Linke, Chair of the Nobel Committee for Chemistry.\n\n&gt;It all started in 1989, when Richard Robson tested utilising the inherent properties of atoms in a new way. He combined positively charged copper ions with a four-armed molecule; this had a chemical group that was attracted to copper ions at the end of each arm.\n\n&gt;When they were combined, they bonded to form a well-ordered, spacious crystal. It was like a diamond filled with innumerable cavities.\n\n&gt;Robson immediately recognised the potential of his molecular construction, but it was unstable and collapsed easily. However, Susumu Kitagawa and Omar Yaghi provided this building method with a firm foundation; between 1992 and 2003 they made, separately, a series of revolutionary discoveries. Kitagawa showed that gases can flow in and out of the constructions and predicted that MOFs could be made flexible. Yaghi created a very stable MOF and showed that it can be modified using rational design, giving it new and desirable properties.\n\n&gt;Following the laureates’ groundbreaking discoveries, chemists have built tens of thousands of different MOFs. Some of these may contribute to solving some of humankind’s greatest challenges, with applications that include separating PFAS from water, breaking down traces of pharmaceuticals in the environment, capturing carbon dioxide or harvesting water from desert air.",
        "upvotes": 333,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/po4f2DI5HsQ0ovq843rCJc4BklL2J1jHNqA9QpeP1Ug.jpeg?auto=webp&amp;s=6adf5958359418903698e14687385344af0faafe"
        },
        "permalink": "/r/science/comments/1o1cp2z/the_nobel_prize_in_chemistry_2025_awarded_to/"
    },
    {
        "id": "1o0hps8",
        "author": "shiruken",
        "title": "The Nobel Prize in Physics 2025: Awarded to John Clarke, Michel H. Devoret, and John M. Martinis \"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit\"",
        "content": "The Nobel Prize in Physics 2025 was awarded to [John Clarke](https://en.wikipedia.org/wiki/John_Clarke_(physicist)), [Michel H. Devoret](https://en.wikipedia.org/wiki/Michel_Devoret), and [John M. Martinis](https://en.wikipedia.org/wiki/John_M._Martinis) **\"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit.\"**\n\n* [Official Press Release](https://www.nobelprize.org/prizes/physics/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/physics/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/physics/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=m9FUkAis62s)\n\n&gt;Quantum mechanics allows a particle to move straight through a barrier, using a process called tunnelling. As soon as large numbers of particles are involved, quantum mechanical effects usually become insignificant. The laureates’ experiments demonstrated that quantum mechanical properties can be made concrete on a macroscopic scale.\n\n&gt;In 1984 and 1985, **John Clarke**, **Michel H. Devoret** and **John M. Martinis** conducted a series of experiments with an electronic circuit built of superconductors, components that can conduct a current with no electrical resistance. In the circuit, the superconducting components were separated by a thin layer of non-conductive material, a setup known as a Josephson junction. By refining and measuring all the various properties of their circuit, they were able to control and explore the phenomena that arose when they passed a current through it. Together, the charged particles moving through the superconductor comprised a system that behaved as if they were a single particle that filled the entire circuit.\n\n&gt;This macroscopic particle-like system is initially in a state in which current flows without any voltage. The system is trapped in this state, as if behind a barrier that it cannot cross. In the experiment the system shows its quantum character by managing to escape the zero-voltage state through tunnelling. The system’s changed state is detected through the appearance of a voltage.\n\n&gt;The laureates could also demonstrate that the system behaves in the manner predicted by quantum mechanics – it is quantised, meaning that it only absorbs or emits specific amounts of energy.\n\n&gt;“It is wonderful to be able to celebrate the way that century-old quantum mechanics continually offers new surprises. It is also enormously useful, as quantum mechanics is the foundation of all digital technology,” says Olle Eriksson, Chair of the Nobel Committee for Physics.\n\n&gt;The transistors in computer microchips are one example of the established quantum technology that surrounds us. This year’s Nobel Prize in Physics has provided opportunities for developing the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.",
        "upvotes": 386,
        "comments": 11,
        "media": null,
        "permalink": "/r/science/comments/1o0hps8/the_nobel_prize_in_physics_2025_awarded_to_john/"
    },
    {
        "id": "1o524xb",
        "author": "sciencealert",
        "title": "Study of 15,000 blood samples shows a rise in antibiotic-resistant superbugs in newborn babies",
        "content": "",
        "upvotes": 5054,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iRFgacv5fAanWZnTNb_9dbtVcWmGRH0w3lhQAl2z4v4.jpeg?auto=webp&amp;s=ff164333ad535697c5a70a58f6ac7613f971d6f1"
        },
        "permalink": "/r/science/comments/1o524xb/study_of_15000_blood_samples_shows_a_rise_in/"
    },
    {
        "id": "1o54rtw",
        "author": "mvea",
        "title": "High youth death rates are an ‘emerging crisis’, global health study warns. Alcohol, suicide and injuries driving rises among teenagers and young adults despite overall rates falling. In North America this was “tied up with the rise of anxiety and depression in young people, particularly women”.",
        "content": "",
        "upvotes": 2434,
        "comments": 135,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dWHYFihlmm6HuqakDOH5YDx4K6wQTceHt3lPqrjgvUk.jpeg?auto=webp&amp;s=4095514e536550da319f55e1a9a18e0cd5c80420"
        },
        "permalink": "/r/science/comments/1o54rtw/high_youth_death_rates_are_an_emerging_crisis/"
    },
    {
        "id": "1o57exu",
        "author": "-Mystica-",
        "title": "Carbon offsets fail to cut global heating due to ‘intractable’ systemic problems, study says. Analysis of 25 years of evidence shows most schemes are poor quality and fail to lower emissions.",
        "content": "",
        "upvotes": 596,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HNsDQT7a8HQDZg3mWVv_oqH0I1zUN33x7anAutZvk5Y.jpeg?auto=webp&amp;s=38d7d2b33b8566ec27386b02ae2919c5b787c014"
        },
        "permalink": "/r/science/comments/1o57exu/carbon_offsets_fail_to_cut_global_heating_due_to/"
    },
    {
        "id": "1o5amen",
        "author": "calliope_kekule",
        "title": "A major global study from The Lancet shows infectious diseases keep falling, but chronic conditions like diabetes, heart disease, and anxiety are rising worldwide.",
        "content": "",
        "upvotes": 324,
        "comments": 10,
        "media": null,
        "permalink": "/r/science/comments/1o5amen/a_major_global_study_from_the_lancet_shows/"
    },
    {
        "id": "1o4v8nw",
        "author": "nohup_me",
        "title": "Up to one third of women globally cohabit with heavy-drinking partners, increasing the likelihood of violence, neglect, and child health problems. The impact is magnified in regions with low/middle income and high gender inequality",
        "content": "",
        "upvotes": 2129,
        "comments": 155,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Zjb5OIeeFrh9CoCbuDmSoePeeQBPmYPuvOJkmOD3lqU.jpeg?auto=webp&amp;s=c322f33293804a8439adb1830c34d84320e3377a"
        },
        "permalink": "/r/science/comments/1o4v8nw/up_to_one_third_of_women_globally_cohabit_with/"
    },
    {
        "id": "1o4nn3i",
        "author": "mvea",
        "title": "Most people rarely use AI, and dark personality traits predict who uses it more. Study finds AI browsing makes up less than 1% of online activity. Students who used AI more often were slightly more likely to score high on personality traits associated with narcissism and psychopathy.",
        "content": "",
        "upvotes": 5973,
        "comments": 512,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8RASgeLduOGiuCURidM54sKypLJo8RC4rf4mWtme1RM.jpeg?auto=webp&amp;s=6807b4821951443c7813e99e3c92926279685dd0"
        },
        "permalink": "/r/science/comments/1o4nn3i/most_people_rarely_use_ai_and_dark_personality/"
    },
    {
        "id": "1o59o7z",
        "author": "calliope_kekule",
        "title": "A new study found that mountain glaciers will soon warm in step with the air around them, losing their brief cooling buffer and melting faster after midcentury.",
        "content": "",
        "upvotes": 142,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4DhEUEFbgzW2N__VaEtoic0f5qAfZ-LeHe58cxUyOtI.png?auto=webp&amp;s=2c2c8f9a740701c1c7902b8f5d88e945074c1ad8"
        },
        "permalink": "/r/science/comments/1o59o7z/a_new_study_found_that_mountain_glaciers_will/"
    },
    {
        "id": "1o4ldwn",
        "author": "mvea",
        "title": "A first-of-its-kind study has found that recognizing – and actually using – personal strengths is linked with better wellbeing and fewer mental-health symptoms in adults with attention-deficit/hyperactivity disorder (ADHD).",
        "content": "",
        "upvotes": 3688,
        "comments": 178,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Mtzh-afaU8FsMVoeCLBP_obUkO2no8Qh9VW85Mvr9Ao.png?auto=webp&amp;s=d74b1ff72f0bd94a40fa5b1deedd9ef8cf20d699"
        },
        "permalink": "/r/science/comments/1o4ldwn/a_firstofitskind_study_has_found_that_recognizing/"
    },
    {
        "id": "1o57ugh",
        "author": "-Mystica-",
        "title": "Air pollution increases the likelihood of people becoming frail in middle and old age, according to an international review of studies. The risk of frailty increased with outdoor particle pollution. For the UK, this could mean about 10-20% of frailty cases are attributable to air pollution.",
        "content": "",
        "upvotes": 180,
        "comments": 3,
        "media": null,
        "permalink": "/r/science/comments/1o57ugh/air_pollution_increases_the_likelihood_of_people/"
    },
    {
        "id": "1o522fv",
        "author": "sciencealert",
        "title": "New study identifies a link between changes in brain shape and declines in cognitive functions, such as memory and reasoning.",
        "content": "",
        "upvotes": 239,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IULiXR4r4p_BhB9pc55_mgCamJcL1qHiX5FjvwUzr6w.jpeg?auto=webp&amp;s=0ee0b4d7950ef002cd3c86cb68bf494a1f2c6a52"
        },
        "permalink": "/r/science/comments/1o522fv/new_study_identifies_a_link_between_changes_in/"
    },
    {
        "id": "1o4afve",
        "author": "mvea",
        "title": "Major IQ differences in identical twins linked to schooling, challenging decades of research. When identical twins receive similar educations, their IQs are nearly as alike as those raised together, but when schooling is very different, their IQs can be as dissimilar as those of unrelated strangers.",
        "content": "",
        "upvotes": 22260,
        "comments": 829,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/N-v7NODL6xxcz1Xi6D-sdCrK_0E9N3i6uqWHd4ONh_8.jpeg?auto=webp&amp;s=5d496984f4b9c748aad7421cb670df437b258cd3"
        },
        "permalink": "/r/science/comments/1o4afve/major_iq_differences_in_identical_twins_linked_to/"
    },
    {
        "id": "1o4fjxh",
        "author": "calliope_kekule",
        "title": "A study of 158 million US workers found health-related absences remain 13% higher than before the pandemic, reducing labour force participation.",
        "content": "",
        "upvotes": 1859,
        "comments": 53,
        "media": null,
        "permalink": "/r/science/comments/1o4fjxh/a_study_of_158_million_us_workers_found/"
    },
    {
        "id": "1o5e6va",
        "author": "brainquantum",
        "title": "Modelling sex differences of neurological disorders in vitro",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rkfE8rZyivQ1mr3M9pn7p4gWLrqWbWIdHe_npMyCW38.png?auto=webp&amp;s=dcf70024df0bc9659433346664503c51fb410e99"
        },
        "permalink": "/r/science/comments/1o5e6va/modelling_sex_differences_of_neurological/"
    },
    {
        "id": "1o5dz8b",
        "author": "BrnoRegion",
        "title": "ScienceDirectAstronomers studied the flickering light of young stars, confirming most are chaotic \"baby\" stars still gathering mass",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/science/comments/1o5dz8b/sciencedirectastronomers_studied_the_flickering/"
    },
    {
        "id": "1o4s01x",
        "author": "Dr_Neurol",
        "title": "A study revealed that social media use was positively associated with self-objectification, specifically with body surveillance and some body image concerns (e.g. body shame, body esteem)",
        "content": "",
        "upvotes": 101,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x2LkJZIv4hvZuvnC4-TTeESTwbnAE_97zHLVYJNwEAg.jpeg?auto=webp&amp;s=270d464967f4fe7ca4ce4257e3916cf3316da252"
        },
        "permalink": "/r/science/comments/1o4s01x/a_study_revealed_that_social_media_use_was/"
    },
    {
        "id": "1o4axrz",
        "author": "-Mystica-",
        "title": "A large study has found that calcium supplements, long recommended for bone health, particularly in older women, don’t increase dementia risk, offering reassurance for the millions who take them to protect against osteoporosis.",
        "content": "",
        "upvotes": 1275,
        "comments": 27,
        "media": null,
        "permalink": "/r/science/comments/1o4axrz/a_large_study_has_found_that_calcium_supplements/"
    },
    {
        "id": "1o3tkfs",
        "author": "James_Fortis",
        "title": "Researchers took 44 young untrained males and randomly allocated them with either plant or animal protein supplement drinks over a 12-week training period. Both groups showed significant gains in strength and muscle mass, but there was no significant difference between the two groups.",
        "content": "",
        "upvotes": 9762,
        "comments": 570,
        "media": null,
        "permalink": "/r/science/comments/1o3tkfs/researchers_took_44_young_untrained_males_and/"
    },
    {
        "id": "1o4g3ty",
        "author": "calliope_kekule",
        "title": "Stalagmite records show a major drought and cooling event 2,800 years ago helped trigger the collapse of China’s Western Zhou Dynasty and mass southward migration.",
        "content": "",
        "upvotes": 187,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CjV6wdeO3h73sowRnAuBphM6QKRPczHZ26PRj96TBjQ.png?auto=webp&amp;s=d143c805b67cda96b9dbdf51deec62feae6ebad3"
        },
        "permalink": "/r/science/comments/1o4g3ty/stalagmite_records_show_a_major_drought_and/"
    },
    {
        "id": "1o41bz3",
        "author": "FunnyGamer97",
        "title": "A healthier gut may improve mental health: Studies find gut microbes can change brain chemistry, stress responses and behaviours in animal models, with early trials of probiotics, diet changes, and faecal microbiota transplants improving mood and anxiety.",
        "content": "",
        "upvotes": 1141,
        "comments": 53,
        "media": null,
        "permalink": "/r/science/comments/1o41bz3/a_healthier_gut_may_improve_mental_health_studies/"
    },
    {
        "id": "1o3rrvm",
        "author": "mvea",
        "title": "People on the far-right and far-left exhibit strikingly similar brain responses. People with stronger political beliefs, regardless of whether they were liberal or conservative, showed increased activity in brain areas associated with emotion and threat detection.",
        "content": "",
        "upvotes": 4187,
        "comments": 1246,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iw1-KeXWi7_IcukrZuAJfh7g1NUshus89cBAF-_1Z7M.jpeg?auto=webp&amp;s=156aad4998eb23054a878c1375d9e73c005e901d"
        },
        "permalink": "/r/science/comments/1o3rrvm/people_on_the_farright_and_farleft_exhibit/"
    },
    {
        "id": "1o4a4ll",
        "author": "-Mystica-",
        "title": "Scientists at the Francis Crick Institute and Vividion Therapeutics have developed compounds that block RAS, a key cancer-driving gene. Now in early human trials, these drugs could treat many cancers effectively while sparing healthy cells.",
        "content": "",
        "upvotes": 274,
        "comments": 18,
        "media": null,
        "permalink": "/r/science/comments/1o4a4ll/scientists_at_the_francis_crick_institute_and/"
    },
    {
        "id": "1o3rv86",
        "author": "mvea",
        "title": "COVID-19 causes changes in sperm that lead to increased anxiety in offspring. The study found that changes in mouse sperm after aSARS-CoV-2 viral infection can affect an offspring’s brain and behaviour. Findings suggest the COVID-19 pandemic could have long-lasting effects on future generations.",
        "content": "",
        "upvotes": 2794,
        "comments": 142,
        "media": null,
        "permalink": "/r/science/comments/1o3rv86/covid19_causes_changes_in_sperm_that_lead_to/"
    },
    {
        "id": "1o3wf3s",
        "author": "Humanprototype187",
        "title": "Consciousness could emerge from Glymphatic-generated Electromagnetic Fields",
        "content": "",
        "upvotes": 1160,
        "comments": 152,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qyGoJ1D8NCEjHvtD5g5FnabiqzoOdE83aQPxYaqUkLA.jpeg?auto=webp&amp;s=9f6ead4b1683a74dfdcab844c577949e2ccad6fa"
        },
        "permalink": "/r/science/comments/1o3wf3s/consciousness_could_emerge_from/"
    },
    {
        "id": "1o47zog",
        "author": "Dr_Neurol",
        "title": "Correlations between social media addiction and anxiety, depression, FoMO, loneliness and self-esteem among students",
        "content": "",
        "upvotes": 221,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x2LkJZIv4hvZuvnC4-TTeESTwbnAE_97zHLVYJNwEAg.jpeg?auto=webp&amp;s=270d464967f4fe7ca4ce4257e3916cf3316da252"
        },
        "permalink": "/r/science/comments/1o47zog/correlations_between_social_media_addiction_and/"
    },
    {
        "id": "1o3u7om",
        "author": "Suitable-Economy-346",
        "title": "Repeated mRNA covid vaccinations may make more diverse and stronger T cell response, potentially better protecting against unseen and broader range of covid variants",
        "content": "",
        "upvotes": 702,
        "comments": 33,
        "media": null,
        "permalink": "/r/science/comments/1o3u7om/repeated_mrna_covid_vaccinations_may_make_more/"
    },
    {
        "id": "1o41vmu",
        "author": "nohup_me",
        "title": "Aged rats who lived in socially enriched environments throughout life retained better memory and cognitive flexibility than those housed alone, and performed just as well as young adults in memory tasks. Highlighting the importance of social interaction in protecting the aging brain",
        "content": "",
        "upvotes": 233,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vKQUHf3hA5rlRi7NduqjEcDcuo6O5rze_BDtSjVQzEs.png?auto=webp&amp;s=41b5f7ab54b1e77d04f853dbd33921d898b66e36"
        },
        "permalink": "/r/science/comments/1o41vmu/aged_rats_who_lived_in_socially_enriched/"
    },
    {
        "id": "1o3y5av",
        "author": "-Mystica-",
        "title": "The timing of emissions cuts, not just their speed, will determine our planet’s fate as a new Cornell study warns that delaying reductions beyond 2050 could push the probability of irreversible ice melt and sea-level rise above 50%, locking humanity into centuries of coastal transformation.",
        "content": "",
        "upvotes": 279,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KwMbu8sU1ySlNKEawzsvQf5_0ZWBzMVrdc11H9WhAAo.png?auto=webp&amp;s=6100a4bb68211713342fdcd5bbcf1f85f2fa3f88"
        },
        "permalink": "/r/science/comments/1o3y5av/the_timing_of_emissions_cuts_not_just_their_speed/"
    },
    {
        "id": "1o5dzzf",
        "author": "BrnoRegion",
        "title": "For people to adopt crypto payments, online reviews must be consistent; conflicting reviews are a deal-breaker, a new study finds.",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/science/comments/1o5dzzf/for_people_to_adopt_crypto_payments_online/"
    }
]