[
    {
        "id": "1qt1fsn",
        "author": "scoreboard-app",
        "title": "Post-Match Thread: Real Madrid vs Rayo Vallecano | LaLiga 25/26 | Feb 1, 2026",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qt1fsn)",
        "upvotes": 46,
        "comments": 290,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qt1fsn/postmatch_thread_real_madrid_vs_rayo_vallecano/"
    },
    {
        "id": "1qnd1ex",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 18,
        "comments": 4295,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qnd1ex/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qt0sw0",
        "author": "Ready_Ad_1353",
        "title": "Mbappe scores from the penalty spot",
        "content": "",
        "upvotes": 615,
        "comments": 173,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mtzdpgbuewgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qt0sw0/mbappe_scores_from_the_penalty_spot/"
    },
    {
        "id": "1qsyapg",
        "author": "InspectorExact3836",
        "title": "Vini scores 1-0 Rayo",
        "content": "",
        "upvotes": 497,
        "comments": 117,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i1sthb66wvgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qsyapg/vini_scores_10_rayo/"
    },
    {
        "id": "1qsvoz7",
        "author": "DoriOli",
        "title": "We urgently need two of these again at the back",
        "content": "",
        "upvotes": 671,
        "comments": 69,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/f1suwx848vgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qsvoz7/we_urgently_need_two_of_these_again_at_the_back/"
    },
    {
        "id": "1qsyqid",
        "author": "No-Independent2522",
        "title": "[COPE] Boos directed at the players during the announcement of the official lineup. The loudest boos were for Vinícius and Bellingham.",
        "content": "",
        "upvotes": 405,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sixyotxozvgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qsyqid/cope_boos_directed_at_the_players_during_the/"
    },
    {
        "id": "1qszxsd",
        "author": "Far_Awareness4497",
        "title": "Where would we be without courtois?is he Better than neuer?",
        "content": "",
        "upvotes": 289,
        "comments": 64,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/e5fvs5ds8wgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qszxsd/where_would_we_be_without_courtoisis_he_better/"
    },
    {
        "id": "1qt2i3z",
        "author": "o6ohunter",
        "title": "There are real life human beings who unironically believe that this wasn’t a penalty",
        "content": "",
        "upvotes": 213,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/92u3v6jdqwgg1.jpeg?auto=webp&amp;s=9cfd2d61e17a8a2e8ba146101648fec722ebf215"
        },
        "permalink": "/r/realmadrid/comments/1qt2i3z/there_are_real_life_human_beings_who_unironically/"
    },
    {
        "id": "1qt0aat",
        "author": "Japesh10",
        "title": "What are we even doing 😭🥀",
        "content": "",
        "upvotes": 180,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/q1wkvjy9bwgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qt0aat/what_are_we_even_doing/"
    },
    {
        "id": "1qt0pct",
        "author": "Pallav_Pokhrel",
        "title": "When my team plays like absolute shit,but I genuinely can't do anything except tweak",
        "content": "",
        "upvotes": 158,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hal81td7ewgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qt0pct/when_my_team_plays_like_absolute_shitbut_i/"
    },
    {
        "id": "1qt3ar2",
        "author": "dakdakdakp",
        "title": "Vini: \"To death with this club\"",
        "content": "",
        "upvotes": 95,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5k106gtmvwgg1.png?auto=webp&amp;s=a82a4f7caa75e7c4e54138f6eb5eabe32c5dfbbf"
        },
        "permalink": "/r/realmadrid/comments/1qt3ar2/vini_to_death_with_this_club/"
    },
    {
        "id": "1qt34u3",
        "author": "ContextDry9672",
        "title": "Bernabéu fans chant against Pérez and demand his resignation! \"perez dimisión\"",
        "content": "",
        "upvotes": 76,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ajdptxdhuwgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qt34u3/bernabéu_fans_chant_against_pérez_and_demand_his/"
    },
    {
        "id": "1qscige",
        "author": "Bijay12356",
        "title": "Kroos is cooking our midfielders 😮‍💨",
        "content": "",
        "upvotes": 3013,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j3pndzp4qqgg1.jpeg?auto=webp&amp;s=58111170534e534f013df80870ca3f284aad12c6"
        },
        "permalink": "/r/realmadrid/comments/1qscige/kroos_is_cooking_our_midfielders/"
    },
    {
        "id": "1qswnui",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs Rayo Vallecano Live Score | LaLiga 25/26 | Feb 1, 2026",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qswnui)",
        "upvotes": 142,
        "comments": 4050,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qswnui/match_thread_real_madrid_vs_rayo_vallecano_live/"
    },
    {
        "id": "1qszzpz",
        "author": "mdjonathan",
        "title": "New updated cycle after today",
        "content": "",
        "upvotes": 71,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8021al469wgg1.jpeg?auto=webp&amp;s=442f033ffcda92e38c40c053b323c8b12d6cd66c"
        },
        "permalink": "/r/realmadrid/comments/1qszzpz/new_updated_cycle_after_today/"
    },
    {
        "id": "1qszevu",
        "author": "Far_Awareness4497",
        "title": "Madrid fans Booing the players at half time. Is it fair?",
        "content": "Madrid fans are once again expressing their frustration by booing the players at the Bernabéu. Yet I’m seeing many fans on Reddit and Twitter dismissing them as “fake fans” for doing so.\n\nThat reaction alone shows how far the standards at Real Madrid have fallen so low that we’re now expected to applaud poor performances. This isn’t Arsenal, where mediocrity is celebrated and our star player who is an attacker scores 5 goals a season and is considered world class. We aren't delusional.\n\nThese players are meant to be the best in the world, and if they’re not showing a fighting spirit or performing to the club’s standards, criticism is not only fair, it’s necessary.\nGone are the days when Cristiano Ronaldo could score two goals and still get booed because his overall performance was poor and he was stat-padding. Now, players have become so entitled that being booed after months of underperforming is treated as betrayal. To the point where Vini can say he doesn’t want to play for a club that boos him after one good performance.\nThat mindset is completely at odds with what Real Madrid has always stood for .",
        "upvotes": 66,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qszevu/madrid_fans_booing_the_players_at_half_time_is_it/"
    },
    {
        "id": "1qt075g",
        "author": "OkNothing6576",
        "title": "Brahim's being least confident player shouldnt SURPRISE anyone.",
        "content": "What Arbeloa said yesterday. About touchables being untouchables. The morale in other players has went down 2000%. Guarantee you this season is already over. Since injuries will happen this season. Even with our \\*legendary\\*  Pintus for fitness. This season is over. I can guarantee you things will not progress since 5 players are above club and other players and especially fans.",
        "upvotes": 51,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qt075g/brahims_being_least_confident_player_shouldnt/"
    },
    {
        "id": "1qt2nxa",
        "author": "TheFeatherDiaries",
        "title": "The Brahim Diaz substitution for Jude's injury blew my mind when the most obvious substitution was sending Ceballos in and pushing Guler higher up the pitch as an advanced 8 or a 10 in Jude's position.",
        "content": "I cant believe this new coach. He completely let Rayo dominate in the midfield when he send Diaz in who has no clue how to play as an 8 and destroyed any chance of circulating the ball from the back or keeping possession against the press.\n\nThe Ceballos sub would have made so much sense. It's mind boggling to see such a tactically inept Madrid coach. Completely messed up the whole flow of the match.",
        "upvotes": 30,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qt2nxa/the_brahim_diaz_substitution_for_judes_injury/"
    },
    {
        "id": "1qt36vp",
        "author": "ContextDry9672",
        "title": "Vinícius demands the crowd's support and the fans respond with whistles",
        "content": "",
        "upvotes": 29,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3cyyputvuwgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qt36vp/vinícius_demands_the_crowds_support_and_the_fans/"
    },
    {
        "id": "1qsw87i",
        "author": "Deezwend",
        "title": "Real Madrid starting XI for Rayo Vallecano",
        "content": "",
        "upvotes": 62,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qsw87i/real_madrid_starting_xi_for_rayo_vallecano/"
    },
    {
        "id": "1qsvdan",
        "author": "Agreeable-Stage-6896",
        "title": "Why did we sign Franco Mastantouno?",
        "content": "Let me begin by saying that this isn’t a hatepost. He’s obviously a very hardworking boy with an amazing dribble. I truly do believe that he will be one of the best players in our team in maybe 4-5 years. Let’s not forget that he’s only 18.\n\nThat being said he doesn’t really make sense in our squad currently. Although he plays as a rw his true position is CAM. Not only do we have both Bellingham and Guler there, but his price from my understanding was around 45 million euros. Why get him when we could have gotten Nico Paz for less than 10 million euros? Not only is he better but also tested in Europe previously\n\nIf perez was willing to spend millions, why not get Zubimendi in our squad? This transfer just doesn’t make sense to me. It feels very much like Endrick, who we got without any intention to start or give minutes\n\nThoughts?",
        "upvotes": 60,
        "comments": 69,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qsvdan/why_did_we_sign_franco_mastantouno/"
    },
    {
        "id": "1qt3k2d",
        "author": "TheFeatherDiaries",
        "title": "SHOCKING : Jude Bellingham was already feeling his hamstring before the match",
        "content": "",
        "upvotes": 17,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fnjo08c8xwgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qt3k2d/shocking_jude_bellingham_was_already_feeling_his/"
    },
    {
        "id": "1qsy7uf",
        "author": "ManuMora98",
        "title": "[Fem] Deportivo 2 - 4 Real Madrid | Rocio 17', Bruun 20', Weir 73' (p), 89' (p); Lucia 15', Pizarro 25' | Hard fought win at Riazor before the Copa de la Reina Quarterfinals against Barça",
        "content": "",
        "upvotes": 21,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bauuxlvivvgg1.jpeg?auto=webp&amp;s=fb1cc5b377418170eabfa874b6f831e93710a55f"
        },
        "permalink": "/r/realmadrid/comments/1qsy7uf/fem_deportivo_2_4_real_madrid_rocio_17_bruun_20/"
    },
    {
        "id": "1qt2kcs",
        "author": "Jon4snowy",
        "title": "Bro what the freak happened to my real madrid.",
        "content": "I expected more dedication from players after ucl game. Again our first goal was vini individual brilliance. Then all these clueless pass against Rayo. There's no linkup between any players. \nCan't take ball forward, when they do it takes forever. \nWhat do they do in training sessions. \nI seriously have no idea how are we still a point behind barca. It would be better to lose against benefica tbh better than losing against city. ",
        "upvotes": 11,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qt2kcs/bro_what_the_freak_happened_to_my_real_madrid/"
    },
    {
        "id": "1qsr8cx",
        "author": "Safe_Cauliflower_646",
        "title": "The board and mainly Perez is the main reason of our drop in performance the last 2 seasons",
        "content": "I see a lot of people shifting the blame onto one or two players to explain the disaster that was last season and this season, but we’re not looking at the bigger picture.\n\nThe board sets the standards for the team and decides who has authority. After we won the Champions League in the 2023–2024 season, our most important player for the team’s dynamics left (Kroos). The board basically set Carlo up to fail when they didn’t sign a ball-controlling midfielder or any center-backs, even though we clearly needed them due to the high age ceiling and Nacho leaving.\n\nThis season, Xabi still didn’t get a ball-playing midfielder, even though he explicitly asked the board, and now Modrić has also left. We’re left with a midfield that can’t pass the ball if their lives depended on it. Regardless, we still started the season relatively well until the Clásico happened. We were winning, Vini got substituted, and then he acted like a fuckinh 25-year-old man-child clown. Regardless of whether you agree with Xabi’s decision, that doesn’t give him the right to act like that.\n\nBut fine, we are still 7 points ahead. Vini would get his lesson and we will move on… except we didn’t. The board decided to back Vini, saying he shouldn’t have been substituted, and basically endorsed his behavior. From that moment on, you could feel that Xabi lost control of the team. Things started going south, and we ended up losing everything.\n\nThis is obviously not all the reasons, but most of the problems we suffer from can be traced back to the board.",
        "upvotes": 55,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qsr8cx/the_board_and_mainly_perez_is_the_main_reason_of/"
    },
    {
        "id": "1qt1nfc",
        "author": "Specialist_Doctor_34",
        "title": "Jude got injured and We were losing all midfield battle during 2nd half.",
        "content": "Some people here wanted jude out so much and it worked out for them so congratulation to those people but what did that change? We became even worse than what we were. In the last 20 minute of 1st half rayo were creating in our own half and no one dared to press. At the left flank without jude rayo created so many chance from there. Arda and brahim were both playing high up the pitch for some 5-10 minute after jude got injured it actually looked like that the duo was working but we saw what happened after that. Fortunately Camavinga stepped up and progressed the ball. I wonder what happen to the people who used to say that arda carry the ball better than jude? Because I only saw him losing ball once he was shifted to middle. Thank you rayo for playing with 10 men because we were getting DOMINATED in second half and they created all of there chances from left side. Our goal came from a penalty and a golazo. Do we create anything at all? Look at the post match interview of valverde and he said that its was good to revenge of what happened at benfica. It was some of the worst display at the bernabeu this season but even after this you will see some people say we are better without jude because we won against rayo and brahim got a assist as well. Well I don't care and I know for a fact that with jude our team is a LOT and by a lot i mean 30-40% better defensively. We need a controller next summer and then he won't have to cover spaces for some of the mid table midfielder because they are too \"small\" to defend when player like neves and vitinha proves that even making a simple run who can cover a lot of spaces. ",
        "upvotes": 9,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qt1nfc/jude_got_injured_and_we_were_losing_all_midfield/"
    },
    {
        "id": "1qt3fh3",
        "author": "Never-EndingDarkness",
        "title": "I'm just disappointed.",
        "content": "The hate that most of the people on this sub have towards those who criticise player performances is just unreal. I mean whether you criticise, Jude, Mbappe, Valverde, Rodrygo, or Vini, you'll get hated no matter what. Everyone watched the game today and the way each of the superstars were disconnected from any semblance of the tactics, but these player FC fans will say that today was a great and hard-fought victory. I mean, yeah a relegation battling team is as scary as Barcelona or Bayern Munich. The team literally won because of a penalty but these player FC fans will not consider this because Mbappe and Vini scored today. I've been watching Real Madrid since 2007, and pretty recently found this sub. I've seen the heartbreaks and the glory days during this 19 year period, but I must say that this team is the most disjointed in the history of our club. For those who'll say that I'm from India and my opinion doesn't matter, I'll just tell you to piss off because you don't know the things that supporting this club got me while growing up. This club and particularly San Iker helped me connect with football and seeing Ronny here at Real, pushed me to grow up as a person who never gives up, so I'm more of a Madridista than you fake guys who only support individual players and only want trophies as a glory hunter. Even if the mods delete this post, I'll still keep trying to criticise the worst batch of players that this club ever had.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qt3fh3/im_just_disappointed/"
    },
    {
        "id": "1qsz0p2",
        "author": "Far_Awareness4497",
        "title": "Why did Madrid Players rely so much on individual quality?",
        "content": "One of my main concerns with our players that I dont see the fans complaining about is that they rely so much on individual quality. I'm watching the game rn and brain Diaz was alone on the left wing and was being marked by 4 players and his team mates didn't bother helping him, they all just stood waiting to see if he would dribble past them. Even. When the opposition is with the ball and on a counter, our midfielders won't track back to help the defence, they want to see if a defender can stop it or courtois saved the ball. If you don't get what I'm saying, replay Benefica's first goal against us on Wednesday. ",
        "upvotes": 11,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qsz0p2/why_did_madrid_players_rely_so_much_on_individual/"
    },
    {
        "id": "1qsw98g",
        "author": "ManuMora98",
        "title": "Deportivo W 1 - [2] Real Madrid W | Signe Bruun 20', after being 3 months out with a concussion (Athenea assist)",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9EULuGCdrJJir_58hHDgQ7e3wMa8dkSG8aukDkiQIbw.jpeg?auto=webp&amp;s=ef85debd22710afdecc80db072c4f2895bfc4c68"
        },
        "permalink": "/r/realmadrid/comments/1qsw98g/deportivo_w_1_2_real_madrid_w_signe_bruun_20/"
    },
    {
        "id": "1qs3zf1",
        "author": "Timely-Structure-905",
        "title": "Dread it… run from it… destiny arrives all the same. Benfica again in UCL playoffs. Are they inevitable?",
        "content": "",
        "upvotes": 446,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9gnvibcw4pgg1.jpeg?auto=webp&amp;s=a1d4be74facf8c5eb0e355968ba8ee00065309c3"
        },
        "permalink": "/r/realmadrid/comments/1qs3zf1/dread_it_run_from_it_destiny_arrives_all_the_same/"
    }
]