[
    {
        "id": "1pqbjno",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Avatar: Fire and Ash / The Housemaid / The SpongeBob Movie: Search for SquarePants)",
        "content": "**New In Theaters**:\n\n* [Avatar: Fire and Ash](https://old.reddit.com/r/movies/comments/1pqbh9u/official_discussion_avatar_fire_and_ash_spoilers/?)\n* [The Housemaid](https://old.reddit.com/r/movies/comments/1pqbhad/official_discussion_the_housemaid_spoilers/?)\n* [The SpongeBob Movie: Search for Squarepants](https://old.reddit.com/r/movies/comments/1pqbhbe/official_discussion_the_spongebob_movie_search/?)\n\n**Awards Run Catch-Up**\n\n* [Sentimental Value](https://www.reddit.com/r/movies/comments/1pkhnsl/official_discussion_sentimental_value_spoilers/)\n* [It Was Just an Accident](https://www.reddit.com/r/movies/comments/1pkhnwc/official_discussion_it_was_just_an_accident/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n**No throwbacks this week as we try to align the weeks so we can continue next year. Next batch of movies were Christmas day releases so we will post them with the Christmas day '26 releases.**\n\n**Still In Theaters**:\n\n* [Ella McCay](https://www.reddit.com/r/movies/comments/1pkhnoq/official_discussion_ella_mccay_spoilers/)\n* [Five Nights at Freddy's 2](https://old.reddit.com/r/movies/comments/1pekchd/official_discussion_five_nights_at_freddys_2/?)\n* [Hamnet](https://old.reddit.com/r/movies/comments/1pekcj2/official_discussion_hamnet_spoilers/)\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n\n**New On Streaming:**\n\n* [Wake Up, Dead Man](https://old.reddit.com/r/movies/comments/1plb82b/official_discussion_wake_up_dead_man_a_knives_out/?)\n* [Jay Kelly](https://old.reddit.com/r/movies/comments/1pg2zf7/official_discussion_jay_kelly_spoilers/?)\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 66,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1pqbjno/official_discussion_megathread_avatar_fire_and/"
    },
    {
        "id": "1pmfask",
        "author": "TestamentOfAnnLeeAMA",
        "title": "Hi r/movies, I'm Tim Blake Nelson. Ask me anything!",
        "content": "Hi r/movies, I'm Tim Blake Nelson, here to answer your questions.\n\nYou might know me from movies/series like **O Brother, Where Art Thou?**, **Old Henry**, **The Ballad of Buster Scruggs**, **The Lowdown**, **Watchmen**, **Lincoln**, **Holes**, **Captain America: Brave New World,** **Syriana**, **Guillermo del Toro's Pinocchio**, **Nightmare Alley**, **The Incredible Hulk**. Full list of credits [here](https://www.imdb.com/name/nm0625789/).\n\n  \nMy new movie, **The Testament of Ann Lee**, is out in theaters nationwide starting December 25 via Searchlight Pictures. It's directed and co-written by Mona Fastvold. Score by Daniel Blumberg.\n\nIt also stars Amanda Seyfried, Lewis Pullman, Thomasin McKenzie, Christopher Abbott, Stacy Martin, Matthew Beard, Scott Handy, Viola Prettejohn, Jamie Bogyo, and David Cale.\n\n*Synopsis:*\n\n&gt;Ann Lee, the founding leader of the Shaker Movement, proclaimed as the female Christ by her followers. Depicts her establishment of a utopian society and the Shakers' worship through song and dance, based on real events.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=-zK\\_nzG36mk](https://www.youtube.com/watch?v=-zK_nzG36mk)\n\nAsk me anything! I'll be back tomorrow (Monday 12/15) at around 2 PM ET to answer questions.\n\n",
        "upvotes": 4898,
        "comments": 865,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0fyu4gwuz37g1.jpeg?auto=webp&amp;s=04f79496a1992b546624fb9ab5497a0eedc885fb"
        },
        "permalink": "/r/movies/comments/1pmfask/hi_rmovies_im_tim_blake_nelson_ask_me_anything/"
    },
    {
        "id": "1pvo3tn",
        "author": "LollipopChainsawZz",
        "title": "Netflix vs. Paramount: Whoever wins… we lose?",
        "content": "",
        "upvotes": 1329,
        "comments": 342,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bt-CeyhB7wMXwvaRX1nx0Dh2JTSC1vK6yu6PwG80_ks.png?auto=webp&amp;s=e240c20ec36f59ca9ff57faa5582f94c4baf2e75"
        },
        "permalink": "/r/movies/comments/1pvo3tn/netflix_vs_paramount_whoever_wins_we_lose/"
    },
    {
        "id": "1pvphm0",
        "author": "ChronosBlitz",
        "title": "Conclave (2024) has a really interesting antagonist in the reactionary traditionalist Tedesco. He plays fair and is honest.",
        "content": "Cardinal Tedesco, the reactionary traditionalist and ostensible final antagonist who has been the opposition since day one, is the only one, apart from Cardinal Benitez, to be entirely free from corruption or breaking papal law. \n\nHe doesn't cheat or try to bribe others like Trombley. In the books, Tedesco is actually the poorest Cardinal with less than 3,000 euros in his bank account. \n\nUnlike Bellini, he doesn't lack for personal courage or conviction. \n\nUnlike Adayemi, he has never strayed and had indiscretions with young nuns under his authority. \n\nHowever good his intentions, Lawrence/Lomeli broke multiple rules in his attempts to expose Trombley.\n\nI just find it interesting that by all accounts, Tedesco 'plays fair'.",
        "upvotes": 536,
        "comments": 58,
        "media": null,
        "permalink": "/r/movies/comments/1pvphm0/conclave_2024_has_a_really_interesting_antagonist/"
    },
    {
        "id": "1pvb2cv",
        "author": "gta721",
        "title": "Make sure to turn off motion smoothing if you've got a new TV",
        "content": "It makes the TV insert fake frames in-betweem real ones which makes movies and shows look wrong with detail lost in camera pans and artifacts around objects.\n\nLG calls it TruMotion, Samsung calls it Clear Motion, Auto Motion or Motion Clarity, and Sony calls it Motionflow. They all turn it on by default.\n\nHowever Real Cinema / Cinema Screen / Cinemotion / frame rate matching should be left enabled if you have a 120hz TV as they remove the judder caused by 3:2 pulldown.",
        "upvotes": 3447,
        "comments": 558,
        "media": null,
        "permalink": "/r/movies/comments/1pvb2cv/make_sure_to_turn_off_motion_smoothing_if_youve/"
    },
    {
        "id": "1pvivbt",
        "author": "Renegadeforever2024",
        "title": "Home Alone (1990) - The Family Orders Pizza",
        "content": "",
        "upvotes": 836,
        "comments": 189,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3bwedobf3e9g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pvivbt/home_alone_1990_the_family_orders_pizza/"
    },
    {
        "id": "1pvjsds",
        "author": "Prior_Meal_7980",
        "title": "Arrival",
        "content": "Just watched arrival and its too damn intriguing.\nThe whole movie i kept interpreting louise is getting the flashbacks of her daughter. The scene when Ian says were you married made me question first time and then when he said do wanna make a baby forced me to believe she was seeing the future but still i was sceptical because the starting scene of movie had left mark on me.\nBut the scene where louise describes to the officials that learnig the alien language can make humans feel the time in non linear way said it all.\nAnd yeah i am still thinking why would Ian have left her after knowing her daughter's disease.",
        "upvotes": 360,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1pvjsds/arrival/"
    },
    {
        "id": "1pvhoko",
        "author": "browniebiscuitchildr",
        "title": "What’s a character who did so much terrible stuff that you just can’t buy their redemption?",
        "content": "*cracks knuckles* Well, I’ve been wanting to do this rant for a long time but for me that is hands down Cheng from Karate Kid (2010). \n\n“There are no bad students, only bad teachers” my ass!\n\nCheng was a straight up psychopath with or without that dojo’s help and there’s no handing off of the tournament trophy or respectful bow at the end that could undo just how bloodthirsty this kid was from start to finish. The scene after he corners Dre in the alleyway is especially brutal. Dude *literally* beats the shit out of the kid (yes, you can see the poop stain afterward), and the entire time he’s giving him a mafia style beatdown with his fist sinking into Dre’s gut harder and harder each time, you can see the absolute sadistic glee on his face.\n\nDidn’t stop at Dre either. This kid wanted the smoke with Jackie Chan (Mr. Han), a grown man, and treated a tournament with twelve year olds like this was his audition for the next Street Fighter role! \n\nIt was entertaining and all for a bad guy but the sudden switch as soon as he was defeated with that flip kick just didn’t feel believable to me. ",
        "upvotes": 373,
        "comments": 545,
        "media": null,
        "permalink": "/r/movies/comments/1pvhoko/whats_a_character_who_did_so_much_terrible_stuff/"
    },
    {
        "id": "1pvqo51",
        "author": "macman07",
        "title": "Just finished Before Sunset. I think this has the best dialogue of a romance ever presented on screen.",
        "content": "I’ve watched Before Sunrise &amp; now Before Sunset, and I am truly blown away. I was going to wait until Before Midnight to make this post but I couldn’t wait. \n\nHawke and Delpy have the best romantic chemistry I’ve ever seen on screen &amp; I genuinely don’t know how the writers even wrote this dialogue. Every conversation is natural and flows together. Every little pause, every little touch, the gentle interruptions as they speak to eachother, it all flows seamlessly as if it isn’t a film, but rather a hidden camera following a real couple. How can this possibly be scripted? \n\nIt’s hands down the best, but more importantly, realistic romantic dialogue I’ve ever seen in my life. I’m blown away and don’t even want to watch Before Midnight because I don’t want their story to ever end. ",
        "upvotes": 101,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1pvqo51/just_finished_before_sunset_i_think_this_has_the/"
    },
    {
        "id": "1pve60y",
        "author": "BunyipPouch",
        "title": "Laurence Fishburne to Direct ‘The Rule of Nines’ With Star André Holland ('Moonlight') - Returning to the director's chair for the first time in 25 years (and only 2nd time ever).",
        "content": "",
        "upvotes": 573,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4-HZ-yB87j470lfT-aVao0gIJRA4mefQmrQtr05aJgQ.jpeg?auto=webp&amp;s=bc282d445cf02b19df05b37984c2d33f8d3827d0"
        },
        "permalink": "/r/movies/comments/1pve60y/laurence_fishburne_to_direct_the_rule_of_nines/"
    },
    {
        "id": "1pv2dyq",
        "author": "frair",
        "title": "What fad in moviemaking are you waiting for to die?",
        "content": "For example, I hate shaky cam, and I'm glad they don't do it as much anymore.\n\nOn fad I see now that I'm not a fan of is having a light source in view. By this I mean like a scene in sunlight where the sun is behind the person and they they move and the sun blinds you. Or the sun is in the shot the whole time and there is horrible contrast and it's straining to watch. ",
        "upvotes": 5875,
        "comments": 4272,
        "media": null,
        "permalink": "/r/movies/comments/1pv2dyq/what_fad_in_moviemaking_are_you_waiting_for_to_die/"
    },
    {
        "id": "1pvd6pl",
        "author": "BunyipPouch",
        "title": "Garret Dillahunt Joins Historical Thriller ‘Pedro Pan’ - Set in the aftermath of Fidel Castro’s Cuban revolution, it follows a Cuban socialite, an English schoolteacher and an Irish Catholic priest in Miami who spearhead a daring operation to help more than 14,000 children escape communist Cuba.",
        "content": "",
        "upvotes": 544,
        "comments": 206,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bqav3OgK1IdtE371DgGHhQah0y7hU2_8Wcia3haohKY.jpeg?auto=webp&amp;s=34d7c6d71e2173dacf05795e8879e2f21434b0f1"
        },
        "permalink": "/r/movies/comments/1pvd6pl/garret_dillahunt_joins_historical_thriller_pedro/"
    },
    {
        "id": "1pvao6i",
        "author": "DarlingLuna",
        "title": "What are some castings which sounded terrible on paper but ended up being brilliant?",
        "content": "On paper, the casting of Michael Keaton as the dark, brooding Batman was an absolute wildcard, since he was primarily known for comedic roles such as Mr. Mom. A similar thing happened with Heath Ledger. Even though he was known as an incredibly talented actor, he was primarily known for more tender, vulnerable roles in films such as Brokeback Mountain and 10 Things I Hate About You. Both castings ended up working incredibly well. What are some other unexpected, seemingly ill fitting castings which similarly worked brilliantly?",
        "upvotes": 716,
        "comments": 614,
        "media": null,
        "permalink": "/r/movies/comments/1pvao6i/what_are_some_castings_which_sounded_terrible_on/"
    },
    {
        "id": "1pvse2q",
        "author": "G_Marius_the_jabroni",
        "title": "\"The Rock\" (1996) had such a well-written, well-acted, &amp; well-directed (Michael Bay) switch up of the main antagonists/bad guys, with General Hummel (Ed Harris) seeming like the bad guy for most of the movie, but Captain Darrow (Tony Todd) &amp; Captain Frye (Gregory Sporleder) were the real bad guys.",
        "content": "General Hummel was portrayed as the main antagonist, obviously along with the other 17 marines that went rouge with him. But he wasn't a normal \"bad guy\". We dont find out until way later that his true intentions were to bluff the Pentagon (with the threat of those 15 VX-gas warheads aimed at the heart of San Fransisco + the tourists they were holding hostage) into paying out $100 million dollars (from a shady slush fund full of proceeds from illegal arms sales that the pentagon makes) so he could distribute $1 million dollars to each one of the 83 marines families that had died under his command over the years, and then pay the other rogue marines a mil each. Pretty noble agenda, but at the same time, not so much.\n\nOur first inkling of who the REAL bad guys are was revealed when the Navy Seals entered the shower room, got surrounded, and then slaughtered. [Captains Frye and Darrow](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhCHteEFvEum8Xu7sQZGIP8Waow1OLitqJfweF-Pq3Ods3oCPKD2bNjsRZGtW2gWr1rlTMu9Q_S94br0FqDhH8Fa40gaT-nsI_YmE0MjWqzMcQ2meV8m6HpYNqfQV8ZQPLmKPuEo3DtQO0/s1600/vlcsnap-2014-03-10-16h04m01s12.png) both have a moment during [that scene](https://youtu.be/-PNJ5e8Qq3g) where they are both shown, how do I put this, to be enjoying slaughtering those navy seals a little too much???\n\nAs the movie progresses, it still kind of feels like Hummel is the bad guy. But then after he gives the ok to launch the first VX-gas rocket bc the pentagon missed the deadline, and then changes the landing coordinates of the rockets mid-flight, shifting it from heading right for the football stadium full of people out to the open ocean, his true intentions are finally revealed. He was just trying to bluff the pentagon.\n\n[And then we get one of the most intense scenes from all 90's action movies.](https://youtu.be/hiJUZjv7xP4) (In my opinion). \"This mission was based on the threat of force. I'm not about to kill 80,000 innocent people. Do you think I am out of my fucking mind? We bluffed. They called it. The mission is over.\" And then Captain Frye busts out such a creepy reply, revealing that HE is the true antagonist of the movie (Captain Darrow as well); \"Who ever said anything about bluffing General?\" That was such an eerie scene. He also was the last rouge marine to go down (I think??), suffering [probably the most gruesome death](https://clip.cafe/the-rock-1996/im-gonna-choke-million-bucks-out-of-youre-gonna-die/) of them all. (Well, [Captain Darrow becoming \"The Rocket Man\"](https://youtu.be/DNg8OCIMZgI?t=31) was pretty freaking brutal too, fitting for the movie's 2nd leading antagonist.) I love this movie, and the very well-written switch up of the main antagonists.",
        "upvotes": 42,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C0OxPJl4iMfAxTSApcE1aKAuq1XjFqoeNgnQRl6MpqE.png?auto=webp&amp;s=1c05811ac40493d894ca15c6eb438b99b0eb260b"
        },
        "permalink": "/r/movies/comments/1pvse2q/the_rock_1996_had_such_a_wellwritten_wellacted/"
    },
    {
        "id": "1pvosq3",
        "author": "WildPlantWoman1986",
        "title": "When Harry Met Sally",
        "content": "I am watching when Harry Met Sally for the first time and I am so so charmed. It is such a sweet film and so realistic, of rhe regret we almost all have. RIP Rob Reiner.\nWho hasn't got someone who got away? That moment when they are watching casablanca at the same time is so sweet and so vulnerable, and so intimate. ",
        "upvotes": 58,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1pvosq3/when_harry_met_sally/"
    },
    {
        "id": "1pvs3t9",
        "author": "wishihadaps42",
        "title": "Do younger generations watch/like it's a wonderful life?",
        "content": "I'm watching this movie now for the first time after seeing bits and pieces of it on TV over the years around Christmas time. I'm in my 30s and I really like movies of all genres and time periods but movies before the 80s I have not seen many besides the Bond movies and some of the classics Godfather, Jaws, Alien etc. and yet this movie is very very good. Couple of times it got me chocked, made me laugh a little and smile quite a few times.\n\n  \nI can't say it feels very Christmasy, it does have a cozy feeling probably because of the black and white and always seeing it associated with the Christmas season on TV. It has a lot of heart (I haven't finished it yet), feel for George Bailey missing out on life, Id say many of my generation probably feel similar, shit I can't even get a job or build a future.\n\n  \nThe only real critique I have is that the warmness, kindness in this film does not exist in the world today if it ever did. Potter and his cruel and cutthroat ideals are really what society is like today.\n\n  \nHave younger people watched and or liked this film? Like under 30? I would expect this movie to be largely forgotten for most under 40.",
        "upvotes": 35,
        "comments": 79,
        "media": null,
        "permalink": "/r/movies/comments/1pvs3t9/do_younger_generations_watchlike_its_a_wonderful/"
    },
    {
        "id": "1pv7z6r",
        "author": "Pippified",
        "title": "Well, It’s a Wonderful Life made me sob.",
        "content": "Merry Christmas everyone!\n\nIn my 30 years of life, I don’t know how I missed watching It’s a Wonderful Life. But, as it happens, never seen it. I mentioned that to my sister and brother in law and they were absolutely incredulous so they popped it on, and fellas. I wept at the end. The way his community came together for him? The way he didn’t realize how important he was? \n\nThis might be a dumb post but whatever. What a beautiful film. I’m filled with holiday cheer or whatever. ",
        "upvotes": 793,
        "comments": 164,
        "media": null,
        "permalink": "/r/movies/comments/1pv7z6r/well_its_a_wonderful_life_made_me_sob/"
    },
    {
        "id": "1pve4ez",
        "author": "JonasKahnwald11",
        "title": "Official poster for HBO documentary 'Critical Incident: Death at the Border' - Premiere in December 29 on HBO Max.",
        "content": "&gt;CRITICAL INCIDENT revisits the 2010 death of Anastasio Hernández-Rojas, an undocumented Mexican immigrant who died while in custody at the border. When eye-witness video emerges, it sparks a far-reaching investigation from a border checkpoint to Washington D.C. CRITICAL INCIDENT chronicles journalists’, lawyers’, and family members’ efforts to explore the Border Patrol’s involvement in the incident, ultimately pointing to cover-ups, and uncovering the existence of a little-known unit inside the agency that had been involved in other border related incidents. In 2022, U.S. Customs and Border Protection disbanded the Critical Incident Teams, and the Inter-American Court of Human Rights held a hearing on the Anastasio Hernandez-Rojas case, ultimately calling for the reopening of the case and recognizing that Hernandez-Rojas’ human rights had been violated during his arrest.\n\n  \nTrailer: [https://youtu.be/1FQWH5IYT5Y](https://youtu.be/1FQWH5IYT5Y)\n\n",
        "upvotes": 225,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7402bg7mxc9g1.jpeg?auto=webp&amp;s=39252fd11dd37276cca8ce8035ccae13a0dfc108"
        },
        "permalink": "/r/movies/comments/1pve4ez/official_poster_for_hbo_documentary_critical/"
    },
    {
        "id": "1pvk9t1",
        "author": "NodariR",
        "title": "Movie Quality Before the Mass Adoption of CGI and Digital Cameras",
        "content": "I recently watched Conspiracy Theory with Mel Gibson and Julia Roberts and The Cooler with William Macy and Alec Baldwin, both pretty average movies from the '90s and '00s but I was struck by how much better they look compared to most modern Hollywood and streaming services content. The texture, colors and overall feel just draw me in. Both films have these perfect night shots: dark, moody and full of detail unlike a lot of new movies where night scenes look either flat, overly brightened or way too dark to see anything.\n\nAnother thing in general, not just in these two films, is how alive the environments feel in older movies. There’s wind, movement and atmosphere in almost every scene, which makes the world feel real and immersive. In contrast a lot of modern movies seem weirdly still with no wind, no rain, barely any movement in the background and sometimes even the shadows on actors faces or in the set decorations look fake, almost like they’ve been airbrushed or Photoshopped for a magazine cover.\n\nThese advances in technology should be making movies look even better and help improve the overall production and not result in the flat, lifeless visuals we often get nowadays. It’s frustrating to see all this potential wasted when older films with fewer resources managed to create such rich and immersive worlds.\n\nWhat do you think about it?",
        "upvotes": 87,
        "comments": 124,
        "media": null,
        "permalink": "/r/movies/comments/1pvk9t1/movie_quality_before_the_mass_adoption_of_cgi_and/"
    },
    {
        "id": "1pvilue",
        "author": "LollipopChainsawZz",
        "title": "The Rip | Sneak Peek | Netflix",
        "content": "",
        "upvotes": 104,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MzynWg1hjE6OUf9rbFiCNCGZ-HZsxqt8Bl5zX9ZPyXk.jpeg?auto=webp&amp;s=5535e5ffe6b907e0c2328bc61a474be990f91874"
        },
        "permalink": "/r/movies/comments/1pvilue/the_rip_sneak_peek_netflix/"
    },
    {
        "id": "1pvn1da",
        "author": "onthewall2983",
        "title": "Moby and Michael Mann talk about Heat",
        "content": "",
        "upvotes": 56,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LZmlajWi_u7nQ7bee9ceBfk2ItJQLGm_7kZAV9NeEwY.jpeg?auto=webp&amp;s=37663e37b1c7ebd316642cdba183a262a54115e3"
        },
        "permalink": "/r/movies/comments/1pvn1da/moby_and_michael_mann_talk_about_heat/"
    },
    {
        "id": "1pv7ihc",
        "author": "jamesandlily_forever",
        "title": "Romantic movies with insane chemistry?",
        "content": "Romantic movies with insane chemistry\n\nI just watched 10 Thing I Hate About You and was blown away by the chemistry of Heath and Julia. It immediately became my favorite movie because of how amazing they were together. I really thought they were perfect for their roles.\n\nDoes anyone have any recommendations of movies with a romantic plot where the lead actors have really good chemistry?",
        "upvotes": 526,
        "comments": 312,
        "media": null,
        "permalink": "/r/movies/comments/1pv7ihc/romantic_movies_with_insane_chemistry/"
    },
    {
        "id": "1puxkxp",
        "author": "BulwarkOnline",
        "title": "There Is No Mary Problem in ‘It’s a Wonderful Life’: George’s vision of his wife without him is essential to the film, but critics continue to miss its true—and profound—meaning.",
        "content": "",
        "upvotes": 3131,
        "comments": 298,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9si5gCcEQMa_wz_WYf0qrFzOgDxmYMMpHgRuNL620EE.jpeg?auto=webp&amp;s=1b74c41dfcd97fee32fd96510647a601948e64f2"
        },
        "permalink": "/r/movies/comments/1puxkxp/there_is_no_mary_problem_in_its_a_wonderful_life/"
    },
    {
        "id": "1pvgcbc",
        "author": "darth_vader39",
        "title": "Apex | Official Teaser | Netflix",
        "content": "",
        "upvotes": 85,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/krkKSGUg2R3AZBktdEMgvefc_4DKPVEcQLpvGmJQL2I.jpeg?auto=webp&amp;s=901816b5091b3ca3ad258ec67aad5eaafe4822d5"
        },
        "permalink": "/r/movies/comments/1pvgcbc/apex_official_teaser_netflix/"
    },
    {
        "id": "1pus3t1",
        "author": "MarvelsGrantMan136",
        "title": "Walt Disney Studios Officially First &amp; Only Studio To Cross $6B WW In 2025",
        "content": "",
        "upvotes": 5061,
        "comments": 525,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Zzlg0yd1eAno5tI23Xn8mZMhYRdtdmLKue7IiTsyGMo.jpeg?auto=webp&amp;s=925febec1d8df977eeeb5e296bfb6f7bf70e5412"
        },
        "permalink": "/r/movies/comments/1pus3t1/walt_disney_studios_officially_first_only_studio/"
    },
    {
        "id": "1pv3fya",
        "author": "tylertompkins1995",
        "title": "What was the talk about Eyes Wide Shut when it came out in 1999?",
        "content": "For those of you that saw it in theaters when it came out, please set the scene.\n\nWhat was the overall consensus?  I’ve heard people say that it almost derailed Cruise’s career because of how “weird” it is.\n\nObviously everyone loves it now (including myself), so it’s weird to think the majority of movie-goers were mixed on it.",
        "upvotes": 767,
        "comments": 615,
        "media": null,
        "permalink": "/r/movies/comments/1pv3fya/what_was_the_talk_about_eyes_wide_shut_when_it/"
    },
    {
        "id": "1pvjcif",
        "author": "filmnir",
        "title": "Satoshi Kon’s Tokyo Godfathers has a subtle homage to another Christmas classic baked into it.",
        "content": "If you haven’t seen Tokyo Godfathers yet, you really should watch it. IMO it’s one of the best Christmas movies out there, and on rewatch, you notice more and more little details each time. The big one to stand out for me on this rewatch was that Gin has A Christmas Carol subplot.\n\n\nAt some point, Gin starts calling himself trash and sees himself as inferior to \"regular\" people. He also tells a story about how his daughter died and his wife followed soon after, and that’s why he’s homeless (though it’s later revealed it's actually because he had alcohol and gambling addictions).\n\n\nWhen he goes off on his own, he meets an old man passed out drunk in an alley. The old man is wearing the same exact clothes as Gin, and the old man remarks that Gin reminds him of himself when he was younger.\n\n\nThe old man refers to himself as trash, saying he's as worthless dead as he is alive. Gin scolds the old man and says don’t talk about himself that way. Gin gets to hear what his own words sound like when coming from someone similar to himself\n\n\nThe old man ends up dying with no loved ones and drunk, and his dead body is ripped from the tent and beaten by young kids. This is Gin’s Ghost of Christmas Future warning him of how his life will end up if he doesn’t change his ways. \n\n\nThe next man Gin meets is a doctor that looks eerily the same as him. Same age, same haircut, same facial expression, and nearly the same facial hair. \n\n\nWe find out this doctor coincidentally has the same exact backstory that Gin lied about to Hana and Miyuki earlier. The doctor's daughter died of sickness and his wife died soon after. \n\n\nExcept the doctor didn’t end up homeless. He went on to help people as a doctor, and is getting married to Gin’s daughter ironically enough (also solid commentary on father issues and marrying a man similar to your dad). \n\n\nThe doctor tells Gin he can only live each day trying his best. This is Gin’s Ghost of Christmas Present\n\n\n(Now, Gin looks down after this and notices the doctor wearing a metal leg brace. I don’t know the exact meaning of this, but in the scene afterwards, Hana scolds Gin for running away from his life. However, because the doctor has a leg brace, he never has the option to “run” away from life. Also could be commentary on how disabled people are basically forced to approach life with a positive outlook to be able to survive the world.)\n\n\nThe last of the men Gin meets is a man is literally buried amongst trash (in an apartment). The man has a crippling gambling addction, and almost abandoned his wife. Funnily enough, his backstory is that his child died (presumably stillborn), and his wife was soon to follow because she was getting ready to jump off a bridge. The same backstory Gin tells, and a close enough backstory to the doctor. \n\n\nGin sees his own decisions from a third person perspective, and he yells at the guy to not abandon his wife when she needs him most. If he really loves the woman, he'd be there for her no matter what. This basically allows Gin at redemption for his sins regarding his own wife and child. This is Gin's Ghost of Christmas Past. \n\nGin uses these lessons to fuel the climax, doing whatever it takes to be there for his chosen family, risking his life to save the baby, and reconnects with his daughter.\n\n\nTokyo Godfathers is noted for being more grounded than Satoshi Kon's other works, but if you look close enough, you see he includes magic and surrealism in his subtle own ways, like bringing Christmas Ghosts to life, or like envisioning Tokyo as a magical entity scattered with hidden faces in the buildings. It's truly a wonderful watch.",
        "upvotes": 39,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1pvjcif/satoshi_kons_tokyo_godfathers_has_a_subtle_homage/"
    },
    {
        "id": "1pvbyzr",
        "author": "LaserDiscCurious",
        "title": "Vera-Ellen was an amazing dancer from the Golden Age of Hollywood. Her versatility in various dance styles made her a standout within the genre. Plagued by anorexia rumors and a tragedy, she quit acting in the late 1950s",
        "content": "",
        "upvotes": 127,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cs-Jp0LxMdYGGL0f2JNFBFCXoN4WHzpg6SAb1UDnj9A.jpeg?auto=webp&amp;s=7c79b6af0b15134bbef8141f33d31777bb7c275f"
        },
        "permalink": "/r/movies/comments/1pvbyzr/veraellen_was_an_amazing_dancer_from_the_golden/"
    },
    {
        "id": "1pvnebp",
        "author": "Push-not-pull",
        "title": "What's that song playing in the background in the Home Alone opening scene?",
        "content": "It's not listed on the soundtrack list. It's well blended in the background with all the noise in the house.So you'll need some good speakers or headphones. You can hear it as soon as Kevin is told to pack his suitcase, it's clearly heard when the duffle bag lands on Harry's feet.\n\nIf you have headphones on you can hear the bass and drums. It's a rock song AFAIK.",
        "upvotes": 19,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1pvnebp/whats_that_song_playing_in_the_background_in_the/"
    },
    {
        "id": "1pvhrho",
        "author": "wentworth340",
        "title": "Ken Burns for other countries or cultures?",
        "content": "Who would you consider to be the Ken Burns of other countries/cultures? Or of your country/culture?\n\nI'm not necessarily looking for people as prolific or in the same style, but for documentaries that provide nuanced and indepth versions of important events for people and places outside America.\n\nThanks",
        "upvotes": 37,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1pvhrho/ken_burns_for_other_countries_or_cultures/"
    }
]