[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1r72gcg",
        "author": "Toughgirl-4253",
        "title": "Linea metro 2, voi che ne pensate? Siete fiduciosi per il 2032 o pensate che, di questo passo, faremo prima a inventare il teletrasporto?",
        "content": "Ma parliamone seriamente: abbiamo appena saputo che febbraio è il mese \"cruciale\" per i sondaggi e i nuovi micro-cantieri della **Metro 2** tra Scalo Vanchiglia e Regio Parco. Bene, direte voi. Finalmente si muove qualcosa! Peccato che poi leggi la data di fine lavori: **2032**. Sì, avete letto bene. Tra test, collaudi e pre-esercizio, se tutto va bene, vedremo un treno tra sei anni abbondanti.\n\n**Ma com’è possibile che nel 2026 ci si metta ancora così tanto a costruire una linea della metropolitana?** Capisco la complessità, capisco i sondaggi, ma qui stiamo parlando di tempi biblici. Ci ricordiamo tutti della Linea 1: quasi 15 anni per vederla completata. Sembra che a Torino il tempo si fermi quando si tratta di scavare sottoterra. Mentre nel resto del mondo le città si trasformano in pochi anni, noi ci prepariamo a un decennio di viabilità impazzita e transenne, con la speranza che i nostri nipoti possano prenderla per andare all'università.\n\n",
        "upvotes": 137,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/epdu5b1371kg1.png?auto=webp&amp;s=8302cf181a7297d09c346b1abf29c9bda8047b1a"
        },
        "permalink": "/r/torino/comments/1r72gcg/linea_metro_2_voi_che_ne_pensate_siete_fiduciosi/"
    },
    {
        "id": "1r7ymbu",
        "author": "mattgwa",
        "title": "Weekly international meeting",
        "content": "Hello!\n\nIf you need to make new international friends in Torino and practice languages I organize an international meeting.\n\nIt is held every Tuesday at 8pm at Tipsy, piazza Vittorio Veneto 23B, Torino.\n\nThis project is 100% based on volunteering, 100% no-profit. I don't get any money out of it.\n\nIt's open to everybody, every age.\n\nIt's very useful for those who are new in town and for locals too to make new friends and connections and practice languages.\n\nHere is the link to our WhatsApp group: [https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q](https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q)\n\n... and here's the link to our page on Meetup: [https://www.meetup.com/torino-international](https://www.meetup.com/torino-international)\n\nWhat do you think about my project?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r7ymbu/weekly_international_meeting/"
    },
    {
        "id": "1r7yj8o",
        "author": "SeverusSnark",
        "title": "Inglese per bambini a Torino. Come vi organizzate?",
        "content": "Ciao! Viviamo a Torino e sto cercando idee per aiutare mio figlio a mantenere l'inglese attivo. A scuola fanno poco e anche a casa non riusciamo a fare molto. Qualcuno ha trovato soluzioni, online o offline, che funzionano davvero per i bambini?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r7yj8o/inglese_per_bambini_a_torino_come_vi_organizzate/"
    },
    {
        "id": "1r7xjgt",
        "author": "LostInMyDreams_",
        "title": "Acquisto nuovo pc",
        "content": "Buongiorno,\nNell'immediato sarò costretto a comprare un nuovo pc. \nEviterei assemblati già pronti, quelli parcheggiati negli scaffali delle note catene di negozi di elettronica o venduti online.\nConoscete, mi potete consigliare negozi affidabili onesti, possibilmente in zona Santa Rita o nei paraggi, dove assemblano pc su misura a prezzi onesti??\nGrazie",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1r7xjgt/acquisto_nuovo_pc/"
    },
    {
        "id": "1r7nadh",
        "author": "Dramatic-Brush-7929",
        "title": "Nuova in città",
        "content": "Ciao a tutti, sono Valentina, ho 25 anni e tra qualche settimana mi trasferirò a Torino per lavoro. Non ho mai visitato la città, ma ho avuto feedback molto positivi dalle persone con cui ne ho parlato.\n\nLavorerò in zona Pozzo Strada e pensavo di cercare casa lì o comunque sulla linea della metro. Consigli per quanto riguarda la zona, la sicurezza in generale o altro (cose necessarie da sapere sulla città, …)\n\nGrazie in anticipo",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1r7nadh/nuova_in_città/"
    },
    {
        "id": "1r78vc1",
        "author": "East-Implement-4571",
        "title": "Ragazze nuove in città",
        "content": "Ciao a tutte, mi chiamo Camilla ho 33 anni e mi sono trasferita da poco a Torino. Ci sono ragazze che hanno più o meno la mia età, che sono qui da poco, o a cui comunque farebbe piacere far qualcosa insieme? Anche semplicemente un aperitivo, oppure andare a qualche evento in città :)",
        "upvotes": 9,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1r78vc1/ragazze_nuove_in_città/"
    },
    {
        "id": "1r7c7fp",
        "author": "No_Mortgage_3263",
        "title": "Best place to eat carne di cavallo?",
        "content": "Visiting Italy after a long time and want to eat horse meat sonce I love it and it's not available where I live. However, google search doesn't come up with a lot of answers. Help!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1r7c7fp/best_place_to_eat_carne_di_cavallo/"
    },
    {
        "id": "1r72lxl",
        "author": "Top-Analysis-887",
        "title": "Torino, ma quanto sei bella? Turin is the place to be!",
        "content": "I dati di febbraio parlano chiaro: Torino non è più solo una tappa veloce, ma una vera capitale europea del weekend lungo! È un orgoglio vedere il Museo Egizio e il Museo del Cinema registrare numeri da record proprio in queste settimane. La nostra città ha smesso di essere \"timida\" ed è finalmente sotto i riflettori internazionali che merita.\n\nVoi lo avete notato questo movimento in città? Fatemi sapere qual è il posto che consigliereste assolutamente a un turista che viene qui per la prima volta!",
        "upvotes": 7,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BzkYwXAmEWi2b26OJKgs-K_aivCS0F_LpQEq86CsKOY.jpeg?auto=webp&amp;s=a2376d14d94cfc24fcad6967f9550039577792b0"
        },
        "permalink": "/r/torino/comments/1r72lxl/torino_ma_quanto_sei_bella_turin_is_the_place_to/"
    },
    {
        "id": "1r7hyzr",
        "author": "Delicious_Table_7817",
        "title": "Living in Torino while being an International student",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r7hyzr/living_in_torino_while_being_an_international/"
    },
    {
        "id": "1r674dh",
        "author": "jollanza",
        "title": "Italy's Abandoned Winter Olympic Sites from 2006",
        "content": "",
        "upvotes": 310,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1r674dh/italys_abandoned_winter_olympic_sites_from_2006/"
    },
    {
        "id": "1r75ktz",
        "author": "Queasy_Bee778",
        "title": "Concerto BTS",
        "content": "Ciao! Io e la mia amica stiamo cercando altre persone che da Torino partono per il concerto dei BTS a Parigi, cerchiamo qualcuno che magari voglia unirsi a noi durante il viaggio o chiedere consiglio.😁",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r75ktz/concerto_bts/"
    },
    {
        "id": "1r6dcd3",
        "author": "kacokaj_kejdis",
        "title": "qualcuno di voi lo riconosce sa se gli è successo la stessa cosa a qualcun altro?",
        "content": "ero al mc di porta susa gli mi si avvicina un ragazzo che a sua detta si fa chiamare Mattia è alto 1,80 ed è ligure ad un primo momento da quel che mi dice è un senzatetto e dopo qualche tempo passato con lui me ne vado e poi dopo 15 minuti mi accorgo che mi ha rubato il telefono e sporgo denuncia a qualcun'altro è successo la stessa cosa?",
        "upvotes": 19,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1r6dcd3/qualcuno_di_voi_lo_riconosce_sa_se_gli_è_successo/"
    },
    {
        "id": "1r6nm6c",
        "author": "sha77asHe",
        "title": "Any beginners/intermediate swimmers?",
        "content": "Hi, I'm an expat who doesn't speak the language yet. I have been to multiple pools in Torino and there are master classes in every one of them but all of them in Italian or the timings are so bad that I can't go during work hours. so I'm looking for a swim partner, I'm starting with swimming after many many years and hopefully by the end of this year I want to be at the level I left, I go to gofit italia nowadays.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r6nm6c/any_beginnersintermediate_swimmers/"
    },
    {
        "id": "1r6cndq",
        "author": "bear_onmars",
        "title": "Dove stampare libri universitari?",
        "content": "Ciao. Ho un libro in PDF da stampare. Oggi sono andato in una copisteria e mi hanno detto che non potevano farlo perchè è protetto da copyright. Conoscete copisterie che lo fanno? (nel caso scrivetemelo anche solo in DM)",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1r6cndq/dove_stampare_libri_universitari/"
    },
    {
        "id": "1r671x2",
        "author": "DatStunt",
        "title": "Italy's Abandoned Winter Olympic Sites from 2006",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r671x2/italys_abandoned_winter_olympic_sites_from_2006/"
    },
    {
        "id": "1r6bb02",
        "author": "InevitablePanic3931",
        "title": "Com’è il mercato IT a Torino? (IT support, network, MES, sysadmin, etc)",
        "content": "Ho la possibilità di trasferirmi a Torino alla fine dell’anno per lavoro. Tuttavia, nel caso questa opportunità non andasse a buon fine, quanto è difficile trovare un impiego in città?  \nHo circa 5 anni di esperienza e lavoro con system administration, supporto IT, MES, reti, ecc.  \nÈ una buona città in cui vivere? Il mio italiano non è ancora al 100%, ma conto di migliorarlo bene entro la fine dell’anno.  \nGrazie!",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1r6bb02/comè_il_mercato_it_a_torino_it_support_network/"
    },
    {
        "id": "1r6iano",
        "author": "DiamondbackArmadillo",
        "title": "Country music DJ",
        "content": "I am a vinyl DJ in NYC, and have been focused on country music for the last few years. I will be living in Torino for 3 months, starting in mid-March, and I'm wondering if there is any place (club/bar/pub) that might be interested in hosting a country music night. (I can also do britpop, synthpop/industrial as well, if there are any spots that might need that too.)\nAny ideas?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1r6iano/country_music_dj/"
    },
    {
        "id": "1r673zp",
        "author": "Constant_Mammoth_864",
        "title": "Qualcuno di Perosa Argentina? Come ci si vive?",
        "content": "Ciao ragazzi,\n\nA quanto pare mia moglie finirà a lavorare a Pinerolo. Noi siamo in affitto a Collegno e stavamo pensando di comprare casa a Perosa Argentina. Devo dire che ci sono stato un paio di volte in gioventù ma conosco pochissimo la città e ovviamente prima di fare il passo ci vogliamo informare bene e farci qualche giro. C'è qualcuno qui su reddit che ci vive e la conosce? Cosa ne pensate? Aggiungo che abbiamo un bambino di quasi 6 anni. Grazie ​",
        "upvotes": 7,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1r673zp/qualcuno_di_perosa_argentina_come_ci_si_vive/"
    },
    {
        "id": "1r6a31j",
        "author": "giggi1276",
        "title": "Sistemazione temporanea (tipo residence)",
        "content": "Ciao, \ncerco una sistemazione temporanea a Torino o hinterland sud (tipo Moncalieri) per lavoratore fuori sede. Consigli? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r6a31j/sistemazione_temporanea_tipo_residence/"
    },
    {
        "id": "1r67es9",
        "author": "jinkxiepop",
        "title": "dove comprare quadernini belli?",
        "content": "di solito vado sempre da tiger o da legami ma le grafiche sono un po' tristi e senz'anima. sto cercando posti anche indipendenti che vendano quadernini per fare journaling con delle belle copertine, in altre città conosco librerie indipendenti che vendono anche stampe e quaderni con le suddette in copertina e le trovo meravigliose. fatemi sapere!!!!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1r67es9/dove_comprare_quadernini_belli/"
    },
    {
        "id": "1r67o7v",
        "author": "FutureVirtual6811",
        "title": "Question about residence permit",
        "content": "Hi everyone,\n\nI have a question about my residence permit application and I’m hoping someone here has had a similar experience. I applied my postal kit a few months ago and I have a question.\n\nThere is a document anomaly / missing document in my application. Do I need to submit the missing document immediately, or can I bring it directly to my fingerprinting appointment? My appointment is in 2 months.\n\nAlso, I’m having trouble logging into the Polizia di Stato portal. It says my file is “not found in archive.” However, I can log into the Portale Immigrazione without any issues, and there my application status shows “in istruttoria.”\n\nHas anyone experienced this situation before?\n\n\t•\tShould I be worried about the “not found in archive” message?\n\n\t•\tIs it better to submit the missing document now, or wait and bring it to the fingerprint appointment?\n\nThank you in advance for any advice!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1r67o7v/question_about_residence_permit/"
    },
    {
        "id": "1r63ly4",
        "author": "Pieraldones",
        "title": "Corsi CLA UniTO",
        "content": "Ciao a tutti, qualcuno ha partecipato ai corsi di preparazione alle certificazioni di CLA Unito? (il centro linguistico di ateneo che dovrebbe avere sede a Palazzo nuovo)\n\nIo sono un livello B1 inglese certificato pochi mesi fa ma vorrei migliorarmi e so che da solo, nel mio caso specifico, sarebbe molto complicato.\n\nHo adocchiato i corsi per il B2/C1 avanzato ma vorrei capire, data la scomodità per me e il costo, se ne vale la pena ed è un buon corso. Credo di aver capito che il numero di iscritti non è mai molto numeroso e questo potrebbe aiutare.\n\nGrazie in anticipo a tutti",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r63ly4/corsi_cla_unito/"
    },
    {
        "id": "1r5b7gu",
        "author": "FranzQuintale",
        "title": "Il nuovo fenomeno della metro",
        "content": "Da un po' un nuovo soggetto si è unito alla lunga lista di personaggi pittoreschi che popolano strade e mezzi pubblici di Torino.\n\nIl ragazzo in questione avrà circa 30 anni, molto grasso, e sale sulla metro a Marche.\n\nNon parla, ma cazzo se si fa sentire. Una volta urla a squarciagola come un pazzo, un'altra si mette a fare versi e tocca tutti.\n\nQualcuno conosce la storia di questo ragazzo?\n\n&gt;!E comunque mannaggia a Basaglia, ormai stare tranquilli sui mezzi è impossibile!&lt;",
        "upvotes": 45,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1r5b7gu/il_nuovo_fenomeno_della_metro/"
    },
    {
        "id": "1r5jht5",
        "author": "Pablitos1989",
        "title": "Festa di carnevale e sfide di pingpong",
        "content": "Condivido evento a Torino di Martedì 17 per festeggiare carnevale e in parallelo torneo amatoriale di ping pong\n\nhttps://ciboetrash.it/carnevale-torino-2026/",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uPlYHzjWRWhKPvap7BaiLWj-kCs7hFI0YhXVS66Bl2s.png?auto=webp&amp;s=6bca3895e655fb82565789cd03c9844345521438"
        },
        "permalink": "/r/torino/comments/1r5jht5/festa_di_carnevale_e_sfide_di_pingpong/"
    },
    {
        "id": "1r5f3vu",
        "author": "Terrible_Wrap1928",
        "title": "provider fibra migrazione",
        "content": "Scusate la domanda super stupida, ma per cambiare fornitore della fibra devo prima disdire il contratto precedente e poi sottoscrivere con il nuovo fornitore o basta solo firmare il nuovo contratto e loro se ne occuperanno? \n\nPS colgo l'occasione per chiedere anche consigli su quale gestore luce scegliere, il mese scorso l'appartamento era rimasto vuoto e ho comunque pagato 25 euro per 1 kW con Octopus energy (siamo in due, 60m², solo il forno è a gas)",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1r5f3vu/provider_fibra_migrazione/"
    },
    {
        "id": "1r5hhlq",
        "author": "nazarthinks",
        "title": "Have you ever triggered an alarm at the Turin airport?",
        "content": "",
        "upvotes": 2,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1r5hhlq/have_you_ever_triggered_an_alarm_at_the_turin/"
    },
    {
        "id": "1r4ssag",
        "author": "Impossible_Math_3247",
        "title": "Interesting Things to do on a Saturday Night in Turin",
        "content": "I (25M) am in Turin for uni next week and will fly back Sunday morning. Since most of my classmates are leaving on Saturday night, I have the evening of Saturday to spend in Turin (I am staying close to Porta Nuova).  \nAre there any run clubs, social gatherings, or open events that you would recommend? For context, I study economics in my MSc. and am into running, lifting, and tech. I'd appreciate any recommendations (though I'd prefer avoiding touristy things - not big on sights, museums, etc.)  \nThank you!",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1r4ssag/interesting_things_to_do_on_a_saturday_night_in/"
    },
    {
        "id": "1r4ny32",
        "author": "SgomberiTorino",
        "title": "Come organizzare uno sgombero economico senza buttare soldi (consigli pratici)",
        "content": "Ciao a tutti,\n\ncondivido alcuni consigli pratici per chi deve organizzare uno sgombero (cantina, garage, appartamento) e vuole risparmiare, evitando fregature o costi inutili:\n\n\t1.\tFai una selezione prima\n\nDividi gli oggetti in 3 categorie:\n\n– da tenere\n\n– da buttare\n\n– da regalare / vendere\n\nMeno roba = meno tempo = meno costo.\n\n\t2.\tVerifica se qualcosa ha valore\n\nMobili vecchi, elettrodomestici funzionanti, libri o oggetti vintage possono ridurre il prezzo finale se recuperabili.\n\n\t3.\tChiedi sempre un sopralluogo (anche via foto)\n\nEvita preventivi “a caso”. Foto chiare o un sopralluogo evitano sorprese.\n\n\t4.\tAttenzione allo smaltimento\n\nChiedi sempre se lo smaltimento in discarica è incluso nel prezzo. È una delle voci che fa lievitare i costi.\n\n\t5.\tOrari e accessi contano\n\nPiani alti senza ascensore, ZTL, cortili stretti: se li comunichi prima, eviti rincari all’ultimo momento.\n\n\t6.\tConfronta più preventivi, ma diffida dei prezzi troppo bassi\n\nSpesso nascondono costi extra dopo.\n\nSe avete esperienze, errori da evitare o altri consigli utili, condividete 👇\n\nPuò essere utile a molti.",
        "upvotes": 6,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2xzm0cudehjg1.jpeg?auto=webp&amp;s=d3225dd114e707555c51eca7c9a58cae777ae96c"
        },
        "permalink": "/r/torino/comments/1r4ny32/come_organizzare_uno_sgombero_economico_senza/"
    }
]