[
    {
        "id": "1p0crpj",
        "author": "SarahSchachnerAMA",
        "title": "Hey /r/movies, I’m Sarah Schachner, composer of PREDATOR: BADLANDS (in theaters now). I’ve also scored PREY and many video games in the Assassin's Creed and Call of Duty series. Ask me anything!",
        "content": "Hey r/movies, I’m Sarah Schachner, composer of PREDATOR: BADLANDS (in theaters now). I’ve also scored PREY and many video games in the Assassin's Creed and Call of Duty series. Ask me anything!\n\nBio:\n\nIn addition to co-composing Predator: Badlands, I scored Dan Trachtenberg’s 2022 film Prey. You may have heard my music in video games like Assassin’s Creed: Valhalla, Origins, Unity, Call of Duty: Modern Warfare (2019), Modern Warfare II (2022), Infinite Warfare, Anthem, and others.\n\nBeyond film and games, I’ve composed music for NASA’s Cassini mission to Saturn and created an immersive sound installation for NASA’s Jet Propulsion Laboratory Mission Control. I’ve also written and produced with artists like 070 Shake, Christine and the Queens, Mike Dean, and Travis Scott.\n\nPREDATOR: BADLANDS is out in theaters worldwide now.\n\n&gt;Cast out from its clan, an alien hunter and an unlikely ally embark on a treacherous journey in search of the ultimate adversary.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=43R9l7EkJwE](https://www.youtube.com/watch?v=43R9l7EkJwE)\n\nAsk me anything! I'll be back later today (Tuesday 11/18) at 3 PM ET to answer questions.",
        "upvotes": 590,
        "comments": 249,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qfiaqnbul02g1.png?auto=webp&amp;s=6838621ed2ac8ecdfc5f7551612b4bee65867eb2"
        },
        "permalink": "/r/movies/comments/1p0crpj/hey_rmovies_im_sarah_schachner_composer_of/"
    },
    {
        "id": "1ozw03z",
        "author": "IReallyLoveAMA",
        "title": "Hey r/movies, we’re some of the team behind the new movie I REALLY LOVE MY HUSBAND. It’s a vacation rom-com with a little edge, it premiered at SXSW, and it’s on Amazon and Apple TV now! We are Arta Gee &amp; Madison Lanesey (actors), GG Hawkins (director), and Ryan Thomas (DP). Ask us anything.",
        "content": "Hi reddit! We're the team behind I REALLY LOVE MY HUSBAND, a new rom-com with edge. We made this microbudget film on an island in Panama (sand fleas included!). It premiered earlier this year at SXSW. We are Arta Gee, Ryan Thomas, Madison Lanesey, and GG Hawkins. It's available on digital now.\n\n**Synopsis:**\n\nOne year into their marriage, Teresa (Madison Lanesey) and Drew (Travis Quentin Young) head to the tropical paradise of Bocas del Toro, Panamá, for a long-overdue honeymoon. But as the lush setting strips away their daily routines, Teresa’s perception of her “golden boy” husband begins to shift. When she becomes captivated by Paz (Arta Gee)—a free-spirited expat managing their rental—Teresa proposes an unconventional idea to rekindle their connection… leading to unexpected consequences.\n\n**Here's our trailer:**\n\n[https://www.youtube.com/watch?v=knI2g3s5\\_q4](https://www.youtube.com/watch?v=knI2g3s5_q4)\n\n**And links to the movie:**\n\n* AMAZON: [https://www.amazon.com/I-Really-Love-My-Husband/dp/B0FN9DJX87/](https://www.amazon.com/I-Really-Love-My-Husband/dp/B0FN9DJX87/)\n* GOOGLE PLAY: [https://play.google.com/store/movies/details/I\\_Really\\_Love\\_My\\_Husband?id=VZylWScFvsc.P&amp;hl=en\\_US](https://play.google.com/store/movies/details/I_Really_Love_My_Husband?id=VZylWScFvsc.P&amp;hl=en_US)\n\n**And more:**\n\n* [How to Write a Movie that Shoots in Three Months:](https://nofilmschool.com/shoot-in-three-months#)\n* [Making a Movie Is Scary (This Is How We Manage Our Fear)](https://youtu.be/9DucrmtVTxk?si=kaIyYntYTtLWi6e9)\n* [Previous AMA](https://www.reddit.com/r/cinematography/comments/1ih64du/i_was_the_dp_of_a_feature_that_is_premiering_at/) in [r/Cinematography](https://www.reddit.com/r/Cinematography/):\n\nAsk us anything! We'll be back tomorrow Tuesday November 18 at 3pm ET / 12pm PT to answer questions.",
        "upvotes": 18,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x9yzhlo5jw1g1.jpeg?auto=webp&amp;s=239314dbb5eb53ea840d90c7c020afbb0ef687ee"
        },
        "permalink": "/r/movies/comments/1ozw03z/hey_rmovies_were_some_of_the_team_behind_the_new/"
    },
    {
        "id": "1p0azt0",
        "author": "DamnThatsInsaneLol",
        "title": "Just found out that Eric Roberts holds the record for most screen credits for a living Hollywood actor (800) &amp; he has 94 upcoming projects. In 2017 alone, he acted in 74 films. This year he was in 38 projects. That's crazy",
        "content": "",
        "upvotes": 18062,
        "comments": 1339,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Jwd4IiqJ3q-sUTydO0D7zpxudYgxwTr7z1sPvJvOH5Q.jpeg?auto=webp&amp;s=3df2acb5b01ed77644f687a2c3bbe48b074e10d4"
        },
        "permalink": "/r/movies/comments/1p0azt0/just_found_out_that_eric_roberts_holds_the_record/"
    },
    {
        "id": "1p0nypn",
        "author": "ChiefLeef22",
        "title": "The Official Trailer For Christopher Nolan's 'The Odyssey' Is Reported To Be Attached To Next Month's Screenings Of 'Avatar: Fire &amp; Ash'",
        "content": "",
        "upvotes": 1077,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C4RmFQk0Nwz-1YLZC5EP3rCsuw-0McI3y7QcS7N4HGA.jpeg?auto=webp&amp;s=8d7c07d320eab1e4c70cbec4bc6835599b7f7e6e"
        },
        "permalink": "/r/movies/comments/1p0nypn/the_official_trailer_for_christopher_nolans_the/"
    },
    {
        "id": "1p0pi45",
        "author": "Sufficient_Duck7715",
        "title": "Paramount Denies Warner Bros. Discovery Bid Involves Arab Wealth Funds",
        "content": "",
        "upvotes": 778,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qr7I8sO6EslX9grVT3qPrVQxUw7XhiZ2q3Nx7CtLp5I.jpeg?auto=webp&amp;s=f35b07a451d2001b3d1fda9026bda5a57c73a8c9"
        },
        "permalink": "/r/movies/comments/1p0pi45/paramount_denies_warner_bros_discovery_bid/"
    },
    {
        "id": "1p0cog0",
        "author": "MarvelsGrantMan136",
        "title": "Project Hail Mary | Official Trailer 2",
        "content": "",
        "upvotes": 2623,
        "comments": 788,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RkjgpHa04pgtD5UreOPtySebYixz3aYPj-z7b6Zp1iI.jpeg?auto=webp&amp;s=e6bb7f4c0910f358499dd9766377abaa7c36b8da"
        },
        "permalink": "/r/movies/comments/1p0cog0/project_hail_mary_official_trailer_2/"
    },
    {
        "id": "1p0h8vy",
        "author": "ChiefLeef22",
        "title": "'Wicked: For Good' - Review Thread",
        "content": "*Now demonized as the Wicked Witch of the West, Elphaba lives in exile in the Ozian forest, while Glinda resides at the palace in Emerald City, reveling in the perks of fame and popularity. As an angry mob rises against the Wicked Witch, she'll need to reunite with Glinda to transform herself, and all of Oz, for good.*\n\nDirector: John M. Chu\n\nCast: Cynthia Erivo, Ariana Grande, , Jonathan Bailey, Ethan Slater, Marissa Bode, Jeff Goldblum, Michelle Yeoh, Colman Domingo, Peter Dinklage, Bowen Yang\n\n**Rotten Tomatoes:** [72%](https://www.rottentomatoes.com/m/wicked_for_good)\n\n**Metacritic:** [61 / 100](https://www.metacritic.com/movie/wicked-for-good/)\n\nSome Reviews:\n\n[Next Best Picture - Lauren LaMagna](https://nextbestpicture.com/wicked-for-good/) \\- 7 / 10\n\n&gt;The cast, led by the phenomenal Cynthia Erivo and Ariana Grande, still deliver fantastic work that is supported by excellent crafts from all departments of production. But the source material is inherently weaker than the first, making this a less fulfilling entry as a standalone, even if it compliments Part One as a whole. The additional scenes are not necessary and only exist for the material to be long enough to qualify its own feature film, which also results in pacing issues.\n\n[BBC - Caryn James](https://www.bbc.com/culture/article/20251118-wicked-for-good-review) \\- 4 / 5\n\n&gt;Let's be clear: the Wicked films are the definition of preaching to the choir. They aren't likely to win over anyone sceptical of candy-coloured spectacle and overt sentimentality presented in Broadway show-stopping fashion. Wicked is what it is. But if you're fine with that, this latest instalment is more captivating than the last and enjoyable to watch throughout.\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/11/wicked-for-good-review-jon-chus-part-2-musical-adaptation-1236620980/)\n\n&gt;What can we say about the performances that hasn’t already been said? Both Erivo and Grande could not be better, and in fact Grande really gets a chance to shine here and runs away with the picture whenever she is on screen. Erivo’s Elphaba remains the juiciest role and she defines it with the mortality only movies can bring. Bailey is terrific again, and Goldblum’s Wizard really comes into deep focus now and he’s got it going on. Marissa Bode’s wheelchair-bound Nessarose is given some key screen time and delivers in a piece of casting that is as inspiring as the character she plays. Nathan Crowley outdoes his Oscar winning production design this time around, as does Paul Tazewell’s Oscared Costumes. The visual effects are first rate. So is this whole splendidly realized and cinematic musical adaptation which if you add up the running times of both films comes in just two minutes shy of 5(!) hours. To be honest I wanted *more.*\n\n[The Telegraph - Robbie Collin](https://www.telegraph.co.uk/films/2025/11/18/wicked-for-good-review-second-part-fails-to-take-flight/) \\- 1 / 5\n\n&gt;Ariana Grande is painfully wooden in Wicked’s irritating sequel. What makes it so frustrating is that director Jon M Chu is an established musicals master; his In the Heights is a modern classic of the form. But the corporate stretch-it-out-and-wring-it-dry approach here has been deadening. Even the staunchest defenders of Wicked, the stage musical about the tragic origins of The Wizard of Oz’s Witch of the West, would have to concede that it peaks just before the interval...\n\n[Slant Magazine - Dan Rubins](https://www.slantmagazine.com/film/wicked-for-good-review-cynthia-erivo-ariana-grande-jonathan-bailey/) \\- 2.5 / 5\n\n&gt;But for as sharp as it may sometimes be, *For Good* is stretched out, breathless, and never really emotionally affecting, even on the level of nostalgia. (However bloated, the first film, to quote one of Glinda’s malapropisms, is thrillifying.) It may transport audiences, especially younger ones, to the colorful Oz for the bulk of an afternoon, but it also serves as a reminder that only in its tauter, wrenching stage form can *Wicked*, like a handprint on your heart, really leave you changed for good.\n\n[Loud and Clear - Joseph Tomastik](https://loudandclearreviews.com/wicked-for-good-film-review/)\n\n&gt;*Wicked: For Good* takes many huge swings but misses in baffling fashion, making for a technically impressive but disappointing conclusion to the *Wicked* story. By all accounts, this is the much more difficult half of the story to pull off, as it’s where the musical in particular gets much denser and incorporates many more direct elements from *The Wizard of Oz*. Unfortunately, that difficulty rears its ugly head in *Wicked: For Good*. As ambitious as this movie is for tackling already-unwieldy source material, those ambitions ultimately don’t pay off.\n\n[RogerEbert - Christy Lemire](https://www.rogerebert.com/reviews/wicked-2-for-good-film-review-2025) \\- 3 / 4\n\n&gt;If it sounds like this second half is darker than the first, it is, but it’s also more effective in its consistency of tone. “Wicked” was all fun and games until it wasn’t, and that sudden shift was jarring. In “For Good,” we know from the start that we’re in more serious territory with the deep strings of John Powell’s score as Ozian workers build the Yellow Brick Road. Erivo and Grande find just the right amount of tenderness and sadness with “For Good,” and that bond between them shines bright once more. Poignant and intimate, it’s a legitimate tearjerker. Bring tissues. \n\n[AwardsWatch - Sophia Ciminello](https://awardswatch.com/wicked-for-good-review-jon-m-chu-fails-to-cast-a-spell-with-bloated-fan-service-filled-finale-c/) \\- 'C-'\n\n&gt;Despite stellar work from Erivo and Grande, *Wicked: For Good* can’t justify its existence as its own separate outing. Even with a pair of new songs and a deeper exploration of some of the musical’s beloved characters, the runtime feels bloated and bogged down by Chu’s constant attempts to make this a movie of the moment and to remind audiences of the connection they had to the first film. Simply put, Chu does not add enough new material to make this film feel like much more than a studio cash grab. There’s certainly still magic to be found in the movie for those who are seeking it, but when the credits finally roll, it’s difficult to say that Chu’s additions to this film have changed the world of *Wicked* for the better.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/nov/18/wicked-for-good-review-cynthia-erivo-ariana-grande-jeff-goldblum) \\- 4 / 5\n\n&gt;It’s tangled and a bit bewildering; but then so is the original film, in which we never know whether to believe in the Wizard’s final benediction. But what a performance from Erivo; it is genuinely moving when the Prince has to convince Elphaba what we, the audience, have always known: that she is beautiful.\n\n[FilmHounds - Paul Klein](https://filmhounds.co.uk/2025/11/wicked-for-good-film-review/)\n\n&gt;Erivo, Grande and Bailey are all fantastic once again, and allowed to deepen the characters more and show the complexities of them, while also remaining true to why people love them so much. It's a shame that the rest of the cast are given short shrift. Ethan Slater and Marissa Bode have the rumblings of a more interesting subplot that doesn't really go anywhere as much as it should. Even so, and despite its more frantic nature, *Wicked: For Good* continues to lovingly taking a look at what it means to be a rebel against dictatorships, how people will lie to you to get what they want, and how you must remain true to yourself at all times. It's not so much that the film is disappointing, that would be too harsh a criticism. It's that the film is merely as good as it could be, given what the stage show offers. It wraps things up, but there's no feeling of cohesion – something that was never going to be in Chu's hands, and for what he has, he excels at.\n\n[Independent - Clarisse Loughrey](https://www.the-independent.com/arts-entertainment/films/reviews/wicked-for-good-review-sequel-b2866672.html) \\- 2 / 5\n\n&gt;For Good has little sense of movement, literally or emotionally – no profound revelations, no wonder or spectacle. All that’s to be done now is for each character to process, via standardised ballad, what they’ve learned.",
        "upvotes": 790,
        "comments": 277,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_g-FZfk0LZonE_DiW5HKlhy_JNoapEM-8AIq0zZzh-Y.jpeg?auto=webp&amp;s=2f74edf1345e5706eae1372991d36c507668950e"
        },
        "permalink": "/r/movies/comments/1p0h8vy/wicked_for_good_review_thread/"
    },
    {
        "id": "1p0fw05",
        "author": "Task_Force-191",
        "title": "Official Poster for \"Is this Thing On?\" Starring Will Arnett and Laura Dern",
        "content": "",
        "upvotes": 747,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2nnluimgh12g1.jpeg?auto=webp&amp;s=ebaeb9e52aea42a0ce9213a641c1be78745a7b09"
        },
        "permalink": "/r/movies/comments/1p0fw05/official_poster_for_is_this_thing_on_starring/"
    },
    {
        "id": "1p0lkiu",
        "author": "Task_Force-191",
        "title": "New Posters for ‘The Thing With Feathers’ - After the unexpected death of his wife, a father (Benedict Cumberbatch) begins to slip into a fog of grief as a towering, birdlike presence—blurring the line between hallucination and haunting—slowly invades his home, Crow",
        "content": "",
        "upvotes": 280,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gbqdftmsi22g1.jpeg?auto=webp&amp;s=edfe4d8d97e74609f467f2c132a16443f5f31662"
        },
        "permalink": "/r/movies/comments/1p0lkiu/new_posters_for_the_thing_with_feathers_after_the/"
    },
    {
        "id": "1p0svyo",
        "author": "Raj_Valiant3011",
        "title": "Will There Be More ‘Knives Out’ Movies? Rian Johnson and Daniel Craig Are “Already Starting to Formulate” Ideas",
        "content": "",
        "upvotes": 120,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r87SZVuMXj3f7vcxElesn27b7GCivAdqwO_0B2To6II.jpeg?auto=webp&amp;s=a54b70ce3df1688eb41b8a5ff58e42e99990a2dc"
        },
        "permalink": "/r/movies/comments/1p0svyo/will_there_be_more_knives_out_movies_rian_johnson/"
    },
    {
        "id": "1p06m6i",
        "author": "The_Iceman2288",
        "title": "Deadline: Sadie Sink joins Avengers: Secret Wars",
        "content": "",
        "upvotes": 1850,
        "comments": 326,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1Kx0KD5U7XTAPDpNHIwWRUaHhB8xPZkoxa_veVlqacY.jpeg?auto=webp&amp;s=9343024b71dc0cafc70d59d64169d7087eb3df5c"
        },
        "permalink": "/r/movies/comments/1p06m6i/deadline_sadie_sink_joins_avengers_secret_wars/"
    },
    {
        "id": "1p0g5jb",
        "author": "Bullingdon1973",
        "title": "A.I. Video Is Threatening Our Ability to Trust Documentaries",
        "content": "\"Documentaries fundamentally traffic in issues of truth, transparency and trust. If they use so-called synthetic materials but present them as if they’re “real,” it’s not just a betrayal of the tacit contract between filmmaker and audience. The implications are far broader, and far more serious: a century of shared history is in jeopardy.\"",
        "upvotes": 430,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Bwvwl8NVvlGKWSK2Y1fV45ro7NKtOJpo2RRgWx9XgpE.jpeg?auto=webp&amp;s=54176c81b6887341401eac8ef70527d5f9c8824b"
        },
        "permalink": "/r/movies/comments/1p0g5jb/ai_video_is_threatening_our_ability_to_trust/"
    },
    {
        "id": "1p08z9h",
        "author": "NoCulture3505",
        "title": "Official Poster for ‘Magellan’",
        "content": "",
        "upvotes": 1103,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7uskikbdyz1g1.jpeg?auto=webp&amp;s=5562744c25ab851d36e837a1a878871d67ce5110"
        },
        "permalink": "/r/movies/comments/1p08z9h/official_poster_for_magellan/"
    },
    {
        "id": "1ozsysh",
        "author": "ChiefLeef22",
        "title": "New Image from 'Project Hail Mary'",
        "content": "shared by the man himself, Andy Weir - [https://www.reddit.com/r/ProjectHailMary/comments/1ozk3hg/teaser/](https://www.reddit.com/r/ProjectHailMary/comments/1ozk3hg/teaser/)",
        "upvotes": 22505,
        "comments": 1977,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/djgt76bmxv1g1.jpeg?auto=webp&amp;s=5f43f93125f9f12f6e1d3c3767056a4320b16cff"
        },
        "permalink": "/r/movies/comments/1ozsysh/new_image_from_project_hail_mary/"
    },
    {
        "id": "1p0cwza",
        "author": "Task_Force-191",
        "title": "MAGELLAN - Official Trailer",
        "content": "",
        "upvotes": 420,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bcEBn1uqOM7NCuXCtBmq3uWwo0DM6C0-zeRL1_1pzoo.jpeg?auto=webp&amp;s=f4196ac2ce4f74a78386aac5cff35cdf3f4b5c28"
        },
        "permalink": "/r/movies/comments/1p0cwza/magellan_official_trailer/"
    },
    {
        "id": "1p0n3of",
        "author": "_Laszlo_Cravensworth",
        "title": "Westwood’s Village Theater to be run by American Cinematheque upon 2027 reopening",
        "content": "",
        "upvotes": 74,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ii6XggV2nKJttmlX2wHs4N0Q1C9p6FUecFP4-JyleE4.jpeg?auto=webp&amp;s=61b585d963f83d8f1c5a80fa4963a1de07c0db06"
        },
        "permalink": "/r/movies/comments/1p0n3of/westwoods_village_theater_to_be_run_by_american/"
    },
    {
        "id": "1p002sl",
        "author": "kikimaymay",
        "title": "My dad is dying. Need recommendations for background noise.",
        "content": "Pretty much the title, my dad is losing his battle with cancer and we're trying to find movies that might help with his agitation and anxiety. We got most of the way through the first LotR movie, but I think the battle scenes were too much. We've got the OG Muppet movie on right now, any other suggestions? \n\nEdit:\n\nYou all are simply amazing. I can't tell you how overwhelmingly wonderful it's been to come back to this post and read the suggestions and stories. I'm going to try and nap a little while he's calm (we're taking shifts) and just want you all to know how much these replies of love have meant to my family. We all had a really good cry about a bunch of random strangers taking the time out of their days to share these moments with us. It's really something else. \n\nEdit#2:\nSleeping isn't working (y'all I was crazy for even thinking it) but TNG is. He just told me \"I think they should be allowed to intermarry\". God only knows who he was referencing, but it gave my mom and me a good giggle\n\nEdit: it's 8.15 am here and I think we can call it successfully getting through the night on his part. TNG has been his pick of choice but thank you all for keeping me and my family company through the dark hours. We know he's definitely not going to get better, and it's going to probably still be rough, but these stories are all so seriously beautiful, please keep sharing. It's been a rough year in general for a whole lot of us, it sounds like, but somehow it seems like there's enough love to go around (and I know that's STUPID cheesy but it seems very true to me right now). Love you all, thank you all. ",
        "upvotes": 1843,
        "comments": 1036,
        "media": null,
        "permalink": "/r/movies/comments/1p002sl/my_dad_is_dying_need_recommendations_for/"
    },
    {
        "id": "1p0hxgw",
        "author": "Sirerf",
        "title": "I created an interactive map that lets you explore movies(among other things) based on where and when their stories take place; and what historical events were happening at the same time!",
        "content": "I built **StoryTerra**, an interactive world map where you can explore movies, books, games, and TV shows based on where and when their stories take place, and see what real historical events were unfolding at the same time.\n\nThe platform brings together over **120,000 titles**, all tagged with their narrative time periods and real-world (or closest fictional) locations. You can click on cities, regions, or countries, then use a time slider to browse across centuries, decades, or individual years.\n\nOnce you set a time, the entire map shifts to that era, so you can freely travel the world and see what stories, and real history, were happening everywhere during that time.\n\nYou can also create and share your own lists of stories!\n\nIt's a new way to discovering how fiction and real history intersect.\n\nWould love to have some feedback, I’m always looking to improve it!",
        "upvotes": 99,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0qt9ok0qu12g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1p0hxgw/i_created_an_interactive_map_that_lets_you/"
    },
    {
        "id": "1ozhhew",
        "author": "MarvelsGrantMan136",
        "title": "First Official Images from 'The Legend of Zelda' Movie",
        "content": "",
        "upvotes": 41730,
        "comments": 5040,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/379n8a9ctt1g1.jpeg?auto=webp&amp;s=d91f3619b35febc2b8c8e1dddf6f759978f2fe6d"
        },
        "permalink": "/r/movies/comments/1ozhhew/first_official_images_from_the_legend_of_zelda/"
    },
    {
        "id": "1p0gyxo",
        "author": "General_Stranger2633",
        "title": "What are some Hays Code era movies that ignored the Code?",
        "content": "So for some reason I've been thinking a lot about older movies and the prudish mindset of older Hollywood. I've known about the Hays code which was enforced from the early thirties to the late sixties and I know that media was a lot more risqué before the Code.\n\nHowever I'm just finding out that the hays code was self imposed and not government imposed. Breaking the code wasn't illegal but the movie would basically be blacklisted. I also just learned there were a few popular movies that ignored the code like Some Like It Hot and Psycho.\n\nWhat are some successful movies from the time period that ignored the code?\n\n(Also, I'm kind of fascinated by how the hays code affected not just Hollywood movies but the general zeitgeist.)",
        "upvotes": 99,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1p0gyxo/what_are_some_hays_code_era_movies_that_ignored/"
    },
    {
        "id": "1p0frbn",
        "author": "NoCulture3505",
        "title": "Is This Thing On? | Official Trailer | Searchlight UK",
        "content": "",
        "upvotes": 92,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-0JsatKNwxMS0WIh77cK2jiZUowXrmLuCTpkPe50t7s.jpeg?auto=webp&amp;s=9d199608b735b92bcd6b7329106e70d6dbe414cb"
        },
        "permalink": "/r/movies/comments/1p0frbn/is_this_thing_on_official_trailer_searchlight_uk/"
    },
    {
        "id": "1p0u2nq",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Hikari - Wednesday 11/19 at 5:00 PM ET - Director of 'Rental Family' (Starring Brendan Fraser, In Theaters Friday 11/21)",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/czgda59z742g1.png?auto=webp&amp;s=ef6184c5da4bd489c3587ef741b7d7900307365f"
        },
        "permalink": "/r/movies/comments/1p0u2nq/amaqa_announcement_hikari_wednesday_1119_at_500/"
    },
    {
        "id": "1p0ggda",
        "author": "-greek_user_06-",
        "title": "Pan's Labyrinth is one of the most beautiful films I've watched",
        "content": "I think that Guillermo del Toro will become one of my most favourite producers. He captivated me with \"The Shape of Water\" and he did it again with Pan's Labyrinth. \n\nWhat more can I say about this beautiful film? Everything is phenomenal. The production, the casting, the colors, the practical effects, the music. This is a dark, fairytale full of magic, love and cruelty. It depicts the ugliness of our real world while establishing a mystical universe which is dark and mischievous. \n\nOfelia touched my heart. Her love towards her mother and brother was pure and real. Ivana Baquero did a fantastic job. Her expressions were so spot-on and she captured Ofelia's emotions in a raw way. The rest of the characters were just as remarkable, I loved Faun's mysterious personality and the actor's gestures and body language really brought life to the character (not to mention the amazing makeup and prosthetics). Mercedes was another character whom I felt a strong connection with and as for Captain Vidal, I hated him with a deep passion. Kudos to Sergi López for making me dislike his character so much. \n\nThe depiction of siblings' love really touched me. As someone with a younger sister, I could relate with Ofelia and Mercedes' love towards their brothers. They would give everything to keep them safe no matter what. \n\nThe film really liked to remind us that our world is full of cruel, sadistic people like Vidal. Unfortunately for us, real life is not a fairytale. Sometimes we have to sacrifice many things to achieve a modest life. Ofelia's mother had to endure a wedding which didn't make her truly happy but by doing so, she thought that she would secure a better life for her and her children. Although the fantasy creatures in the movie were mysterious and creepy at times, it was the real people of the movie that gave me the chills. The scene with the farmer and his son made me wince and scream in anger. It is painful to remember that people like Vidal exist, people who find pleasure in causing pain to others and who will not hesitate to do despicable things without blinking an eye. \n\nBut despite the sad tone, there was also a bright side. With hatred there is also love, with despair, hope. Ofelia, Mercedes and Dr. Ferreiro reminded me that people are capable of good things too. These characters showed selflessness and kindness and these actions had a big impact on the film. \n\nThe ending made me a sobbing mess. Emotional yet beautiful. I loved the way it connected with the beginning of the film and how bittersweet it feels. The whole movie in general has a special place in my heart and it has become one of my most favorite movies of the year. I will definitely rewatch it but not too soon. For now, Ofelia and her story have left traces on my heart. ",
        "upvotes": 54,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1p0ggda/pans_labyrinth_is_one_of_the_most_beautiful_films/"
    },
    {
        "id": "1p0l41i",
        "author": "systemstheorist",
        "title": "Tommy (1975) - Eyesight to the Blind - Ann-Margret plays a guilty mother who brings her deeply traumatized adult son Tommy (Roger Daltrey) to be healed by “The Preacher” played by Eric Clapton.",
        "content": "",
        "upvotes": 29,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3onkpieoe22g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1p0l41i/tommy_1975_eyesight_to_the_blind_annmargret_plays/"
    },
    {
        "id": "1oznxpd",
        "author": "SanderSo47",
        "title": "‘Heat 2’: Christian Bale Circling Role In Highly-Anticipated Sequel From Michael Mann",
        "content": "",
        "upvotes": 2665,
        "comments": 289,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ILnZA3gzkg5WAMc3yBu9cCpA7BVyr83n9tJaxJW42Ac.jpeg?auto=webp&amp;s=3b5562223b4bcb7f9b7e63da28fb4a0f1707dab4"
        },
        "permalink": "/r/movies/comments/1oznxpd/heat_2_christian_bale_circling_role_in/"
    },
    {
        "id": "1ozh5ao",
        "author": "ChiefLeef22",
        "title": "James Cameron says he and Robert Rodriguez have sworn a blood oath to make Alita 2 – and maybe 3 too.",
        "content": "",
        "upvotes": 5752,
        "comments": 372,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p6bkDE4H-QDbUkdZ6fA9qkgTULE51H8spjnxVvYu20E.jpeg?auto=webp&amp;s=9be2882b358119a473da0a08b50354018922a609"
        },
        "permalink": "/r/movies/comments/1ozh5ao/james_cameron_says_he_and_robert_rodriguez_have/"
    },
    {
        "id": "1p0fztk",
        "author": "Task_Force-191",
        "title": "The Chronology of Water | Official Trailer UHD",
        "content": "",
        "upvotes": 43,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_tCr5hFGHI1E4FDJwQEGwGCvpkrlsDmuNr1qYdcoec8.jpeg?auto=webp&amp;s=61c523df9ffd7c75d4592d3444305e4b785a1020"
        },
        "permalink": "/r/movies/comments/1p0fztk/the_chronology_of_water_official_trailer_uhd/"
    },
    {
        "id": "1p0rhph",
        "author": "BunyipPouch",
        "title": "New Poster for Historical-Fantasy '100 Nights of Hero' - Starring Maika Monroe, Felicity Jones, Richard E. Grant, Emma Corrin, Nicholas Galitzine, and Charli XCX.",
        "content": "",
        "upvotes": 11,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x44b73zbn32g1.jpeg?auto=webp&amp;s=b729d1c87d5409fe8a01d27c0df9dc059e9f4bbb"
        },
        "permalink": "/r/movies/comments/1p0rhph/new_poster_for_historicalfantasy_100_nights_of/"
    },
    {
        "id": "1p00dek",
        "author": "EconScreenwriter",
        "title": "Ryan Coogler Says DCOM 'Luck of the Irish' Influenced 'Sinners'",
        "content": "",
        "upvotes": 383,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ptaDS3kP2ofT2JBZnfgmnSbiO5P4eubtxImDo0YNj5I.jpeg?auto=webp&amp;s=02c1604b7c032be2798b29c580bef3d1690a50b0"
        },
        "permalink": "/r/movies/comments/1p00dek/ryan_coogler_says_dcom_luck_of_the_irish/"
    },
    {
        "id": "1p0cqra",
        "author": "sensesalt",
        "title": "Michael B. Jordan and Juno Temple Join Cast of Netflix Animation Movie 'Swapped' From Tangled Director",
        "content": "",
        "upvotes": 38,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gsle4ZOpWuQhvsVT1YPcCI4qLi_hksBHEvc4vLXl34w.jpeg?auto=webp&amp;s=334d58040d4cdacc1ff0a1892587d1bf44ec1d9f"
        },
        "permalink": "/r/movies/comments/1p0cqra/michael_b_jordan_and_juno_temple_join_cast_of/"
    }
]