[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 51,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r68bvn",
        "author": "MintySea92",
        "title": "Reality Check: Americas Next Top Model",
        "content": "Tyra, the judges and all the producers on that show were just pure evil towards those girls. They filmed and aired a crime, put many through unnecessary surgeries as well as mentally and physically humiliating them. To then have the gall to justify it all by saying they didnt realise they were hurting them at the time and that they were helping them!!\n\nThe documentary was a hard watch and I hope all the women involved have been able to find some happiness after the trauma they were put through.",
        "upvotes": 858,
        "comments": 556,
        "media": null,
        "permalink": "/r/netflix/comments/1r68bvn/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r6z9j9",
        "author": "HehroMaraFara",
        "title": "Reality Check: America’s Next Top Model",
        "content": "I was getting upset initially because Tyra and all the other trash people involved with the show were just rose colored glasses-ing the useless and abusive drivel that they were responsible for. \n\nThen came halfway through episode two and finally some receipts came out. Then all you hear is the excuses of “we didn’t know then about rape and SA!” \n\nFuck right off everyone involved with the production, we see who you really are. ",
        "upvotes": 22,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1r6z9j9/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r6sn18",
        "author": "Tikitanya6667",
        "title": "Reality Check: Americas next top model",
        "content": "So it’s bad enough that nobody had Keenyah’s back when she was made to feel uncomfortable by a male model BUT for Nigel to say during his interview it’s a reality of that world to deal with harassment (maybe it wouldn’t be if people stood up for other people in those situations) “you as an individual should be able to stand up for yourself and say this isn’t working and figure it out and get the job done there’s people and cameras everywhere.” UM she did try to stand up and she was dismissed. He was harassing her and making her uncomfortable in front of all those “people and cameras” and nobody did a damn thing and she was scolded for speaking up. Like all these years later and after seeing the entire situation that happened between them and he still can’t say we messed up on how we handled that situation we should have protected her? It’s still she should have been able to get the job done regardless of how someone was making her feel… She “needed to be professional” when that man was being a creep &amp; in reality the creep was the one not being professional and should have been scolded not her. “Just take it and shut up”. Smh disgusting.",
        "upvotes": 58,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1r6sn18/reality_check_americas_next_top_model/"
    },
    {
        "id": "1r6exe2",
        "author": "Einsteinssister",
        "title": "Reality Check: Americas Next Top Model severe abuse!",
        "content": "Shandi being raped while completely blacked out, no stopping it, AND then supposedly filming it is absolutely insane. Filming her break up after being raped was so tacky. Why in the world did they even put that into the story line? Shandi faced significant backlash and bullying online. \n\nAlso hearing that they filmed while a girl was showering with another guy was said to be prohibited? Sounds like a bunch of creeps to me.",
        "upvotes": 191,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1r6exe2/reality_check_americas_next_top_model_severe_abuse/"
    },
    {
        "id": "1r663yp",
        "author": "Zokieiei022",
        "title": "Did Don't Look Up age way too well… or was it always this accurate?",
        "content": "I just rewatched Don't Look Up and honestly it hits differently now. When it first came out, I thought it was exaggerated satire. But on a rewatch, the media chaos, political spin, meme culture, people turning everything into a trend… it doesn’t even feel unrealistic anymore.\n\nDo you think the movie was brilliant social commentary, too on-the-nose, or just heavy-handed? And which character do you think was the most realistic?\n\nCurious how everyone feels about it now vs when it first dropped.",
        "upvotes": 621,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1r663yp/did_dont_look_up_age_way_too_well_or_was_it/"
    },
    {
        "id": "1r6m5rx",
        "author": "R_Steelman61",
        "title": "Best comedy - Mom",
        "content": "Wife started watching this and I was skeptical but it's a nightly ritual for us now. Just really funny, great characters and consistent quality.\n\nWhat surprised me is how such a serious topic is handled in a comedy. Somehow they are able to address the topic of addiction and still be able to laugh.\n\nGreat show. ",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r6m5rx/best_comedy_mom/"
    },
    {
        "id": "1r6tole",
        "author": "Middle-Abalone-3142",
        "title": "Most Hooking Shows On Netflix Today",
        "content": "I have just wrapped up some shows and been don’t with Stranger Things since December 31 😢 so I am looking for a new show. Drop the greatest, most intense, or loveable shows in the comments. Preferably a show with more then 1 season (so not really a limited series but more of a show)",
        "upvotes": 7,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1r6tole/most_hooking_shows_on_netflix_today/"
    },
    {
        "id": "1r702mv",
        "author": "Silent-Donkey-1303",
        "title": "In the Mud S01E01...cast question",
        "content": "In the 1st episode...two of mariah's hench women go to the cell where they film the porn videos to collect payment.  One of the henchwomen is really big/ fit. Thick neck. Anyone know the actress ?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r702mv/in_the_mud_s01e01cast_question/"
    },
    {
        "id": "1r6qpx2",
        "author": "TugaCan",
        "title": "Bridgerton",
        "content": "For those of you that read the books, has there been a connection between the families and colours ?\n\nI’m on my second rewatch\n\nI’ve always noticed the infamous Bridgerton Blue, and how the Bridgerton home leans into blue tones\n\nThe Featherington house leans green\n\nBUT\n\nPenelope leans yellow for the most part\n\nAs she walks down the aisle, Yellow by Coldplay is played.\n\nIs this referred to in the books?\n\nOr simply a Shonda tidbit?\n\n(Posting here because for some reason it’s been removed from 2 Bridgerton subreddits) ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r6qpx2/bridgerton/"
    },
    {
        "id": "1r6vm49",
        "author": "AblissMusic",
        "title": "Why do titles play in spatial audio instead of Atmos 99% of the time?",
        "content": "Hi, guys. I have an Atmos enabled soundbar, but for some reason, on Netflix, atmos-compatible titles will play in spatial audio 99% of the time, even though my sound bar, TV, and the title all support atmos. I even bought a 2.1 HDMI cable specifically to fix this issue, cuz I heard older cables don't work with Atmos, but that didn't help \n\nBoth my TV as well as Netflix are up to date and the sound bar is plugged into the Earc port, and my TVs digital audio out is set to passthrough, so I don't think it's an issue with the setup itself\n\nAnother issue I have is even when I do get atmos playback, the effect often doesn't sound that strong. Like there are times where it doesn't even sound like it's playing in Atmos, even though I know it is cuz a badge on my TV pops up saying so. Is this normal? If not, what's going on? \n\nI reached out to customer service and they weren't able to help me. Can someone in this group help me PLEASE???? I've been having this issue for YEARS! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r6vm49/why_do_titles_play_in_spatial_audio_instead_of/"
    },
    {
        "id": "1r6fxdx",
        "author": "Infinite-Albatross44",
        "title": "Your Monster, was really amazing!",
        "content": "“IT’S NOT OK!”\n\nI almost broke down at this moment because the scene is so deeply moving. It honestly feels possibly Oscar worthy. All those times when people run over you and you tell yourself it is ok, even when you know it is not. You keep going anyway, trying not to look unhinged, trying to survive the feeling. It is painfully relatable.\n\nYour Monster carries strong Beauty and the Beast energy with a love story that wrestles with the inner self. It explores the struggle to overcome the distance between loving who you are inside and facing a world that keeps pushing past your boundaries.\n\nJust gorgeous and completely unhinged in the best possible way.\n\nThey also killed the ending!",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r6fxdx/your_monster_was_really_amazing/"
    },
    {
        "id": "1r6qoqn",
        "author": "Candid-Disaster-6064",
        "title": "Some shows are not playing because of Dolby",
        "content": "Hi! i have been having an issue on my computer and hoped that someone could help me. when i go to play certain shows on netflix on my computer, like You or Bridgerton, i get sound but a screen that is black and says “Dolby Vision playback is not authorized on this computer. Please uninstall Dolby Vision to remove this message.” other shows like Gilmore Girls work fine. The weird part is is that sometimes it plays these shows just fine and other times it gives me the notification. I have a lenovo yoga 7 2-in-1. i tried one day to go through my settings and messed with some stuff but ultimately ended up putting everything back the way it was supposed to be. like i said, after that it started giving me the message on and off. it didn’t used to give me this message, it has only been happening for the past couple weeks. any kind of help would be greatly appreciated. thank you all so much in advance!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r6qoqn/some_shows_are_not_playing_because_of_dolby/"
    },
    {
        "id": "1r6pze9",
        "author": "cincinnabunn",
        "title": "any shows that are like squid game/alice in borderland/the 8 show",
        "content": "any shows that have that sort of game show element please recommend them to me as it may be my favourite type of shows 😭😭 it can be from any country as well !",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r6pze9/any_shows_that_are_like_squid_gamealice_in/"
    },
    {
        "id": "1r6b8pb",
        "author": "reaper88911",
        "title": "Issues with rewatching shows?",
        "content": "has anyone else had issues with rewatching shows? I wanted to start LDR again, started an episode then it always goes to \"play next episode\" and plays Lucky 13 instead on the next one in sequence. (its already odd that S4 is at the top.) but most eps are in the \"seen\" stage with the red bar, they play for 1 or 2 seconds then go to the \"playing next\" screen and skip to lucky 13..\n\nwe need a \"start again\" button to reset all the red progress bars i guess.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r6b8pb/issues_with_rewatching_shows/"
    },
    {
        "id": "1r6j14c",
        "author": "WelcomeToWitsEnd",
        "title": "We need more shows like Hack My Home",
        "content": "I'm a little late to the party here, as it came out in 2023, but gosh -- what a great premise for a show. It's the first interior design/renovations show I've seen that puts as much thought and care into what will work for their clients, and the solutions they come up with in regards to small/tight spaces are incredible. \n\nAre there things they could do better? Definitely. I didn't enjoy the bits where they'd bully Brooks, for example. We did not have nearly enough Ati, who was such a warm and welcoming joy in every scene she appeared in. And I'd like a little more vetting of the families beforehand (there was one episode in particular that was low-key upsetting to watch tbh). \n\nBut those are growing pains, and shouldn't disqualify the show from a second season. You had episodes like the Dome House, and episode 7 with the kid who was stuck on a murphy bed in the living room, and you see how life changing it is for them to suddenly have their own space. And I loved the first episode, too -- what they did with that basement blew me away. \n\nI've watched a lot of renovation shows in my time (it's a guilt pleasure of mine) but those shows tend to focus more on appealing to audiences rather than the person who'll be living in that space. This one was such a fresh and fun take. \n\nI know Netflix doesn't lurk here, but maybe if more of us watch it, we can catch Netflix's attention and get a second season, lol ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r6j14c/we_need_more_shows_like_hack_my_home/"
    },
    {
        "id": "1r6jyv7",
        "author": "Nowthecurtainrises",
        "title": "Subtitle Issue",
        "content": "Mom was messing around with the Netflix subtitle options and now the default appearance is completely skewed with white letters and highlight. (This subreddit won’t let me post an imgur link, will try adding one in the comments). The other styles all with backdrops still work.\n\nAttempts to reset, uninstall, reload, and change settings from the app have all proven fruitless to get subtitles back to original style and appearance.\n\nAny help would be appreciated.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r6jyv7/subtitle_issue/"
    },
    {
        "id": "1r6men5",
        "author": "on-a-call",
        "title": "Show off your discontinued profile icons! Here's mine and my girlfriend's.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r6men5/show_off_your_discontinued_profile_icons_heres/"
    },
    {
        "id": "1r5vd00",
        "author": "Sad-Conflict-4435",
        "title": "The Hunting Party",
        "content": "So is anyone else watching this? I tuned in cuz of my love/hate relationship with Melissa Roxburgh. She was in \"Manifest\"...which happens to be one of my all-time favorites. Lmk what's y'all think?",
        "upvotes": 21,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1r5vd00/the_hunting_party/"
    },
    {
        "id": "1r6dv4n",
        "author": "PLUSsignenergy",
        "title": "Help me find a German or Dutch sci/fi show",
        "content": "I remember watching it around 2019 or maybe 2021. It reminds me of the German show, “DARK.” It has a main female protagonist whose brother or someone she knows went missing into the woods. The show revolves around this forest that some believe is being protected by a goddess of Celtic origin that started with an A. I believe the deity was part deer? The deity kidnaps her and chains her up. I think the dear ended up being her brother? \n\nWell, I can’t anything about this! Help! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r6dv4n/help_me_find_a_german_or_dutch_scifi_show/"
    },
    {
        "id": "1r5k2gw",
        "author": "Tomegaro",
        "title": "Mindhunters Similiar Shows",
        "content": "So I just finished Mindhuners and OMG I CAN'T BELIEVE IT TOOK ME THAT LONG TO WATCH IT! Loved everything about it - although the ending of season 2 left a bit to be desired imo. \n\nThe cinematography, Kemper's acting, the interplay between the two FBI agents, and getting into the mind of psychopaths - amazingly told.\n\n  \nAfter finishing it, finished the Ted Bundy series (not as good imo), watched a bit of the Monster: Dahmer series again... \n\n  \nBasically wondering, what would you recommend to watch next that in that realm that's as good as Mindhunters? Documentary, Series, movie, it's allll good ",
        "upvotes": 46,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1r5k2gw/mindhunters_similiar_shows/"
    },
    {
        "id": "1r6o8i4",
        "author": "Whole_Confection_925",
        "title": "Why?!!",
        "content": "Why are a lot of the movies on netflix made in another country, translated to English but have shitty subtitles??? Like for example “the invisible guardian” it’s a really good show but the sub titles do not match the translation. If the translation says “OH my god! That’s terrible!” The subtitles say “ this is bad.” It’s very frustrating!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r6o8i4/why/"
    },
    {
        "id": "1r6ey58",
        "author": "Aromatic-Bad146",
        "title": "How can I complain?",
        "content": "I am based in the U.K. and I try to change my password and it says can’t do this try again later. I chat to them online and they say please manage your account via my account. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r6ey58/how_can_i_complain/"
    },
    {
        "id": "1r5bits",
        "author": "Orangeandjasmine777",
        "title": "ER just appeared on UK Netflix. Should I give it a try?",
        "content": "As I search Netflix for a new show to watch, I notice the American TV show ER recently came to Netflix UK. I realise this show is not a brand new show. \n\nI like medical dramas. New Amsterdamn. Chicago Med. Good Doctor. I also like psychological thrillers. Is ER a little too dated or should I give it a go? ",
        "upvotes": 45,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1r5bits/er_just_appeared_on_uk_netflix_should_i_give_it_a/"
    },
    {
        "id": "1r6d9cr",
        "author": "QuatroAcounto-4",
        "title": "Southland: Miranda Rights non existent",
        "content": "I’m on season 2 episode 3 and I swear I haven’t heard one suspect be mirandized. I know they won’t show it for every arrest because they would get repetitive as hell for a TV show.  But I swear I haven’t heard it once ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r6d9cr/southland_miranda_rights_non_existent/"
    },
    {
        "id": "1r5t9ch",
        "author": "Artvandelay2019",
        "title": "Looking for name of show. Trailer has a group of people robbing a warehouse, tieing everyone up and taking down a safe with a forklift.",
        "content": "I saw the trailer for a show last night on Netflix. The categorie was \"cops\" or some thing similar. I believe it was 6-8 episodes. Wanted to watch it today but can not find it. The description was something about the robbers and the cops following them. It was not a documentary. Does anyone know what it is? I wish I wrote it down. Not sure when It came out",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1r5t9ch/looking_for_name_of_show_trailer_has_a_group_of/"
    },
    {
        "id": "1r5z4kk",
        "author": "trypz",
        "title": "Casting from Phones",
        "content": "Did Netflix make a change on Android so I can't cast to a tv? it is still available on my wife iPhone... it's annoying because I use it to watch shows in hotels and Airbnb's without logging in everywhere... ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r5z4kk/casting_from_phones/"
    },
    {
        "id": "1r52dkf",
        "author": "Immediate_Strike7720",
        "title": "The Lincoln Lawyer",
        "content": "I’ve just finished season 4 and this was by far the best season in my opinion. The whole case and how it played out was done brilliantly as well as integrating the side cases with Lorna. I see that they’ve renewed another season, not sure it can top this one though and wondering if they should’ve ended on a high? What’s everyone else’s thoughts on this? ",
        "upvotes": 90,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1r52dkf/the_lincoln_lawyer/"
    },
    {
        "id": "1r5cp3u",
        "author": "RiskAndReason",
        "title": "Has anyone watched The Museum of Innocence?",
        "content": "I recently started watching The Museum of Innocence and I’m really curious what others think about it.\n\n\n\nDid it capture the emotional depth and atmosphere of the story for you? I feel like it’s more about obsession than plot, and that’s either going to click or completely miss depending on the viewer.\n\n\n\nIf you’ve watched it, did you love it, find it slow, or somewhere in between?",
        "upvotes": 11,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1r5cp3u/has_anyone_watched_the_museum_of_innocence/"
    }
]