[
    {
        "id": "1gqodnj",
        "author": "BunyipPouch",
        "title": "Join us tomorrow (Thursday 11/14) at 4:00 PM ET for a live AMA/Q&amp;A with the cast &amp; crew (director, writer, producer, lead actor, and lead actress) of 'Hell Hath No Fury', an independent comedy-thriller.",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hr7o4207nq0e1.png?auto=webp&amp;s=0295982c5a65335920aca048f55d9c405d7cfe3b"
        },
        "permalink": "/r/movies/comments/1gqodnj/join_us_tomorrow_thursday_1114_at_400_pm_et_for_a/"
    },
    {
        "id": "1gqogko",
        "author": "BunyipPouch",
        "title": "Join us this Friday 11/15 at 3:00 PM ET for a live AMA/Q&amp;A with Janty Yates (Oscar-winning Costume Designer for 'Gladiator') and Dave Crossman (Oscar-nominated Costume Designer for 'Napoleon'). They worked together on Ridley Scott's upcoming 'Gladiator 2'.",
        "content": "",
        "upvotes": 13,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l1xf6n3unq0e1.jpeg?auto=webp&amp;s=01daa31ce212d9754312308409224436d16bf953"
        },
        "permalink": "/r/movies/comments/1gqogko/join_us_this_friday_1115_at_300_pm_et_for_a_live/"
    },
    {
        "id": "1gqkeg8",
        "author": "MarvelsGrantMan136",
        "title": "First Images of Jennifer Lawrence and Robert Pattinson in Lynne Ramsay's 'Die, My Love' - Set in rural America, 'Die, My Love' is a portrait of a woman engulfed by love and madness",
        "content": "",
        "upvotes": 3806,
        "comments": 255,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ew75zijxtp0e1.jpeg?auto=webp&amp;s=2c7d35cfb74952c4ad10e4e6b42754834681cc48"
        },
        "permalink": "/r/movies/comments/1gqkeg8/first_images_of_jennifer_lawrence_and_robert/"
    },
    {
        "id": "1gqhofj",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘THE AMATEUR' Starring Rami Malek",
        "content": "",
        "upvotes": 3606,
        "comments": 478,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cxr1dpjz9p0e1.jpeg?auto=webp&amp;s=bdc351ff19255729f8d6ff902360e58e3519dc7b"
        },
        "permalink": "/r/movies/comments/1gqhofj/official_poster_for_the_amateur_starring_rami/"
    },
    {
        "id": "1gqpobn",
        "author": "kjoro",
        "title": "I binge watched some of the Disney live action remakes and found the creative choices strange.",
        "content": "So I've been bingeing the live action Disney films and I watched the original Lion King when I was a kid. Which I loved\n\nSo watching the remake. The music was surprisingly great and that was the actual highlight for me. I did like Beyonce as Nala. Just my opinion though.\n\nThe visuals were beautiful to look at but I couldn't help but feel it was just a lesser version overall. From actors to pacing and the whole vibe.\n\nLittle Mermaid was...just not good. Again musically it was great but otherwise it just felt like a hacky remake. The visuals were not enjoyable nor the characterisations. Halle did the best she could with what was given.\n\nMulan. Well that's been beaten to death but I actually enjoyed it for what it is. I can't explain beyond that.I like how it took itself seriously and for some reason I couldn't compare it to the original as much. \n\nBeauty and the beast was just strange for me. I genuinely didn't enjoy it. Also I watched Sideways music analysis on the movie which helped bring out the flaws more.\n\nAladdin. I actually enjoyed it and the outfits were incredible. Jafar was not it though. Easily the weakest link.\n\nI do like how Will Smith made it his own but no one can replace Robin Williams. Out of all the remakes. This is the one I enjoyed the most, flaws and all. \n\nI do wish some of Guy Ritchie's personality came through more just because his British humour gets me but alas. Actually the Nordic prince was definitely his humour coming out.\n\nAnd that's how far I've gotten. Again these are my opinions.\n\nEdit: I haven't seen all of the remakes but to complete this post.\n\nI really enjoyed Cruella when I saw it awhile ago. Emma Stone is great at the accent and I really felt immersed in that world. Some dodgy CGI but overall a truly good film.\n\nI didn't enjoy Alice in Wonderland. Weird CGI and it felt...sickly? I felt actively turned off from it.\n\nI haven't seen Maleficent. Maybe soon.",
        "upvotes": 512,
        "comments": 267,
        "media": null,
        "permalink": "/r/movies/comments/1gqpobn/i_binge_watched_some_of_the_disney_live_action/"
    },
    {
        "id": "1gqi2dr",
        "author": "KillerCroc1234567",
        "title": "New character posters for “Y2K”",
        "content": "",
        "upvotes": 1210,
        "comments": 272,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fuhsq_8y0lkDkqpnDW2ATKhP27047b_Q8A8LYYF00dQ.jpg?auto=webp&amp;s=a4544c85c7c8ae5eb4a3d9357e336c79a7aac972"
        },
        "permalink": "/r/movies/comments/1gqi2dr/new_character_posters_for_y2k/"
    },
    {
        "id": "1gqrbhk",
        "author": "TheoBro111",
        "title": "Rewatched Logan Lucky dir. by Steven Soderbergh",
        "content": "I was looking through Netflix for something to watch last night and saw that they had recently added Logan Lucky. I hadn't seen it since its release in 2017 and I didn't have it held in the same regard that I do other Soderbergh movies, so I figured it was due for a rewatch to see how it holds up. By the end of this watch, I just couldn't shake how this film leaps forward to capture our world today. It's frankly impossible to watch this movie as an American after the events of last week and not come away with a firm understanding that this a picture of the rural, red part of the states, and also this is an incredibly fucking hard way to live and a tough way of life. \n\nThe entire cast of this movie gets to something that so many other movies set in the Midwest miss in their tone, the exhaustion of it. It's exhausting for Channing Tatum to work a state away from home, and always be rushing to his daughter, and this bad knee he can't afford to ever get right. Watching Adam Driver portray an armless veteran who still can't get ahead in life because of jail time he did as a teenager is so quietly brutal. Even Daniel Craig as the Popeye-esc explosives guy has moments of real softness that connect throughout. You see it through this whole unbelievably stacked cast, truly the names in these credits are absurd, these parts of the states are beaten down, and as big industry continues to suck the money up the chain, the people are exhausted trying to keep up. It's shown plain and simply, and really who could blame the Logan's for seeing an opportunity to get ahead for once. \n\nEven in a performance I didn't love, Seth Macfarlane as Max Chilblain, he's literally an International billionaire who has forcefully made himself way too big a deal in the lives of midwestern Americans. He has decided through sheer annoying willpower to be a part of this story, and honestly that is so on the nose that it hurts my head. \n\nIf this post is to say anything, it's that I highly recommend revisiting Logan Lucky if not seeking it out for a first time. It's wonderfully made, incredibly written by Jules Asner, and can be watched as a compelling Dukes of Hazard meets Oceans Eleven thriller. But I couldn't help but approach it knowing that it's a story that gives a look into what's actually going on day to day for people living in parts of American that I'm sure feel lost in lots of our national discussion. It's entirely possible that this an overly sincere look and I'm reaching for a hand that doesn't want to be held, so let me know if so. ",
        "upvotes": 263,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1gqrbhk/rewatched_logan_lucky_dir_by_steven_soderbergh/"
    },
    {
        "id": "1gqqnn1",
        "author": "West-Literature-8635",
        "title": "Best animal attack scene in cinema history?",
        "content": "Just had the [bear attack scene from The Revenant](https://youtu.be/_8P8MgsFNZQ?si=XgdqrPdkSMP5Unjw) recommended to me on YouTube and I was just blown away all over again by how realistic, tense and absolutely fucking brutal that scene is. The isolation, the barely perceptible bear chuffing in the background as he walks, the reveal of the bear cubs walking in front of him as the camera swings around to show the mama bear on her hind legs before she charges with full abandon. Then just 5 straight minutes completely helpless as this absolute beast mauls the shit out of him. I think Innaritu's style is the perfect vessel for this kind of scene, it's not over-the-top and there's no music but the sound design is still the star of the show and the bear is never in focus enough for any sort of goofy effects to ruin the impact\n\nIs there any scene from any other movie that can top it?",
        "upvotes": 288,
        "comments": 396,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ao-ua_OVT6dmERxgFYbFgBbwsAz_O6TMYquZC0CTDxY.jpg?auto=webp&amp;s=e15ba053909d4616cfe1f3b73ef6fa19f2e6c709"
        },
        "permalink": "/r/movies/comments/1gqqnn1/best_animal_attack_scene_in_cinema_history/"
    },
    {
        "id": "1gqhqyo",
        "author": "KillerCroc1234567",
        "title": "The Amateur | Official Trailer",
        "content": "",
        "upvotes": 836,
        "comments": 210,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MBCFwIu0apCrArsfCLlqnkM74IlDWRuDMvY6kutKzmc.jpg?auto=webp&amp;s=1c2717092c567eadda1d58f040e6712896151a81"
        },
        "permalink": "/r/movies/comments/1gqhqyo/the_amateur_official_trailer/"
    },
    {
        "id": "1gqxc70",
        "author": "PhoenixRising724",
        "title": "Is there a director who in your opinion has slipped but you still continue to watch?",
        "content": "I saw the trailer for Lindsey Lohan’s new Christmas movie and it is what it is but when I saw it was directed by Stephen Herek I got excited. From Critters to Mr. Holland’s Opus he made some really enjoyable movies but nothing after that entertained me as much. Does anyone else continue to watch a director hoping they can recapture some of their earlier magic?",
        "upvotes": 64,
        "comments": 225,
        "media": null,
        "permalink": "/r/movies/comments/1gqxc70/is_there_a_director_who_in_your_opinion_has/"
    },
    {
        "id": "1gqkhoy",
        "author": "feztones",
        "title": "ANORA -- and why her ethnicity mattered",
        "content": "Like many of you, I was SO excited to watch Anora from the moment I heard about it; but perhaps for a different reason. \"Anora\" is a very very traditional, old-school Uzbek name. It's a name your grandmother that was born in an Uzbek village would have (compare it to a name like Bertha, or Doris). Most importantly, it's a name that's generally recognizable to Russians as being Uzbek, or Central Asian at least.\n\nIn the Soviet Union, Uzbeks were the third most populous ethnicity right after Russians and Ukrainians. During the USSR, Uzbeks (and Central Asians in general) were seen as backwards savages compared to Slavs. Since the dissolution of the USSR, over a million Uzbeks reside in Russia as migrant workers. They face A LOT of racism and legal discrimination to the point that it's very common for most Russian landlords to explicitly advertise that they won't rent to Uzbeks. To put it plainly, Uzbeks are perceived pretty negatively and they're looked down upon in Russia. Uzbek women in particular also have a stereotype in post- USSR countries, as well as places like Dubai and India, as being prostitutes.\n\nThis is why I thought it was so brilliant that Anora in the movie was going to be Uzbek. Every single review or article about the movie initially said that she was Uzbek, so I was surprised that it was never mentioned in the movie. I recently read an article with the director however that Anora is supposed to be Russian, which honestly takes away a lot from the movie for me. It would have made so much more sense why Anora had the relationship with Russian that she did, and it would give yet another reason why Vanya's parents didn't accept her. The USSR racism against Central Asian carries over to post-USSR communities in the US. Brighton Beach, where the movie takes place, is home to half of all Uzbeks that reside in the US. I grew up going there a lot, and I remember feeling slightly embarrassed and ashamed every time I would go to Russian markets or restaurants because I'd get dirty looks for being visibly Uzbek. I always refused to identify with anything Russian even though my parents were from the USSR and raised me with a lot of Russian media/culture. I just didn't feel comfortable having anything to do with it when so many Russians looked down on my people.\n\nSo if you take the fact that Anora is a sex worker and combine it with the fact that she is from a \"low-class\" culture in Russia, doesn't it make even more sense why Vanya's mom was soo mean to Anora and rushed over there? And why Anora wanted Vanya to approve of her and defend her so badly? \n\nAlso, I just can't believe it's a coincidence that Mikey Madison looks remarkably central asian compared to the average Slavic Russian, and she was given a Central Asian/Uzbek name in the movie. I wonder if she was initially supposed to be Uzbek-American, but that aspect was later changed due to a fear of backlash from the Central Asian community? Anyways, I hope this can add some context to y'all.",
        "upvotes": 360,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1gqkhoy/anora_and_why_her_ethnicity_mattered/"
    },
    {
        "id": "1gqdhor",
        "author": "MarvelsGrantMan136",
        "title": "Y2K | Official Trailer 2 | A24",
        "content": "",
        "upvotes": 687,
        "comments": 351,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_B5zP0Ljkv6u_cMVhox4xtYb8ARrVsIc7xTHWGExmOA.jpg?auto=webp&amp;s=bd142f381cb72a3fa30057b90c87c36a6c0143d7"
        },
        "permalink": "/r/movies/comments/1gqdhor/y2k_official_trailer_2_a24/"
    },
    {
        "id": "1gqdpr7",
        "author": "Bennett1984",
        "title": "How To Make Millions Before Grandma Dies | Official Trailer ",
        "content": "",
        "upvotes": 333,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5v98pEK0QHrB9ldIt8nwIKbUnPhSwI6je7xzEDA1q78.jpg?auto=webp&amp;s=3d0d3a847a9486c11720944ca196eed544ce38fb"
        },
        "permalink": "/r/movies/comments/1gqdpr7/how_to_make_millions_before_grandma_dies_official/"
    },
    {
        "id": "1gqpucf",
        "author": "Old-Professor205",
        "title": "A Man From Earth; 2007- SciFi",
        "content": "What are your thoughts on this film? I watched it when it released back in 2007. I was unaware at the time that the writer was Jerome Bixby (“It’s A Good Life” among other great works). I rewatch it again recently and the themes, thought provoking dialogue, and interesting characters really hold up. With a budget of $200,000 and shot over eight days this film and the writing is remarkable.",
        "upvotes": 60,
        "comments": 67,
        "media": null,
        "permalink": "/r/movies/comments/1gqpucf/a_man_from_earth_2007_scifi/"
    },
    {
        "id": "1gqh984",
        "author": "bill7chaos201",
        "title": "FURY",
        "content": "so im gonna be honest,I was watching FURY last night and im a girl who doesnt tend to cry at movies,infact i have NEVER cried at a movie before.But this one did it for me like *it genuinely hurt me*.but dont get me wrong it was an amazing movie but by the end i was balling my eyes out. It just hit me in a place iv never been hit before\n\nFURY  \n10/10  \nwould recommend.",
        "upvotes": 167,
        "comments": 149,
        "media": null,
        "permalink": "/r/movies/comments/1gqh984/fury/"
    },
    {
        "id": "1gqz1pw",
        "author": "ZenPaperclips",
        "title": "Any 60's/70's era lesser known films you'd recommend? ",
        "content": "I could use Google, but I don't necessarily want the consensus best stuff. I trust the average redditor more for that info =]\n\nI've neglected most films released prior to my birth and want to fix that. Bonus points for lesser known stuff. Things you saw and liked but never garnered widespread recognition. Any genre. Any budget. Foreign films ok, even encouraged.\n\nPlease give me one or three recommendations you have from the 60s-70s era in filmmaking. Thanks!",
        "upvotes": 12,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1gqz1pw/any_60s70s_era_lesser_known_films_youd_recommend/"
    },
    {
        "id": "1gqn9br",
        "author": "indiewire",
        "title": "Renate Reinsve on 'Armand,' Her Most Demanding Role Yet",
        "content": "",
        "upvotes": 68,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/caELvBLqLanUVYbS6CmGYMc0WwxsWt1GY8lDO6SMscE.jpg?auto=webp&amp;s=16a29a450980ae54f17a142e26b0696dde12fa85"
        },
        "permalink": "/r/movies/comments/1gqn9br/renate_reinsve_on_armand_her_most_demanding_role/"
    },
    {
        "id": "1gqqw42",
        "author": "Thick_Stand2852",
        "title": "Any good classic movies to watch on a date?",
        "content": "I’ve been dating this amazing guy that studies at the film academy, we’ve been going on dates where we watch really good older movies together (we’re both in our early 20’s so older is anything before 2000).\n\nWe take turns picking movies and this time it’s my turn. Last time I picked Awakenings, as I’m a medicine major and I had read the book by Oliver Sacks. Luckily the movie was pretty good. This time I have no idea what to pick.\n\nI think emotional, deep movies is what we’re going for. Does anyone have any good recommendations so I can seem cool and impress him?🙏🏻",
        "upvotes": 37,
        "comments": 218,
        "media": null,
        "permalink": "/r/movies/comments/1gqqw42/any_good_classic_movies_to_watch_on_a_date/"
    },
    {
        "id": "1gpx5fd",
        "author": "MarvelsGrantMan136",
        "title": "Lupita Nyong’o to Star in Christopher Nolan’s Latest Film",
        "content": "",
        "upvotes": 3881,
        "comments": 332,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4nk03AxH99HWTc9pxEtcvjXFEHzDgk7e9Il5Mlzf_uM.jpg?auto=webp&amp;s=14181849dc40f336ee1319a5458576c38f340ba4"
        },
        "permalink": "/r/movies/comments/1gpx5fd/lupita_nyongo_to_star_in_christopher_nolans/"
    },
    {
        "id": "1gr0g95",
        "author": "HotOne9364",
        "title": "The Pirates of the Caribbean sequels made one huge mistake that forever tainted them.",
        "content": "They focused way too much on Jack Sparrow.\n\nI don't wanna hear any smartass reply on how \"then they wouldn't have been successful\". That's not what this is about. \n\nThe first film wasn't the best film ever made but it was enjoyable for what it was. The production values,  the sense of fun, and Geoffrey Rush are what made that film what it is. Jack Sparrow worked as a supporting character but he wasn't the lead; Will Turner and Elizabeth Swann were. Their love story is right up there with Peter Parker and Mary Jane, Shrek and Fiona, Sam and Mikeila, Homer and Marge, etc. Will &amp; Elizabeth were the heart and soul that grounded the film while Sparrow was the side attraction. \n\nWhen the sequels focused more on Sparrow, it felt like that Simpsons episode where Homer created a character to help Itchy &amp; Scratchy's ratings and he'd ask \"Everytime Poochie's not on screen, a character has to say, 'Where's Poochie?'\". Everything has to revolve around him for some reason. It was ridiculous and made him a Mary Sue. It didn't help that none of the films developed Sparrow. He was a completely static character. Even Optimus Prime in the Bayformer movies had more character development. So watching him as a lead was simply boring and it ultimately became an excuse to stroke Johnny Depp's massive ego.\n\nThese sequels could have been so much better. Just focus on Will &amp; Elizabeth, develop them as characters, focus less on spectacle and more on story, I guarantee you, the films still would have made money. Not saying Sparrow not be included; they just needed to stop idolizing him.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1gr0g95/the_pirates_of_the_caribbean_sequels_made_one/"
    },
    {
        "id": "1gpznug",
        "author": "MarvelsGrantMan136",
        "title": "John Mayer, McG Team to Buy Historic Jim Henson Lot in Hollywood for $60M - The storied property had been the subject of bid speculation from the Church of Scientology",
        "content": "",
        "upvotes": 2266,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NBIDsL2TWLnT_EzrqcSeUcB_M1xcTvlIueSjSGcY2Sc.jpg?auto=webp&amp;s=0efbd44212f32ecfb9184be7a4c057cbd44e1bed"
        },
        "permalink": "/r/movies/comments/1gpznug/john_mayer_mcg_team_to_buy_historic_jim_henson/"
    },
    {
        "id": "1gqzi9x",
        "author": "sprintcarsBR",
        "title": "What are your favorite line deliveries? ",
        "content": "It doesn’t matter how good the movie was or even if the actor did their best throughout the movie. What scene had an actor absolutely nail a line delivery that made you believe they meant it. \n\nThe two examples that come to mind for me are Nick Nolte in Tropic Thunder when he says “We’ll take them off the fucking grid!” when he first pitches throwing the actors into the jungle on the beach. The second is Anthony Hopkins in The Edge. A beautifully shot movie with both great and hammed up acting, but when he riles up Alec Baldwin to kill the bear. They repeat back “What one man can do another can do!” Followed by Anthony absolutely killing the final line of the scene “because today, I’m going to kill the motherfucker.” It always sends chills down my spine. \n\nI know I’m being a hypocrite asking this, but any links to scenes that are referenced is greatly appreciated. \n\n***EDIT: Please include the name of the movie.***",
        "upvotes": 7,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1gqzi9x/what_are_your_favorite_line_deliveries/"
    }
]