[
    {
        "id": "1mnchtr",
        "author": "AmyBergAMA",
        "title": "Hi reddit, I'm Amy Berg. My newest documentary, IT'S NEVER OVER, JEFF BUCKLEY, is out in theaters now, about the life of musician Jeff Buckley. I've also directed DELIVER US FROM EVIL (Oscar-nominated for Best Documentary) and WEST OF MEMPHIS (BAFTA-nominated for Best Documentary). Ask me anything!",
        "content": "Hi reddit, I'm Amy Berg. My newest documentary, IT'S NEVER OVER, JEFF BUCKLEY, is out in theaters now, about the life of musician Jeff Buckley. I've also directed DELIVER US FROM EVIL (Oscar-nominated for Best Documentary) and WEST OF MEMPHIS (BAFTA-nominated for Best Documentary). Ask me anything!\n\n**Here's the trailer for IT'S NEVER OVER, JEFF BUCKLEY:**\n\n[https://youtu.be/DRrcgLRX8Qc?si=mya7FRx6kqS4q8-L](https://youtu.be/DRrcgLRX8Qc?si=mya7FRx6kqS4q8-L)\n\nIT'S NEVER OVER, JEFF BUCKLEY premiered at Sundance earlier this year is out in theaters starting August 8th, 2025 via Magnolia Pictures. \n\nAsk me anything! I'll be back at 5 PM ET today (Monday 8/11) to answer your questions.\n\n**Other information about the film:**\n\nIT’S NEVER OVER: JEFF BUCKLEY, directed by Oscar-nominated filmmaker Amy Berg (DELIVER US FROM EVIL, JANIS: LITTLE GIRL BLUE, WEST OF MEMPHIS), covers the life of the rising young star with an otherworldly voice and boundary-pushing artistry, who left the '90s music world reeling when he died suddenly, at age 30, after the release of his critically acclaimed debut album “Grace.” Told through never-before-seen footage from Buckley’s archives and intimate accounts from his mother Mary Guibert, former partners Rebecca Moore and Joan Wasser, Jeff’s former bandmates, including Michael Tighe and Parker Kindred, and luminaries like Ben Harper and Aimee Mann, IT’S NEVER OVER, JEFF BUCKLEY illuminates one of modern music’s most influential and enigmatic figures.\n\nAs part of the theatrical release of IT’S NEVER OVER, JEFF BUCKLEY, Magnolia Pictures will proudly present 26 minutes of exclusive, remastered footage from a rare solo performance at The Middle East in Cambridge, MA, filmed on February 19, 1994, six months before the release of Grace. This previously unreleased material will screen immediately following the film and will only be available when the film hits theaters on August 8th, for an extremely limited time, offering both longtime fans and newcomers alike a rare opportunity to experience Jeff Buckley’s raw, unfiltered brilliance.”\n\n* Directed by Amy Berg\n* Produced by Ryan Heller, Christine Connor, Mandy Chang, Matthew Roozen, Jennie Bedusa and Amy Berg.\n* Executive Produced by Mary Guibert, Alison Raykovich, Brian A. Kates, Michael Bloom, Jennifer Westin, Maria Zuckerman, Brad Pitt, Ian Stratford.\n\n**Bio information:**\n\nAmy Berg is a critically acclaimed, Oscar and Emmy nominated documentary filmmaker. Her first film, Deliver Us From Evil, was nominated for an Academy Award and a DGA Award for Outstanding Directorial Achievement in Documentary in 2007. She then went on to direct West of Memphis, in collaboration with producers Peter Jackson and Fran Walsh. \n\nIn 2013, Amy’s psychological thriller Every Secret Thing (starring Diane Lane, Dakota Fanning, Elizabeth Banks, Common, and Danielle MacDonald) was purchased by IFC. She then directed An Open Secret, a documentary about the exploitation and sexual abuse of young actors, followed by an introspective look at a religious cult, Prophet’s Prey, made in association with Showtime and Imagine Entertainment. Her project about music legend Janis Joplin, Janis: Little Girl Blue, premiered at the Venice and Toronto Film Festivals followed by a theatrical release in fall 2015.\n\nWith Amy at the helm, her company Disarming Films has been producing long form documentary features and docuseries for broadcast for over a decade. Projects include The Case Against Adnan Syed (HBO), We Are: The Brooklyn Saints (NETFLIX), the Emmy award winning series Dogs (NETFLIX) in which Amy directed the groundbreaking episode, “Bravo Zeus” and Phoenix Rising (HBO). Upcoming releases include dramatic independent feature The Wilderness and documentary It’s Never Over, Jeff Buckley which premiered at Sundance 2025 and is set to release later this year.\n\nTalk to you all later! AMA!",
        "upvotes": 389,
        "comments": 138,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ez2sbfwj0eif1.png?auto=webp&amp;s=b8993ce645afc941e18fddf05538173d3705b511"
        },
        "permalink": "/r/movies/comments/1mnchtr/hi_reddit_im_amy_berg_my_newest_documentary_its/"
    },
    {
        "id": "1mnp8tu",
        "author": "SanderSo47",
        "title": "August 8-10 Box Office Recap – 'Weapons' debuts with a fantastic $43.5M domestically and $71.8M worldwide, and getting an \"A–\" on CinemaScore, rare for a horror. 'Freakier Friday' debuts with a solid $28.5M domestically and $43.8M worldwide. 'Fantastic Four' crosses $400M, but it's fading quickly.",
        "content": "https://preview.redd.it/y40bdbedggif1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=55c0e5eee8fa9187d049396605e67fa21521cda3\n\nThis was a very busy weekend for theaters, with two newcomers pulling some pretty good numbers. \n\nYou'd think ***Freakier Friday*** would easily dominate the weekend thanks to nostalgia and the original film's popularity. But despite a very solid opening, the actual king of the weekend was WB/New Line's ***Weapons***, which pulled a crazy debut for an original title and further cements Zach Cregger as a box office draw. Meanwhile, ***The Fantastic Four: First Steps*** was hit by another steep drop this weekend.\n\nThe Top 10 earned a combined $126.2 million this weekend. That's down 18.5% from last year, when both ***Deadpool &amp; Wolverine*** and ***It Ends with Us*** earned over $50 million, while ***Borderlands*** massively flopped.\n\nAt the top spot, WB/New Line's ***Weapons*** debuted with a fantastic $43.5 million in 3,202 theaters. Funny enough, the final number was $43,501,**217**. In one single weekend, it already surpassed the domestic lifetime of director Zach Cregger's previous film, ***Barbarian*** ($40.8 million). \n\nAnother impressive fact: second original horror film of the year to hit $40 million on its opening weekend, just after ***Sinners*** ($48 million). WB also achieved an incredible feat: this is the studio's seventh #1 opening this year and it's also the sixth in a row to debut with over $40 million. This is something no studio has ever accomplished.\n\nHow could it open this high? Especially when ***Barbarian*** didn't get this high? In spite of that film's performance, the film quickly earned a cult following in streaming and home media, which raised Zach Cregger's profile in horror circles. So everyone is obviously curious to know what he can do next. But most importantly, he followed up the film with an interesting premise: 17 kids from the same classroom vanished from their homes at 2:17am and never came back.\n\nCredit must go to WB for an incredible marketing campaign. They properly laid out the mystery and horror aspect, without spoiling much about the film. The film's cryptic posters and videos also helped raise curiosity. And the film's iconic kid run has been mimicked online, raising further awareness. Another advantage was the lack of horror competition: ***I Know What You Did Last Summer*** fell quickly and ***Together*** was very niche, which allowed ***Weapons*** to reach out horror fans. And finally, the reviews: it's sitting at a fantastic 95% on RT and 81 on Metacritic. It's simply a perfect combination where everything simply clicked.\n\nAccording to Warner Bros., 58% of the audience was male, and 69% was in the 18-34 demographic. Reportedly, 27% of the audience watched the film because Cregger was the director, which is something very encouraging. His name was plasted all over the marketing, even more than the actors. The debut suggests he has become a box office draw in horror circles. Not easy to accomplish that. But the good news don't stop there. Horror is usually front-loaded, but ***Weapons*** dropped just 23% on Saturday and 19% on Sunday, better than usual for horror. And judging by its reception, it's easy to see why.\n\nAudiences gave ***Weapons*** a great \"A–\" on CinemaScore, which is insanely hard for a horror film to achieve. What does this mean? That the film will enjoy fantastic word of mouth and have better legs than usual for horror. Thanks to a very empty August, it should easily hit $130 million domestically, and that's just a conservative prediction. Don't be surprised if it winds up higher. Whatever the case, ***Weapons*** is set for a very healthy run. Cregger already has set his next film (a ***Resident Evil*** reboot for next September), and it looks like his future is shining bright.\n\nIn second place, Disney's ***Freakier Friday*** debuted with $28.5 million in 3,975 theaters. That's above the original's $22.2 million debut, although in terms of attendance, it was below the original. Still, considering the hit-and-miss state of comedies in theaters, we'll take this as a win.\n\nThere aren't much high expectations; the budget was just $42 million, which means it will be easily profitable. But it still feels like the film could've done a bit better than this. After all, the original is one of Lohan's and Curtis' most popular films, growing audiences over the past 22 years. Disney pretty much sold the film as another wacky comedy adventure; on one hand, it kept the same spirit and tone as the original, but on the other, it couldn't overcome the \"been there, done that\" feeling of other legacy sequels (even if the film involved more body swapping).\n\nThere's also the belief that those curious will probably wait for streaming. After all, it's why comedies have been struggling to break out in theaters. Even with positive reviews (73% on RT), this is just solely for the fans. In some concerning news, the film was a bit front-loaded; it dropped 29% on Saturday, when a 20% drop is the normal drop. Looks like audiences prioritized watching something called ***Freakier Friday*** on Friday.\n\nAccording to Disney, a massive 71% of the audience was female, and 66% was 35 and under. They gave it a strong \"A\" on CinemaScore, which is actually above the original. August is quite empty, so there's room for some good legs. For now, the film should hit around $90 million, but it remains a question mark if it will pass the original's $110 million domestic total.\n\nAfter its disappointing second weekend performance, ***The Fantastic Four: First Steps*** had another bad weekend. It fell to third place, plummeting a steep 59% and grossing $15.7 million this weekend. These drops are eerily similar to ***Quantumania*** (69.9% second weekend, 59.9% second weekend), indicating the public is losing interest at a rapid pace. It lost IMAX screens to ***Weapons***, but that's not an excuse; ***Superman*** fell 57.5% on its third weekend when ***F4*** opened, but that was a $117 million opener from the same genre, not a R-rated original horror film. So how could ***F4*** still collapse 59%?\n\nThrough 17 days, the film has earned $230.6 million domestically. Its opening weekend was $8 million behind ***Superman***, and now it's running $58.7 million behind. If the film doesn't stabilize soon, it could finish below the 2005 film's adjusted total ($272 million), which would be a huge disappointment.\n\nIn fourth place, DreamWorks' ***The Bad Guys*** added $10.5 million this weekend. That's a very rough 52% drop, which is very bad for an animated film; those films are known for having great legs. For contrast, the original dropped just 32.2% on its second weekend. Hell, the drop is also steeper than Pixar's ***Elio*** (50%) this year. This is very disappointing considering the film is not facing any animated competition. \n\nNow, there's still some good news. Through 10 days, the film has made $43.6 million, which is actually just $1 million behind the original through the same point. Even though the weekend drop is bad, it still posted very strong weekdays, which are actually better than the original. The hope is that it can continue legging out through the empty August.\n\nIn fifth place, Paramount's ***The Naked Gun*** fell a rough 51% on its second weekend, earning $8.3 million. But in a similar case to ***The Bad Guys 2***; bad weekend drop, but strong weekdays. Through 10 days, the film has earned $32.9 million domestically, becoming Liam Neeson's biggest film as leading star since ***The Commuter*** ($36.3 million). The film should finish with around $50 million domestically.\n\n***Superman*** dropped 42%, grossing $7.9 million. The film has amassed $331.3 million, and it should finish wih around $355 million domestically.\n\nIn seventh place, ***Jurassic World Rebirth*** dropped 45%, adding $4.8 million this weekend. The film's domestic total stands at $326.9 million, and it looks to finish with around $340 million domestically.\n\nThe best drop in the Top 10 belonged to ***F1***. It eased just 30% for a $2.9 million weekend. The film has earned $178.6 million, and with a confirmed IMAX re-release this Friday, it will continue holding very well through August.\n\nNeon's ***Together*** had a pretty great debut last week, but it was hit hard by the arrival of ***Weapons***. The film collapsed 63%, adding $2.5 million this weekend. That takes its 12-day total to $17.1 million, and it looks to finish with a little below $25 million.\n\nRounding out the Top 10 was Angel Studios' ***Sketch***, which flopped with $2.4 million in 2,157 theaters ($4.9 million five-day). The film showed promise on Wednesday, debuting with $1.9 million, but it collapsed by 73% the following day. Even with an \"A–\" on CinemaScore, it looks like the film will be quite front-loaded.\n\n#**OVERSEAS**\n\n***Weapons*** opened with a pretty great $28.3 million overseas, for a fantastic $71.8 million worldwide debut. That's one of the greatest debuts for an original horror film, and like the domestic number, it already surpassed the lifetime gross of ***Barbarian*** ($45 million). The best debuts were in the UK ($3.6M), Mexico ($2.7M), France ($2M), Australia ($1.8M) and Spain ($1.6M). It remains to be seen how it holds up in these markets, but right now, the film is set to earn over $200 million worldwide by the end of its run. And like the domestic market, that's a conservative prediction. \n\n***The Fantastic Four: First Steps*** is also collapsing overseas. This weekend, it earned $17.5 million, which represents another steep 56% drop, and taking its worldwide total to $435.3 million. The best markets are the UK ($25.5M), Mexico ($24.2M), France ($12.5M), Brazil ($11.6M) and Australia ($9.7M). The film is not showing signs of stability, which is very alarming considering the film's high costs (the budget is reported at \"more than $200 million\" and over $100 million in marketing). If it doesn't start holding well, there's a strong possibility it could miss $500 million worldwide. Missing $550 million is already very disappointing, but missing $500 million is flop territory.\n\nIn Japan, ***Demon Slayer: Kimetsu no Yaiba Infinity Castle*** continues making history. The film's total in the country is now ¥20.31 billion ($137.9 million) after 22 days. It has registered a staggering 14.7 million ticket sales and has become the 12th most-watched film of all time in Japan. It's not showing signs of slowing down in the slightest. The film is also registering insane pre-sales in other East Asian markets, indicating it's going to try to take down ***Mugen Train*** ($507 million).\n\n***Jurassic World Rebirth*** earned $16.1 million this weekend, allowing it cross $800 million worldwide. A big portion of this was from its final market, Japan, where the film debuted with $7.5 million, despite heavy competition from ***Demon Slayer: Kimetsu no Yaiba Infinity Castle***. The best markets are China ($78.1M), the UK ($45.3M), Mexico ($35.3M), Germany ($30.5M) and France ($26.6M). Without any other market left, it should finish with around $875 million.\n\n***Freakier Friday*** debuted with $15.2 million overseas, for a $43.8 million worldwide debut. The best debuts were in Mexico ($2.8M), UK ($2.4M), Australia ($1.4M), Argentina ($800K) and Colombia ($800K). Pretty good debuts in Latin America, but quite soft in other markets. Nevertheless, it's not a bad place to start, given overseas accounted for just 31% of the original's gross.\n\n***F1*** continues impressing outside America. It added $11.7 million overseas, taking its worldwide total to a fantastic $571 million. The best markets are China ($57M), the UK ($28.9M), Korea ($28.2M), France ($27.9M) and Mexico ($19.6M). With IMAX on the horizon, it's gonna crack the $600 million milestone very soon.\n\n***The Bad Guys 2*** added $9.3 million overseas, for a $84.3 million worldwide total. The best markets are the UK ($9.9M), France ($4.7M), Mexico ($3.6M), Spain ($3.5M) and South Korea ($2M). It still has a lot of markets left.\n\n***The Naked Gun*** added $6.2 million overseas, for a $56.3 million worldwide run. The best markets are the UK ($5.9M), Germany ($4M), Netherlands ($1.3M), Mexico ($1.2M) and Austria ($728K). Like ***The Bad Guys 2***, it still has some big markets left to open.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Thunderbolts* | May/2 | Disney | $74,300,608 | $190,274,328 | $382,436,365 | $180M\n*28 Years Later* | Jun/20 | Sony | $30,002,966 | $70,446,897 | $150,149,648 | $60M\n\n- Marvel's ***Thunderbolts*** has closed with a very weak $190 million domestically and $382 million worldwide, failing to break even. Despite positive reviews and solid word of mouth, the public simply wasn't interested in finding what that asterisk meant in the film. Especially when the MCU was coming off the absolute mess that was ***Brave New World***. Even with the good word of mouth and promoting the ***New Avengers*** title after the opening weekend, the film had very average legs. Building good will is important, but when people aren't watching it, what's there left? How will Marvel move with these characters in the future? We know they will be in ***Doomsday***, but how plot relevant will they be? Only time will tell.\n\n- Sony's ***28 Years Later*** has closed with $70 million domestically and $150 million worldwide. That's pretty much 2.5x its budget, so it pretty much broke even. The high trailer views suggested there would be a gigantic film on its way, but the film proved to be more niche and front-loaded than expected. But the film still ended on an okay note, money-wise. Word of mouth was polarizing (particularly for its ending), but the film will probably enjoy a good afterlife in home media and streaming. There's already ***The Bone Temple*** set for January, now it's up in the air to see if Sony will greenlight the third and final installment.\n\n#**THIS WEEKEND**\n\nTwo newcomers, but with ***Weapons*** heading for a crazy run, none are a threat in taking the top spot.\n\nUniversal is releasing ***Nobody 2***, just 4 years after the original premiered. It was a victim of COVID release, but it still made a solid $57 million worldwide, and its popularity grew in streaming and home media. You get pretty much what you'd expect: Bob Odenkirk kicking ass. Without any R-rated action film on the horizon, it could attract those fans and help it leg out through the empty August.\n\nLionsgate is also releasing crime thriller ***Americana***, which stars Sydney Sweeney, Paul Walter Hauser, Halsey, Eric Dane, Zahn McClarnon, and Simon Rex. The film premiered at SXSW and earned very positive reviews... but there's two things. First, it has a 100% on RT... but it's just 7 reviews. Second, it premiered at SXSW... back in 2023. It sat on the shelf until Lionsgate bought it in March 2024, and it's now barely getting released. With a limited campaign and low buzz, it'd be a surprise if it broke out.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 117,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hxgrjJ9_UQ2faSXXv0joqaqht3esxOcbjhWrRm9w_ec.png?auto=webp&amp;s=829049f680f15e99380898711b99b46b53a80cc2"
        },
        "permalink": "/r/movies/comments/1mnp8tu/august_810_box_office_recap_weapons_debuts_with_a/"
    },
    {
        "id": "1mnpaus",
        "author": "MarvelsGrantMan136",
        "title": "Alan Tudyk Says He Got Dropped From ‘I, Robot’ Publicity After Testing Higher Than Will Smith With Test Screening Audiences",
        "content": "",
        "upvotes": 29673,
        "comments": 2081,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/So8j9AKVM370qxfbFRp29Pyv4dC74mymgMdUIKc_p80.png?auto=webp&amp;s=ffd7ffbadf0475da82d904fa65fa300400fa170e"
        },
        "permalink": "/r/movies/comments/1mnpaus/alan_tudyk_says_he_got_dropped_from_i_robot/"
    },
    {
        "id": "1mnrv0n",
        "author": "MarvelsGrantMan136",
        "title": "AMC Theatres to Trim Pre-Show by 4 to 5 Minutes, CEO Says",
        "content": "",
        "upvotes": 3048,
        "comments": 527,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/I9INi8TXX_72u9g-wHYijzoLTntZ4vbDT0zVzi2b75U.jpeg?auto=webp&amp;s=c62cc256b05a4ed1dbadf07bdd8116552ee4c308"
        },
        "permalink": "/r/movies/comments/1mnrv0n/amc_theatres_to_trim_preshow_by_4_to_5_minutes/"
    },
    {
        "id": "1mnedp7",
        "author": "CorleoneBaloney",
        "title": "A scene from Lincoln (2012) where abolitionist and statesman Thaddeus Stevens answers a question on racial equality to help pass the 13th Amendment to end slavery in America.",
        "content": "For further context: Thaddeus Stevens was asked by Abraham Lincoln and his abolitionist allies to tone down his words in order to gain votes from conservative Republicans, leaning Democrats, and win the general public.\n\nHe needed to declare that the passing of the 13th Amendment was not for racial equality but for equality before the law. Establishing it as a matter of racial equality might have lost support, as it was considered too radical at the time.",
        "upvotes": 7733,
        "comments": 631,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vn9c66tngeif1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mnedp7/a_scene_from_lincoln_2012_where_abolitionist_and/"
    },
    {
        "id": "1mns5b0",
        "author": "NoCulture3505",
        "title": "‘Naked Gun’ Producers Seth MacFarlane and Erica Huggins Talk Greenlight Hurdles and Sequel Possibilities",
        "content": "",
        "upvotes": 719,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/I8L4FH_k-fZXCsTGG9pNDJxoEVU4Ivlm87o84hxcFuw.jpeg?auto=webp&amp;s=03b9d01f2a8f6a5489d566d43ba8504279205ca2"
        },
        "permalink": "/r/movies/comments/1mns5b0/naked_gun_producers_seth_macfarlane_and_erica/"
    },
    {
        "id": "1mnsteh",
        "author": "Material-Reality3761",
        "title": "Napoleon was the Worst Let Down in Recent Movie History",
        "content": "I wanted to see his rise through the revolution, his ascension to the throne, and his repeated spanking of the Austrians and Italians. Him outmaneuvering and destroying British-lead coalition after coalition. His blunder in Spain after he decreed his brother king and ignited an already incalcitrant Spanish population leading to a long and bloody guerilla war. Then his inevitable, doomed march East into the maw of the Russian steppe. His frozen retreat, both of his exiles. There is so much more to this man and his significance.\n\nInstead we got Josephine on screen for 80 minutes.\n\nRidley Scott is on my do-not-see list now. His last great film was The Martian. His cut of Kingdom of Heaven is still in my top 5 of all time list. I just think he's lost his touch (no offense, the guy is almost 90)",
        "upvotes": 639,
        "comments": 207,
        "media": null,
        "permalink": "/r/movies/comments/1mnsteh/napoleon_was_the_worst_let_down_in_recent_movie/"
    },
    {
        "id": "1mndx4x",
        "author": "1961Deckard",
        "title": "Esther Williams, Swim With Tom and Jerry, \"Dangerous When Wet\", 1953.",
        "content": "Dangerous When Wet\" (1953), is a musical and a romantic comedy, starring Esther Williams and Fernando Lamas and directed by Charles Walters.\nIt includes a famous animated scene in which Esther Williams swims underwater with Tom and Jerry.\n\nEsther Williams was known as the “Hollywood mermaid” for her aquatic films.\nThe sequence with Tom and Jerry was MGM's idea to give a novel touch and take advantage of the popularity of the characters. It became one of the most remembered scenes in Esther Williams' entire filmography.\nThis film was one of MGM's last great water musicals, as the genre began to decline in the mid-1950s.",
        "upvotes": 2977,
        "comments": 70,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/uajphj6ldeif1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mndx4x/esther_williams_swim_with_tom_and_jerry_dangerous/"
    },
    {
        "id": "1mnnhoj",
        "author": "MarvelsGrantMan136",
        "title": "‘Shrek 5’ Release Date Delayed to June 30, 2027",
        "content": "",
        "upvotes": 919,
        "comments": 161,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2m60yUDacSiWArOagsawrBnyNQVTqVZ6N9_TgFjmFr8.jpeg?auto=webp&amp;s=7d3e26a4e1310359fb553bcd6fce95763861a0c3"
        },
        "permalink": "/r/movies/comments/1mnnhoj/shrek_5_release_date_delayed_to_june_30_2027/"
    },
    {
        "id": "1mnm4p9",
        "author": "MoneyLibrarian9032",
        "title": "First poster for ‘BONE LAKE’ The horror film follows 2 couples who mistakenly double-booked the same vacation rental and their weekend turns into a bloody battle for survival.",
        "content": "",
        "upvotes": 910,
        "comments": 158,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mpc9qlcyvfif1.jpeg?auto=webp&amp;s=be6660257daa15fb2ddc789c9e9d36bcca136a16"
        },
        "permalink": "/r/movies/comments/1mnm4p9/first_poster_for_bone_lake_the_horror_film/"
    },
    {
        "id": "1mnh6ea",
        "author": "MarvelsGrantMan136",
        "title": "Austin Abrams Confirmed to Star in Zach Cregger's 'Resident Evil' Movie",
        "content": "",
        "upvotes": 1602,
        "comments": 236,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k2Ec6_VExrJZAxbIqWsteCUY43W1YnCz3QRNusest2U.jpeg?auto=webp&amp;s=f92fb512f4afd769b5801ebd3d875727ec7ac6ab"
        },
        "permalink": "/r/movies/comments/1mnh6ea/austin_abrams_confirmed_to_star_in_zach_creggers/"
    },
    {
        "id": "1mnbgjy",
        "author": "MarvelsGrantMan136",
        "title": "Greta Gerwig's 'Chronicles of Narnia' Movie Begins Filming",
        "content": "",
        "upvotes": 2437,
        "comments": 974,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7AYnDgm6mgx5DUUEFzrrOVMpSyld-DsXhom43cRv09A.jpeg?auto=webp&amp;s=c2ad441c9719688c9094707c1c1ebd9b8f9bf3cb"
        },
        "permalink": "/r/movies/comments/1mnbgjy/greta_gerwigs_chronicles_of_narnia_movie_begins/"
    },
    {
        "id": "1mnljar",
        "author": "DemiFiendRSA",
        "title": "Channing Tatum and Rebecca Wang Join ‘Demon Slayer: Kimetsu no Yaiba Infinity Castle’ English Dub Cast",
        "content": "",
        "upvotes": 694,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Eu8DuLe_lD20bu4oZlmXJv1mGdXIP32BAr8yS1Q-VIs.jpeg?auto=webp&amp;s=67766c755ed9259afbd30229e1f4542208738708"
        },
        "permalink": "/r/movies/comments/1mnljar/channing_tatum_and_rebecca_wang_join_demon_slayer/"
    },
    {
        "id": "1mnet6n",
        "author": "darth_vader39",
        "title": "AMC Theatres Narrows 2nd Quarter Loss to $4.7 Million as Revenue Jumps 36% on 'Sinners,' 'F1' Success",
        "content": "",
        "upvotes": 1183,
        "comments": 157,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6hW9yMD_XE8QH03r4dkMMKT1zdBuvt9sFkOloBhkFE0.jpeg?auto=webp&amp;s=70dec4e3e6bac93d74db5eeaa949a942f5f15777"
        },
        "permalink": "/r/movies/comments/1mnet6n/amc_theatres_narrows_2nd_quarter_loss_to_47/"
    },
    {
        "id": "1mn5qyc",
        "author": "stonecoldmark",
        "title": "Popstar: Never Stop Never Stopping….",
        "content": "I watched this movie tonight because my Netflix mentioned it was leaving this week. \n\nI never saw this movie before and was interested 1) because the director behind the new naked gun movie did this. \n\n2) several Redditors called it the funniest movie nobody has ever seen. \n\nI have to agree, I laughed out loud several times. I love a good parody of serious topics, this felt like the Spinal Tap for a new era. \nThe shots taken at TMZ were hilarious. The way it was shot was so mtv like. Just so good. \n\nI am ashamed that it took 9 years to watch it, but I’m buying the blu ray, because it has high rewatch value. \n\nAbsolutely hilarious! ",
        "upvotes": 5102,
        "comments": 603,
        "media": null,
        "permalink": "/r/movies/comments/1mn5qyc/popstar_never_stop_never_stopping/"
    },
    {
        "id": "1mo0ciz",
        "author": "Street-Engineering70",
        "title": "Watching movies &amp; tv shows from the 90s and homes don't look lived in anymore. Why?",
        "content": "If you look at the sets of movies and TV shows from the 90s (and I'm not talking sitcoms), homes looked real, messy, lived in. The shelves were full of clutter and the refrigerators had pictures all over them and colorful cereal boxes on top. \n\nNow everything looks like a staged showroom set and is perfectly clean. Is it a budget thing? \n\nI remember reading an article a few years ago that referenced Eyes Wide Shut and how the kitchen looked compared to new movies but I can't find it now so maybe someone here knows. \n\nIt's just so unrealistic. Especially in drama movies or tv shows. The houses literally are spotless and lifeless. I was watching When Harry Met Sally and the party scene at their friend's house struck me like wow, the shelves are full of books and clutter and rolled up newspapers and random knicknacks and it looked amazing and real. \n\nStuff now just feels...sterile.",
        "upvotes": 66,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1mo0ciz/watching_movies_tv_shows_from_the_90s_and_homes/"
    },
    {
        "id": "1mnnecv",
        "author": "MoviesMod",
        "title": "Buster Keaton in the climax of 1925's Seven Chances",
        "content": "",
        "upvotes": 250,
        "comments": 34,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/992rr87h4gif1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mnnecv/buster_keaton_in_the_climax_of_1925s_seven_chances/"
    },
    {
        "id": "1mo15rn",
        "author": "krakatoot1",
        "title": "Best Villain death in a film??",
        "content": "I’m talking about moments where the death scenes are not only spectacular but moments where you think, ‘God Damn, now that guy, had it coming’.   \n\n  Spoilers \n\nMyself, I got to go with Wes Studi’s Death from Last of the Mohicans.    The way Micheal Mann shot it is amazing, it really looks like a painting.   But more than that, it is a slow, brutal death for just an awful, AWFUL person.     \n\n\nWhat about you?  What at some others?",
        "upvotes": 22,
        "comments": 132,
        "media": null,
        "permalink": "/r/movies/comments/1mo15rn/best_villain_death_in_a_film/"
    },
    {
        "id": "1mntg04",
        "author": "DemiFiendRSA",
        "title": "'Wednesday' Creators Alfred Gough &amp; Miles Millar Working On New 'Addams Family' Animated Reboot Film",
        "content": "",
        "upvotes": 44,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AwzxeDnMnsjZPOtqWfv7-rxWdEuR_bDrnHHQ580XJwA.jpeg?auto=webp&amp;s=54cf61297759f1933e1303afdc99daff6e4bce7b"
        },
        "permalink": "/r/movies/comments/1mntg04/wednesday_creators_alfred_gough_miles_millar/"
    },
    {
        "id": "1mmt044",
        "author": "LookAtThatBacon",
        "title": "During the development of the Harriet Tubman biopic movie, a Hollywood executive once suggested that Julia Roberts should play her. What are some other baffling casting suggestions/choices that have been made?",
        "content": "Source for the title: https://www.cbsnews.com/news/a-studio-executive-wanted-julia-roberts-to-play-harriet-tubman-biopic-screenwriter-says/\n\n&gt; The Harriet Tubman biopic has been more than 25 years in the making. In the historical drama released earlier this month, Cynthia Erivo plays the legendary abolitionist — but one Hollywood executive initially thought the role should go to Julia Roberts. \n\n&gt; Gregory Allen Howard, the screenwriter and producer of \"Harriet,\" recently revealed in multiple interviews that Roberts was suggested to play the lead role during a meeting with a studio president in 1994. \n\n&gt; \"The climate in Hollywood… was very different back then,\" Howard said. \"I was told how one studio head said in a meeting, 'This script is fantastic. Let's get Julia Roberts to play Harriet Tubman.'\"\n\n&gt; Howard said that a black person in the meeting said casting Roberts would be impossible because she is white. \n\n&gt; \"That was so long ago. No one will know that,\" the executive replied, according to Howard.",
        "upvotes": 7653,
        "comments": 2109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/20gJ0s46pu8k9FISABZVPy7JSAv2_PBiXnTLVtjdsjA.png?auto=webp&amp;s=b1343136842a700e6ddd9136840210bee2fdeb7b"
        },
        "permalink": "/r/movies/comments/1mmt044/during_the_development_of_the_harriet_tubman/"
    },
    {
        "id": "1mntquf",
        "author": "-janusjanus-",
        "title": "Watching Bombshell. I think John Lithgow really has quite a bit of range. Which actors you think have the most range?",
        "content": "A lot of actors in Hollywood have a bread-and-butter role but once in a while do something different which surprise you. Think of Adam Sandler. He's like 95% doing his usual brand of comedy (man-child, insulting/sarcastic yet somehow also a nice guy deep inside), and once in a while he does something different, the most clear and successful example being Uncut Gems, though there are other examples too (Punch-Drunk Love, Reign Over Me).\n\nBut then you got guys like John Lithgow who is just amazing when you think about his range. This guy done all kinds of things and yet I often think of him as kind of under the radar. That's me personally I mean. Yet he's  been in Cliffhanger, Footloose, Blow Out, Shrek,, Love Is Strange, and Killers of the Flower Moon, and Love Is Strange. And let's not forget The World According to Garp. Oh, and from what gave him the most exposure for me personally: 3rd Rock from the Sun. And in Bombshell, another fantastic performance, he just disappears in the role. Makes it look so easy. Never seems like he's \"acting.\"\n\nWho are some actors who really mix it up and done all sorts of work, and done it well. And shown they are comfortable in comedy, drama, action, horror, etc.",
        "upvotes": 38,
        "comments": 104,
        "media": null,
        "permalink": "/r/movies/comments/1mntquf/watching_bombshell_i_think_john_lithgow_really/"
    },
    {
        "id": "1mnj88m",
        "author": "NoCulture3505",
        "title": "Max Minghella In Talks To Join DC Studios’ ‘Clayface’",
        "content": "",
        "upvotes": 116,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xxrNXB2F-xeGANLHIriJyDFfP9HfICtDn71MOaNT1Z8.jpeg?auto=webp&amp;s=6e954eac750c319a99c8dac3d047903f9451501e"
        },
        "permalink": "/r/movies/comments/1mnj88m/max_minghella_in_talks_to_join_dc_studios_clayface/"
    },
    {
        "id": "1mnrcm3",
        "author": "Adventurous-Way1293",
        "title": "What’s the most well made “based on a true story” movie in terms of authenticity and sticking to the real facts&amp;events without too many “Hollywood additions”",
        "content": "I would have to choose “soul surfer” bc at the end of the movie you can see the “receipts” with actual real footage of Bethany and the scenes were spot on!\nI REALLY liked that and that what’s inspired me to write cause I would love to see more movies about stories like hers\nGave me the chills honestly 🥹",
        "upvotes": 38,
        "comments": 142,
        "media": null,
        "permalink": "/r/movies/comments/1mnrcm3/whats_the_most_well_made_based_on_a_true_story/"
    },
    {
        "id": "1mnk4fh",
        "author": "Mattone_Martello",
        "title": "What do you think of Hayao Miyazaki's \"Porco Rosso\"?",
        "content": "I ask you this question because I consider Porco Rosso my favorite animated film. It's admirable how it manages to be truly accessible to anyone, of all ages. It is, for me, a great film for the way in which it mixes an excellent theme (that of man profoundly changed by war) with spectacular and colorful action scenes. Not to mention the wonderful settings on the Adriatic Sea, and the protagonist himself. Marco is tremendously interesting because, in the end, he is neither a saint nor a hero, he is a man of great skill and affinity with planes; but also a \"pig\". Literally a \"pig\". \nI also really love all the anti-fascist morality. Overall, Porco Rosso is a manifesto of freedom both in the heavens and on the ground. \n\nWhat do you think of this film?",
        "upvotes": 83,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1mnk4fh/what_do_you_think_of_hayao_miyazakis_porco_rosso/"
    },
    {
        "id": "1mnzu3u",
        "author": "gunslinger_006",
        "title": "Bring Her Back",
        "content": "Wow.   Just.   Wow.  \n\nI went into this movie after absolutely loving Talk To Me.  \n\nI was expecting another straight up horror movie.  \n\nThis was so much more.   \n\nBring Her Back is a tremendously powerful and brutal tale about grief and trauma.  About what can happen to us if we let trauma twist our insides to the point of completely losing who we are and what we thought we believed in.  \n\nIs it scary?  Absolutely.  \n\nDoes it deserve to live in the “horror” genre?  Absolutely.  \n\nDoes it feature some truly horrific visuals?  Absolutely. \n\nBut this film floored me.  It has a heart, deeply broken heart that cannot ever be repaired.  \n\nAs a parent to a young girl, this story ripped me in half.  \n\nThis film is a tour of the depths of parental misery and loss.  \n\nIt made me feel crazy inside that by the end, I found myself actually feeling some kind of empathy for the antagonist.  \n\nAnd i suspect that was the point.  \n\nI dont know what the writers/directors were trying to do, but what they ended up doing was creating a blistering and jaw dropping nightmare about unprocessed trauma and grief.  \n\nIts going to be a long time before i watch this film again.  I need to sit with it for a while and let myself finish feeling what its done to me.  \n\nThe only other film that had ever had this strong an effect on me was Requiem For A Dream.\n\nIf you are considering seeing this film, i encourage you to give it your full and complete attention.  I watched it with a pair of really good headphones, in a completely dark room and i highly recommend that as the viewing experience.  \n\nI cannot remember the last time a film managed to make me feel this combination of both horrifying grief but also gratitude.  \n\nI went and crawled into my daughters bed after seeing this and just held her, listening to the sound of her breathing.  \n\nI had no idea this film was going to make me feel so grateful, alongside feeling absolutely horrified for the kids in this film.  \n\nThats all i have for now.  \n\nThis film was truly special.  \n\n\n",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1mnzu3u/bring_her_back/"
    },
    {
        "id": "1mo2476",
        "author": "jmah24",
        "title": "Any other movies like Wonka (2023)?",
        "content": "It's the first movie I've watched in a long time that made me (37m) feel like a kid again. Most of the movies I love are more sci-fi/action with some comedy/drama sprinkled in.\n\nWonka really hit the mark on being you can't believe what you're seeing, but part of you wants to believe you're just watching magic. It felt like it was made for people that were kids in the 90's, it just had that absurdity level that you know what's going to come next, you know it's going to be ridiculous, and yet it's still heartwarming and/or funny that you just don't care.\n\nAnything else in the same vein made in the last 10-15 years?",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1mo2476/any_other_movies_like_wonka_2023/"
    },
    {
        "id": "1mnbp20",
        "author": "darth_vader39",
        "title": "Apple Reveals Premiere Date of ‘Mr. Scorsese’ From Director Rebecca Miller",
        "content": "",
        "upvotes": 150,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KzLbsxIv6W7uvmUTiJJjCi2-WCOrAozr4dLK9OijrUY.jpeg?auto=webp&amp;s=da8d969f4d211553a329f8aa7a4c471e1ad3a9c2"
        },
        "permalink": "/r/movies/comments/1mnbp20/apple_reveals_premiere_date_of_mr_scorsese_from/"
    },
    {
        "id": "1mnccde",
        "author": "KillerCroc1234567",
        "title": "‘Springsteen: Deliver Me from Nowhere’ To World Premiere At New York Film Festival (New Image Revealed)",
        "content": "",
        "upvotes": 125,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFdl4YDkllVWJA5VuOKRu0xauMoO_v1DE5YHxDitf6E.png?auto=webp&amp;s=b2361de044eb70b712c8885f6a3bf93ce2489004"
        },
        "permalink": "/r/movies/comments/1mnccde/springsteen_deliver_me_from_nowhere_to_world/"
    },
    {
        "id": "1mo07br",
        "author": "dcterr",
        "title": "Derek Flint",
        "content": "Who here has watched Our Man Flint or In Like Flint? I think these are both excellent movies in the spirit of James Bond. I don't know if you call them Bond spoofs, since James Bond is sort of a spoof itself, but I still find them quite entertaining, and I think James Coburn does an excellent acting job as Derek Flint, a sort of American version of James Bond. Lee J. Cobb is also very good as his bumbling superior in charge of his assignments. I'd also say these movies spoof Bond's womanizing quite well, and very much in line with the swinging 60s.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1mo07br/derek_flint/"
    },
    {
        "id": "1mns6if",
        "author": "Specific-Photo261",
        "title": "A24 Prevails In Competitive Bidding For Ian Tuason Horror Film ‘The Undertone’ Following Pic’s Fantasia Fest Premiere",
        "content": "",
        "upvotes": 18,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rGM3poA2IoTUaYUa4hZaPxbhmuypMIOZ0s7e-oWR5N8.jpeg?auto=webp&amp;s=c9aeb0eddc7db438e64876bd620a63c9e6e067d3"
        },
        "permalink": "/r/movies/comments/1mns6if/a24_prevails_in_competitive_bidding_for_ian/"
    },
    {
        "id": "1mmxw4o",
        "author": "Happy_Philosopher608",
        "title": "What was with the wave of 3D movies in the early '10s that then suddenly just stopped?!",
        "content": "What was with that spate of every movie circa 2008-2013 having been shoved into 3 dimensions and then the trend just suddenly died away like it never happened??\n\nI recently found a pair of them red n blue-lensed glasses down the back of my man-drawer, and cant remember the last time a movie released in 3D at my local cinema tbh, and i remember back in 2010 you could barely find a single one that that was solely in 2D! \n\n(And of course you then got the battle between proper shot for 3D and the godawful flat and lazy post conversions! Personally Life of Pi and Gravity in IMAX 3D was still my favourite ever cinema experience and Clash/Wrath of the Titans just looked very colourless and ugly in post converted 3D! )\n\nSo yeah, was there a hard reason the whole phenomenon just stopped seemingly overnight or did I just misremember?",
        "upvotes": 1021,
        "comments": 757,
        "media": null,
        "permalink": "/r/movies/comments/1mmxw4o/what_was_with_the_wave_of_3d_movies_in_the_early/"
    },
    {
        "id": "1mmr3kg",
        "author": "darth_vader39",
        "title": "Eddie Murphy Turned Down ‘Rush Hour’ To Go To Miami and Make ‘Horrendous’ ‘Holy Man’",
        "content": "",
        "upvotes": 2329,
        "comments": 261,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rmoKC1iQhtdhMcdjLSwyhYSL8RGOtDeSBjl0yVCRMdo.jpeg?auto=webp&amp;s=ce77cdec775a5f1d1e8b3b6fc41ab55f697707d7"
        },
        "permalink": "/r/movies/comments/1mmr3kg/eddie_murphy_turned_down_rush_hour_to_go_to_miami/"
    }
]