[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j4ce5c",
        "author": "Few_Pumpkin3666",
        "title": "Doubting the authenticity of the \"Top 10\" list",
        "content": "I remember when 'Kinda Pregnant' with Amy Schumer released last month and for like two weeks straight it was showing as #1 on the trending movies and I just, straight up don't believe it. This isn't like some big takedown or the tired trope of \"Amy Schumer is horrible and no one likes women comedians\". Her movies aren't usually my cup of tea but I'm not here to hate. \n\nThis one though, I just cannot believe it was actually number one. Especially with the scene that auto plays when you stay on it too long. It's hard for me to even imagine a demographic that would see that and decide to spend the next hour and a half watching it. Let alone enough to make it #1 for 2 weeks straight. So I guess I'm asking if anyone else feels like they just lie about the numbers to push their newest originals? If they put it as #1 someone might at least give it a try. Or do y'all think I'm just way off base here and imagining things or out of touch. \n\nAgain to reiterate, I have a wide range of movies I'll watch and enjoy, even some of the Netflix original movie slop has its merrit for just turning your mind off and having a little fun. See 'Red Notice'. All this to see I don't just hate the actress or the genre, but still, this looks even worse than their normal original slop. ",
        "upvotes": 76,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1j4ce5c/doubting_the_authenticity_of_the_top_10_list/"
    },
    {
        "id": "1j44a6s",
        "author": "Pogrebnik",
        "title": "Millie Bobby Brown Confirms 'Enola Holmes 3' Filming Start Window",
        "content": "",
        "upvotes": 121,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1j44a6s/millie_bobby_brown_confirms_enola_holmes_3/"
    },
    {
        "id": "1j3z2f4",
        "author": "S4v1r1enCh0r4k",
        "title": "Ezra Edelman Slams Netflix for Scrapping His 9-Hour Prince Documentary. Says that Netflix and Prince's estate won't release it since it could \"do generational harm to Prince\"",
        "content": "",
        "upvotes": 155,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1j3z2f4/ezra_edelman_slams_netflix_for_scrapping_his/"
    },
    {
        "id": "1j3y8l9",
        "author": "AnagnorisisForMe",
        "title": "With Love Meghan thoughts...",
        "content": "Posting this with great trepidation as I am not a bot (and I'm really hoping I have enough karma points after all the downvotes that I don't get kicked off Reddit). I think there are good parts of the With Love Meghan series. The episode with Roy Choi is in particularly good as the Korean sauces and cooking techniques are interesting as is his brining technique. The series is not exactly Carl Sagan, but that it is not what the intention is. If you want light background entertainment, give With Love Meghan a chance.",
        "upvotes": 183,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1j3y8l9/with_love_meghan_thoughts/"
    },
    {
        "id": "1j4gqdg",
        "author": "Kesonac",
        "title": "Next series for me and my parents ? :D",
        "content": "So far we watched prison break, money heist and the 100.\nMy dad and I would rank it like:\n1: The 100\n2: Prison break and Money heist\n\nWhereas my mom would rank it like\n1: money heist\n2: prison break\n3: the 100\n\nSo as you can see Im not sure which series could be a good middle ground for me/my dad and my mom :D We all 3 loved all 3 series, only the 100 was a tad too complicated for my mom sometimes, but she still loved it:D anyone got an idea? (Prime is also an option, hope its allowed to say here)",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1j4gqdg/next_series_for_me_and_my_parents_d/"
    },
    {
        "id": "1j4ix8x",
        "author": "Domino_USA",
        "title": "\"A Secret Love\" Netflix Documentary",
        "content": "Does anyone know if it is possible to purchase the Netflix documentary \"A Secret Love\" on DVD or is there a streaming service that carries this documentary that allows downloads for purchase, such as Amazon? I am having trouble finding a copy of the documentary available for purchase outside of streaming on Netflix.  *A Secret Love is* about a lesbian couple who kept their relationship private for nearly 70 years.  It is directed by  Chris Bolan and is a portrait of his great-aunt, Terry Donahue, and her relationship with her partner, Pat Henschel.  Henschel was also a member of the All American Girls Professional Baseball League Players Association which the movie \"A League of Their Own\" is based on.  The documentary is one hour and 20 minutes.  The couple were eventually married and one of them, if not both, have passed on now.  They faced anti-gay bigotry throughout their lives.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4ix8x/a_secret_love_netflix_documentary/"
    },
    {
        "id": "1j4c67u",
        "author": "S4v1r1enCh0r4k",
        "title": "Sam Worthington to Star in Netflix’s New Thriller 'I Will Find You'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4c67u/sam_worthington_to_star_in_netflixs_new_thriller/"
    },
    {
        "id": "1j4jvp2",
        "author": "Elborshooter",
        "title": "Student issues",
        "content": "I've seen lots of students on the sub being annoyed that they had trouble with watching netflix on their parents account while away.\n\nHere's my problem : I pay for my own account (way too much might I add), but this year I'm in a different country and coming back to the \"household\" is absolutely out of the question. I got a message saying I have 14 days to get back to the household if I want to be able to continue to watch netflix.\n\nWhat can I even do at this point ? (Apart from cancelling my subscription to what is slowly becoming a massive scam)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4jvp2/student_issues/"
    },
    {
        "id": "1j4esbn",
        "author": "renis_h",
        "title": "New addition to Netflix: The Leopard",
        "content": "Just wanting to shine a spotlight on a Netflix show that I really think deserves more eyes on it in The Leopard. For those that don't know, this is based on an Italian 1963 film of the same name, that more or less follows the story of the Italian uprising, and documents how the rich are able to hold onto their power and position even after large scale upheaval. \n\nThis is definitely worth the watch, and I am surprised that Netflix is just digging out these old films that no one expects them to remake and actually does a really good job of recreating them. While I have been in a slump with netflix at the moment, this is definitely a show that's worth the watch.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j4esbn/new_addition_to_netflix_the_leopard/"
    },
    {
        "id": "1j4jrrv",
        "author": "Necessary_Article410",
        "title": "“Murder doc”?",
        "content": "Does anyone know a good “murder” or kidnapping doc where the actual victim of the crime is in it? I have been searching around for one like that and cannot find it. I like the ones that have “American murder” or “cold case” but i just want to find one with 1st story accounts from the victim! please let me know if someone knows one.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4jrrv/murder_doc/"
    },
    {
        "id": "1j41axh",
        "author": "Robemilak",
        "title": "'Bullet Train Explosion' Gets a Teaser Trailer, Releasing April 23",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j41axh/bullet_train_explosion_gets_a_teaser_trailer/"
    },
    {
        "id": "1j4iasz",
        "author": "Alan_Stamm",
        "title": "'The Leopard:' Lavish new series based on 1958 novel is 'a withering takedown of society's flaws and hypocrisies that still hits home today'",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4iasz/the_leopard_lavish_new_series_based_on_1958_novel/"
    },
    {
        "id": "1j47eaj",
        "author": "luvlils",
        "title": "Shows not showing up",
        "content": "Is anyone else experiencing shows are not showing up on my tv for Netflix where im not able to see gossip girl for example it shows as remind me but when I go into the app its there for me to watch. Its the same with switching profiles everything is there except for the shows on my profile",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j47eaj/shows_not_showing_up/"
    },
    {
        "id": "1j3hzk7",
        "author": "Neat_Panda9617",
        "title": "I HIGHLY recommend Toxic Town!",
        "content": "Typical British production with incredible actors, well-written script, and compelling story. Thought it might be too much of a bummer but then I saw who was in it and gave it a shot. Watched all four episodes yesterday and stood up cheering when it ended.",
        "upvotes": 150,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1j3hzk7/i_highly_recommend_toxic_town/"
    },
    {
        "id": "1j43viw",
        "author": "Atlast_2091",
        "title": "How to Sell Drugs Online (Fast): The Final Season | Official Trailer",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j43viw/how_to_sell_drugs_online_fast_the_final_season/"
    },
    {
        "id": "1j3r39q",
        "author": "No_Culture7573",
        "title": "STILL not over this…",
        "content": "Is anyone else still salty about the ANNE WITH AN E cancellation ordered “jointly” by CBC and Netflix in 2019 just ahead to its season 3 premiere? I have never seen such fierce retaliation and clap back from a fanbase after a series cancelation ever, with a change.org petition reading 1.5 MILLION signatures. Hello CBC and Netflix executives???? Still also salty about Netflix saving Manifest for 2 more seasons despide being originally cancelled. Who even asked for that? 😂 ",
        "upvotes": 36,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1j3r39q/still_not_over_this/"
    },
    {
        "id": "1j4idgm",
        "author": "cmlcgf",
        "title": "I need series recommendations!!!",
        "content": "Pode ser qualquer gênero, mas eu AMO romance e fantasia. Ter romance na série é essencial para mim (mesmo que sejam só migalhas kkkk 🥹)\n\nObs: EXCETO The Vampire Diaries, Teen Wolf, Stranger Things, The Witcher, Winx, Cidade Invisível, Mundo sombrio de Sabrina, Wandinha, Sandman... \n(Ou eu já assisti essas ou não gostei 🙁)\n\nEntão, qual série BOA nesse estilo vocês me recomendariam?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4idgm/i_need_series_recommendations/"
    },
    {
        "id": "1j432e2",
        "author": "skidmarks731",
        "title": "Where did the download button go?",
        "content": "I usually watch content on my phone on my train ride in. The typical \"my Netflix\" does not have my downloaded content anymore and there's no more icons for downloading any show or movies. Did something happen? ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j432e2/where_did_the_download_button_go/"
    },
    {
        "id": "1j3n6kb",
        "author": "ECO_FRIENDLY_BOT",
        "title": "American Primeval",
        "content": "Really enjoyed this latest Western from Netflix which was surprisingly good and was up there with Godless in terms of quality. It's a pity they didn't make it 8 episodes as it's a very interesting period in American history especially the evolution of the Mormons and their bloody past. The cast was excellent especially rhe always reliable Betty Gilpin and Taylor Kitsch who is good in most things despite some of the hate he gets from critics. Shea Whigham is impressive as always and must be one of the best character actors working today. Also nice performance from Dane Dehaan who always delivers a memorable performance and really should be a bigger name in Hollywood. A quality show that stands out amongst all the rubbish on Netflix.",
        "upvotes": 48,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j3n6kb/american_primeval/"
    },
    {
        "id": "1j4a903",
        "author": "Blu-",
        "title": "More anime is being added but closed caption only subtitles is ruining it",
        "content": "I was excited to watch Frieren only to discover it only has CC subtitles. I just can't enjoy it that way. But other shows like Dandadan have normal subtitles?\n\nWhy is that? Why are some CC and some not?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4a903/more_anime_is_being_added_but_closed_caption_only/"
    },
    {
        "id": "1j4a3yp",
        "author": "Acrobatic_Coyote_583",
        "title": "Household WiFi being annoying - help appreciated.",
        "content": "I am studying in a different city to my parents, who pay for the family Netflix. I can get temporary codes but is there any way to have the account in both houses and get around the OTPs. Any help would be really appreciated as I can’t even enter the access code in my PlayStation Netflix app. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4a3yp/household_wifi_being_annoying_help_appreciated/"
    },
    {
        "id": "1j3xaww",
        "author": "AllisonBurgers_O",
        "title": "Guysss , Never Have I ever / Emily in Paris / Ginny and Georgia .. Which one would you recommend other than the two .",
        "content": "I just wanna chill in-between by Studies tbh .\nIf I kept studying I'd be drained .So which one of these is better to Relax and Enjoy at the same time ? Any Suggestions appreciated 👏 ❤️ !!!",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j3xaww/guysss_never_have_i_ever_emily_in_paris_ginny_and/"
    },
    {
        "id": "1j3zoh8",
        "author": "heachx",
        "title": "Movies/shows with jungle adventures",
        "content": "Please recommend movies/shows like Jumanji, Lara Croft, Uncharted, Indiana Jones, The Lost City.\n\nBasically everything with treasure hunt, jungles, action, comedy that is available on netflix. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j3zoh8/moviesshows_with_jungle_adventures/"
    },
    {
        "id": "1j436b2",
        "author": "flydaychinatown1",
        "title": "Specific movie only available in HD on phone?",
        "content": "Im watching Netflix via the app on desktop and im able the watch shows/movies in HD except one which im able to get in HD on my phone but I want to watch it in HD on desktop. Any solution?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j436b2/specific_movie_only_available_in_hd_on_phone/"
    },
    {
        "id": "1j41kd4",
        "author": "HisztisMyrtle",
        "title": "How to access a movie available only in one country?",
        "content": "Hi All,\n\nI have Netflix in Poland, and now I travelled to Hungary for a short time. I can access my Netflix, but I think it's the same selection as back in PL. The point is, in Hungary, there should be a certain movie available on Netflix (and only here) but it's not coming up for me, even though my current IP is obviously Hungary. Is there a way to somehow access this movie? I thought the selection updates based on your IP, but apparently not? Is this another EU regulation?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j41kd4/how_to_access_a_movie_available_only_in_one/"
    },
    {
        "id": "1j3s9hj",
        "author": "dAlembertFula",
        "title": "Running Point Connections",
        "content": "Has anyone watched 'Running Point' on Netflix and 'How to Lose a Guy in 10 Days'. Both starring Kate Hudson. I just finished 'Running Point' and there are SO many similarities (in terms of plot points/activities) to 'How to Lose a Guy in 10 Days'. First, the basketball. Like 40% of 'How to Lose a Guy in 10 Days' is spent watching basketball/at the basketball game, where the colors are similar to those in 'Running Point'. Second, the 'Game 7' importance. I'm not a basketball nerd, so that term has no importance to me, but it was a key piece in both movie and show. \n\nI had 2 more points that I forgot, so I'll edit it later when I remember, but if anyone has found more similarities, please tell. They were written by different people, so that can't be why. I was wondering if 'Running Point' was supposed to be this homage to 'How to Lose a Guy in 10 Days.'",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3s9hj/running_point_connections/"
    },
    {
        "id": "1j4dwzy",
        "author": "indiewire",
        "title": "As Zoe Saldana Defends 'Emilia Perez,' What's Next for Mexican Cinema?",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1j4dwzy/as_zoe_saldana_defends_emilia_perez_whats_next/"
    },
    {
        "id": "1j4i4v6",
        "author": "Edge_Crusher_2148",
        "title": "Netflix’s Running Point Just Dropped a Randomly Racist Attack on Dagestanis",
        "content": "I just watched episode six of Running Point and I have to ask, who is behind this show? Because this was not just bad writing, it was deliberate.\n\nIsla Gordon storms into The Sean Murphy Show, a basketball podcast, shuts the host’s laptop, and demands to know who leaked information about one of her players. When Sean reminds her he is in the middle of an interview, she casually drops, “Just tell whatever wife-beating Dagestani MMA fighter they can wait.”\n\nWhat do Dagestani fighters have to do with this show? Why was this even written? Why did Netflix sign off on such blatant racism and Islamophobia? It was completely unrelated and totally unnecessary, just a throwaway smear that served no purpose except to push an agenda.\n\nThis was not an edgy joke or satire. It was straight up defamation. If this line had targeted any other group, the backlash would be immediate. But because it is about Muslim athletes, it gets ignored.\n\nIf this is the kind of writing Running Point is going with, they can keep it. At this point, it is obvious what they are doing, and I am not here for it.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j4i4v6/netflixs_running_point_just_dropped_a_randomly/"
    },
    {
        "id": "1j3gdch",
        "author": "SpecialistWeb8987",
        "title": "Wtaf does Netflix think by labeling this as fit for 6yo?",
        "content": "",
        "upvotes": 25,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8p3gbhvukpme1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j3gdch/wtaf_does_netflix_think_by_labeling_this_as_fit/"
    },
    {
        "id": "1j3uezs",
        "author": "nodakskip",
        "title": "Questions on adding an extra account.",
        "content": "Ok for years I have used my moms netflix (she knew) and we live in the same city. After netflix cracked down on that my devices like Roku said I could not log in since I was not at the registered home address. Thats fine. My pc netflix still let me log in. Now that no longer works either. I was thinking of getting my own netflix account, but wanted to ask about the new thing to add a second account to her existing account where I can register at my home. \n\nMy questions are...\n\n1. Is there any real benifit money saving wise if I have an extra account under her?\n\n2. I would pay for my own, but wondering if it would make her pay for my new account if I made one under her? Can I use my own cc card or paypal?\n\n3. Does netflix servers still screw up when its an extra account under someone else? Does it still want me in the same address?\n\nIf I get my own, that is fine. I just wanted to ask first.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j3uezs/questions_on_adding_an_extra_account/"
    }
]