[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 486,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ij3kyz",
        "author": "gbnewsonline",
        "title": "Netflix price rise coming to UK",
        "content": "",
        "upvotes": 109,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1ij3kyz/netflix_price_rise_coming_to_uk/"
    },
    {
        "id": "1ijjysf",
        "author": "IshaanM8",
        "title": "Device not part of household on PC",
        "content": "# Your device is not part of the Netflix Household for this account is now happening on PC as well..\n\n  \nIt was good while it lasted as you could still use it as before on the laptop / desktop but the same issue that was happening on the phone, is now happening on PC.",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ijjysf/device_not_part_of_household_on_pc/"
    },
    {
        "id": "1ijk6lm",
        "author": "dragon-elbow-coal",
        "title": "Scooby-Doo! Mystery Incorporated on Netflix is NOT a prequel to Scooby-Doo, Where Are You!",
        "content": "I keep seeing on this sub that Scooby-Doo! Mystery Incorporated (SDMI) is a prequel to Scooby-Doo, Where Are You! (SDWAY), but I struggle to see how that could be the case. While the ending does reset Crystal Cove to a timeline where there was no influence from the Evil Entity—complete with the gang driving off into the sunset with a 1960s Hanna-Barbera-style laugh track—several inconsistencies prevent this from leading directly into the events of SDWAY.  \n\nFirst off, canonically, Coolsville has always been the gang’s origin. This has been consistent in nearly every Scooby-Doo movie and series until SDMI. Secondly, SDMI features a museum displaying the costumes of unmasked villains from SDWAY, suggesting that SDWAY already exists within the SDMI universe. Additionally, Fred and Daphne appear visibly shaken when they see a synthetic replica of Scrappy-Doo in the same museum, a direct reference to Scooby-Doo (2002).  \n\nFor SDMI to lead into SDWAY, the gang would have had to lose their memories—just like the other residents of Crystal Cove—which clearly does not happen. When they leave town for college, they still remember all their past cases, despite those events technically never having taken place in the new timeline. This means that the individuals who would have become villains in SDWAY lived different lives and never donned their infamous disguises.  \n\nIf anything, the ending of SDMI erases the events of SDWAY rather than setting them up. This would suggest that SDWAY is actually a prequel to SDMI, with the most likely sequel being What’s New, Scooby-Doo? (WNSD). However, due to the timeline alterations in SDMI, I’d rather view it as a standalone, non-canon series—or possibly part of a Scooby-Doo multiverse. Since Scooby-Doo is technically part of the DC Universe, the latter isn't entirely out of the question.  \n\nWhat are your thoughts? ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ijk6lm/scoobydoo_mystery_incorporated_on_netflix_is_not/"
    },
    {
        "id": "1ijn361",
        "author": "jedix_",
        "title": "new isp, no tv, household locked out",
        "content": "I don't watch netflix on a tv, but somehow my household is set.  I read in another post this is done automatically by device activity if you don't have a tv.. I really don't care how it's set but I can't update it now.  I just switched internet providers and now I'm locked out of using my own account.  I kicked all my devices out and changed my password, but I'm still locked out.  I guess the enshitification continues to expand, even to paid services.  Way to go netflix.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ijn361/new_isp_no_tv_household_locked_out/"
    },
    {
        "id": "1iiz9pz",
        "author": "StarKCaitlin",
        "title": "Ben Affleck to Replace Matt Damon in Netflix Thriller ‘Animals,’ Gillian Anderson Joins Cast",
        "content": "",
        "upvotes": 100,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1iiz9pz/ben_affleck_to_replace_matt_damon_in_netflix/"
    },
    {
        "id": "1iiyhyr",
        "author": "theipaper",
        "title": "Apple Cider Vinegar isn't just cashing in on Belle Gibson's scam",
        "content": "",
        "upvotes": 90,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1iiyhyr/apple_cider_vinegar_isnt_just_cashing_in_on_belle/"
    },
    {
        "id": "1ijn1dw",
        "author": "forevony_0904",
        "title": "Good show Maid",
        "content": "Just finished\n\nI really liked this show. Not my fave as I normally love teen dramas romance but this was very good. \n\nSad we didn't see an ending for Nate tho. But so happy ending for Maddy and Alex. Good good show. Highky recommend everyone watch it ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijn1dw/good_show_maid/"
    },
    {
        "id": "1ijq1jd",
        "author": "Cassidus",
        "title": "Have you noticed this or has it happened to you?",
        "content": "I'm a week off from my membership being over and Netflix is trying to encourage me back with offers. But also, my continue watching list is gone and i cant even search for the show I want because it's \"gone\" on my profile. My partner can search it fine on the same account, by just using her profile. My theory is that they're trying to subtlety encourage me back to subscribing. Would you agree?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijq1jd/have_you_noticed_this_or_has_it_happened_to_you/"
    },
    {
        "id": "1ijpzjo",
        "author": "OlympicPlinkoChamp",
        "title": "Personal Information Techinal Help Needed Urgently",
        "content": "I requested and received my personal information from Netflix.  It contained a file \"MessagesSentByNetflix\".  Under the column \"Message Name\" there are messages labeled \"Barrower Resolution Interstitial\".  What does this mean?  Under the column \"Channel\" it has some labeled \"Alerts\".  What does this mean?  With most messages there is no logged interaction or device.  Is there a way to see what device triggered this message?  Is there a way to see if there was in fact any interaction?  Is there a way to get more IP information?  Is there detailed information about the length of active periods of browsing?  \n\nI need exact technical definitions of what these things mean and as detailed as possible information about interactions during a given period.  \n\nI need this information urgently.  I can't emphasize enough how critical my need for this information is.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijpzjo/personal_information_techinal_help_needed_urgently/"
    },
    {
        "id": "1iirj71",
        "author": "Impossible-Will-8414",
        "title": "Kinda Pregnant -- Wow",
        "content": "OK, I know Amy Schumer can be a complicated figure, but she has done some decent work lately, including in the Hulu series Life and Beth -- not amazing or anything, but a mix of quiet humor and heartfelt plot lines. And movies like Trainwreck, while not great, still have had some merit. But my GOD -- Kinda Pregnant, which debuted today on Netflix, is fully unwatchable -- it's like a Z-grade Adam Sandler movie (and funnily enough, Adam Sandler's nephew, Tyler Spindel, directs this atrocity!), with a \"wild and wacky\" plot that is completely over the top and characters who are not in any way recognizably human. And Schumer actually co-wrote the script, so she can't blame this on bad writing. It is ATROCIOUS. Watched about 30 minutes and flipped it off, both literally and figuratively. Schumer really seems to be in a very bad place if this garbage is any indication.",
        "upvotes": 238,
        "comments": 160,
        "media": null,
        "permalink": "/r/netflix/comments/1iirj71/kinda_pregnant_wow/"
    },
    {
        "id": "1ijp6aw",
        "author": "Robemilak",
        "title": "Emilia Pérez' Karla Sofía Gascón Apologises for the Recent Comments: \"I sincerely apologize to everyone who has been hurt along the way.\"",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ijp6aw/emilia_pérez_karla_sofía_gascón_apologises_for/"
    },
    {
        "id": "1ij16du",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix has released the teaser for 'The Eternaut' live-action adaptation of the famous Argentinian sci-fi comic. Premieres globally on April 30",
        "content": "",
        "upvotes": 27,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ij16du/netflix_has_released_the_teaser_for_the_eternaut/"
    },
    {
        "id": "1ijkein",
        "author": "grruser",
        "title": "The Are Murder - dubbing is wrecking it",
        "content": "Finally some Nordicish noir but the dubbing is so bad. It sounds like all the Spanish shows which I don't watch because every voice is so flat. Does Netlix not care about this? Can I complain?\n\nCorrection: The Are Murders",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ijkein/the_are_murder_dubbing_is_wrecking_it/"
    },
    {
        "id": "1ijk0ay",
        "author": "apoc_krysis",
        "title": "Lost feature",
        "content": "Does anyone remember several years back when Netflix had a thing I think it was called “Max” and it would talk to you and pick out a random movie based on what you told it you liked? It was very short lived but it was cool. I can’t remember if that was the correct name. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ijk0ay/lost_feature/"
    },
    {
        "id": "1iiew2n",
        "author": "EthanWilliams_TG",
        "title": "Netflix Cancels Six Announced Games Before Release",
        "content": "",
        "upvotes": 419,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1iiew2n/netflix_cancels_six_announced_games_before_release/"
    },
    {
        "id": "1ijjq7a",
        "author": "Winter_Swing9361",
        "title": "rom com movie + tv + book suggestions",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijjq7a/rom_com_movie_tv_book_suggestions/"
    },
    {
        "id": "1ij8qaz",
        "author": "brucie_me",
        "title": "Roku won't show Netflix on home page!",
        "content": "I have 3 Rokus and one of them (newest Roku Ultra 2024) doesn't show Netflix on my home page no matter how I try! I can only access it through the remote or \"channel lineup\" -- no problem with other apps. This is known issue from what I read online, is a fix or workaround available?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ij8qaz/roku_wont_show_netflix_on_home_page/"
    },
    {
        "id": "1ij44af",
        "author": "ideasnstuff",
        "title": "Action Scenes in The Night Agent",
        "content": "For all the serious action fans - do the fight and action scenes stand out in TNA? I find the production quality great overall but the action scenes are comparable to other similar shows. I don't see anything that sets it apart to justify all the attention it gets during promos.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ij44af/action_scenes_in_the_night_agent/"
    },
    {
        "id": "1ijg36i",
        "author": "ZenCat14",
        "title": "Whenever I watch anything, I get sent to the home screen after a short time",
        "content": "So, there are some shows that I've been meaning to watch, but whenever I start them, after a few seconds, I'm sent back to the Netflix home screen on mobile. This also happens with previews of shows. Any ideas for a fix? I tried uninstalling and reinstalling, but that didn't help.\n\nEdit: As it would turn out, it's not just shows that are doing this, but the entire app. After having it open for a little while, it automatically minimizes on my phone while still having the app open.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijg36i/whenever_i_watch_anything_i_get_sent_to_the_home/"
    },
    {
        "id": "1iiymb5",
        "author": "FirTrader",
        "title": "Second time thru Black Mirror",
        "content": "I’ve only watched all of “Black Mirror” once, two years ago.  It’s one of my favorites.  Currently binge watching several episodes, each night, before falling asleep.  I just want everyone to know i’m ok (rocks back and forth with blank stare, fidgeting nervously with hands).  Everything’s going to be ok.",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iiymb5/second_time_thru_black_mirror/"
    },
    {
        "id": "1ij5i93",
        "author": "climbergirlwx",
        "title": "La Palma",
        "content": "A lot of copy paste from Dante’s Peak (1997)😂 even the characters are similar looking! Not complaining because I grew up loving Dante’s Peak, just thought it was interesting. \n\nDid anyone else think so as well? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ij5i93/la_palma/"
    },
    {
        "id": "1ijdi8n",
        "author": "jackdempsy2345",
        "title": "The capture of ending",
        "content": "Has anyone watching the Netflix series “ the capture” and was really disappointed with the ending? I wanted Paul to become a free man. The ending just felt dissatisfied for me and I loved watching it apart from the ending.im quite cautious in watching season 2",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ijdi8n/the_capture_of_ending/"
    },
    {
        "id": "1ijlwnp",
        "author": "Yuskii__",
        "title": "Your device isn’t part of this netflix household",
        "content": "I borrow a sister’s account, and we live in separate houses. Used to be, I can use her netflix account on pc without encountering this issue. However, just today, I have encountered this issue while using browsers. Has anyone else experienced this?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ijlwnp/your_device_isnt_part_of_this_netflix_household/"
    },
    {
        "id": "1ii1bwp",
        "author": "AccurateInflation167",
        "title": "Netflix drops Emilia Pérez star from Oscars campaign over tweets",
        "content": "",
        "upvotes": 1314,
        "comments": 148,
        "media": null,
        "permalink": "/r/netflix/comments/1ii1bwp/netflix_drops_emilia_pérez_star_from_oscars/"
    },
    {
        "id": "1ijjzur",
        "author": "Bubbly-Ad-9375",
        "title": "how on earth does the fox move?",
        "content": "during episode five, of (the limited series dutch show about a psycho house robot) Cassandra, a toy fox plushy is seen dragged off of screen unexplainably. How??? All other family members were accounted for in other places! Please lmk, as this is driving me crazy. also, highly recommended the show!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ijjzur/how_on_earth_does_the_fox_move/"
    },
    {
        "id": "1iirlph",
        "author": "SodaPopinski6",
        "title": "Home Improvement.",
        "content": "Feeling old. Been binging Home Improvement and haven’t laughed like this in a long time. Also brings back memories of the whole family sitting down to watch TGIF. ",
        "upvotes": 16,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iirlph/home_improvement/"
    },
    {
        "id": "1ij4xn0",
        "author": "Pogrebnik",
        "title": "Robert De Niro to Star in Adaptation of Alex North's 'The Whisper Man' for Netflix, James Ashcroft to Direct",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ij4xn0/robert_de_niro_to_star_in_adaptation_of_alex/"
    },
    {
        "id": "1ijeuai",
        "author": "Logical_Mushroom_689",
        "title": "No promo for Stranger Things 5?",
        "content": "Anyone knows why Netflix released everything they showed on the Next on Netflix event except that teaser they showed for Stranger Things? \n\nIt’s been oddly quiet for ST compared to their promotion for other seasons. Usually by now we’d have a few teasers and some quick looks, now we have absolutely nothing except some bts stuff. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ijeuai/no_promo_for_stranger_things_5/"
    },
    {
        "id": "1ij9bix",
        "author": "Saushi00",
        "title": "Why does Netflix video quality is poor on my laptop compare to tv and mobile",
        "content": "Netflix quality on my mobile great and on TV amazing but why does on laptop it sucks I have basic 720p plan I use Netflix app which runs on edge browser if any way it can be fixed please help",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ij9bix/why_does_netflix_video_quality_is_poor_on_my/"
    },
    {
        "id": "1iiqt4a",
        "author": "Several-Archer4786",
        "title": "Rewatching \"The Wiz\"",
        "content": "I remember watching this several times on network television as a kid growing up. My wife has never seen it so we're watching it together for the first time. Just the era of the film brings back memories.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iiqt4a/rewatching_the_wiz/"
    }
]