[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 71,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lm8k6b",
        "author": "deedee1801",
        "title": "New layout stinks!",
        "content": "So tired of interface changes that don’t benefit users but only justifies someone’s paycheck. And I’m looking at you too, Kindle! This is frustrating and tiresome! Goodbye! ",
        "upvotes": 41,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lm8k6b/new_layout_stinks/"
    },
    {
        "id": "1lm0e0r",
        "author": "Medical_Neat5037",
        "title": "Looking for a new show to binge",
        "content": "I'm looking for something new and interesting, paranormal or funny would be best. Some recent ones I finished are Evil, Lucifer, The Good Place, Supernatural, and A Man On the Inside. Bonus if there are several seasons.",
        "upvotes": 23,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1lm0e0r/looking_for_a_new_show_to_binge/"
    },
    {
        "id": "1llkgpq",
        "author": "BrianLevre",
        "title": "What was the hardest thing to stomach when you watched Trainwreck Poop Cruise? SPOILER",
        "content": "For me, it's too close to call between three things:\n\n1) The sewage everywhere.\n\n2)  The completely irrational fear so many people had of pooping in a bag.\n\n3)  The women that were there having the bachelorette party.\n\nBacked up toilets making people walk through sewage... that's pretty messed up.  I don't want to imagine the smell or the illnesses people got because of it, but it's not going to last forever.  People have had to put up with worse.\n\nPooping in a bag... It beats pooping on the floor.  It's a logical measure to take when the sewage system stops working.  Poop in bags, it can all be collected, and it can be placed and contained in an appropriate area.  Truck drivers and van lifers poop in bags all the time.  It's no big deal.\n\nThose three women...  So many things about those women...\n\nFirst, the bride-to-be seemed like she was the inspiration for Kristen Wiig's role in The Californians on SNL...she was dripping with an abundance of unnecessary drama.  \"Why isn't the bar open???\"  Then taking the Imodium, doubling down on her fear of pooping without a toilet, and complaining about a soggy lettuce sandwich when there could have been zero food at all.\n\nThen the group talking about peeing in the shower.  It's like they were clueless about the fact they were born as human animals with biologic processes.  They seemed to not have an idea about how they could squat to pee in a shower.  They were disgusted with having to do it, needing a shower after.  Jeez ladies, it's just pee... ever been camping?",
        "upvotes": 258,
        "comments": 212,
        "media": null,
        "permalink": "/r/netflix/comments/1llkgpq/what_was_the_hardest_thing_to_stomach_when_you/"
    },
    {
        "id": "1llsq0m",
        "author": "Ok_Resolution_9218",
        "title": "Netflix incognito mode",
        "content": "\nJust an idea: I think Netflix should add an incognito mode feature to the app! Sometimes users just want to watch something without it affecting their recommendations or appearing in their viewing history. This would be really helpful for people who share accounts, or even just for times when you’re watching something different from your usual preferences—like a kid’s movie, a guilty pleasure show, or a documentary for school.\n\nAdding incognito mode would allow users to explore more content freely, without worrying about Netflix’s algorithm messing up their suggestions. People use incognito mode in web browsers all the time for similar reasons—why not bring that privacy option to streaming too?\n\nAlso, I noticed a small typo in the original idea—“incognito mouse” was probably meant to say “incognito mode.” But hey, imagine a sneaky little mouse sneaking around Netflix too! 😄\n\nOverall, I think this feature could attract a lot more users and keep current ones happier.\n",
        "upvotes": 24,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1llsq0m/netflix_incognito_mode/"
    },
    {
        "id": "1lm9cb8",
        "author": "Lord_Explosion",
        "title": "Why do I have to sign in on the TV in order to cast from my phone?",
        "content": "I travel between houses and am unable to watch Netflix on my TV even when I try to cast from my phone because there is no I’m traveling option. The I’m traveling option used to exist on the Samsung TV app, but it doesn’t anymore.  I tried to cast from my iPhone, but it still won’t let me watch on the TV despite having an active account on my phone. The house I’m currently at is not the primary Netflix household. I also don’t want to add this house to my household because I am not here often enough to necessitate in an extra $7 a month.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm9cb8/why_do_i_have_to_sign_in_on_the_tv_in_order_to/"
    },
    {
        "id": "1lmavyz",
        "author": "Emile_the_rat",
        "title": "Stranger Things season 1 HDR",
        "content": "\n\n\nI know season 1 originally was made and released in SDR.\n\nBut I’ve started rewarching the show now, and my TV gets a HDR signal when playing season 1.\n\nHDR seems on point too. I tried to search online, but can’t find any official announcement from Netflix on this. So seems like Netflix in silence remastered season 1 for HDR. Don’t mind, HDR looks great, hard to see the difference between HDR in season 1 and 2. so they did a great job.\n\nThe scene in byers house when the Demogorgon enter through the ceiling and all the christmas lights are flashing looks insane in the HDR remaster.\n\nSame with the school scene were El destroys the Demogorgon and all the lights are flickering. \n\nThese two scenes looks brilliant in HDR.\n\nQuestion is, have anyone else noticed this? When did it happen, season 1 was SDR last time I watched it, 2 years ago.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmavyz/stranger_things_season_1_hdr/"
    },
    {
        "id": "1lmanc9",
        "author": "superhyperultra458",
        "title": "Seeing in browser Hades as one of mobile games but does not show in Android at all",
        "content": "https://preview.redd.it/dd6yjt99lk9f1.png?width=1814&amp;format=png&amp;auto=webp&amp;s=92cdd1094b0053ee08229a353e68337daab4f8bb\n\nI just noticed that Hades is there and will leaving. However, checking on Netflix in android and straight on Playstore; it doesn't show at all. Is mobile Hades region-locked in the Playstore.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmanc9/seeing_in_browser_hades_as_one_of_mobile_games/"
    },
    {
        "id": "1lm3ryu",
        "author": "im_not_creative123",
        "title": "Trying to log in on my pc, but the website looks like this (default font, cant interact with anything) and when i click the sign in button, the login page is a white screen",
        "content": "I have tried it on multiple devices (laptop and phone as well) and a different browser, but the results are the same. Anyone having issues as well? This is my first time trying to log in on my computer, my smart tv works fine.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lm3ryu/trying_to_log_in_on_my_pc_but_the_website_looks/"
    },
    {
        "id": "1llw9u2",
        "author": "killwish_",
        "title": "Just binged \"Mercy For None\" on Netflix and WOW – this series brings some serious brutal action!",
        "content": "Hello, r/Netflix community!\nI just had to share my thoughts on \"Mercy For None,\" the new limited series that dropped recently. I finished it and honestly, I'm still reeling! Without giving away any plot points, if you appreciate intense, visceral action with a truly brutal edge, you absolutely need to add this to your watchlist. I'm not saying it's the same, but it delivers an unrelenting, high-octane experience that reminded me of the best parts of action thrillers, almost like a John Wick-level intensity but with its own distinct, darker flavor.\nIt's currently climbing the ranks on Netflix, and for good reason. Has anyone else watched it yet, or is it on your radar? Would love to hear your spoiler-free initial reactions or what you're hoping for if you plan to watch!\nCheers,\n\nu/killwish_",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1llw9u2/just_binged_mercy_for_none_on_netflix_and_wow/"
    },
    {
        "id": "1llrrfi",
        "author": "Fit1Mistake",
        "title": "Kpop demon hunters",
        "content": "So I accidentally clicked on the Kids profile on Netflix and that’s how I stumbled on K-Pop Demon Hunters. And honestly? It wasn’t bad at all.\n\nNetflix really needs to step up their game when it comes to promoting their content. There are so many decent shows and movies buried in there that never get the spotlight.\n\nAnyway, here’s my quick review:\n\nWhat I liked:\nThe story was actually interesting. It felt like there’s more to the story that we didn’t get to see enough of. I’d love to see it turned into a full series. it definitely has potential to expand.\n\nWhat I didn’t like:\nThe animation could’ve used some work. Most of the time, only the characters’ mouths moved no facial expressions or detailed movement. It felt a bit stiff.\n\nA live-action version might be even better, honestly. The concept is strong enough to carry it.\n\nFinal thoughts:\nIt’s enjoyable. I’d give it a solid 7/10. Worth the watch. ",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1llrrfi/kpop_demon_hunters/"
    },
    {
        "id": "1lm8fce",
        "author": "PlasmaHanDoku",
        "title": "Black flickering on the monitor when playing games?",
        "content": "Hey having issues with Netflix that whenever I watch a show on my 2nd monitor my main monitor and my 2nd monitor would flicker then freeze. This only happens when I am playing games and it doesn't seem to happen when I don't have anything up. I'm not sure what is causing the issue.\n\nI'm using a 5070TI and I'm not sure if the GPU is causing the issue. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm8fce/black_flickering_on_the_monitor_when_playing_games/"
    },
    {
        "id": "1lm89kd",
        "author": "wizardrous",
        "title": "Does anyone else’s Netflix app fight them when they try to rewind?",
        "content": "Every time I try to rewind, it keeps skipping back forward. It's like it's trying to resist my basic commands. Is this a problem with my Roku or just a problem with Netflix overall?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lm89kd/does_anyone_elses_netflix_app_fight_them_when/"
    },
    {
        "id": "1lm820t",
        "author": "hazentheamazing",
        "title": "I will say that the last kids on earth is pretty underrated and not talked about as much",
        "content": "I’m on on book 2 episode 6 right now and I can confidently say that this is one of my favourite shows (not like a top ten or even top 15 but still)\n\nBut what I will say is that, the story is great, the plot is great, the characters are great, the Animation is more then great, the dialogue, the first episode was a great way of to start off the entire series and the episode is about an 1 hour and 6 minutes long (which is rare since the rest of the show and most animation shows only have like at most 20 minutes maybe 50 minutes of episodes), and this is better then the typical shitty shows Netflix put on here (looking at you big mouth)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm820t/i_will_say_that_the_last_kids_on_earth_is_pretty/"
    },
    {
        "id": "1lm7ndw",
        "author": "Aeyoun",
        "title": "Blurry subtitles on Google TV Streamer 4K",
        "content": "Netflix’s UI and subtitles on the Google TV Streamer 4K are real low-quality and appears to be upscaled from 720p to 4K. This does not affect other apps. Is there anything I can do to get crisper subtitles? I’m assuming this is an issue on Netflix’s side, but I’m stunned this could still be the case in 2025.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm7ndw/blurry_subtitles_on_google_tv_streamer_4k/"
    },
    {
        "id": "1lm6q84",
        "author": "Due_Ad9428",
        "title": "New arrivals not on Netflix home",
        "content": "I feel like on my Netflix new arrivals don't really show up, even when I've watched them before. I'm currently looking at you Squid Game, forgot it was releasing today, but they didn't even recommend it and it isn't in the notifications. I just think it's weird because hypothetically this is a huge show that they'd love to promote, is this happening to anyone else? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lm6q84/new_arrivals_not_on_netflix_home/"
    },
    {
        "id": "1lm5vqj",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game season 3 made me feel like I wasted so much of my life",
        "content": "Where... do we even begin. At this rate, I would've preferred if Gi-hun just got on that plane in season 1's ending. I find it insane the cast all agreed this was the best possible ending.\n\nSo many characters wasted and built-up for nothing.\n\nJun-ho? He's a terrible Dora the Explorer. All this searching for the island across 2 seasons, WASTED. He doesn't even TALK to his brother. How in the hell is him just being sent the baby and money a satisfying conclusion for his character?\n\nDae-ho is another example. All this mystery of whether he's a fake marine or lying. It seems like he has an abusive dad, always changing the subject whenever he's brought up. You think we're going to get some story of him being traumatized right? NOPE! He's literally just a fake marine, he goes crazy and then he dies, murdered by Gi-hun.\n\nThe mother and son were an exact copy of the wife and husband. Grandma gives the inspiring speech... and then just kills herself.\n\nThe season is described as \"forgiveness\" by Lee Jung-jae. What forgiveness? I didn't see ANY of that.\n\nAnd MG Coin? This season basically just proved Thanos was right. Throughout the first 5 episodes, he's a genuinely well-written morally gray character... and then the finale throws it ALL out the window in lightning speed. He goes from protecting Gi-hun and the baby to suddenly trying to murder both. Right after asking if the baby is okay.\n\nThe writer/director claims he wasn't supposed to be a one dimensional villain but rather make \"human/realistic decisions\" but NONE of that was it. He just turned cartoonishly evil in the blink of an eye. A worse Sang-woo, at least his turn was gradual.\n\nAnd the ending doesn't even feel like a proper conclusion, just a set-up for the sequel's. I don't even need to get into the VIP's.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lm5vqj/squid_game_season_3_made_me_feel_like_i_wasted_so/"
    },
    {
        "id": "1lm4uji",
        "author": "Puzzleheaded-Law8960",
        "title": "Brightness sliders not working sometimes on mobile (modern samsung)",
        "content": "Hey, im a British netflix user, and I 've noticed as of recent that the brightness slider doesn't always seek to work as intended, and it seems to be on certain shows/movies that it does or doesn't work properly. I think it has been a problem for longer, but it never used to be a thing that bothered me as much since I never used Netflix on my phone as much as I do now.\n\nI am currently using a Samsung 23 Ultra, but i am certain I have experienced this issue on previous Android phones I have used.\n\nI've found that every now and then, when I'm watching something on Netflix, the brightness seems to be too low despite me having it all the way up on the app in the overlay settings, and when I try moving the slider up and down, probably around 60%~ of the slider (from the top of the slider towards the bottom) doesn't change anything. When the slider is all the way around the bottom, it's darker, clearly lower brightness, but it only seems to brighten up to 30-40%~, after that, sliding it up higher makes absolutely no difference.\n\nAlso as I said before, confusingly, it seems to be on certain movies/shows, and as of posting this, the only show I can find where that is a problem is Inside Job, though I do remember this being an issue on previous movies/shows I've watched in the past.\n\nI have 3 questions really;\n1 - has anyone else experienced this issue with the brightness clearly not going above a certain point despite the fact that it should, due to sliding the brightness control slider higher\n2 - are there any known reasons for it happening to me, or fixes for it?\n3 - is it an issue more specifically with the individual shows somehow? (I can't tell, as the netflix website doesn't have a brightness slider, but shows that appear too dim on my phone appear brighter and fine on the website on my PC)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm4uji/brightness_sliders_not_working_sometimes_on/"
    },
    {
        "id": "1lm9aci",
        "author": "Stunning-Coyote-1034",
        "title": "Why does my Netflix do that?",
        "content": "Every time time that I watch a trailer like in the video Netflix puts that. (I think it’s a standby thing? Like when you’re not active on the tv so it puts it on). I can tell that the trailer isn’t over I just don’t understand why it keeps doing that. Im on Roku tv if that does anything. It’s been happening for a year now I think. I tried to uninstall the app and redownload it but it keeps happening. Has this happened to anyone and is there a solution?\n",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7qbxouup8k9f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lm9aci/why_does_my_netflix_do_that/"
    },
    {
        "id": "1lm3mnv",
        "author": "Alarmed-War-1135",
        "title": "Thoughts on the end of squid game S3?",
        "content": "I just finished squid game S3 and I thought it was good but the ending could had been better.\n\nI wish the protagonist was still alive but he did the best that he could. And I thought the police would had arrived earlier to the island.\n\nI’m a bit confused with the child of the character n11, someone can explain?\n\nAlso you think they will have a season 4? The very end left the story a bit open that it could happen again but different people. But maybe they would stretch the series too much.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lm3mnv/thoughts_on_the_end_of_squid_game_s3/"
    },
    {
        "id": "1lldmyp",
        "author": "adham_deiib",
        "title": "IMDb ratings on Netflix!",
        "content": "Hi,\n\nI developed a chrome extension that brings IMDb ratings directly into your [Netflix](https://www.linkedin.com/company/netflix/) experience!\n\nI’ve always valued IMDb ratings, as they usually provide an accurate reflection of how good a movie or a show really is, often aligning with my own opinion—which made me realize how helpful it would be to have those ratings visible while browsing Netflix.\n\nThe idea came from the all-too-familiar struggle of endlessly scrolling through Netflix, unable to decide what my next watch is going to be.\n\n💡 It’s completely free to use—give it a try and let me know what you think! I'm actively looking to upgrade and maintain this project, so if you have any cool ideas or feature suggestions, I’d love to hear them.\n\n🧩 You can add it to your browser here: [https://chromewebstore.google.com/detail/mpepkheopbiedmfpjbikkfaehbblelbe?utm\\_source=item-share-cb](https://chromewebstore.google.com/detail/mpepkheopbiedmfpjbikkfaehbblelbe?utm_source=item-share-cb)",
        "upvotes": 50,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lldmyp/imdb_ratings_on_netflix/"
    },
    {
        "id": "1lm8mhb",
        "author": "OkPaleontologist7217",
        "title": "The Future of the Squid Game Universe",
        "content": "Now that Squid Game Season has ended with season 3 — what's next for the Squid Game universe?\n\nSquid Game is easily one of the most successful Netflix series ever — possibly the most successful. Given its popularity, a spinoff or expansion of the universe feels like a no-brainer.\n\nBack in Season 1, a VIP mentioned that the games in South Korea were the best, which strongly implies that Squid Games are happening in other countries too. And in the final moments of Season 3, we even saw a game of Ddakji taking place in the U.S., hinting at a possible American version of the games.\n\nSo what do you think the future holds?\n\nPersonally, I’d love to see a prequel exploring how In-ho won the game and became the Front Man after that, or even a deeper look into Il-nam and how the Games were originally founded. A version of Squid Game set in a different country could also be interesting, but I’m more intrigued by the origins and inner workings of the existing story.\n\nWhat kind of spinoff or continuation would you want to see, and how high do you see the possibility for these Spinoffs?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm8mhb/the_future_of_the_squid_game_universe/"
    },
    {
        "id": "1lmasdp",
        "author": "EpicalBeb",
        "title": "Netflix needs to stop mislabeling anime seasons",
        "content": "I didn't know apothecary diaries had 23 more episodes to watch until I caught up to the manga and the comments were saying the anime was ahead of the manga...",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lmasdp/netflix_needs_to_stop_mislabeling_anime_seasons/"
    },
    {
        "id": "1llwu8k",
        "author": "MrTeacher_MCPS",
        "title": "Straw - Explain to me please",
        "content": "In the movie Straw, how does Nicole know about the death of her daughter, but her best friend at work doesn’t?  Nicole says, “they told me earlier.”  Who is they?  Why would they tell the bank manager?  I re-watched the beginning and the end, and it’s even more unrealistic now, and feels like a cop out ending.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1llwu8k/straw_explain_to_me_please/"
    },
    {
        "id": "1lm15m5",
        "author": "HCISIAOW",
        "title": "How to stop episode from ending during credits?",
        "content": "No matter what show I watch, the episode will end abruptly a few seconds after the credits start. I find it pretty infuriating. The credits are still part of the episode, considering they'll have music, and animation if it's an animated show, so I wanna be able to watch or at least listen to them. The only thing I've been able to do is go back to the episode, fast forward to the very end, and then start after twenty seconds or so of credits. \n\nIs there any way to get Netflix to play the credits without interruption?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lm15m5/how_to_stop_episode_from_ending_during_credits/"
    },
    {
        "id": "1lm0qnw",
        "author": "GoldDerby",
        "title": "Stephen Graham, Cooper Koch, and the best of our Emmy Limited Series/Movie Actor interviews:",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm0qnw/stephen_graham_cooper_koch_and_the_best_of_our/"
    },
    {
        "id": "1llxlp4",
        "author": "No-Panic-4658",
        "title": "Netflix isn't playing anything on Opera.",
        "content": "I am using Opera on Firefox currently, and Netflix isn't playing anything.\n\nI am presented with an error code and a recommendation.\n\nNetflix's error code is 07701-1003 and it says to go to browser settings and maker sure \"Can play protected content\" is selected, but \"Can play protected content\" is selected.\n\nAt this point I don't know what to do, I'm not a tech guy. \n\nAny thoughts/recommendations?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1llxlp4/netflix_isnt_playing_anything_on_opera/"
    },
    {
        "id": "1lm618u",
        "author": "SnapSketchStudios",
        "title": "BANGER",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm618u/banger/"
    },
    {
        "id": "1lljyg1",
        "author": "Peppermint07_",
        "title": "The Waterfront - that Grady is annoying AF",
        "content": "I don’t like his voice, it’s a high pitched, annoying voice. His demeanor is pathetic. His games are stupid. He’s the most stupid villain portrayed on TV. I feel like skipping the scenes he shows up. Does he get killed by the end of season 1? I’m so much hoping we can have a more decent villain.",
        "upvotes": 10,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1lljyg1/the_waterfront_that_grady_is_annoying_af/"
    },
    {
        "id": "1llleuv",
        "author": "mel-06",
        "title": "We need a Netflix docuseries on Hollywood’s most protected abusers: Marilyn Manson, Steven Tyler, P. Diddy &amp; more",
        "content": "With so many survivors coming forward and lawsuits being filed, how do we still not have a full Netflix docuseries exposing the patterns of abuse in Hollywood and the music industry?\nWe’ve seen streaming platforms tackle R. Kelly, Jeffrey Epstein, and even Jimmy Savile — but where’s the series that digs into the ongoing cases involving people like:\n\n\n•\tMarilyn Manson – Multiple women have come forward with allegations of grooming, assault, and psychological abuse. Evan Rachel Wood’s Phoenix Rising was powerful, but barely scratched the surface and didn’t get the Netflix-level attention it deserved.\n\n\t•\tSteven Tyler – In his own memoir, he admits to becoming the legal guardian of a 16-year-old girl he was in a relationship with, allegedly coercing her into an abortion after their apartment burned down. She has since filed a lawsuit.\n\n\t•\tP. Diddy (Sean Combs) – Recently hit with a wave of lawsuits and disturbing footage. Multiple people have accused him of sexual assault and trafficking. It’s getting harder to ignor",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1llleuv/we_need_a_netflix_docuseries_on_hollywoods_most/"
    },
    {
        "id": "1lm08ft",
        "author": "_bibi05",
        "title": "Thoughts on Squid game final season ending?",
        "content": "I honestly expected something different from the ending. I thought it was a bit rushed especially with seong-gi hun character. I’m also sad the way they killed Hyun Ju😭",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lm08ft/thoughts_on_squid_game_final_season_ending/"
    }
]