[
    {
        "id": "1lcwoxq",
        "author": "SonyPictures",
        "title": "Danny Boyle Here: Ask Me Anything.",
        "content": "Hello Reddit! Director Danny Boyle here. \n\nI'm back, and I’m excited to answer your questions about my new film 28 Years Later. It's starring Aaron Taylor-Johnson, Jodie Comer and Ralph Fiennes and is out in UK cinemas on June 19th and US movie theatres on June 20th. \n\nI'll be online from 5pm BST on Tuesday June 17th - drop your questions below and I hope to answer as many as I can. Speak soon!\n\nhttps://preview.redd.it/ro4j9kivca7f1.jpg?width=788&amp;format=pjpg&amp;auto=webp&amp;s=391f46c6bc5fb615d471e7a15d601d977e765eb9\n\n",
        "upvotes": 735,
        "comments": 442,
        "media": null,
        "permalink": "/r/movies/comments/1lcwoxq/danny_boyle_here_ask_me_anything/"
    },
    {
        "id": "1ld74m5",
        "author": "SanderSo47",
        "title": "June 13-15 Box Office Recap – 'How to Train Your Dragon' flies to a fantastic $198M worldwide debut, the best in the franchise. 'Materialists' opens with $11.3M, the third best debut in A24's history. However, Neon's 'The Life of Chuck' disappoints with just $2.3M.",
        "content": "https://preview.redd.it/ec6bwbl0bd7f1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=e2de910277562c1266263fbfcfc38cb837a209ce\n\nTurns out audiences were also welcome to DreamWorks remaking their own films.\n\nThe live-action remake of ***How to Train Your Dragon*** easily topped the box office, opening higher than any of the prior films. A24 also found success with ***Materialists***, which scored the company's third best debut. Unfortunately, the week's big loser was Neon's ***The Life of Chuck***, which disappointed in its wide expansion.\n\nThe Top 10 earned a combined $146.4 million this weekend. That's down a rough 30.6% from last year, when ***Inside Out 2*** debuted with a colossal $154 million.\n\nOpening at #1, ***How to Train Your Dragon*** debuted with a pretty great $84.6 million in 4,356 theaters. That's higher than any of the animated films, even adjusted for inflation. Obviously below ***Lilo &amp; Stitch***'s massive debut, but the film was not really expected to come close to those numbers.\n\nThere were concerns over the idea of a live-action remake of this franchise. After all, the original film is barely 15 years old and fresh in people's mind. But it's clear that it was enough nostalgia to make people curious. Universal and DreamWorks made two great jobs here: getting Dean DeBlois back as the director with complete control, and re-capture the iconic images of the animated film. Sure, it leaned as shot-for-shot in some aspects, but clearly it worked here. As the saying goes, \"if it ain't broke, don't fix it.\"\n\nAccording to Universal, 56% of the audience was female, and 68% was 35 and under. They gave it a strong \"A\" on CinemaScore, the same grade as the animated films. Even with ***Elio*** coming up, this should be a main attraction for families throughout the summer. It should definitely hit over $250 million domestically. Universal ain't wasting a second with this, as they already set a sequel for June 2027.\n\nIn second place, ***Lilo &amp; Stitch*** dropped 51.4% and added $15.7 million this weekend. That's not a terrible drop, but it's still quite rough. For the past few weeks, the film has had very mediocre legs at the box office. For some perspective, its first weekend was $82 million ahead of ***Mission: Impossible***. Now it's fourth weekend is just $5 million ahead. The film has amassed $366.5 million domestically, and it's now guaranteed to finish below ***A Minecraft Movie*** ($423 million). Quite front-loaded for a family film.\n\nIn third place, A24's ***Materialists*** opened with $11.3 million this weekend. While Box Office Mojo and The Numbers report the debut at $12 million, Deadline said that the updated actuals are $11.3 million. That's the studio's third biggest debut ever, behind ***Civil War*** ($25.5 million) and ***Hereditary*** ($13.5 million). Notably, it matched the domestic lifetime of Celine Song's previous film, ***Past Lives*** ($11.3 million), in just 3 days.\n\nThis debut suggests that there's still an audience waiting for a romance in theaters. A24 sold the film pretty much solely on its cast. Sure, Dakota Johnson, Chris Evans and Pedro Pascal have had some box office duds in the past few years, but they're still well known names. Celine Song has also earned a cult following thanks to her critically acclaimed ***Past Lives***. While ***Materialists*** didn't have the universal acclaim of that film, it still earned a great response (86% on RT). \n\nAccording to A24, 74% of the audience was female and 69% was 35 and under. This is a great debut... but here's when things turn a little wild. Audiences gave the film a very weak \"B–\" on CinemaScore, which is quite poor for a romance film. It's a result of A24 marketing the film as a traditional rom-com, but the final film is not that. It's quite likely that the film falls off in coming weeks, but it should still hit $30 million domestically.\n\nEven with the loss of IMAX screens, ***Mission: Impossible – The Final Reckoning*** had its best drop so far. It dipped just 28.8%, adding $10.5 million this weekend. While the film started $14 million behind ***Dead Reckoning*** on its opening weekend, it's now $15 million ahead of it through the same point. The film has earned $166.5 million, and it will outgross that film's domestic total in the next few days.\n\nAfter its disappointing debut last week, ***Ballerina*** didn't save face on its second weekend. It collapsed 60.2%, earning just $9.7 million this weekend. That drop is slightly better than ***John Wick: Chapter 4*** (62%), but that film's opening weekend was 3 times larger. Even with positive reviews and word of mouth, it doesn't appear like the audience was much interested in this.\n\nThrough 10 days, ***Ballerina*** has earned just $42.1 million domestically. If it keeps dropping like this, it will miss $60 million domestically. So there's a strong chance that it becomes the least attended film in the franchise (***John Wick***'s adjusted total is $58.4 million). Ouch.\n\n***Karate Kid: Legends*** recovered after its terrible drop last week. It dipped 38.7%, adding $5.2 million this weekend. Although the film's $44.4 million domestic total still leaves a lot to be desired.\n\nIn seventh place, ***Final Destination: Bloodlines*** eased 37.9% and earned $4 million. The film has amassed $130.7 million domestically, and it will finish with close to $140 million. Assuming it's not fully impacted by ***28 Years Later*** this week.\n\nWes Anderson's ***The Phoenician Scheme*** dropped 48.9% and added $3.2 million. That's actually a better drop than ***Asteroid City*** (53%). Impressive, considering the film's word of mouth wasn't as strong as that film. Through 2 weekends in wide release, the film has earned $12.9 million.\n\nNeon expanded Mike Flanagan's ***The Life of Chuck*** to 1,072 theaters, but the film disappointed in ninth place with just $2.3 million this weekend. That's Flanagan's worst debut in theaters; his three theatrical films all managed to open with at least $12 million. Sure, they all opened in far more theaters, but still.\n\nUnfortunately, this result isn't surprising. After all, the limited release last week was underwhelming, indicating it wasn't going to break out in its expansion. The film earned buzz when it surprisingly won the People's Choice Award at the Toronto Film Festival, suggesting it would be an awards player. Instead of cashing in on the buzz, Neon bought it and decided to set it for summer. In a sea of competition, it simply feels like the buzz died down in the past 9 months. It just didn't connect with audiences.\n\nDue to releasing in just 1,072 theaters, we don't have much data breakdown for the weekend. Now, the audience reception is very positive, which bodes well for its legs. Although with a debut this low (and little-to-no awards buzz), the film might not last long in theaters.\n\nRounding out the Top 10 was ***Sinners***, which dropped 45.8% for a $1.5 million weekend. The film has earned an incredible $275.5 million so far.\n\nA24's ***Bring Her Back*** is disappearing quickly. It collapsed 60%, adding $1.4 million this weekend. The film's domestic total stands at $17.6 million.\n\n***Thunderbolts*** is also nearing the end of its run. It collapsed 57.7%, earning just $1 million this weekend. The film has earned $188.5 million, and it will finish its run with around $192 million.\n\n#**OVERSEAS**\n\n***How to Train Your Dragon*** also led the box office in the rest of the world. It opened with a fantastic $114.1 million overseas, for a $198 million worldwide debut. The best debuts were in Mexico ($14M), the UK ($11.4M), China ($11.2M), Brazil ($7.8M), South Korea ($7.4M), France ($5.1M), Australia ($4.4M), Spain ($4.3M), Germany ($4M) and Italy ($3.3M). Nearly all of these markets are all franchise best. Like the domestic market, this should be the main attraction for families for the summer. The second film is the highest grossing in the franchise with $621 million worldwide, and the remake should easily fly past that. Expect more live-action DreamWorks remakes. For better or worse.\n\n***Lilo &amp; Stitch*** was impacted by ***Dragon***'s arrival. It dropped 54% and added $31 million this weekend, for a $858 million worldwide total. The best markets are Mexico ($61.8M), UK ($45.1M), France ($35.2M), Brazil ($31.8M) and Germany ($27M). While the film seemed like an \"easy billion\" based on its opening weekend, these drops are quite steeper than expected, and it has no new markets left to open. For now, $1 billion is still in the cards, but if it hits it, it won't be by much.\n\n***Mission: Impossible – The Final Reckoning*** added $21 million overseas, allowing it to cross $500 million worldwide. The best markets are China ($55.8M), UK ($31.2M), Japan ($27.3M), Korea ($21.6M) and France ($20.8M). It should pass ***Dead Reckoning*** worldwide, but it still remains to be seen if it will touch $600 million.\n\n***Ballerina*** added $13.5 million overseas, taking its worldwide total to $91 million. Barring a miracle recovery, the film will probably close with around $140 million worldwide. Damn.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*The Amateur* | Apr/11 | 20th Century Studios | $14,802,849 | $40,759,635 | $95,956,038 | $60M\n*The Accountant 2* | Apr/25 | Amazon MGM | $24,533,959 | $65,523,366 | $102,123,366 | $80M\n\n- ***The Amateur*** has closed with almost $96 million worldwide. Not a bad amount, although its $60 million budget put profitability quite high. While it started with some promise, it didn't really hold well in the coming weeks. There's potential in mid-budget thrillers, but the quality still needs to be there if it wants a chance at success.\n\n- But you know what not many expected? That ***The Accountant 2*** would finish with $102 million worldwide, barely above ***The Amateur***. That's a rough drop from the original's $155 million worldwide total, but it simply looks like the audience moved on after 9 years. Even when the original was a huge hit in home media and streaming. A sequel is in development, but it's more likely it will go to Prime Video instead.\n\n#**THIS WEEKEND**\n\nWe've got two wide releases. One will contend for the #1 spot, and the other is probably heading to some very ugly numbers.\n\nAfter so many years stuck in development in hell, Sony is finally releasing Danny Boyle's ***28 Years Later***, 18 years after the latest installment in the franchise. Like the previous films, there are no returning cast members, with Jodie Comer, Aaron Taylor-Johnson and Ralph Fiennes as the new leads. But what's important is the return of Boyle in the director's chair, alongside Alex Garland as the screenwriter. The film is also setting a higher bar than most horror films; it cost $75 million, more expensive than the average horror film. It's also set to launch a trilogy, with the second film already filmed and set for January 2026. How big will it be?\n\nThe other release is Pixar's ***Elio***, the company's 29th film. It follows an eleven-year-old boy named Elio who accidentally becomes the intergalactic ambassador of planet Earth after being beamed up to the Communiverse by aliens for making contact. The film has had a complicated release, given that it was supposed to come out in March 2024. And in the process, some aspects of the film were retooled, including replacing America Ferrera with Zoe Saldana. While Pixar hit gold last year with ***Inside Out 2***, there's no chance ***Elio*** opens anywhere close to that. The recent failure of other sci-fi animated films like ***Lightyear***, ***Strange World***, and ***Transformers One*** puts a lot more pressure on this film.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 70,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FtLNLU5zLaW96xH2ENmHEJgSu1-d7oDCGDXdC0vjs2M.png?auto=webp&amp;s=c166b4733996974718b16a87958366b080820561"
        },
        "permalink": "/r/movies/comments/1ld74m5/june_1315_box_office_recap_how_to_train_your/"
    },
    {
        "id": "1ldc0ok",
        "author": "BunyipPouch",
        "title": "First Image for Comedy-Thriller 'Anything That Moves' - An innocent Chicago food delivery boy, after having sex for money, finds himself involved in a series of murders that can be traced back to someone who was in his bed. - A tribute to 1970s X-rated films and erotic-thrillers.",
        "content": "",
        "upvotes": 1527,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pryvlx4kge7f1.png?auto=webp&amp;s=2176372f0b65069dad2dfbc0e0812474b89b60cf"
        },
        "permalink": "/r/movies/comments/1ldc0ok/first_image_for_comedythriller_anything_that/"
    },
    {
        "id": "1ld5tb9",
        "author": "Amaruq93",
        "title": "\"Titan A.E.\" at 25 | History has been kind to the 2000 animated sci-fi flop that killed Fox Animation Studios",
        "content": "",
        "upvotes": 3525,
        "comments": 371,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fanG9ygcYfpn0n5Yglg75fXlyNS9VJKw7xklczZW4Fo.jpeg?auto=webp&amp;s=99c9a03d27b5195873f53e05e929dce1a9e36d39"
        },
        "permalink": "/r/movies/comments/1ld5tb9/titan_ae_at_25_history_has_been_kind_to_the_2000/"
    },
    {
        "id": "1lcs81p",
        "author": "MarvelsGrantMan136",
        "title": "The Naked Gun | Official Trailer",
        "content": "",
        "upvotes": 13904,
        "comments": 1743,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Eg7lNqurnPN2pVFaMiuyKkshyonWytsEzEy3W8SedvU.jpeg?auto=webp&amp;s=f7b7280d5619dff610dbf30945cd72ed9524847e"
        },
        "permalink": "/r/movies/comments/1lcs81p/the_naked_gun_official_trailer/"
    },
    {
        "id": "1lde51f",
        "author": "today_okay",
        "title": "What actor or director do you think has lost their touch?",
        "content": "I really am kind of disappointed by the trajectory of Tim Burton. He went from truly bizarre and kooky to kind of a strange brand owner of his own style - kind of a caricature. I think the stuff from Cameron Crowe lately has been off. I would imagine that we'll never get a great movie out of Oliver Stone or David Mamet ever again...",
        "upvotes": 363,
        "comments": 596,
        "media": null,
        "permalink": "/r/movies/comments/1lde51f/what_actor_or_director_do_you_think_has_lost/"
    },
    {
        "id": "1ld9lu5",
        "author": "MiddleOwn5557",
        "title": "What opening scene has little or nothing to do with the movie plot?",
        "content": "This came to mind while watching Flight of the Navigator\n\nThe opening scene: [https://www.youtube.com/watch?v=MwtkUw717TQ](https://www.youtube.com/watch?v=MwtkUw717TQ)\n\nIt's got one glaring element like the flying disc which is then revealed to be a frisbee. But, the whole dogs catching frisbees has nothing to do with the movie plot.\n\nCan you think of any other examples?",
        "upvotes": 535,
        "comments": 299,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Bi0uU4uMmxOSaQ6GtlxuaXGOLNCpHdjvEV8BauzDZ5k.jpeg?auto=webp&amp;s=6068db77446e69eee6d96b28ccdde9beaa3679ed"
        },
        "permalink": "/r/movies/comments/1ld9lu5/what_opening_scene_has_little_or_nothing_to_do/"
    },
    {
        "id": "1ld5j2r",
        "author": "MarvelsGrantMan136",
        "title": "Carla Gugino Joins Brad Pitt In New ‘Cliff Booth’ Movie From Netflix And David Fincher",
        "content": "",
        "upvotes": 931,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2NqKxasHleuEm1q2L2zyLt0MznPr_jA-jT8LurHOyvw.jpeg?auto=webp&amp;s=d49eea0d7757a9bd54be3c6432cab0ea5252c79f"
        },
        "permalink": "/r/movies/comments/1ld5j2r/carla_gugino_joins_brad_pitt_in_new_cliff_booth/"
    },
    {
        "id": "1lcs8kq",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Ari Aster's 'Eddington'",
        "content": "",
        "upvotes": 3866,
        "comments": 481,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6ybry65cfa7f1.jpeg?auto=webp&amp;s=a3d48284a7b7c1c551e5eefe7fc4f16bfb78f061"
        },
        "permalink": "/r/movies/comments/1lcs8kq/new_poster_for_ari_asters_eddington/"
    },
    {
        "id": "1ld6zd8",
        "author": "HatingGeoffry",
        "title": "Monty Python And The Holy Grail 50th Anniversary 4K Blu-Ray Launching Soon",
        "content": "",
        "upvotes": 637,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ah6zPsFFp4zDPtl07Q2se3AycDghGXhfnqCNkXB7tyE.jpeg?auto=webp&amp;s=8942c5825979f0ddc57e2cc5e5970225ca6ed40e"
        },
        "permalink": "/r/movies/comments/1ld6zd8/monty_python_and_the_holy_grail_50th_anniversary/"
    },
    {
        "id": "1ld75yw",
        "author": "MarvelsGrantMan136",
        "title": "David Hekili Kenui Bell Dead – ‘Lilo &amp; Stitch’ Shave Ice Guy Passes Away Just Weeks After Movie Release",
        "content": "",
        "upvotes": 608,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1ld75yw/david_hekili_kenui_bell_dead_lilo_stitch_shave/"
    },
    {
        "id": "1lcywlt",
        "author": "magikarpcatcher",
        "title": "‘Deep Cover’ Review: Bryce Dallas Howard and Orlando Bloom play improv actors working an undercover police sting in a winningly silly comedy",
        "content": "",
        "upvotes": 1052,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6t8dPLTC2_PtYtVdzKhnlSaDdViHFTGqyUsy2CzfQJU.jpeg?auto=webp&amp;s=c51628c2802ebaedb8b6d5d7b4e95d767613ded8"
        },
        "permalink": "/r/movies/comments/1lcywlt/deep_cover_review_bryce_dallas_howard_and_orlando/"
    },
    {
        "id": "1lcxbzi",
        "author": "ChiefLeef22",
        "title": "Official 20th Anniversary Re-Release Poster for 'Brokeback Mountain'",
        "content": "",
        "upvotes": 957,
        "comments": 157,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p48wgx0jfb7f1.jpeg?auto=webp&amp;s=05669a097457fe2b7886d516d7ad819eae09d1c8"
        },
        "permalink": "/r/movies/comments/1lcxbzi/official_20th_anniversary_rerelease_poster_for/"
    },
    {
        "id": "1ldeq7t",
        "author": "tjalek",
        "title": "King Arthur Legend of the Sword is probably the craziest that Guy Ritchie has gone",
        "content": "I remember when Snatch was one of those films that everyone had on DVD in the early days, saw the Sherlock films in cinema and always wanted a RocknRolla sequel, his style was so distinct\n\nBut then I fell off Guy Ritchie until The Covenant and then I watched his films since Aladdin.\n\nI noticed that he had played it straighter than I would have expected in Aladdin, The Covenant and Fountain of Youth and I wondered why. that zany super British way he would cut together scenes.\n\nI didn't like Wrath of Man, felt very B grade.\n\nThe Gentlemen and Operation Fortune felt most like him since and Ungentlemanly had elements of his zaniness.\n\nThen I saw King Arthur, which was such an over the top hyper Guy film, that I almost expected some freeze frame 4th wall breaking moments. I loved it, it's so crazy.\n\nHowever it being such a big box office bomb and critical failure. I wouldn't be surprised if it made him more wary to be himself as much and became more of a director for hire.\n\nLooking forward to rewatching King Arthur again actually, it's so nuts.\n\nEDIT: The montage, the dlalogue, the big ass snake towards the end, the slow mo 360 degree camera shots are so insanely over the top hahahaha, it's time to make it a cult classic.",
        "upvotes": 87,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1ldeq7t/king_arthur_legend_of_the_sword_is_probably_the/"
    },
    {
        "id": "1lcm75u",
        "author": "Warmwombie",
        "title": "My crush is coming over… I need a movie that says “I have great taste” but also “I won’t mind if we end up making out halfway through”",
        "content": "Hey r/movies, I need some help.\n\nMy crush is coming over for a movie night and I want something that hits the sweet spot — interesting enough to show I have great taste, but chill enough that it won’t be awkward if we get distracted halfway through. Nothing too intense or super emotional. Think cool, vibey, maybe a little flirty.\n\nSomething that says “I’m fun and effortlessly hot” without me having to say it.\n\nDrop your best recommendations — I’m relying on you all to save this night!",
        "upvotes": 5393,
        "comments": 3956,
        "media": null,
        "permalink": "/r/movies/comments/1lcm75u/my_crush_is_coming_over_i_need_a_movie_that_says/"
    },
    {
        "id": "1ldfn2v",
        "author": "MaxRichter_Enjoyer",
        "title": "The Saint (1997) - trailer, with Val Kilmer and Elisabeth Shue. Great and fun spy movie.",
        "content": "",
        "upvotes": 58,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TcPFWzFCmBSOKqXcItccNnQWECuzae7bCCqSDgVHMVA.jpeg?auto=webp&amp;s=7ed2c332b65a82e2a0ccdbb10d2fa3fc3d45888a"
        },
        "permalink": "/r/movies/comments/1ldfn2v/the_saint_1997_trailer_with_val_kilmer_and/"
    },
    {
        "id": "1ld7kjj",
        "author": "stormbringermacmanus",
        "title": "What is this trope called in movies?",
        "content": "Where a character is refusing point blank to do something and then we cut to them doing that exact thing… for example in 65 when the Adam Driver is refusing to let the little girl put the flower in his hair… cut to later as they walk along and he has the flower in his hair…there must be hundreds of other examples but I can’t think of another right now.",
        "upvotes": 135,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1ld7kjj/what_is_this_trope_called_in_movies/"
    },
    {
        "id": "1lcs6l6",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'A Big Bold Beautiful Journey' Starring Margot Robbie and Colin Farrell",
        "content": "",
        "upvotes": 860,
        "comments": 136,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z38qg8pxea7f1.jpeg?auto=webp&amp;s=37137751f93ae0717b58420d7b5b91939f4c5ef6"
        },
        "permalink": "/r/movies/comments/1lcs6l6/official_poster_for_a_big_bold_beautiful_journey/"
    },
    {
        "id": "1ldbw7i",
        "author": "Striking_Courage_822",
        "title": "Quick help! Romance or rom com to watch with my 92 year old grandpa",
        "content": "We both like other genres but this is our only common ground lol. We are open to any decade. Nothing TOO grossly sexual bc it’s my grandpa but we’re not prudes either. He can’t follow very complex storylines anymore but I’m trying to avoid the hallmark crap he usually makes me watch. Some we’ve loved in the past: Roman holiday, easy a, Jerry McGuire, legally blonde. ",
        "upvotes": 61,
        "comments": 170,
        "media": null,
        "permalink": "/r/movies/comments/1ldbw7i/quick_help_romance_or_rom_com_to_watch_with_my_92/"
    },
    {
        "id": "1ldgomz",
        "author": "SquishyThorn",
        "title": "Just finished “The Game” 1997",
        "content": "The ending has me pissed off so bad. They drove him to suicide and then celebrated it. If that was my brother I would never forgive him. I know it’s a movie, that’s the point, etc. But they lost me when he was thanking people for coming to his birthday at the end. They caused him so much trauma! I would want to sue the shit out of them. ",
        "upvotes": 18,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1ldgomz/just_finished_the_game_1997/"
    },
    {
        "id": "1lcxm38",
        "author": "LeviBateman",
        "title": "What was the de facto heist movie before Ocean's 11?",
        "content": "Maybe this is more of a personal take than I'm realizing, but it seems like Ocean's 11 (2001) is the prototypical example of what a heist movie is.  So many components: the rag-tag group of thieves, the ping-pong dialogue, the editing, the style of the music, the inevitable ending where it appears that the plan is going to fail but of course that is just part of the larger plan; all of these elements seem to be so closely associated with the heist film genre that whenever someone does a parody or pastiche of one, they always reference Ocean's 11.\n\nObviously, there have been other heist movies since, but none have seemed to leave the same mark on the genre.  At the same time, Ocean's 11 is relatively young in the film timeline (just a little over 20 years old), so what was the movie before it that people used to point to as the perfect example of a heist movie?\n\nEdit: Thanks for all the responses guys!  I'm excited to check out some of the movies you all have mentioned.  The Italian Job, Sneakers, The Thomas Crown Affair, The Great Train Robbery, and Rififi are all on my list now!  Additionally, I love The Sting and, thinking about it, I can see its influence on Ocean's 11 (even if the style is wildly different between the two).  I've also watched Heat recently.  It's hard for me to think of it as a heist movie.  Yes, there is a heist in it, but it's such a small portion of the overall story and it's already pulled off by the last act of the film.  While a great movie, I don't know if I consider it \"heist movie\".",
        "upvotes": 272,
        "comments": 476,
        "media": null,
        "permalink": "/r/movies/comments/1lcxm38/what_was_the_de_facto_heist_movie_before_oceans_11/"
    },
    {
        "id": "1ldhmlr",
        "author": "Gullible_Eagle4280",
        "title": "What are some Mindless Action Movies to Watch just Purely for the Action?",
        "content": "My wife loves action movies and we’ve pretty much seen what I would call all “the good ones” plenty of action but decent storylines/plots/acting as well. So we’ve watched The Mission Impossible series, John Wick series, Taken series, all the Jason Stratham titles etc. So what are some “B Movies” that are action packed but maybe don’t have any “A-List” actors in the lead role(s)? Extra points for ones with lots of machine guns! TIA",
        "upvotes": 14,
        "comments": 92,
        "media": null,
        "permalink": "/r/movies/comments/1ldhmlr/what_are_some_mindless_action_movies_to_watch/"
    },
    {
        "id": "1ld7ptg",
        "author": "BunyipPouch",
        "title": "Rob Delaney Visits the Criterion Closet",
        "content": "",
        "upvotes": 63,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Q1TBvc9tsXIaJ5CCn-0GeeY-SCTWv-VwWG-fGMgOuRI.jpeg?auto=webp&amp;s=4b069dd04d31eee48d57ba5aaac8c064393e0945"
        },
        "permalink": "/r/movies/comments/1ld7ptg/rob_delaney_visits_the_criterion_closet/"
    },
    {
        "id": "1ldgw1w",
        "author": "LoneWolfIndia",
        "title": "Vera Farmiga",
        "content": "One of my favorite actresses, she has a typical old world charm, absolutely graceful and sensual. And damn talented on top of it. An actress who has made her name with a host of great performances mostly in Indie cinema.\n\nhttps://preview.redd.it/5xvrpyddtf7f1.png?width=1683&amp;format=png&amp;auto=webp&amp;s=3638822a30d0ee2869d3b39d47b00873746bed15\n\nOf Ukrainian origin, dad a systems analyst, and mom a school teacher. She herself is a semi professional folk dancer, and a trained pianist.\n\nhttps://preview.redd.it/s631v9gstf7f1.png?width=485&amp;format=png&amp;auto=webp&amp;s=32fecb32258bf85727d7104b6d8118ead669ea72\n\nThe performance that got her noticed would be Down to the Bone in 2004, as a single mom, addicted to cocaine, delivering a knockout performance. \n\nhttps://preview.redd.it/qrx6nxcduf7f1.png?width=277&amp;format=png&amp;auto=webp&amp;s=4e5d6ca2f83d5c384fd8a8dc4732f20e45e09538\n\nIn an ensemble cast that had Leo, Matt Damon, Jack Nicholson, Martin Sheen, Mark Wahlberg and Alec Baldwin, she still got noticed as Dr. Marolyn Madden in Martin Scorcese's The Departed, a police pyschiatrist, who is initially involved with Damon, and later gets into an affair with Leo. One gorgeous shrink must say.\n\nhttps://preview.redd.it/w6v7b7hmuf7f1.png?width=320&amp;format=png&amp;auto=webp&amp;s=83bbe6834dd1adce732b5ed57eeef6f74e5064c3\n\nOne excellent performance in the war drama, **In Tranzit** , as a Russian female prison warden, who gets into a romantic relationship with a German POW. Her Ukrainian roots made it easy for her to slip into this role.\n\nhttps://preview.redd.it/ta2d8koouf7f1.png?width=320&amp;format=png&amp;auto=webp&amp;s=2a895840086261f272f0c4bdaffa74f53b765cbf\n\nOne of her finest performances in the Holocaust drama, **The Boy In the Striped Pyjamas,** as Elsa Hoess, the wife of a senior Nazi official, whose son befriends a Jewish prisoner. The ending scene when she breaks down, knowing the truth of her son is quite haunting.\n\n\n\nhttps://preview.redd.it/th6gdhvruf7f1.png?width=1440&amp;format=png&amp;auto=webp&amp;s=1c75846518135408a3f399ca33f897ace538fa03\n\nAnother great performance as Kate Coleman, the mother who needs to make a difficult choice in the horror flick, The Orphan.\n\nhttps://preview.redd.it/fo31evfyuf7f1.png?width=600&amp;format=png&amp;auto=webp&amp;s=38510199d53ccfede8a04820adb1a39973d99352\n\nUp in the Air, the 2009 comedy drama, with George Clooney, where she played the role of Alex Goran, a businesswoman, who gives George Clooney a fresh perspective on life, great performance again. One of my favorite rom coms.\n\nhttps://preview.redd.it/jati3i5evf7f1.png?width=195&amp;format=png&amp;auto=webp&amp;s=0757d426a8029c1aa6194dac36c931e5a730d455\n\nAnd Lorraine Warren, the paranormal investigator in the Conjuring series, that made her widely popular.\n\n\n\n\n\n\n\n\n\n\n\n",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1ldgw1w/vera_farmiga/"
    },
    {
        "id": "1ld6v71",
        "author": "BunyipPouch",
        "title": "Jake Gyllenhaal In Talks To Star In Amazon MGM's Political-Thriller 'Code Black' - The 7-figure deal is one of the biggest all time for a short story - The country’s top heart surgeon is flown to D.C. to perform an operation, finding himself led into a trap that threatens his family &amp; the nation.",
        "content": "",
        "upvotes": 57,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n0ysiEbyE5Zq4LFSetCeMOc05x6xw1AnCF_3yLU3PS8.jpeg?auto=webp&amp;s=4949773ebc802010dcca11e21443d561cdaa875d"
        },
        "permalink": "/r/movies/comments/1ld6v71/jake_gyllenhaal_in_talks_to_star_in_amazon_mgms/"
    },
    {
        "id": "1lcygmj",
        "author": "SanderSo47",
        "title": "Lynne Ramsay's ‘Die, My Love’, Sets November 7, 2025 Wide Release – Starring Jennifer Lawrence, Robert Pattinson, LaKeith Stanfield, Sissy Spacek, and Nick Nolte.",
        "content": "",
        "upvotes": 129,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M0MRc9QDhFq9nX3KuOrvg9O3IawLtpXJYXhm65a6NCo.jpeg?auto=webp&amp;s=5ae4e879c97fcfde3e3afa0dd533c41935bc0494"
        },
        "permalink": "/r/movies/comments/1lcygmj/lynne_ramsays_die_my_love_sets_november_7_2025/"
    },
    {
        "id": "1lc3qgs",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Naked Gun' Starring Liam Neeson &amp; Pamela Anderson",
        "content": "",
        "upvotes": 48308,
        "comments": 2059,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nuz4on7y547f1.jpeg?auto=webp&amp;s=113208f6df2d979633b6b51c2ca3269a3674643e"
        },
        "permalink": "/r/movies/comments/1lc3qgs/new_poster_for_the_naked_gun_starring_liam_neeson/"
    },
    {
        "id": "1lcv7yq",
        "author": "hamburglin",
        "title": "The build up to, and the practical werewolf suit of Underworld Evolution at 1:21 is legitimately impressive to this day",
        "content": "I go back to this scene every once in a while. It still gets me pumped. The werewolf's suit and presence is intense. The practical effect is still well beyond CGI in 2025. It feels real, strong and gritty.\n\nSadly, they didn't show him performing many power attacks. He's typically sitting there or running away. When he gets a one on one with the hybrid, he gets his head ripped off almost immediately in one of the most pathetic ways possible. I don't think most people were actually rooting for the hybrid there. He's just not interesting.\n\nEdit: the scene is when the werewolf is finally released from his century long prison and aggressively towers over his brother.\n\n50 seconds in:\n\nhttps://youtu.be/ML1dM5D64Ws?si=aVBSDAYMJkre9Bl1",
        "upvotes": 213,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CBQXz5ZBlXQT28dpAqMQL3U4elPzjwPrVObSWDtD0vQ.jpeg?auto=webp&amp;s=efe39b542b312a2682318134eafc948136578082"
        },
        "permalink": "/r/movies/comments/1lcv7yq/the_build_up_to_and_the_practical_werewolf_suit/"
    },
    {
        "id": "1lce00i",
        "author": "RejectingBoredom",
        "title": "What’s your favourite “bad guy realises it’s over” moment?",
        "content": "Particular actors who really nail the facial expression of defeat in a movie. \n\nOne of my favourites is when Nichols sees Kimble walk into the conference at the end of The Fugitive, another is Charnier seeing the police cars at the end of The French Connection (even though the ending doesn’t actually pan out as you’d think). Mola Ram’s terror when Indy starts cutting the rope is another great one. \n\nJust those looks of abject “shit, I’m not supposed to go down like this” moments on a villain’s face that makes the ending so much more satisfying. \n\nI find in action movies there’s something really actually quite deflating and underwhelming about just killing the bad guy. It’s better when he knows he’s lost. ",
        "upvotes": 3264,
        "comments": 2376,
        "media": null,
        "permalink": "/r/movies/comments/1lce00i/whats_your_favourite_bad_guy_realises_its_over/"
    },
    {
        "id": "1ld11z0",
        "author": "BunyipPouch",
        "title": "Criterion Collection Announces September Releases: 4K UHD: Flow, This Is Spinal Tap, The French Dispatch, Isle of Dogs, High and Low, Read My Lips, Wes Anderson Collection - Blu Ray: The Beat That My Heart Skipped, Born In Flames",
        "content": "",
        "upvotes": 86,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Wpr69GlVoau0oFBgEy81_HQSndlcxtFY0JIkSNFaEO4.png?auto=webp&amp;s=6eff3b3c65dd904038d01cab50833eec3a7ff56f"
        },
        "permalink": "/r/movies/comments/1ld11z0/criterion_collection_announces_september_releases/"
    },
    {
        "id": "1lcpd5p",
        "author": "FilmWaffle-FilmForum",
        "title": "Which two actors do you always mistake for each other?",
        "content": "Mine is Kurt Russell and Jeff Bridges. I can tell them apart if they’re both in front of me but every single time I see either of them in a movie, I have to search up the cast just to confirm I’m not confusing one with the other.\n\nIt doesn’t help that both of them are relatively similar in terms of what movies they star in, especially over the past 20 years. ",
        "upvotes": 319,
        "comments": 709,
        "media": null,
        "permalink": "/r/movies/comments/1lcpd5p/which_two_actors_do_you_always_mistake_for_each/"
    },
    {
        "id": "1ld5ep3",
        "author": "Caledor152",
        "title": "‘Alien: Earth’ Star Sydney Chandler &amp; ‘Shōgun’ Star Takehiro Hira Starring In Sci-Fi movie ‘Anima’",
        "content": "",
        "upvotes": 39,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/resY9GSnDPm8717Sk5Xo5REgvtDab_l25tmUGfmf3V8.jpeg?auto=webp&amp;s=c6870ff2dd828016092cc8c5580499d2fb0096f5"
        },
        "permalink": "/r/movies/comments/1ld5ep3/alien_earth_star_sydney_chandler_shōgun_star/"
    }
]