[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 673,
        "comments": 5036,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1no1yfg",
        "author": "OverPotato2322",
        "title": "Netflix is reportedly Interested in buying Warner Bros.",
        "content": "",
        "upvotes": 79,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1no1yfg/netflix_is_reportedly_interested_in_buying_warner/"
    },
    {
        "id": "1no9tsh",
        "author": "ChipInDistress",
        "title": "Spoiled it for myself",
        "content": "Saw a trailer for the show “The Residence” on Netflix and just started the first episode a couple minutes ago. In the introduction/credits there’s a person walking on top of the White House as the camera zooms out, so out of curiosity I googled who that was thinking nothing of it… The google AI summary said it was the killer and the characters name as well so all the mystery is gone now. Hope it’s still worth a watch. P.S I’m sorry if this doesn’t belong here I’m just frustrated.",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1no9tsh/spoiled_it_for_myself/"
    },
    {
        "id": "1nn8wrx",
        "author": "iSwaggyP",
        "title": "They are joking right?",
        "content": "This shit made me cancel. How many more subscribers do you think they are going to lose because of this? I’m officially done with this disgrace of a streaming app  ",
        "upvotes": 993,
        "comments": 315,
        "media": null,
        "permalink": "/r/netflix/comments/1nn8wrx/they_are_joking_right/"
    },
    {
        "id": "1no5nhg",
        "author": "Peppermint07_",
        "title": "Black Rabbit - question about plot",
        "content": "In one scene, detective Seung mentions to her partner or someone that they found the watch box inside her (Anna Dixon) closet. What watch box? Junior left Vince’s fake watch there, how come a watch box also shows up there? Can anybody explain? Thanks in advance!",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1no5nhg/black_rabbit_question_about_plot/"
    },
    {
        "id": "1no3lhi",
        "author": "hurricanescout",
        "title": "Billionaires bunker",
        "content": "Starting a thread for the hatewatch. I can’t get over how BAD it is. Like it had potential: they could’ve had romance between the ppl working there and the billionaires. They could’ve had multiple attempts to scam the different billionaires out of their money. They could’ve actually had some dramatic tension of folks figuring it out, trying to escape, an actual uprising. Folks on the outside could’ve figured it all out and it turns into a hostage negotiation without the billionaires knowing they were hostages. Instead other than them actually getting them in to the bunker, I’m in episode 8 and there’s been more action in an hour of my abuela’s daily telenovela. Not to mention dead lesbian syndrome within an hour of her appearing, and some casual antisemitism (come on, the wealthiest most evil billionaire just happens to be Jewish and he’s the only one whose religion or ethnicity is mentioned? 🙄🤦‍♀️). I’m not even getting to the plot holes. So yeah. Feel free to pile on: worst thing I’ve seen since Berlin came out. Guys, Money Heist was great. But that was your one great idea. Let it go. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1no3lhi/billionaires_bunker/"
    },
    {
        "id": "1no9423",
        "author": "cmatty12",
        "title": "Why did Vince go to the same fence that junior setup?",
        "content": "I just finished *Black Rabbit*. What an amazing and intense show.\n\nSomething that doesn’t make sense to me though is the ending. **Spoilers ahead — stop reading if you haven’t finished.**\n\nAt the end, Junior forces Vince to rob the Black Rabbit with him. Since Vince was masked, no one knew who the second gunman was. Later, Vince kills Junior to save his brother Jake, which obviously puts him on a collision course with Junior’s father.\n\nHere’s my confusion: why on earth does Vince go to the *same fence* that Junior was planning to use? By doing that, he exposes his identity. Junior’s father learns exactly who he is, and it puts everyone in danger.\n\nIf Vince had just stayed away, no one would have ever been able to confirm for sure that he was the other shooter. Going to the fence with the jewels was basically like announcing, “Yes, I was the second robber.”\n\nAm I missing something here? Was there a reason he *had* to go to that fence, or is this just a plot hole?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1no9423/why_did_vince_go_to_the_same_fence_that_junior/"
    },
    {
        "id": "1nnzy6i",
        "author": "golosee",
        "title": "Haunted Hotel Nathan",
        "content": "Am I the only one that can’t stop thinking about Nathan??? He broke my heart and the relationship he has with Katherine is so touching! I hate growing attached to characters this quickly (especially if they’re from an animated Netflix show) but I really do love that character. I NEED to see how he develops…",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nnzy6i/haunted_hotel_nathan/"
    },
    {
        "id": "1nnvai0",
        "author": "Monkeyallens",
        "title": "Black Rabbit is too Dark",
        "content": "It was worth binge watching, great acting, story was OK and it kept you interested. It was just too dark. I really wish they lightened it up a bit, it would be more enjoyable to watch. ",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nnvai0/black_rabbit_is_too_dark/"
    },
    {
        "id": "1no8o5t",
        "author": "Sea-Possession8260",
        "title": "I need help",
        "content": "https://preview.redd.it/a0b49vppjuqf1.png?width=790&amp;format=png&amp;auto=webp&amp;s=261bf9deaa2fcf8b0ce226388925f7f3c48e824d\n\nI don't know If this asked before, but I need help. This account owned by my brother in-law family and he let me use this since he was busy with work and no time for Netflix. Its been working for few weeks until this happened, at first I thought I got banned by his family allowing me not to use Netflix but I found out it was to do with Netflix Household Wifi or something, I don't know what that means, I been using the same wifi the moment I start netflix.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1no8o5t/i_need_help/"
    },
    {
        "id": "1no3ph5",
        "author": "pinkyepsilon",
        "title": "Isn’t Black Rabbit a retelling of Othello?",
        "content": "While not direct, I see the psychological manipulation, trauma, and unraveling of the characters an interesting retelling of Othello with these similar themes?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1no3ph5/isnt_black_rabbit_a_retelling_of_othello/"
    },
    {
        "id": "1no0rii",
        "author": "Just-Professional667",
        "title": "Help me find this show/movie??",
        "content": "A few years ago I remember watching this show or movie. It had to have been a short one season show I know that. All I can remember about the general premise is that a woman wanted a man who was married. She was wealthier and all I know the show was dark and mysterious 💀send help please. I can’t remember if she hurt the wife or something but somehow he was manipulated into sleeping w her or something? \n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1no0rii/help_me_find_this_showmovie/"
    },
    {
        "id": "1no29du",
        "author": "babtundeog",
        "title": "Why do I still see ads",
        "content": "I have the standard package which doesn't include ads. However when watching a live event,im getting ad breaks on my laptop and my tv. This doesn't happen on my phone though. Is there a specific reason for it, or is it an app issue?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1no29du/why_do_i_still_see_ads/"
    },
    {
        "id": "1nndyfm",
        "author": "TransmanLSD",
        "title": "i need a show to watch where i’m not going to want to pause it",
        "content": "i need a show to binge that’s really good. i like psychological, teen drama, supernatural (vampires preferably)\ni also enjoy cop/detective shows. \nrecent ones i binged and finished:\n- The Bates motel\n- beauty in black \n- Adolescence \n- Your Honor\ni’ve also enjoyed LOST and TWD\n",
        "upvotes": 39,
        "comments": 136,
        "media": null,
        "permalink": "/r/netflix/comments/1nndyfm/i_need_a_show_to_watch_where_im_not_going_to_want/"
    },
    {
        "id": "1nnlqvr",
        "author": "Aggravating-Big-6248",
        "title": "Can we talk about Billionaires' Bunker?",
        "content": "So, can we talk about *Billionaires' Bunker*? I’m kinda pissed about how it ended. I hate finales like that – they could’ve at least given us one more episode. Obviously I went straight to Google to check if season 2 is coming.\n\nI *do* love this type of show – kind of a mix between *Fallout* and *Silo*, but with a melodrama twist. Still, I’m torn. It got so over the top at times that it lost all sense of authenticity, and some of the relationships really started to bug me.\n\nAnd don’t even get me started on Guillermo Falcón and all his endless affairs… that got exhausting real fast.\n\nI don’t even know how to fully put my feelings into words yet, which is why I’m curious what you all thought.",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nnlqvr/can_we_talk_about_billionaires_bunker/"
    },
    {
        "id": "1no2rya",
        "author": "chloe-decker666",
        "title": "I’m so confused",
        "content": "Ok so I have Netflix (obviously) and it’s doing this weird thing where if I try to watch it on my tv it changes my icon and there are shows that are no longer there that should be like supernatural I was watching it and now it’s just disappeared off of my tv Netflix but it’s still there on my phone. What is wrong with it and how can I fix it? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1no2rya/im_so_confused/"
    },
    {
        "id": "1nnx22g",
        "author": "Mediocre-Fan-495",
        "title": "Jamie's sweater in Adolescence Ep.1",
        "content": "When Jamie had to change his clothes at the station, I swear the sweater looks like it's on backwards.  Way too high on the neck in the front and lower in the back.  I noticed it immediately and it was bothering me the rest of the episode.\n\nAnyone else catch that?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nnx22g/jamies_sweater_in_adolescence_ep1/"
    },
    {
        "id": "1nnwhpa",
        "author": "[deleted]",
        "title": "Series like Top Boy?",
        "content": "I'm currently watching Top Boy for the second time in my life and it's still as enjoyable as ever, however I would love to see a new series. Any suggestions?",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nnwhpa/series_like_top_boy/"
    },
    {
        "id": "1nnt24c",
        "author": "YashrajMittal",
        "title": "Netflix &amp; Chill",
        "content": "Alice in Borderland is such a good series I would say binge watching it.. Epic masterpiece. I hope the season 3 doesn't disapponts us and turns out to be fantastic... ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnt24c/netflix_chill/"
    },
    {
        "id": "1nnr49m",
        "author": "clarissedbvr",
        "title": "M'entends-tu saison 3",
        "content": "Je désespère de trouver la saison 3 de la série québécoise \"M'entends-tu ?\" ou \"Do you hear me ?\" en anglais. Je suis en France pour info, et sans succès sur le site Télé Québec et sur Plex... help je suis fru",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnr49m/mentendstu_saison_3/"
    },
    {
        "id": "1nmsohn",
        "author": "HushedCamel",
        "title": "Is there a way to stop shows you've already watched being suggested?",
        "content": "As the title says.  Half the suggestions are movies and tv series I've just watched - I want fresh things!\n\nALSO, is there a way to block certain genres being suggested?  I watch mostly English and Korean language shows/movies... but now I'm getting constant suggestions for Indian things which I have 0 interest in.  Is there a settings function I'm missing?",
        "upvotes": 114,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1nmsohn/is_there_a_way_to_stop_shows_youve_already/"
    },
    {
        "id": "1nne3af",
        "author": "RevolutionaryDraw898",
        "title": "The Starling",
        "content": "Starring Melissa McCarthy Kevin Kline and the Irish guy from Bridesmaids. If you are looking for a feel good movie to watch on Netflix. Of course it has a bit of comedy but it’s mostly a drama. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nne3af/the_starling/"
    },
    {
        "id": "1nmmpx2",
        "author": "swaggy72",
        "title": "Black Rabbit is Phenomenal",
        "content": "I cannot believe I would get that much hooked on anything. The show is absolutely amazing and everyone should go and watch it. Every freaking moment had me on edge. Can't expect anything better.\n\nDon't listen to the people saying its no good. Trust me I have wasted a lot of time on shows that I leave halfway. This one will keep you hooked for all 8 hours.",
        "upvotes": 176,
        "comments": 125,
        "media": null,
        "permalink": "/r/netflix/comments/1nmmpx2/black_rabbit_is_phenomenal/"
    },
    {
        "id": "1nnlie0",
        "author": "Less-Information-463",
        "title": "Low quality movies",
        "content": "Like the title says, some movies, or shows, just have bad quality. I watched Sisu, Becoming Led zeppelin and The darkest hour, all of them have low resolution, even on the phone. But other movies have great resolution. Am I the problem or Netflix?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnlie0/low_quality_movies/"
    },
    {
        "id": "1nnvxwu",
        "author": "grumpioldman",
        "title": "Wednesday (Addams family spin off)",
        "content": "This has good reviews but I can only think people have become used to non existent storylines and piss-poor acting.\nI was hoping it would have some quality, some reason to be but after about 20 minutes I turned it off.\nAppalling.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nnvxwu/wednesday_addams_family_spin_off/"
    },
    {
        "id": "1nnhck4",
        "author": "Known-Plant-3035",
        "title": "JDrama Unnatural not showing up in netflix despite nowhere saying it was taken down?",
        "content": "I am in the Asia region. I was watching the jdrama Unnatural yesterday, but checked netflix today and it was just gone? Gone from my recents, gone from the search panel, I even searched it up on google and went in from there, yet it just showed loading screen that would not load. Usually when I load a show from google when it’s been taken down, it shows the show information, but doesn’t allow me to play it. I also checked to see if anything was taken down recently and Unnatural was not one of it. Anyone knows why?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnhck4/jdrama_unnatural_not_showing_up_in_netflix/"
    },
    {
        "id": "1nnkjmm",
        "author": "ApprehensiveSock8145",
        "title": "Mais temporadas de pesca implacável",
        "content": "alguém sabe informar se a série pesca implacável foi descontinuada pela netflix?! gostei muito da série e acho uma pena não ter mais temporadas, até comentei com vários amigos e realmente sentimos falta de mais episódios.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnkjmm/mais_temporadas_de_pesca_implacável/"
    },
    {
        "id": "1nmqbn6",
        "author": "Sea-Possession8260",
        "title": "Is SHAMELESS that good? How is it?",
        "content": "A few months I got bored and decide to watch all the top show in Netflix, such as Better Call Saul, Breaking Bad, the Witcher, Ozark and decide to watch Shameless next but I saw it was just bunch of families together, like slice of life show. \n\nIs there any action? I mean if its not, then its fine for me as long its good. ",
        "upvotes": 31,
        "comments": 125,
        "media": null,
        "permalink": "/r/netflix/comments/1nmqbn6/is_shameless_that_good_how_is_it/"
    },
    {
        "id": "1nmu8j0",
        "author": "Main-Doughnut6222",
        "title": "Kingdom: a masterclass in political intrigue and human greed",
        "content": "I’d been sitting on Kingdom for a while and honestly regret not watching it sooner. I went in expecting a typical zombie drama with mindless gore, but wow this was something else entirely.\n\nIt felt like Game of Thrones collided with the zombieverse: the political intrigue, the scheming, the betrayals… all of it was just as gripping as the horror itself. What really struck me was how the show captured the pettiness and cruelty of human nature how people would rather cling to the throne and their power than save actual lives. That layer made the story so much more haunting than just the undead.\n\nAnd the acting? Absolutely top notch. Every performance carried so much weight that I found myself invested in every character’s fate, even the ones I hated.\n\nIf you’ve been putting this one off like I did, don’t. It’s a masterpiece.",
        "upvotes": 19,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nmu8j0/kingdom_a_masterclass_in_political_intrigue_and/"
    },
    {
        "id": "1nmrvhb",
        "author": "Moonlitmindset",
        "title": "Haunted Hotel is FANTASTIC",
        "content": "(SUBTLE SPOILERS AHEAD) \n\nThe writers, actors, show runners, animators, and everyone who’s worked on this show should be SO PROUD! \n\nI love animation and for a long time now nothing new has felt like it “hit the mark” and this show just nailed it. \n\nThe pacing is fantastic, the humor is quirky and unique, the characters have strong individual identities and relationships, the world building is GREAT with so much potential to explore, and the animation is really crisp while still providing lots of fun details in the hotel. \n\nBut I think the thing that I truly appreciate is the balance of light humor with serious topics. They deftly explore the difficult emotions these characters feel with both humor and genuine honesty. From things like self acceptance (Ben) and fear of dating again (Catherine) to the much more serious undertones of missing a parental figure and wanting to have friends (Ester), and family trauma/relationship dynamics (Nathan and Catherine). The characters feel very truthful, their flaws explored with their good intentions and love for each-other ultimately coming through. \n\nThey touch on these topics while still providing room to develop them, leaving the audience not only excited for more world development but also excited to explore these characters on a deeper level. You can feel the passion from the creators in each episode. \n\nI’m so impressed and excited for this show and really hope Netflix invests in it properly. If they do it could absolutely be a classic! I certainly already have it on my rewatch roster and this season alone is one I know will be watched over and over again :) \n\nThank you to everyone who created and worked on this show for giving us such a gem! ",
        "upvotes": 23,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nmrvhb/haunted_hotel_is_fantastic/"
    },
    {
        "id": "1nners8",
        "author": "GhostOfCalville",
        "title": "To anyone who’s watched at least 1 episode of the madness..",
        "content": "Is the plot of that show not quite literally panning out in the real world? I can’t help but make direct connections from the events in that show to what’s happening in the US right now. \n\nNo this isn’t some psycho post nor do i think everything is directly related… but there are similarities in the unfolding of events that you can’t help but to think about. Am i crazy? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nners8/to_anyone_whos_watched_at_least_1_episode_of_the/"
    }
]