[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hqq5d8",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 2 Opens With 68 Million Views, Netflix’s Biggest TV Debut Ever",
        "content": "",
        "upvotes": 670,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1hqq5d8/squid_game_season_2_opens_with_68_million_views/"
    },
    {
        "id": "1hr0xa7",
        "author": "No_Spinach_9309",
        "title": "loved squid game season 2. thought it was good",
        "content": "# so i kinda loved season 2. (also season 1) i think its crazy how much hate i saw on this sub about the season. just showed me not to go on reddid after watching shows, its so negativ. \n\nand some comments i see about the season are just weird. like the crirics for it. im like what do you mean? this didnt made sense? it wasnt unrealistic either. it totally did. or that the characters werent likeable or the acting wasnt that great. and even with more specific negativ reviews im like? the comments just dont make sense to me. also i didnt found it boring at all. i have the feeling people just want to watch extrem games and people dying. they dont care about the story. the only thing i hated was the ending lol. so sad",
        "upvotes": 42,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0xa7/loved_squid_game_season_2_thought_it_was_good/"
    },
    {
        "id": "1hqysej",
        "author": "badboy_1432",
        "title": "\"From the green tracksuit to...? The suspense is killing me! #SquidGameSeason3",
        "content": "",
        "upvotes": 44,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/z422muj7dcae1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hqysej/from_the_green_tracksuit_to_the_suspense_is/"
    },
    {
        "id": "1hr4d9o",
        "author": "S4v1r1enCh0r4k",
        "title": "Upcoming Netflix show American Primeval releases new trailer ",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hr4d9o/upcoming_netflix_show_american_primeval_releases/"
    },
    {
        "id": "1hr3h5o",
        "author": "Kaleidoscope_Pure",
        "title": "Is House of Cards worth watching?",
        "content": "Always thought this is probably a good show, however things with Kevin Spacey went down really fast, and i think the show might end up kinda bad after he left.\nEven with all that, is it worth watching? ",
        "upvotes": 8,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1hr3h5o/is_house_of_cards_worth_watching/"
    },
    {
        "id": "1hr0yz6",
        "author": "techfinpro",
        "title": "‘Santa Clarita Diet’ Creator Victor Fresco Learned his Show was Canceled when Netflix took apart its Sets",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0yz6/santa_clarita_diet_creator_victor_fresco_learned/"
    },
    {
        "id": "1hr18wu",
        "author": "Stunning_Ad6376",
        "title": "Profile issue on fire tablet ",
        "content": "Hi\nI'm having an issue watching Netflix on an Amazon fire tablet, it suddenly after working for years, loads 12 and under profiles and closes when selecting a 15 or 18 profile.\n\nI've tried everything suggested for errors I've found on the net: clearing cache, checking for system and app updates, restarting the device, deleting and reinstalling the app.\n\nAnyone had a solution for this problem?\n\nThank you",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hr18wu/profile_issue_on_fire_tablet/"
    },
    {
        "id": "1hqzrxn",
        "author": "RhiAndroid1990",
        "title": "I’m so annoyed at the lack of old episodes uploaded for WWE Raw &amp; Smackdown",
        "content": "Me &amp; husband were watching all the old 2000 episodes on WWE Network, and now it’s moved to Netflix. Was excited. Saving 1 subscription and been a long Netflix subscriber but we wake up this morning and there are NINE episodes for 2000 &amp; 2001 and then it jumps to 2022. I’m pretty upset to be fair. ",
        "upvotes": 5,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1hqzrxn/im_so_annoyed_at_the_lack_of_old_episodes/"
    },
    {
        "id": "1hr2c1d",
        "author": "GatoMorato",
        "title": "During a trip inside the EU, can you watch the own catalog from each country?",
        "content": "I'm from the EU and I wonder if I can watch for example the Italian top series the days I jump there, and the same with France and Spain ones. I really like watching that \"exclusive\" catalogue while traveling!\n\nIve Just read in the Netflix website that inside the UE the content remains several days 😒 but perhaps there is a way to watch it like when I go to the UK.\n\nPS: the same may work with Amazon Prime Video..?\n\nThanks in advance! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hr2c1d/during_a_trip_inside_the_eu_can_you_watch_the_own/"
    },
    {
        "id": "1hqt38y",
        "author": "citrusgrimm",
        "title": "Does it bother anyone else when you select a show and you get a review instead of the description of the show? ",
        "content": "It's definitely a pet peeve of mine. I just wanna know what this show/movie is about, you want me to go in blind? I know I can just look up the movie/show but I shouldn't have to. Am I wrong about this opinion? \n\n",
        "upvotes": 16,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hqt38y/does_it_bother_anyone_else_when_you_select_a_show/"
    },
    {
        "id": "1hr4kxa",
        "author": "Lovepeacepositive",
        "title": " Torch 2024 roasting special",
        "content": "I guess originally streamed on Dec 27th but recorded the 17th of December. It seems kind of short (42 min) and it drives me insane when Netflix decides to censor so they cut stuff like they did for Brady’s (Luckily I did watch that one live!!). Also, most likely the reason it wasn’t done live. Who was there in person and can tell us all the good stuff they cut out?!?! Damn censorship, there is no way they only had 42 min of material… seems like they cut at least 18 min, so what did we miss?   ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hr4kxa/torch_2024_roasting_special/"
    },
    {
        "id": "1hr41ia",
        "author": "Princess_CeNedra",
        "title": "My smart TV doesn't open my Netflix account anymore - just shows black screen",
        "content": "I don't know if it's problem of Netflix or the Tv, because Netflix is working on my phone. However, when I try to enter netflix on my TV, there is only a black screen.\nHow can I solve this?\n(TV brand is Hisense)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hr41ia/my_smart_tv_doesnt_open_my_netflix_account/"
    },
    {
        "id": "1hqx0s4",
        "author": "Vojuln3",
        "title": "Don't Die: The Man Who Wants to Live Forever - Discussion Thread\n",
        "content": "How far would you go to live forever - or even just slow down the aging process? This startling documentary by Chris Smith (Fyre, 100 Foot Wave) is told through intimate access to Bryan Johnson, a man who has dedicated his life to defy aging. Don't Die: The Man Who Wants to Live Forever dives into the controversial wellness practices one man is using to maintain youth and vitality, and the effect this journey has on himself and those around him.\n\nReleased today on Netflix\n\nTrailer: [https://www.youtube.com/watch?v=kf9e1o7rUeo](https://www.youtube.com/watch?v=kf9e1o7rUeo)",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hqx0s4/dont_die_the_man_who_wants_to_live_forever/"
    },
    {
        "id": "1hr2rdt",
        "author": "Justforwrasslinstuff",
        "title": "WWE Fans, What Are You Watching First on Netflix",
        "content": "Already posted something similar in the wrestling subs, but since the point of moving WWE to Netflix was to try to get new fans, I might as well do the same here.\n\nFor those of us who have received the glorious bounty of loads of WWE content on our Netflix subscriptions, what are you watching first?\n\nPersonally, I've chosen Invasion from 2001, because I probably haven't seen it since 2002 at the latest. I never had the Network, so outside of my old DVDs and YouTube, this is the first chance I've had to watch a bunch of wrestling content in a long time.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hr2rdt/wwe_fans_what_are_you_watching_first_on_netflix/"
    },
    {
        "id": "1hqpeg3",
        "author": "raknor88",
        "title": "Is there a setting where I can turn off the game suggestions?",
        "content": "I really have ZERO interest in playing the browser games that they keep offering. Is there somewhere in the settings that I can go to turn those off?\n\nI use Netflix for shows and movies. If I wanted to game I'd open up Steam. I'm getting very annoyed seeing that stupid watermelon everytime I open up Netflix.",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hqpeg3/is_there_a_setting_where_i_can_turn_off_the_game/"
    },
    {
        "id": "1hqtowz",
        "author": "SongsOfTheYears",
        "title": "What is the official guidance given for the thumbs (\"like\" vs. \"love\" vs. \"not for me\")?",
        "content": "I reflexively dismissed that screen and then regretted doing so, as I am curious for what they consider those to be, even though it's obviously fairly intuitive.  But I couldn't get it to display again after having dismissed it.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hqtowz/what_is_the_official_guidance_given_for_the/"
    },
    {
        "id": "1hr0pmm",
        "author": "TinyZookeepergame292",
        "title": "Harlan Coben's Missing You. Kat is a detective but cannot detect anything???",
        "content": "So we have just started the series and are flabbergasted with how incompetent Kat is at doing detective work. Her friend who is a private investigator and a kid who is looking for his missing mother do more detective work than her. \n\nIn the most problematic scene for me, Stacey finds out that the missing ex fiance was arrested 11 years ago. How can Stacey find this information but not Kat who is an actual police officer? This is beyond irritating. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0pmm/harlan_cobens_missing_you_kat_is_a_detective_but/"
    },
    {
        "id": "1hqzqer",
        "author": "texting32",
        "title": "Reality show contestants",
        "content": "Are people who compete in reality shows on Netflix allowed to compete on other reality shows outside of Netflix? Examples: the challenge, the amazing race, traitors, ect. I’ve noticed I don’t think I’ve ever seen any of them cross over to other sides of the reality tv world. Unlike the shows I listened where cast members often go on other shows. Usually they’re stuck in the Netflix bubble of THTH, the circle, perfect match, ect. I wonder if there’s something in their contract that prohibits them from leaving the Netflix bubble or it’s just by coincidence. Or maybe vice versa the other shows don’t want Netflix contestants on their shows.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hqzqer/reality_show_contestants/"
    },
    {
        "id": "1hqz21s",
        "author": "Bafabifi",
        "title": "Netflix with ads",
        "content": "I’ve stop subscribing since they no longer allow sharing, but would like to watch something again this year.\n\nIs the netflix with ads worth subscribing too? Or there will be too many ads/annoying? ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hqz21s/netflix_with_ads/"
    },
    {
        "id": "1hqvtlf",
        "author": "VolkPlsWin",
        "title": "Squid game season 2 was good but...",
        "content": "It was really Season 2 part 1.    Start of the final episode it's like how are they going to wrap this up. I know they announced the new season comes this year but it was still the first half of whatever they're creating since season 1.\n\n  \nI also enjoyed it more than the first season tbf it was more complex not just omg hunger games on steroids.\n\n  \n",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hqvtlf/squid_game_season_2_was_good_but/"
    },
    {
        "id": "1hqnmh5",
        "author": "ConsiderationMost497",
        "title": "First time Netflix subscriber ",
        "content": "Like the title said. I'm a first time subscriber   I'm a long time pro wrestling fan so I bought mainly for WWE Raw starting Jan 6th.  Was a few other things I wanted to see also anyone else here first time subscribers + because of WWE? ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqnmh5/first_time_netflix_subscriber/"
    },
    {
        "id": "1hqivvd",
        "author": "sfmike99",
        "title": "Barbie, Dune 2 and Furiosa not in 4k?",
        "content": "That \"premium\" plan is tough to justify when the biggest new movies are HD only. I watched Dune 1 on 4k on HBO MAX but let the subscription drop. I'd switch back if my SO wasn't hooked on Korean dramas.",
        "upvotes": 15,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hqivvd/barbie_dune_2_and_furiosa_not_in_4k/"
    },
    {
        "id": "1hqirtk",
        "author": "skullywogging",
        "title": "Seasonal Shows that take too long.",
        "content": "I used to love stranger thing especially after the first season.\n\nI used to love demon slayer after the first season.\n\nSame for breaking bad.\n\nSame for attack on titans. \n\n\nThen seasons taking years long to drop new episodes are causing these shows downfall. By time you bring out a new season we don't even C A R E about what happened prior anymore. The hype is gone. The excitement has dissipated.  And people actually start resenting being left with cliffhangers and don't watch the show anymore. \n\nI think it'll be a good idea to pre-make the shows episodes at LEAST 1 year in advance so they can have a steady flow of episodes with a waiting period of 2 months apart.\n\nLife is so hectic and fast paced. So much happens. Mr.Directors n Actoring peoples. We need to move a little quicker than that. ",
        "upvotes": 15,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hqirtk/seasonal_shows_that_take_too_long/"
    },
    {
        "id": "1hr1bht",
        "author": "IchKannDieWeltRetten",
        "title": "Squid Game Season 3 Teaser Analysis",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hr1bht/squid_game_season_3_teaser_analysis/"
    },
    {
        "id": "1hr2zdh",
        "author": "cheesy_crump",
        "title": "Rick and Morty removed off of Netflix?",
        "content": "I'm not sure if it's for other countries but I know for Australia and New Zealand, Rick and Morty was removed off Netflix in the passed 48 hours without any warning. Usually it says \"Leaving soon\" or \"Last day to watch *insert date*\" but it's like it's just Vanished? And personally I'm a little disappointed, I love Rick and Morty, I hated that when I went to rewatch it this morning it was gone. Like I said I'm not sure if it was the same for other countries. But I just felt it was odd.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hr2zdh/rick_and_morty_removed_off_of_netflix/"
    },
    {
        "id": "1hqo6hd",
        "author": "Powerful-Look324",
        "title": "The platform/platform 2 questions",
        "content": "The Platform/Platform 2 questions \n\nHey I just watched these two movies and I am very very confused. I’m not good at understanding themes so forgive me if some of my questions are really stupid. \n\nTHEME QUESTIONS \n\n1. What does the child being sent up represent in both movies? I understand how the platform is supposed to represent capitalism and society but what does that he children being sent up supposed to represent? \n\n2. What does the children scene in platform 2 represent? The one with all the kids fighting for the top of the pyramid? Why does the winner of the game get sent to the bottom of the platform? What is that even supposed to mean. \n\n3. What was the animal cruelty supposed to represent? The cruelty of people? There’s one scene where the platform goes all the way to the bottom and we hear animals clawing and growling. What does that mean?\n\n4. What was the point of the fat guy who liked pizza. What was his representation of the theme? \n\n5. There were several biblical references throughout, like mentoring the word savior multiple times, 666 people in the platform, and the christian black guy. What do those represent? \n\n6.  Does the law and the people trying to enforce the one meal a day in platform 2 supposed to represent communism? \n\n\n\nPLOT QUESTIONS \n\n1. Was the girl at the bottom real in platform 1? Was she the message? I’m pretty sure she’s not because they show in the mid credits scene the chefs reacting to the panna cotta but not the kid.\n\n2. How does the main character girl of platform 2 survive at the very bottom of the pit all the way until she is reunited with her ex?\n\n3. What is the point of the platform? Is it like the cube where we’ll never know its purpose? \n\n4. Why does miharu search for her kid after willingly let her kid play in the pyramid game? She knew that there was a chance of her kid getting chosen right?\n\n5. So sending a kid up wasn’t the message right? Because the girl sent up the black kid and the platform kept on going. What’s the point of the kids then. \n\nI know it’s a lot and some of them might be stupid questions but i’m a stupid person so thanks if you can answer these ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hqo6hd/the_platformplatform_2_questions/"
    },
    {
        "id": "1hqvdyt",
        "author": "TheTropicalDog",
        "title": "No Good Deed",
        "content": "Has anyone watched this? I have some questions. Possible spoilers below. \n\n*\n\n*\n\n*\nWhy is it called No Good Deeds? Because there aren't any? That's what I'm assuming. \n\nWhat did Mikey go to prison for? I don't believe I missed the explanation but idk. He keeps saying he did Paul &amp; Lydia a huge favor &amp; it seems to relate to Jacob's death but what was it? I'm so confused. \n\nWhy was there the lame side story with Margo &amp; Gwen? Was Margo a realtor? Did I miss that too? She didn't seem to work but was making deals with Gwen. \n\nWhy didn't the nosy neighbor (RIP Linda Lavin!) catch the shooting on her surveillance camera? Maybe she installed that after the murder. \n\nI think that's it. I had more but I can't remember. Sorry if these are dumb questions. It was a good show but I spent most of it wondering what Mikey did. Love seeing Denis Leary in screen again! \n\nThanks! Happy NY! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hqvdyt/no_good_deed/"
    },
    {
        "id": "1hr0yjv",
        "author": "daily_mirror",
        "title": "Netflix viewers keep watching 'masterpiece of awfulness' that's 'a good movie trying to get out'",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0yjv/netflix_viewers_keep_watching_masterpiece_of/"
    },
    {
        "id": "1hqzyx8",
        "author": "sadballofyarn",
        "title": "Sick of the no downloads on netflix- literally why else would i have it",
        "content": "Anyone have suggestions for where else to get shows from? I'm in aus so my options already suck. Not being able to download now is actually so stupid. Idk if I'm willing to keep paying for something that isn't even useful.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hqzyx8/sick_of_the_no_downloads_on_netflix_literally_why/"
    },
    {
        "id": "1hqilrj",
        "author": "Vast_Long7872",
        "title": "Series for my mom",
        "content": "Hello, so my mum loves to watch series (only on Netflix) and she's looking for some recommendations and since I don't watch series I thought I'd ask here. She's into police stuff (like criminal minds) and misteries, drugs (like narcos) and action movies. Any recommendation is appreciated&lt;3 ",
        "upvotes": 5,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1hqilrj/series_for_my_mom/"
    }
]