[
    {
        "id": "1p86oel",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Rick Jaffa and Amanda Silver - Tuesday 12/2 at 3:00 PM ET - Screenwriters of 'Avatar: Fire and Ash', 'Avatar: The Way of Water', 'Rise of the Planet of the Apes', 'Dawn of the Planet of the Apes', 'Jurassic World', 'Mulan', and lots more.",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/meeshve0vt3g1.png?auto=webp&amp;s=0c0c379f71c28f28a4096a90daec09c01fb0c4d7"
        },
        "permalink": "/r/movies/comments/1p86oel/amaqa_announcement_rick_jaffa_and_amanda_silver/"
    },
    {
        "id": "1p7ri9u",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Zootopia 2 / Eternity / Wicked: For Good / Rental Family / Sisu 2: Road to Revenge) plus throwback discussions!",
        "content": "**New In Theaters**:\n\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n* [Rental Family](http://old.reddit.com/r/movies/comments/1p2njvg/official_discussion_rental_family_spoilers/?)\n* [Sise 2: Road to Revenge](https://old.reddit.com/r/movies/comments/1p2njwg/official_discussion_sisu_2_road_to_revenge/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Unbreakable](https://www.reddit.com/r/movies/comments/1p7rc3w/official_throwback_discussion_unbreakable_spoilers/?)\n* [102 Dalmatians](https://www.reddit.com/r/movies/comments/1p7rc5z/official_throwback_discussion_102_dalmatians/?)\n* [How the Grinch Stole Christmas](https://old.reddit.com/r/movies/comments/1p2njxy/official_throwback_discussion_how_the_grinch/?)\n* [Rugrats in Paris](https://old.reddit.com/r/movies/comments/1p2njzl/official_throwback_discussion_rugrats_in_paris/?)\n* [The 6th Day](https://old.reddit.com/r/movies/comments/1p2nk1c/official_throwback_discussion_the_6th_day_spoilers/?)\n\n**Still In Theaters**:\n\n* [The Running Man (2025)](https://old.reddit.com/r/movies/comments/1owltat/official_discussion_the_running_man_2025_spoilers/?)\n* [Now You See Me: Now You Don't](https://old.reddit.com/r/movies/comments/1owltc9/official_discussion_now_you_see_me_now_you_dont/?)\n* [Keeper](https://old.reddit.com/r/movies/comments/1owltdy/official_discussion_keeper_spoilers/?)\n* [Predator: Badlands](https://old.reddit.com/r/movies/comments/1oqjexr/official_discussion_predator_badlands_spoilers/?)\n* [Die, My Love](https://old.reddit.com/r/movies/comments/1oqjez7/official_discussion_die_my_love_spoilers/?)\n\n\n**New On Streaming:**\n\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 25,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1p7ri9u/official_discussion_megathread_zootopia_2/"
    },
    {
        "id": "1p97nlo",
        "author": "MarvelsGrantMan136",
        "title": "‘Good Boy’ Star Indy the Dog Becomes the First Animal Nominated for a Film Award; Indy earned a historic Astra Award nomination for Best Performance in a Horror or Thriller",
        "content": "",
        "upvotes": 16691,
        "comments": 467,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wgOoJjZA184r2o7w-0GS6VXYMnOU_vAK8-0keOmni-g.jpeg?auto=webp&amp;s=b9be3805ff32b0a1b11fc8e5db17579542e385bc"
        },
        "permalink": "/r/movies/comments/1p97nlo/good_boy_star_indy_the_dog_becomes_the_first/"
    },
    {
        "id": "1p910k2",
        "author": "cyPersimmon9",
        "title": "“Netflix Lighting” and the Death of Cinematography",
        "content": "",
        "upvotes": 7401,
        "comments": 689,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZPQ6_cZE_yT0C3HuLKffuRW5azsLmfGCVj0UZIw2Dh0.jpeg?auto=webp&amp;s=5601831f46cde872f24f20afd57ecce8ad724fb8"
        },
        "permalink": "/r/movies/comments/1p910k2/netflix_lighting_and_the_death_of_cinematography/"
    },
    {
        "id": "1p94mnh",
        "author": "EuphoricButterflyy",
        "title": "The Cell (2000)- Enter the Demon King aka Carl Stargher. Dir. by Tarsem Singh",
        "content": "",
        "upvotes": 2089,
        "comments": 330,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dpg7mjat024g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1p94mnh/the_cell_2000_enter_the_demon_king_aka_carl/"
    },
    {
        "id": "1p8y6ov",
        "author": "BunyipPouch",
        "title": "Lucy Liu Enters a Risky New Chapter: The trailblazing star talks facing decades of industry “disrespect,” fighting for her first true starring film vehicle in 'Rosemead,' and the complex legacy of 'Kill Bill'.",
        "content": "",
        "upvotes": 2243,
        "comments": 191,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m294NjvdQf9GFbeNbWMzA4t9YMnJEAwJSAsvkuu507A.jpeg?auto=webp&amp;s=3f0f8999af8a4f4b9985f57f3bfd54d3e9876403"
        },
        "permalink": "/r/movies/comments/1p8y6ov/lucy_liu_enters_a_risky_new_chapter_the/"
    },
    {
        "id": "1p92xdf",
        "author": "chrisdancy",
        "title": "The movie didn't change, I did. (Excalibur - 1981)",
        "content": "Last night purchased \"Excalibur\" 1981.  I was 13 when I first saw it in 1981. I remember being riveted to it for some reason. Maybe it was the visuals, the music or the far away place feeling it gave me.\n\nBy the 90s, I had purchased it and VHS and watched it again. Seemed kind of over the top and slow, and confusing.\n\nFast forward 2025. I was sitting here on Thanksgiving even, and remembered a few scenes from it. \n\nStarted watching on Youtube.\n\nBOOM! 10 mins later, I'm purchasing it and starting it alone on my laptop with ear buds. \n\nSome things that stood out to me at 57 that I didn't get until now:\n\n1. Merlin - He's basically a non-human. Multiple times, referred to as such. As a kid, I thought he was just a wizard. He's a pagan. Would not have picked that up as a kid or even understood it. He's got some lines that are literally genius, and I'm not sure the movie would have worked without him.  \n2. Sex and Violence - Wow, didn't realize how sexual it was, almost homoerotic at times.   \n3. The use of light - Never remember noticing how they played with light and reflections to denote power and magic.\n\nThat got me thinking, what other movies could I go back and watch as an aging person from the 70s and 80s and totally see them different.\n\nStrangely enough, \"Falling Down\" just hits different the past few years. ",
        "upvotes": 684,
        "comments": 319,
        "media": null,
        "permalink": "/r/movies/comments/1p92xdf/the_movie_didnt_change_i_did_excalibur_1981/"
    },
    {
        "id": "1p9gelg",
        "author": "Ghosty_Spartan",
        "title": "The assassination of Jesse James.",
        "content": "You ever think Warner Bros will ever re release the movie in 4k? It just such a great movie with such great cinematography by Deakins, Kind of surprised Criterion passed up on doing it. Feels like something right up their alley. I know the director also says he has longer version that Warner Bros also passed on releasing. ",
        "upvotes": 83,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1p9gelg/the_assassination_of_jesse_james/"
    },
    {
        "id": "1p9b8co",
        "author": "PETEthePyrotechnic",
        "title": "What are your “staples” of sci fi films, and why?",
        "content": "Think of “jazz standards,” but for sci fi movies. I’m looking for peak sci fi, like the Alien series, Interstellar, or 2001: a Space Odyssey. I’m trying to catch myself up on all of the best sci fi put to screen and I need a list to go off of. Bonus points for dystopian stuff like Bladerunner or the Matrix.",
        "upvotes": 110,
        "comments": 257,
        "media": null,
        "permalink": "/r/movies/comments/1p9b8co/what_are_your_staples_of_sci_fi_films_and_why/"
    },
    {
        "id": "1p9b67w",
        "author": "RawToast1989",
        "title": "In Volcano there's a moment with Tommy Lee Jones that's definitely off.",
        "content": "Idk if this kind of mistake/ post is allowed here but, in Volcano, near the end of the movie Tommy Lee Jones has to heroically sprint from his assumed safe place to watch the detonation to save his daughter and the little boy she is in charge of.  However, when TLJ sees the two children and runs over to them it shows that they are close enough for him to run to in just a few seconds. In the shot of him running to them we see the building *collapsing* directly behind him *right* where he was standing seconds before! He had to be standing in the danger zone just to see his daughter/ the boy.  ",
        "upvotes": 110,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1p9b67w/in_volcano_theres_a_moment_with_tommy_lee_jones/"
    },
    {
        "id": "1p9edft",
        "author": "Lazylazylazylazyjane",
        "title": "Last Really Good Movie You Watched?",
        "content": "What was the last really good movie that you watched?  It doesn't have to be a new release.  Mine isn't.\n\nThe last really good movie I watched was Stand and Deliver.  It was funny, heart-warming, moving, and I love that it's based on a real story and that I got to go down a rabbit hole learning about it.  \n\n  \n",
        "upvotes": 55,
        "comments": 302,
        "media": null,
        "permalink": "/r/movies/comments/1p9edft/last_really_good_movie_you_watched/"
    },
    {
        "id": "1p911ea",
        "author": "BunyipPouch",
        "title": "First Poster for Thriller 'The Dutchman' - Starring Andre Holland, Kate Mara, and Zazie Beetz - A businessman is drawn into a sexualized game of cat and mouse with a mysterious woman on a subway that leads to a violent conclusion.",
        "content": "",
        "upvotes": 309,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kldjrcgdb14g1.jpeg?auto=webp&amp;s=848f17ae1a566db09376953e1fd77e8f7cacc79d"
        },
        "permalink": "/r/movies/comments/1p911ea/first_poster_for_thriller_the_dutchman_starring/"
    },
    {
        "id": "1p8ivkd",
        "author": "Equivalent-Key5379",
        "title": "Is there a Horror movie that completely advertised it as a normal film?",
        "content": "I'm saying completely set the genre as a different genre than horror. Every advertisement, commercial, and trailers were not advertised as horror at all. The only time you knew it was a horror movie was once you were in the theatre. Now I feel like this might be illegal but i'm still curious if anyone has done it. \n\nEdit: completely forgot I posted this, did not expect this lmao.",
        "upvotes": 5975,
        "comments": 2750,
        "media": null,
        "permalink": "/r/movies/comments/1p8ivkd/is_there_a_horror_movie_that_completely/"
    },
    {
        "id": "1p8ulkh",
        "author": "AporiaParadox",
        "title": "Plot holes caused by adaptation changes",
        "content": "Adaptations inevitably make changes to the source material, either adding new elements or cutting out scenes or characters. Sometimes though, these changes create plot holes that weren't in the source material, either contradicting something that was already established, or omitting an explanation (which isn't necessarily a plot hole, but still very annoying).\n\nFor example, the Wizard of Oz infamously ends with Glinda the Good Witch telling Dorothy that she had the power to go back home all along with her Ruby Slippers. When asked why she didn't just say that from the start, she claims that Dorothy wouldn't have believed her, which is a rather questionable assertion. The original book has no such problem, there the Good Witch of the North and the Good Witch of the South are separate characters, the Good Witch of the North is the one that gave her the shoes, and Glinda the Good Witch of the South is the one to tell Dorothy how to go home at the end of the story.\n\nSo what other notable plot holes or weird leaps in logic weren't in the source material but were caused by adaptation changes?",
        "upvotes": 666,
        "comments": 522,
        "media": null,
        "permalink": "/r/movies/comments/1p8ulkh/plot_holes_caused_by_adaptation_changes/"
    },
    {
        "id": "1p9bdep",
        "author": "adomental",
        "title": "I watched Hugo (2011) with my kids. Great movie, but an even better experience",
        "content": "The movie was very good. But the experience we had as a family watching it was incredible. \n\nMy 11yo kept quoting 'absolute cinema' to me, and rather than just say \"You don't know Scorsese\" I decided we should watch the one kid oriented movie he's made. \n\nThe movie itself is a homage to early cinema. Which lead to us having so many great discussions. \"Is it true that when people first watched the movie about a train arriving at the station that they screamed?\" \"Wait, that rocket in the eye of the moon was from a real movie?\" (Yes kids, and that movie not only came out decades before the moon landing, but before the first aeroplane.) We talked about all the real life stunts Buster Keaton nearly killed himself for, we talked about silent film. We talked about physically cutting out frames as film film editing. \n\nAll those fun discussions arose from the plot of the movie. It sent their minds racing about how movies work in a way they've never thought about before.  \n\nThe search function on our Google TV occasionally stops working, so I had to navigate to the movie in the first place by playing six degrees of Kevin Bacon. OBAA (which was on the home screen) to Leo, to Marty, to Hugo.) \n\nMy eldest was shocked, he didn't understand how I got there so easily, so I got to explain to him what six degrees of separation is, and how to play it. I gave him a few easy ones to work out, using his favourite movies, (link FNAF to The Hunger Games, absolute layup) which was a fun way to introduce him to movie trivia. \n\nBut then I got to cap it off by telling him that I could link him personally to this movie within six steps. We live in regional Australia, so we don't have many Hollywood connections. But in 1947, an actress called Jean Simmons (not the one from Kiss) was touring Australia and wanted to see a sheep get sheared, went to a farm in the middle of nowhere, where my great grandfather was a shearer, there's a photo of them together while he's working a sheep. So the link is: Kids --&gt;Me --&gt; Bupar --&gt; Jean Simmons, --&gt;(through Howl's Moving Castle - they play old/young Sophie) --&gt; Emily Mortimer who is in Hugo. His mind was blown. \n\nOne other great movie moment was that my younger child, quiet morbidly, always asks if any of the actors have died since the movie came out. So we got to talk about exactly how cool Christopher Lee was. \n\nLike I said, the movie was very fun. But the moments that sprung from it, and discussions we had together, were absolute cinema. ",
        "upvotes": 80,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1p9bdep/i_watched_hugo_2011_with_my_kids_great_movie_but/"
    },
    {
        "id": "1p8vg4s",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Zazie Beetz - Monday 12/15 at 12:30 PM ET - Actress in 'Deadpool 2', 'Joker', 'Atlanta', 'Bullet Train', 'Nine Days', 'Invincible', 'The Harder They Fall', 'The Bad Guys', and lots more.",
        "content": "",
        "upvotes": 516,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mctahkst604g1.png?auto=webp&amp;s=b799ca43b6c1ffeb0d1eda39b7f8bcf83ec9bf55"
        },
        "permalink": "/r/movies/comments/1p8vg4s/amaqa_announcement_zazie_beetz_monday_1215_at/"
    },
    {
        "id": "1p91ch8",
        "author": "Bullingdon1973",
        "title": "The Great Beatles Documentary That’s Nearly Impossible to See (Legally)",
        "content": "",
        "upvotes": 230,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1p91ch8/the_great_beatles_documentary_thats_nearly/"
    },
    {
        "id": "1p93m9o",
        "author": "herewego199209",
        "title": "She's Out of my League is one of the last of the Judd Apatowian type of comedies that's missing today. Not only is it out flat out funny, but there's such realism in both the ridiculously pretty girl lead( Alice Eve) and the nerd lead (Jay Baruchel) that makes you root for them.",
        "content": "It's a movie you can pass off as a silly fantasy where a hot girl like Alice Eve would never fall for a guy like Jay Baruchel's character, but the script does a really good job showcasing why she'd want to stop dating the same guys who break her heart and why someone like Kirk is who she should be with. And I feel the insecurities and the apprehensiveness they give to the Kirk character is something ever guy can relate to who has had insecurity issues and they're dating a really pretty girl. \n\nThe third act scene where they're about to have sex for the first time encapsulates the entire crux of the movie. Kirk looks at himself as boring, unattractive, and not worthy of being loved because he's been bullied and broken down to that point. He doesn't realize that Molly knows he has faults but she wants him anyway. \n\nThis movie and movies released around this time like Celeste and Jesse Forever are the comedies I really wish were still being made today. Just sweet laugh out loud movies you can watch over and over again.\n\n",
        "upvotes": 172,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1p93m9o/shes_out_of_my_league_is_one_of_the_last_of_the/"
    },
    {
        "id": "1p9acqi",
        "author": "apierno",
        "title": "Is JustWatch giving you all incorrect info?",
        "content": "I looked up Once Upon a Time in Hollywood and it shows Hulu. I logged into Hulu, and no dice. \n\nIt’s been incorrect about 1 in 10 of my searches, recently. Seems like I’m seeing this kind of error more and more often and it’s not all with one service. Anyone else seeing something like this, or am I doing something wrong? ",
        "upvotes": 63,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1p9acqi/is_justwatch_giving_you_all_incorrect_info/"
    },
    {
        "id": "1p8q3zl",
        "author": "Purpleking1994",
        "title": "We have \"so bad its good\" but what about \"so good its bad\"?",
        "content": "My example is Requiem for a Dream. Its such a good film and realistic that I simply can't watch it again. Any other films that cover this type genre? Another one I can think of is Deliverance.  That film had me wishing I had never watched it, even though I highly enjoyed it. Martyrs is one more than I can think of.",
        "upvotes": 922,
        "comments": 662,
        "media": null,
        "permalink": "/r/movies/comments/1p8q3zl/we_have_so_bad_its_good_but_what_about_so_good/"
    },
    {
        "id": "1p9767h",
        "author": "Top_Report_4895",
        "title": "'The Secret Agent' Is Brazil's Oscar Submission for a Reason",
        "content": "",
        "upvotes": 81,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7oVdJZTrPUTGQmJ4WhlsWClQq46BcmM_8p2dM4eR6do.jpeg?auto=webp&amp;s=1edc38fedbf3f3765ab9a446ee68bdc2fe485964"
        },
        "permalink": "/r/movies/comments/1p9767h/the_secret_agent_is_brazils_oscar_submission_for/"
    },
    {
        "id": "1p9a3zv",
        "author": "Wonder-Lad-2Mad",
        "title": "The Spine of Night (2021) fucking RULES! It satisfied my dark fantasy cravings completely. It's like a combination between Fire &amp; Ice and Metalocalypse",
        "content": "I randomly saw this movie recommnded on Reddit for being \"gothic\". It grabbed my attention cause otherwise I've never heard of this movie. Initially I was kinda hesitant, seeing it has low ratings and the rotoscoped animation isn't very appealing, five minutes into the movie and it completely grabbed me. The animation and artstlye grew on me.\n\n\n\nIt is super inspired by Fire &amp; Ice, the Ralph Bakshi movie. Both in it's dark fantasy/sword and sorcery themes and the animation style, except Fire &amp; Ice is way better animated, but the rotoscoped artstyle is the same.\n\n\nThe charcter designs and the level of gore and violence reminded me an aweful lot of Metalocalypse. You will see A LOT of detailed, animated gore. And it fucking rules. And there's also a lot of nudity, not in a sexual context though.\n\n\n\nThe story is surprisingly good, but I'm kinda biased cause I love dark fantasy. The pacing is quite leisurely. It takes it's time unwrapping the plot for you, and to me personally it was worth it cause it ending is very satisfying.\n\n\n\nI would just like to shout out this movie for A. Being an absolute passion project which I wish got more appriciation and eyeballs on it. It took seven years to complete this project. And B. The Dark Fantasy genre is not very popular these days so I value anything that brings it back.",
        "upvotes": 46,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1p9a3zv/the_spine_of_night_2021_fucking_rules_it/"
    },
    {
        "id": "1p88bg0",
        "author": "desimaninthecut",
        "title": "James Cameron Says if Avatar: Fire and Ash Doesn't Make Enough Money to Justify Avatar 4 and 5, He's Ready to Walk Away and Write a Book to Resolve the One Thread It Leaves Open - IGN",
        "content": "",
        "upvotes": 24252,
        "comments": 2761,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QvKW9kolRl9F9A8rVqY8kA8re0A84ODgEdaK3QYKe0o.jpeg?auto=webp&amp;s=0ec8409bf732a100260661241932906dc102469d"
        },
        "permalink": "/r/movies/comments/1p88bg0/james_cameron_says_if_avatar_fire_and_ash_doesnt/"
    },
    {
        "id": "1p96x78",
        "author": "shinyhpno",
        "title": "What are some movies that are more about a location than the characters in it?",
        "content": "I want to be clear that I'm not looking for \"setting as a character\". I was scrolling on Tubi and came across The Great Escape. The description is worded as this:\n\n&gt; The award-winning, high-energy World War II epic about a maximum security Nazi POW camp that three U.S military prisoners attempt to break out of.\n\nI thought it was an interesting way to word it. It frames the prison as the focus as opposed to the prisoners. It feels like the main character is the prison itself.",
        "upvotes": 69,
        "comments": 137,
        "media": null,
        "permalink": "/r/movies/comments/1p96x78/what_are_some_movies_that_are_more_about_a/"
    },
    {
        "id": "1p8dueq",
        "author": "MarvelsGrantMan136",
        "title": "New Posters for ‘Kill Bill: The Whole Bloody Affair’",
        "content": "",
        "upvotes": 4366,
        "comments": 172,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tjg8s9didv3g1.jpeg?auto=webp&amp;s=69825b7b7a46f1f7a1b966f22eb29aa25cd4cf2c"
        },
        "permalink": "/r/movies/comments/1p8dueq/new_posters_for_kill_bill_the_whole_bloody_affair/"
    },
    {
        "id": "1p9amtx",
        "author": "Local-Candidate-5098",
        "title": "First look at Dafne Keen in Night Comes an Apocalyptic thriller via Big Pictures Cinema Group",
        "content": "",
        "upvotes": 33,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ttunvtdxa34g1.png?auto=webp&amp;s=f003c2b85cb0d7fb65c94daaa154381ca0a20204"
        },
        "permalink": "/r/movies/comments/1p9amtx/first_look_at_dafne_keen_in_night_comes_an/"
    },
    {
        "id": "1p9feu4",
        "author": "oxPastaxo",
        "title": "The movie where a man yells \"you bastard\" in Spanish before a bomb goes off",
        "content": "I was flipping through the channels years ago and I saw a movie where a hispanic man receives a package in his home. If memory serves correct, he was short haired, maybe balding and had a mustache. A lighter complex hispanic person. He opens a package and realizes it's a bomb and yells \"EL BASTARDO\" Or YOU BASTARDO\" or something like that. I never got the name of the movie and when I try to google it.All I get is other movies that don't seem to be right or don't have the scene. If anyone in here knows the name of that movie, I would greatly appreciate it.It's been bugging me for years.",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1p9feu4/the_movie_where_a_man_yells_you_bastard_in/"
    },
    {
        "id": "1p9cdk6",
        "author": "Competitive-Funny844",
        "title": "Spy Kids (2001)",
        "content": "Decided to watch this the other day to simply revisit the nostalgia and it still holds up. I find that this movie brings a nice introduction to the whole Hispanic culture into the American mainstream media and for the casual audience to witness the traditional setting of the Mexican family. It definitely portrays a positive representation and influences of Latino pride for the entire children and family to enjoy.  ",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1p9cdk6/spy_kids_2001/"
    },
    {
        "id": "1p9ht9n",
        "author": "sliclky1169",
        "title": "Train Dreams",
        "content": "This was such a quiet masterpiece.  The shooting locations were incredible and evocative with amazing and subtle acting throughout the film. The story was as chaotic and disjointed as any real life.  It really felt like a good a glimpse into that world, peopled by our near ancestors, not so long ago(Not it mention the excellent narration and score!).",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1p9ht9n/train_dreams/"
    },
    {
        "id": "1p9j6ff",
        "author": "Large-You1042",
        "title": "What movie would you show an adult friend who had never seen a movie before?",
        "content": "I was thinking something that just immerses you or has a really well thought out design. Idk I like the avatar movies or some science fiction movie. Alternatively, there are horror movies and mind benders that are cool. My ex loved the Truman Show and my friend loves 1917. But I’m trying to think like overall visually, intellectually, audibly (soundtrack), and overall just the ✨movie of all time✨",
        "upvotes": 4,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1p9j6ff/what_movie_would_you_show_an_adult_friend_who_had/"
    }
]