[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 682,
        "comments": 5060,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nrdav5",
        "author": "JollyToe440",
        "title": "Tired of seeing cheating in relationships in Netflix Shows",
        "content": "This ain’t no spoiler. I just began The Waterfront Episode 1. Before half of the episode was done, it seems like one of the main guys runs into his high school sweetheart. It is then made clear that they are both partnered up already. The next day, he goes to her shop where she works and they strike a convo. It feels like there will be cheating already, and i’m just fed up with that storyline. I won’t continue watching this show if the characters are just typical netflix tropes; unrelatable yet oh-so cheesy. Also, it just feels unnecessary to start this cheater narrative when the guy could’ve just been single. So cliché. \n\nReally wondering why this show is at the top searches. \n\nAnyone can let me know if there will be actual cheating or will they be normal people for once? ",
        "upvotes": 192,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1nrdav5/tired_of_seeing_cheating_in_relationships_in/"
    },
    {
        "id": "1nran0i",
        "author": "ToonAdventure",
        "title": "'Haunted Hotel' Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 158,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nran0i/haunted_hotel_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1nr3m7y",
        "author": "graemeisverytired",
        "title": "Squid Game success means that Famke Janssen is now acting for the first time in her native language in Netflix’s Amsterdam Empire",
        "content": "This new status quo is one that Dutch actress and X-Men icon, Famke Janssen, feels grateful for. Janssen stars in an upcoming Netflix show called Amsterdam Empire, and it's the first time that she has ever acted in her native language. Speaking with our video producer, Ashley Victoria Robinson, Janssen noted that Amsterdam Empire was part of this post-Squid Games world of international streaming. “Us now being in a time where Squid Game, everyone is watching anything in any language, and it doesn’t matter anymore. That has really changed the landscape for all of us, so that’s wonderful,\" Janssen said. \n\nMore: [https://www.thepopverse.com/tv-netflix-squid-game-international-shows-famke-janssen-amsterdam-empire-dutch/](https://www.thepopverse.com/tv-netflix-squid-game-international-shows-famke-janssen-amsterdam-empire-dutch/)",
        "upvotes": 95,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nr3m7y/squid_game_success_means_that_famke_janssen_is/"
    },
    {
        "id": "1nro4rt",
        "author": "UnicornWhiskeyFairy",
        "title": "App sleep timers",
        "content": "I feel like I’m not the only one who watches/listens to shows on Netflix/Hulu/Disney/Discovery to fall asleep and there needs to be a way to make a timer. If our TV had the technology why don’t our apps?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nro4rt/app_sleep_timers/"
    },
    {
        "id": "1nrja2h",
        "author": "AccomplishedPut5175",
        "title": "French Lover",
        "content": "Just watched this movie, and I highly recommend it.\nThe movie is light, enjoyable, sit back and enjoy.\n\nOmar Sy once again shows that he is a master in all genres, while Sara Giraudeau simply amazed me with her acting.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nrja2h/french_lover/"
    },
    {
        "id": "1nr49m7",
        "author": "Trent-Popverse",
        "title": "Guillermo del Toro is planning to change his entire moviemaking style: \"I feel like I need a change\"",
        "content": "",
        "upvotes": 25,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nr49m7/guillermo_del_toro_is_planning_to_change_his/"
    },
    {
        "id": "1nrb2pi",
        "author": "tummyachemedicine",
        "title": "Please recommend me series like Dr. Cha and others that are attractive to middle aged women",
        "content": "My mom never had hobbies, specially after divorcing a few years ago and had to start working a lot. So when she saw me watching Dr. Cha she was really interested in it and we had a good time watching 6 episodes in one sitting. She works a lot day and night and only has 2 days, so I'd like for her to have a good time at least. She is quite the boomer too.\nWe come from a latin country with huge soap opera culture, but nowadays nobody watch much TV, and my mom is older and probably prefers things that are more drama and \"conservative\" (so probably no gay or very progressive stuff unless it's side characters 😭). I don't wanna change her, just have a good time.\nI thought about Bridgerton, older moms seem to love it, so please recommend me stuff like that moms like too.",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1nrb2pi/please_recommend_me_series_like_dr_cha_and_others/"
    },
    {
        "id": "1nroidp",
        "author": "Only-Storage9984",
        "title": "Adolescence: I have questions, let’s talk about it!",
        "content": "I need somebody who is professionally trained to give me Jamie’s clinical diagnosis from his interview! Is he a sociopath with narcissistic tendencies? I’m by no means trained on the subject. I just watch a lot of serial killer shows and some of those traits seemed to be evident. I wasn’t sure if the psychologist was just overwhelmed, felt bad for him or genuinely scared or a combination then all. Either way one of the best acted, directed and written pieces of television I’ve ever seen! ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nroidp/adolescence_i_have_questions_lets_talk_about_it/"
    },
    {
        "id": "1nrndk0",
        "author": "Pdx_Obviously",
        "title": "Visiting Spain... But confused.",
        "content": "I'm in Spain on vacation.  When I opened Netflix for my typical pre-sleep wind down, I was pleasantly surprised that two shows that do not appear in my feed in the United States were showing here. Big Bang Theory and Friends.\n\nI watched several episodes of BBT over the last 4 evenings and when I opened up the app today, both it and Friends are gone.  Still in Spain.\n\nAny idea why?  It's fine... But just confusing.  Wondering if Netflix figured out I had an American account and blocked content that shows exclusively on Max in United States...?  \n\nAnyway if anyone can provide insight, it would help my curiosity. \n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nrndk0/visiting_spain_but_confused/"
    },
    {
        "id": "1nrew14",
        "author": "1have1question",
        "title": "Is it possible to show movies/ TV series which are only dubbed in my language?",
        "content": "I'm peculiar about how I watch my TV lol, and 99% of the time I want to see a dubbed version in my language (Italian). The problem is, sometimes there is a show which has the translated title, but it's only subs, so my only way of trying to tell if it was dubbed doesn't work. I've tried to talk to customer support, but they were no help and I don't want to bother them anymore.\n\nParticularly problematic because I like to watch anime and I'm often out of Italy. \n\nUsually if I search for Italian/TV series it works, but I'd like to not only see those, but ALL of the catalogue dubbed in Italian, if it makes sense.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nrew14/is_it_possible_to_show_movies_tv_series_which_are/"
    },
    {
        "id": "1nriouu",
        "author": "No_Cardiologist5966",
        "title": "Bug on netflix",
        "content": "I'm Brazilian and I have the following problem: the menus don't appear to play or change subtitles or select episodes.\n\n\nI even recorded it to show what my app looks like.\n\nWhen forcing a reinstallation, the app has a different version and the bug stops happening, but in 2 or 3 days it goes back to that version where the bug occurs and I have to redo the process.\n\n Does anyone help me?",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/34w9vqld1mrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nriouu/bug_on_netflix/"
    },
    {
        "id": "1nqmh74",
        "author": "Glass_Pomegranate820",
        "title": "Anyone watched Hunting Wives?",
        "content": "At first glance looks a little soapy for me but is also tagged mystery. Tempted to watch just for some of the Cast. Haven’t seen Katie Lowes in anything since Scandal, which I loved her in!! Thoughts? I watch a pretty wide range of drama, thriller, true crime, and some comedies.",
        "upvotes": 88,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1nqmh74/anyone_watched_hunting_wives/"
    },
    {
        "id": "1nr6gsx",
        "author": "What_is_good97",
        "title": "If I bring my apple tv to my parents' house once a month, will I be able to get around the household block?",
        "content": "I rarely use netflix, but I'm a fan of great british bake off and want to watch the new weekly episodes, but my apple tv is no longer part of our base household.",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nr6gsx/if_i_bring_my_apple_tv_to_my_parents_house_once_a/"
    },
    {
        "id": "1nqya2e",
        "author": "Longjumping_Bowl_403",
        "title": "Movie Review: Fractured (Netflix Original)",
        "content": "If you're into thrillers, the type that keep you guessing, hoping for something, a light at the end of the tunnel, this movie is for you. It'll keep you guessing all the way through. This type of movie evokes feelings straight from Shutter Island (a must watch). Somewhat dragged out, but very much worth a watch.\n\nPersonal Rating: 8.5/10",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nqya2e/movie_review_fractured_netflix_original/"
    },
    {
        "id": "1nranrh",
        "author": "RedBunnyJumping",
        "title": "Rollercoaster interview",
        "content": "Anyone else notice Netflix is doing some really creative stuff on TikTok lately???? isn't that mad?  \nfirst I thought it wasn't real...  \nMost celebrity promotion feels so fake and scripted. This feels like something youu actually choose to watch, not something you skip for real!!  Netflix found a way to make promotion that's actually entertainment! \n\nIt feels like they're actually trying to make good content rather than just pushing their shows :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nranrh/rollercoaster_interview/"
    },
    {
        "id": "1nr8tnz",
        "author": "thatbeesh1234567",
        "title": "Offline downloads HMDI connection no longer working",
        "content": "I have been casting offline for well over 5 years (download content onto my iphone, iphone-hdmi adapter to connect to non-smart tv). I turn off data &amp; have no wifi, the HDMI projected the content onto the tv just fine from my phone. I was never able to do that with other streaming platforms such as Amazon Prime or Paramount (which I read online that's due to their policy or something, although Paramount did randomly work a time or two?).\n\n  \nAs of last Friday, I got an error Offl:10000; When I watch it directly on my phone, no issues &amp; it plays as normal (while remaining offline). I googled which told me to restart my phone, redownload the app, sign out, etc. I did all of that without success.\n\nI contacted Netflix to see what's going on &amp; the chat person said that I should have never been able to do that due to copyright or something &amp; that subscribers would only be able to watch offline content directly on the device. I am so confused as to how that is an infringement to be able to just play the content on a larger screen at home?\n\nI've had the same adapter for quite some time so perhaps a new one would allow it? Or I'm wondering if the netflix tech team realized the glitch &amp; just recently fixed it?\n\nI'm pretty freakin bummed out since we rely on this set up for the cottage that has horrible phone reception (i.e. can't stream directly with data) &amp; no internet up there.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nr8tnz/offline_downloads_hmdi_connection_no_longer/"
    },
    {
        "id": "1nr78rx",
        "author": "OutreObvious",
        "title": "BRING BACK CAPTAIN FALL",
        "content": "High key, I don’t feel like Netflix tried much in the marketing department. But in the current political/world/class climate… am I the only one who thinks they need to just give it one more go? At least finish the plot?\n\nI watch *a lot* of dark comedy.. and this is one of the few that actually feels different than the rest? Psh, the cancellation almost opens a Pandora’s box of my own conspiracy theories. Netflix treated Captain Fall no better than his parents—just GAH. At least finish the original 20 episodes, yeah?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nr78rx/bring_back_captain_fall/"
    },
    {
        "id": "1nr141c",
        "author": "DelboyTrotter164",
        "title": "Is this a bug?",
        "content": "So, I tried setting up my account but it doesn't let me for some reason. I typed in my email and an error comes up saying \"Sorry, something went wrong. Try again later.\". \n\nI tried a few times, updated the app, turned my phone off and on and it still shows the same thing. I waited a couple of hours and tried again and still the same. Is this Netflix' fault or am I doing something wrong?\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nr141c/is_this_a_bug/"
    },
    {
        "id": "1nr5kt9",
        "author": "JaniceRaynor",
        "title": "Netflix put out a KPOP Demon Hunters’ “Your Idol” cover, sang by Abaddon the demon from Haunted Hotel",
        "content": "Related subreddits r/HauntedHotel and r/kpopdemonhunters  \n\nIf Abaddon, the demon boy from the new animated series Haunted Hotel, was to write a song about his life, it would 100% be \"Your Idol\" from KPop Demon Hunters. Jimmi Simpson, the voice of Abaddon, performs a \"Your Idol\" cover in this special Haunted Hotel music video.",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t1x6y9tgajrf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nr5kt9/netflix_put_out_a_kpop_demon_hunters_your_idol/"
    },
    {
        "id": "1nrhext",
        "author": "TylerSpicknell",
        "title": "I hope the success of K-Pop Demon Hunters will convince Netflix to treat animation with more respect.",
        "content": "They don't treat any of their animated movies and shows right, especially their shows. More often than not they just cancel it after one season or in the case of Inside Job renew then change their mind and cancel it. \n\nThey don't even want to give their animated movies sequels. That is why I almost lost hope, but I think this movie will cause Netflix to come around. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nrhext/i_hope_the_success_of_kpop_demon_hunters_will/"
    },
    {
        "id": "1nrgul3",
        "author": "Skur11",
        "title": "Leaked content for the Netflix vieeogame Storyteller",
        "content": "One of the artists assisted a game developing event I was exposing at in Argentina, she showed some pictures I'm certain were never seen before, I looked them up and nothing showed up, but correct me if I'm wrong. She said these were Work In Progress herself.\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nrgul3/leaked_content_for_the_netflix_vieeogame/"
    },
    {
        "id": "1npwqh3",
        "author": "Practical_Captain_58",
        "title": "Netflix code for horror is 8711",
        "content": "Type this in the search bar and you will see all the horror they have available without the algorithm .\n\nYou will see one or two odd suggestions as well.\n\n**Happy Haunted Season!!!**",
        "upvotes": 492,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1npwqh3/netflix_code_for_horror_is_8711/"
    },
    {
        "id": "1nqohil",
        "author": "Comfortable_Bat9856",
        "title": "Ruin good shows with music",
        "content": "Dear Netflix,\n\nMany times an amazing show comes along, sometimes on Netflix, and many a times these shows are time period shows. The casting team gets actors that look, sound, and act like the time period. The art, set, costume all bust their butts to be perfect with the time period. Then the idiots in the score/music department think they need to put in modern music. This practice needs to end. Nothing kicks me out of a film harder. You are ruining so many shows. You could make great shows, but instead you make \"just okay\" shows. House of Guinness is one of these shows. Who ever the heck is in charge at Netflix fix this stupidity. If you want to add a modern flair why spend millions making anything period perfect? Why? You may as well casted all Indians instead of Irish looking people. You may as well put the cast in American eagle shirts with cargo shorts. At that point it does not matter. \n\nSincerely,\nA cinema lover",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nqohil/ruin_good_shows_with_music/"
    },
    {
        "id": "1nqkltr",
        "author": "shinyemptyhead",
        "title": "Looks like they might have gone back to the old UI?",
        "content": "https://preview.redd.it/olsp7irzzdrf1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=300b328e7c6415c8fababda0ec2f723ee8783723\n\nI'm on an LG TV, and my UI had switched to the new format a couple of months ago. I just came home after being away for a week, and it's showing me the old format! I'm so happy.",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nqkltr/looks_like_they_might_have_gone_back_to_the_old_ui/"
    },
    {
        "id": "1nql45o",
        "author": "Necessary-Flounder27",
        "title": "What is your favorite movies / shows for background ?",
        "content": "I'm looking for lighthearted and humorous movies or TV shows that are easy to follow and perfect for background watching. I usually have them on while doing arts and crafts, so I’d love options where I can look up occasionally and still enjoy what’s going on without getting lost. I'd prefer newer recommendations, and I have access to all major streaming platforms—except Apple TV+. Any suggestions?\nI really like delicious and dungeons on Netflix! I’ve watched it thrown through, but it’s also such a good background show. Easy watch, humorous, entertaining!! ",
        "upvotes": 9,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1nql45o/what_is_your_favorite_movies_shows_for_background/"
    },
    {
        "id": "1nqxtos",
        "author": "Sweaty-Toe-6211",
        "title": "White Collar Leaving Netflix on October 1",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nqxtos/white_collar_leaving_netflix_on_october_1/"
    },
    {
        "id": "1nqogtn",
        "author": "Sudden_Pop_2279",
        "title": "Alice In Borderland season 3; unecessary but entertaining",
        "content": "After I finished Squid Game season 3 in June, I was... pretty disappointed tbh. I frequently saw Squid Game being compared to another show, Alice In Borderland. So I decided \"let me check this out\" and I really liked it, in fact I even preferred it to Squid Game. The only thing is, season 2 was genuinely such a perfect conclusion that I myself wondered how they'd do season 3, especially as the manga ends at season 2 except for a short one-shot manga.\n\nI decided to give season 3 a try when it released today. Overall? I'd say its a 7.5/10. It was better than Squid Game season 3 and I didn't regret watching it but it wasn't exactly necessary either.\n\nThe games were fine. I especially liked the Zombies ones. \n\nFor the new character's, although they didn't hit the same as the original's did, I DID like quite a few. Rei especially was a stand-out for me. I remember everyone saw the trailer and thought she'd be annoying/hateable but no, she's probably going to be the fan favorite when this is all over. As a former bully victim, I was rooting for Nobu and am so glad he pulled through. Sachiko reminded me so much of Geum-ja from Squid Game and her surviving was a nice surprise.\n\nOn the other hand... Banda and ESPECIALLY Yaba were so wasted as villains. Yaba could be removed from the season and NOTHING would change whatsoever. He had 2 scenes. Banda was the main villain but he did nothing except hands out the cards to people manipualte Ryuji and try to recruit Arisu. At least Niragi was given a tragic backstory that humanized, this dude was just evil for fun.\n\nThere were a few questions left unasnwered, like where was Yaba in the final few episodes and why was the Borderland's collapsing at the end. It was nice for Ann to play a role due to her remembering everything but I wish she had a bigger role. It was nice to see all the previous cast return in the final episode for sure.\n\nBut PLEASE do NOT do an American spin-off.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nqogtn/alice_in_borderland_season_3_unecessary_but/"
    },
    {
        "id": "1nqaixh",
        "author": "Sudden_Pop_2279",
        "title": "Wednesday Season 2 OTT Verdict: With 100M+ Views, The Jenna Ortega-Led Show Enters Netflix’s All-Time Top 10!",
        "content": "",
        "upvotes": 22,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nqaixh/wednesday_season_2_ott_verdict_with_100m_views/"
    }
]