[
    {
        "id": "1otnjmm",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey] Real Madrid 0-0 Rayo Vallecano",
        "content": "",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otnjmm/postmatch_survey_real_madrid_00_rayo_vallecano/"
    },
    {
        "id": "1otauls",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 11,
        "comments": 970,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otauls/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ouxr2z",
        "author": "More-Judgment-9253",
        "title": "Endrick Passing/ Central Play",
        "content": "Since they don't have any good attackers at Lyon endrick's definitely gonna be a starter, and he's most likely gonna be scoring a lot imo. I still don't think he can be a ST here for now though, he's gonna have to play on the RW.  \nCredit: Douba on twitter",
        "upvotes": 63,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p70yvg65qr0g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ouxr2z/endrick_passing_central_play/"
    },
    {
        "id": "1oue980",
        "author": "chunchunmaru1129",
        "title": "Only the true madridistas will remember this goal.🔥",
        "content": "",
        "upvotes": 655,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rm17455ton0g1.jpeg?auto=webp&amp;s=128fb1bf4e59aeb8e8ad728298862a3c6f555c2c"
        },
        "permalink": "/r/realmadrid/comments/1oue980/only_the_true_madridistas_will_remember_this_goal/"
    },
    {
        "id": "1ou7atn",
        "author": "TheFeatherDiaries",
        "title": "Xabi Alonso furious after Vinicius loses ball in 1 vs 3 dribble : '' Pass it, pass, pass, PASS! GOD DAMN IT.\"",
        "content": "",
        "upvotes": 1204,
        "comments": 326,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/e5zd9vuh7m0g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ou7atn/xabi_alonso_furious_after_vinicius_loses_ball_in/"
    },
    {
        "id": "1oufulh",
        "author": "cyrusmancub",
        "title": "Real Madrid and Lyon are finalizing a six-month loan for Endrick",
        "content": "",
        "upvotes": 342,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oufulh/real_madrid_and_lyon_are_finalizing_a_sixmonth/"
    },
    {
        "id": "1ou97tz",
        "author": "No-Independent2522",
        "title": "Real Madrid Legend, Hall of Famer, attacker, midfielder, Defender, GK, President, socio Eduardo Camavinga celebrated his 23rd birthday tonight at with his France teammates",
        "content": "",
        "upvotes": 536,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fvkjgsmxom0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ou97tz/real_madrid_legend_hall_of_famer_attacker/"
    },
    {
        "id": "1ounn5t",
        "author": "Footboler",
        "title": "Player Power vs Xabi Alonso",
        "content": "Another man utd problem loading at Real. It will take minimum 7 years for this player power caused consequences to be fixed. The board must draw the line now, either you follow the manager or ship out . There can be no compromise on this . This is a  dangerous time for the club. Fans must back the manager too\n\nSecondly the game is getting tactical and the era of relying on individual brilliance is gone. Big Clubs understand this and this is why they are going for younger tactical managers . You must adapt and change or perish ",
        "upvotes": 81,
        "comments": 88,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ounn5t/player_power_vs_xabi_alonso/"
    },
    {
        "id": "1ouidya",
        "author": "More-Judgment-9253",
        "title": "Gonzalo Garcia- CWC Compilation",
        "content": "Did all this just to rot on the bench😔",
        "upvotes": 137,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zmqlk8h4fo0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ouidya/gonzalo_garcia_cwc_compilation/"
    },
    {
        "id": "1oubgic",
        "author": "Ready_Ad_1353",
        "title": "Thomas Tuchel: “I'm delighted that Bellingham has returned, he comes back as a 10. I think that's his best position. One of his strengths is to score from this position. He scores ‘#9 goals’ &amp; tap-ins which is unusual for a 10. It seems easy, but to arrive in position at the right time is difficult”",
        "content": "",
        "upvotes": 278,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/35we6Jcit6tbxLiwxLtcg9LSm50aHx0s8ImXA_NQPCg.jpeg?auto=webp&amp;s=1a38bd8e46657e8e3d8c8d63a75f44918094dada"
        },
        "permalink": "/r/realmadrid/comments/1oubgic/thomas_tuchel_im_delighted_that_bellingham_has/"
    },
    {
        "id": "1ouewy7",
        "author": "More-Judgment-9253",
        "title": "Lack of team control:  Vini says he doesn't want long balls, play properly.  Güler didn't even know when to jump into the press, and Camavinga didn't know when to attack. Huijsen says we're two against one, help out. Mbappe says in attack, we're always down a man.",
        "content": "Do you guys think this is bad for Xabi? To me I think these are very worrying signs if the players are confused and don't know when to press, complaining about the attack, and the lack of  buildup.  This is the translation from twitter btw, I'll put the link:  [(20) (fan) REAL MADRID FANS 🤍 on X: \"🗣️ ](https://x.com/AdriRM33/status/1988230151910682923)",
        "upvotes": 175,
        "comments": 74,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qpb5ly2orn0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ouewy7/lack_of_team_control_vini_says_he_doesnt_want/"
    },
    {
        "id": "1oufkfp",
        "author": "Mastermind_737",
        "title": "Much different team now. The aerial game is no longer an option with this starting squad/current system, yet hope isn't lost. Before and after for those unaware of the difference. 3rd image is my opinion of what should change.",
        "content": "This is a basic comparison. When breaking down teams in a low block our old team was almost perfect. Which is why we would have often 4+ goal scorelines. It was a solid structure that allow a bombardment of crosses and insurance to stop the counter. \n\nNow we only have Jude as a threat in the box, but very fast and technical players with Valverde in midifeld and Mbappe and Vini. We can no longer lean on the aerial attack, but in the building department of Benzema holding the ball and playing it through to Ronaldo and Bale stays the same. Jude will fill that role and provide that outlet to Mbappe and Vini. \n\nVini now with an actual crossing option will have to be defended more closely giving him more opportunities to be dangerous. Going down the line to cross to Jude, cutback to arda/Valverde, or to use the space in between to go for himself. The same applies to Mbappe who actually is much more efficient when shooting across goal on the right like his most recent el clásico goal. If Vini and Mbappe swap wings, they most certainly will create a headache for defenders. \n\nAnd when we are in dire need of a goal, that switch of Arda for Gonzalo and pairing Gonzalo and Jude in the box will work wonders. \n\nWe no longer are an aerial based team, but we have the components to spread the field and be dangerous. Xabi needs to experiment more until we have a proper structure in attack. I appreciate his usage of Masantouno/Brahim, but we have Mbappe we will perform a much better job in creating danger on that right side and Jude we will perform an even better job in being strong and protecting/blocking out the centerbacks creating space for the team to score. Lemme know what y'all think. ",
        "upvotes": 92,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oufkfp/much_different_team_now_the_aerial_game_is_no/"
    },
    {
        "id": "1oul342",
        "author": "Special_Virus851",
        "title": "Trent Alexander Arnold",
        "content": "still our best signing(according to me)",
        "upvotes": 42,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bsk6r66dxo0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oul342/trent_alexander_arnold/"
    },
    {
        "id": "1ounfbe",
        "author": "ManuMora98",
        "title": "[Fem] Real Madrid 1 - 1 Paris FC | Weir 97'; Azzaro 40' (p) | Weir saves a point after the team missed very clear chances om the first half, 7 points out of 9 | Women's CL Match Day 3",
        "content": "",
        "upvotes": 28,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gu5ugo8fdp0g1.jpeg?auto=webp&amp;s=83fd5ec6a083283c0bd5f70a1fd203b0f2e1a080"
        },
        "permalink": "/r/realmadrid/comments/1ounfbe/fem_real_madrid_1_1_paris_fc_weir_97_azzaro_40_p/"
    },
    {
        "id": "1oud24z",
        "author": "tzaje",
        "title": "Gymnastics legend Nadia Comăneci wears a Jude signed Real Madrid shirt during an event in home country Romania. In 2026 there will be 50 years since her perfect 10, a world first in Olympic gymnastics.",
        "content": "",
        "upvotes": 83,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oud24z/gymnastics_legend_nadia_comăneci_wears_a_jude/"
    },
    {
        "id": "1otyaa3",
        "author": "KabiX2",
        "title": "Since Courtois is injured I think it's good time to repost this",
        "content": "",
        "upvotes": 812,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/79bbrk83mj0g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1otyaa3/since_courtois_is_injured_i_think_its_good_time/"
    },
    {
        "id": "1ouh2uu",
        "author": "Critical-Remove-1878",
        "title": "At this point of the season, the last time we had brought a new coach: 3D, 1L in La Liga + a home loss to some team from Moldova",
        "content": "I think that interchanging between Ancelotti-Zidane for a decade, with small breaks inbetween, has made people forget how it's like to appoint a completely NEW manager, who hasn't managed the team again or wasn't an assistant manager previously.\n\nWhen Ancelotti was brought in 2021, at that point of the season we had dropped points in 4 La Liga games in 12, not 2/12. We also lost 1-2 to Sheriff Tiraspol at home, one of the most shocking results in the history of the competition. We barely managed to get a 3-3 draw at home vs Levante, with Vini scoring in the 85th minute. We barely won 2-1 vs Valencia, with two goals after the 85th minute again. Of course, none of it mattered in the end, because we won the league and the UCL.\n\nWhen Zidane had his first full season on his 2nd tenure (19/20), we had 4D, 1L in 12 league games, even worse than 21/22 and we hadn't even faced Barcelona. In the UCL we got completely destroyed by PSG (3-0) and then drew 2-2 at home vs Club Brugge. We won La Liga too at that season btw.\n\nRight now we had lost our two toughest fixtures of the first half of the season (Atletico away, Liverpool away) and just dropped 2 points against a team that are usually tough to play against.\n\nA large part of the difficult schedule is gone. In the UCL we face a winless team away, then Man City at home, then Monaco at home and then Benfica (with 0 points right now) away. That's at least 3 wins if we play our normal football. In La Liga we've faced 5/7 teams that are 2nd-8th right now and we won 4/5 of those games. Look at our record against top 6-8 La Liga teams last season and this will put a smile on your face. ",
        "upvotes": 44,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ouh2uu/at_this_point_of_the_season_the_last_time_we_had/"
    },
    {
        "id": "1ou5f0q",
        "author": "1Fils",
        "title": "Vini vs Doku, Looking at their matchups against Liverpool's bradley.",
        "content": "As a Madridista, the contrast between Vini Jr and Doku going up against Conor Bradley was honestly eye-opening. When Vini faced Bradley in the UCL, he just couldn’t get going as Bradley anticipated almost every dribble and matched his pace, which really threw Vini off his game and halted a lot of our attacking threat. In the city vs Liverpool game, Doku stepped up against Bradley and it was a completely different fight. Doku’s physicality and explosive speed were on full display; he bullied his way past Bradley with ease, absorbing contact and powering through tackles that Vini avoids due to contact. Doku didn’t just rely on skill but pure athleticism, something that made Bradley look much less assured than he did against Vini. Analysing them back-to-back really made the contrast in their styles feel leagues apart.",
        "upvotes": 117,
        "comments": 108,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ou5f0q/vini_vs_doku_looking_at_their_matchups_against/"
    },
    {
        "id": "1otttxs",
        "author": "No-Independent2522",
        "title": "At Anfield, the players ran 5 Km less than the English side. Just five days later, Real Madrid repeated this worrying, covering 8 Km less than Rayo Vallecano. This difference means that each Real Madrid player ran approximately 1 Km less than their direct opponent in their last two matches",
        "content": "",
        "upvotes": 426,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7mApIoBdAx47A3CjM9WNCtAFBWF4zlKR7ZV0An59mI4.jpeg?auto=webp&amp;s=1d760c815bc97c3bf14add04f401062a43abdb71"
        },
        "permalink": "/r/realmadrid/comments/1otttxs/at_anfield_the_players_ran_5_km_less_than_the/"
    },
    {
        "id": "1oun7m2",
        "author": "ManuMora98",
        "title": "Real Madrid W [1] - 1 Paris FC | Caroline Weir 90'+7",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lgH7ITs2zgCB8f6eG10kcvzh26P9wMm7SasCNugLaGM.jpeg?auto=webp&amp;s=8c51524ad7ff652303f064c17e29d67abc4bd3bc"
        },
        "permalink": "/r/realmadrid/comments/1oun7m2/real_madrid_w_1_1_paris_fc_caroline_weir_907/"
    },
    {
        "id": "1ouhz44",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against Paris FC (home) | Women's CL Match Day 3",
        "content": "",
        "upvotes": 8,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/47ctihoxco0g1.jpeg?auto=webp&amp;s=807ac1f544b221cac4bfdc437caa134cc5f15ebb"
        },
        "permalink": "/r/realmadrid/comments/1ouhz44/fem_our_starting_xi_against_paris_fc_home_womens/"
    },
    {
        "id": "1ou6wz6",
        "author": "RoadCurrent8355",
        "title": "Main control mechanisms for those who need to know.",
        "content": "Four main types of Control through playstyle \n1. Positional Control(tiki-taka), seeking to hog the ball, a DLP/Regista is an absolute must, in fact the more the merrier, false fullbacks,  ball playing cbs, etc (Prime Barca Xavi-Iniesta-Busquets, pass around till there is an opening )\n2. Spatial Control( Space Manipulation)- Not manipulating the ball, manipulating space, dragging out players subtly for through balls, opening space for others,, doesn't need the ball, A tempo manipulator is also needed to avoid predictability, but it's less about passing and more about football IQ in manipulating the football field's space, A modric type of player (Kroos-Modric-Casemiro)\n3. Territorial Control (High pressing)- Hustle, dueling football, immediate counter, absolute chaos control, a DLP is not necessarily needed, it does elevate the ceiling though(e.g Thiago Alcantra at Liverpool), but the requirements are workhoses in the middle and runners in attack for pressing and transitions.(Prime liverpool 2018-2022 that pressed everyone to dust), rotations needed to manage fatigue.\n4. Block Control - Italian football, a DLP (Pirlo) is also needed to launchpad attack and transitioning when opponents lose the ball (Prime Milan, Juve).\n\nI rank them as\n1. Spatial Manipulation- The Swiss army knife, perfect for most scenarios, though can be somewhat stale sometimes vs deep blocks(RM ucl run of 6ucls in 10 years\n2. Territorial Control- Perfect counter to positional football that requires perfection, might falter vs deep blocks without that incisiveness, Spatial battles can turn into battles of Individual brilliance (Liverpool under Klopp)\n3. Positional Control- Requires perfect execution for maximum result, best for teams that like to sit deep, but can be somewhat stale if the block stays too strong(Inter 2010 or if pressed super intensely(Pool-2019).\n4. Block Control - Prime Italian Catteneciao football, controls by denying central space, but surrenders some kind of identity, relies too much on opponents making mistakes to get counter opportunities \n\n\nOur historical sweet spot last 10 years was that Space Manipulation that didn't need the ball to control and worked like a charm in knockouts. Which kind of control mechanisms do you think this current squad should work towards pending when we get a DLP/Regista, though elite teams nowadays usually blend these control mechanisms with each other.",
        "upvotes": 34,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ou6wz6/main_control_mechanisms_for_those_who_need_to_know/"
    },
    {
        "id": "1otvz16",
        "author": "The_Middle_Child_",
        "title": "Towards the end Vini says \"it seems like we don't want to win today\" after seeing the subs warm up",
        "content": "Also got some abuse from the Rayo fans ",
        "upvotes": 214,
        "comments": 98,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8xlnvwyy2j0g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1otvz16/towards_the_end_vini_says_it_seems_like_we_dont/"
    },
    {
        "id": "1ouccv0",
        "author": "Comprehensive_Cut437",
        "title": "Naive question possibly where did it not go better for the galactico period?",
        "content": "Hi there,\n\nI’m from the UK and was watching some of the David Beckham documentary and I knew the ‘galactico’ period have been widely regarded as not fulfilling their potential but I didn’t quite realise that DB secured a single la liga title.\n\nHowever I concede I did not watch RM week in week out as I didn’t have the sports channels. So I wondered from a fans perspective what your views were of the period and team? Some of the plays from highlights feels of that time seems to show beautiful football but of course they are highlights.\n\nThank you in advance.",
        "upvotes": 11,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ouccv0/naive_question_possibly_where_did_it_not_go/"
    },
    {
        "id": "1ounkj1",
        "author": "DamnThatsInsaneLol",
        "title": "4231, 442 and 352 are the most suitable formations for our current squad imo. Utilizes our midfield most efficiently, optimises the Arda-Mbappe connection while also allowing Jude to cut in &amp; crash the box. 433 just doesn't work when you don't have an elite RW",
        "content": "",
        "upvotes": 3,
        "comments": 53,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ounkj1/4231_442_and_352_are_the_most_suitable_formations/"
    },
    {
        "id": "1ou8uas",
        "author": "Plane_Outside5646",
        "title": "We are faaaaar from perfection.",
        "content": "",
        "upvotes": 9,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cWd1Jzu_1BqoEixJKM94Lg2VVBxxm6F9e5qD4oJrDos.jpeg?auto=webp&amp;s=2c289206078341ff60cacee075021e922721f1ca"
        },
        "permalink": "/r/realmadrid/comments/1ou8uas/we_are_faaaaar_from_perfection/"
    },
    {
        "id": "1otdkwb",
        "author": "Bryam_h_m",
        "title": "Missing this Rodrygo performances like crazy",
        "content": "Now we just have a black void in the right wing, Xabi really is not taking all off the juice out of this squad.\nNowadays If you want to nullify real madrids attack, you just 7 man mark Vini and that is it, because there is no threat in the right wing, and the worst part, is that he is not responding when he is brought on as a sub or when he starts",
        "upvotes": 582,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z8o9blgmkf0g1.jpeg?auto=webp&amp;s=420861fb1e00f9e305f1d16451f32d96c3793836"
        },
        "permalink": "/r/realmadrid/comments/1otdkwb/missing_this_rodrygo_performances_like_crazy/"
    },
    {
        "id": "1otka4s",
        "author": "Grouchy-Support-1019",
        "title": "You are clearly spoiled",
        "content": "Obviously, you don’t remember the time when we had to wait 12 years for a Champions League victory. With players like Zidane, Raul, Ronaldo, Robinho, Beckham, Baptista, Casillas, Ramos, Pepe, Marcelo... absolute club legends. Obviously, you don’t remember how nobody believed in us in 2013/2014, that we could actually win the UCL. Obviously, you don’t remember how everyone criticized Real Madrid for signing Modrić, how that transfer was even labeled one of the worst in the club’s history, and that the club supposedly wasted around 45 million euros on a totally average player.\n\nBut most importantly, you’ve got foggy memories and don’t remember how tough those matches were and how many times we had to come back from behind. Everyone acts as if Real Madrid used to step onto the pitch and completely dominate, being a class above every opponent. Which simply wasn’t the case. Those were hard-fought victories, often after very poor performances, especially in the knockout stages.\n\nYou’re spoiled and expect Real Madrid to crush anyone by several classes. Look at the 2021/2022 season, once again, nobody believed we could win, and in every single match we were the underdogs. Every knockout game was extremely difficult, and often we were outplayed. Same thing in 2023/2024.\n\nEveryone keeps saying we’ve been playing “nothing” for the last few seasons, yet in those few seasons we’ve won the Champions League twice and La Liga twice.\n\nWe lost 1–0 to Liverpool in the UCL group stage and everyone loses their minds... You’re exactly the same type of people who criticized Real Madrid back in 2012: “Why is this guy playing and not that one? Why did we buy this player instead of that one? This one has to go, that one’s a disappointment.” Instead of proudly supporting the best team in the world, you’re throwing crap at it. But history will show you were wrong.\n\nShow me a single team that has as many Champions League titles as Real Madrid. Show me a single team that has won 6 UCLs in the last 12 years. Show me a single team that has managed to defend the UCL title twice in a row under the modern knockout format. Let alone winning it three times in a row, a record that won’t be broken for decades.\n\nReal Madrid has always had weaker seasons during rebuilds, and it’s always proven to be just a matter of time before we ruled Europe again. Your pathetic analyses and dramatic comments like “they played absolute garbage,” “Xabi is useless,” “extremely disappointed with the performance,” etc., are laughable. I don’t know if it’s just this subreddit that’s so toxic and spoiled and who’ve only supported Real Madrid for a few years and don’t know what a real crisis looks like or if this is now the standard kind of Real Madrid fan, but honestly, you should be ashamed.\n\nAm I happy with the way we play? No. But we’re in a rebuilding phase, and Xabi has been coach for only few months. We’re first in La Liga. We won El Clásico. We’re the best-performing Spanish team in the UCL and quite possibly the only Spanish club that will qualify directly for the Round of 16. Yet all you can say is how terrible we play.\n\nPull your heads out of your asses and stop pretending to be professional football analysts, because you clearly have no idea what’s actually going on.",
        "upvotes": 217,
        "comments": 90,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otka4s/you_are_clearly_spoiled/"
    },
    {
        "id": "1otgq64",
        "author": "soldier101br",
        "title": "Our boys arrives in London for National Duty with Carlo Ancelotti against Senegal",
        "content": "",
        "upvotes": 279,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dk7ugz767g0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1otgq64/our_boys_arrives_in_london_for_national_duty_with/"
    },
    {
        "id": "1otlrf6",
        "author": "TheFeatherDiaries",
        "title": "I miss Mbappe x Arda",
        "content": "",
        "upvotes": 150,
        "comments": 116,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vgyoxvho3h0g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1otlrf6/i_miss_mbappe_x_arda/"
    }
]