[
    {
        "id": "1oc23pv",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 21,
        "comments": 6369,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oc23pv/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ojdajz",
        "author": "IcefoxX5",
        "title": "[Match Thread] Southampton FC U21s - Real Madrid Castilla | U21 Premier League International Cup, Group Stage, Matchday 2",
        "content": "#FT: SOUTHAMPTON 1:1 CASTILLA\n\n&amp;#x200B;\n\n#PREMIER LEAGUE INTERNATIONAL CUP\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n0:1 Thiago Pitarch 76'\n\n1:1 Lekan Okunola 90'+4 \n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n🔄 10' - Fortea leaves the pitch supported by the medical team, he has an ankle injury after a Southampton player stepped on his foot - hopefully it's nothing too grave. Manu Serrano comes on for him\n\n20' - penalty not given for a foul on Yáñez in the box\n\n33' - now a yellow for a dive in the box for Yáñez - it wasn't a penalty but it was never a dive either. Castilla dominating and pushing hard for the first goal here \n\n35' - now the best chance of the game is Southampton's on the counter. In the end it's a 3v1 situation on the goalkeeper, but the final pass is so bad, it forces their attacker to take a shot from a very tight angle, that Mestre can save nicely\n\n45' - huge chance for Castilla, Mesonero advances at the right side of the box and puts it inside - Álvaro let's it pass through with a nice dummy for Yáñez, who tries a precise shot, but it goes just wideif the box\n\n45'+1 - Lamini needs treatment after a bad elbow by a Southampton player that could've been a red card if the referee saw it. He is bleeding from his nose, but he can continue\n\n45'+4 - another clear stomp that should've been an easy yellow card for Southampton - English referee doing the job for the English home team here \n\nHT - half time in an even match - Castilla have more of the ball, but Southampton are dangerous on the counter. The game is also pretty physical, with the referee sadly not applying the same criteria for both teams here\n\n46' - 2nd halfway\n\n52' - quadruple chance for Castilla, first Mesoneros shot is blocked, then Bruno's shot on the following corner goes over the bar. One or two minutes later, Yáñez' low curled shot goes just wide, and in the next play, Manu Serrano's shot is saved by the keeper\n\n60' - suffocating dominance by Castilla now - Mesonero's curled shot is nicely saved by the keeper\n\n🔄 61' - Leiva on for Castrelo. His first match for Castilla, although unofficial, since the 2022/23 season \n\n63' - Yáñez' weak footed shot from a pretty tight angle is too central and the keeper can save it again. The goal needs to start arriving soon\n\n68' - Yáñez arrives after Bruno redirects a chipped pass further into the box. His volley is well wide, yet another missed chance by him. Castilla have had enough chances for 3-4 goals here by now\n\n🔄 69' - last subs, and Arbeloa unearths his gems - Manuel Ángel, César Palacios and Thiago Pitarch on for Mesonero, Ginés and Dani Yáñez\n\n⚽ 76' - GOLLLL DEL CASTILLA - corner from the right side - the ball gets played short, then all the way to the left to Leiva, he plays it to Bruno, who plays it into the box to Palacios. He lays it off with a flick to Pitarch, who curls it in nicely into the bottom right corner for the lead that was well overdue\n\n88' - HUGE SAVE by Mestre - Mestre's pass to open the buildup is too long for Manuel Ángel to reach. Castilla get caught off guard and one pass is enough to put their striker through with only Rivas in front of him. He wiggles past him to take a well placed shot, but Mestre's foot darts out to direct it wide of the goal\n\n90'+2 - and another big chance for Castilla, this time it's Leiva, who is through on the right wing and tries to surprise the keeper with a low shot at the near post, but it hits the side netting \n\n⚽ 90'+4 - unbelievable. Last kick of the game is a corner, and it reaches Southampton's keeper. His header is great, but Mestre's save is even better and he manages to squeeze it against the bar and out with his glove. The ball falls right in front of Okunola, who heads it into the net on the ground\n\nFT - an incredibly frustrating and unjust result for Castilla, who dominated practically the entire match and even more so in the second half, but did not take their chances well enough to generate a result that mirrored their dominance. Southampton only arrived twice at the end of the game and tied the game after an unlikely goalkeeper header in the dying minutes. Castilla now 2nd in the group table behind Wolves, who played one more match however\n\n&amp;#x200B;\n\n**Kickoff:** 20:00 CET\n\n**Venue:** St. Mary's Stadium, Southampton\n\n**Referee**: Ross Martin (ENG) \n\n**Competition:** U21 Premier League International Cup, Group Stage\n\n**Viewing options:** [RMTV/RM Play](https://play.realmadrid.com/live/237284)\n\n&amp;#x200B;\n\n**Castilla XI** (5-2-3): Sergio Mestre - Diego Aguado, Lamini Fati, Mario Rivas, Jesús Fortea (10' Manu Serrano)- Cristian David, Bruno Iglesias, Dani Mesonero (69' Manuel Ángel) - Gabri Castrelo (61' Álvaro Leiva), Álvaro Ginés (69' César Palacios), Dani Yáñez (69' Thiago Pitarch)\n\nBench: Guille Súnico (GK), Pol Fortuny.\n\nUnavailable: Fran González (rested), Joan Martínez (rested), David Jiménez (rested), Victor Valdepeñas (rested), Jorge Cestero (rested), Roberto Martín (injury), Hugo de Llanos (injured), Rachad Fettal (injured), Loren Zúñiga (rested). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** LWWWW\n\n**PL International Cup stats:** 2nd | 3pt | 1-0-0 | 1:0\n\n",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4HME4xj8DPkoCjrBA6RPTDUbx3uXTEuucJ44MsSSHFE.jpeg?auto=webp&amp;s=4ee92f49794109842e84d75a109db6d91065b0d9"
        },
        "permalink": "/r/realmadrid/comments/1ojdajz/match_thread_southampton_fc_u21s_real_madrid/"
    },
    {
        "id": "1okuo75",
        "author": "No-Independent2522",
        "title": "Kylian Mbappe with the golden boot and team mates",
        "content": "",
        "upvotes": 858,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9o1nup979gyf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1okuo75/kylian_mbappe_with_the_golden_boot_and_team_mates/"
    },
    {
        "id": "1okw56t",
        "author": "o6ohunter",
        "title": "Sometimes, dreams do come true",
        "content": "",
        "upvotes": 364,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c0d6l0fsjgyf1.jpeg?auto=webp&amp;s=3971693a1f53f3424bc266592ee4f5ded9fc8e63"
        },
        "permalink": "/r/realmadrid/comments/1okw56t/sometimes_dreams_do_come_true/"
    },
    {
        "id": "1okx8he",
        "author": "ContextDry9672",
        "title": "After Jude Bellingham's team wins, KyKy and Vini team start throwing balls at them to ruin the party.",
        "content": "",
        "upvotes": 176,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jtifpz97rgyf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1okx8he/after_jude_bellinghams_team_wins_kyky_and_vini/"
    },
    {
        "id": "1okxs26",
        "author": "ViniciusFastAF",
        "title": "One player you would like to bring back in his prime version to the current Real Madrid squad? For me, it would be Bale for that right wing position. Ignoring CR7 is very difficult too.",
        "content": "",
        "upvotes": 143,
        "comments": 59,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/m9savf43vgyf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1okxs26/one_player_you_would_like_to_bring_back_in_his/"
    },
    {
        "id": "1okqb9a",
        "author": "busyblckboy",
        "title": "Real Madrid players with most dribbles in La Liga this season.",
        "content": "",
        "upvotes": 235,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zhmzwao56fyf1.jpeg?auto=webp&amp;s=6ae026fb46c78d2f7b6d886b5b7f2bc847c46bc3"
        },
        "permalink": "/r/realmadrid/comments/1okqb9a/real_madrid_players_with_most_dribbles_in_la_liga/"
    },
    {
        "id": "1okr30s",
        "author": "the_fanman2912",
        "title": "Kylian Mbappe's form in the last 10 games, All Comps.",
        "content": "https://preview.redd.it/rqcnic4qdfyf1.png?width=1241&amp;format=png&amp;auto=webp&amp;s=1b74f5179c081976dd5865b9aebf2bfc66b26b81\n\nAbsolutely incredible form, super consistent. Honestly completely validates the ballon d'or shouts. Even excels in big games, 5 goals in 3 games in the UCL. \n\nWe can expect even more in the future, no sign of slowing down, all by the supposed flog signing just last year. Just insane.",
        "upvotes": 123,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1okr30s/kylian_mbappes_form_in_the_last_10_games_all_comps/"
    },
    {
        "id": "1okpgr3",
        "author": "UNIQUEUSERNAME-5",
        "title": "Insta Admin needs a raise asap",
        "content": "",
        "upvotes": 167,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qzk7ki7aweyf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1okpgr3/insta_admin_needs_a_raise_asap/"
    },
    {
        "id": "1okpw9z",
        "author": "Ready_Ad_1353",
        "title": "Trent Alexander-Arnold explains when and why he started to learn Spanish ahead of his move to Real Madrid.",
        "content": "",
        "upvotes": 136,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3v0p3dab1fyf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1okpw9z/trent_alexanderarnold_explains_when_and_why_he/"
    },
    {
        "id": "1okpr69",
        "author": "Public-Connection822",
        "title": "Can anyone explain the Barca lying about how much they paid for Neymar to avoid taxes situation",
        "content": "Apparently Neymar was supposed to come to Madrid but went to Barca because Barca went to the dad of Neymar and payed him extra and then lied about how much they paid for Neymar to pay less taxes.  We then went for Bale and got the iconic BBC trio.  So does anyone know what happened cause I’m pretty interested",
        "upvotes": 103,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1okpr69/can_anyone_explain_the_barca_lying_about_how_much/"
    },
    {
        "id": "1ok8uwi",
        "author": "sahibosaurus",
        "title": "The other side of El Clásico",
        "content": "\nWe focus on the fights and the controversy, but it's good to see there is still the mutual respect and basic decency still intact.\n\nVini gets so much hate for his passionate outbursts on the field but his heart is in the right place. \n\nAdding this paragraph because they want me to write a 300 letter essay just to post a video for some reason.",
        "upvotes": 1245,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/97g3oapmtayf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ok8uwi/the_other_side_of_el_clásico/"
    },
    {
        "id": "1ok5aga",
        "author": "TheFeatherDiaries",
        "title": "OFFICIAL : Arda Güler wins Real Madrid's Player of the Month Award for OCTOBER",
        "content": "",
        "upvotes": 464,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/65gmrxzo5ayf1.jpeg?auto=webp&amp;s=24660214cd37d80e034b94dd6eeba5b8322f9503"
        },
        "permalink": "/r/realmadrid/comments/1ok5aga/official_arda_güler_wins_real_madrids_player_of/"
    },
    {
        "id": "1okyudx",
        "author": "neo_optimus",
        "title": "Excellent analysis of our press that resulted in Vini sub",
        "content": "https://www.youtube.com/watch?v=XLfk5fuFbhg\n\n(I'm in no way affiliated with this channel or video)\n\nGreat explanation on how barca tweaked their play out of our press by exploiting Vinicius' positioning of Kounde. Frankly I think he was one of our best players that night and was electrical enough to cause havoc (much more than Rodrygo could), but this was a correct decision in hindsight.\n\nUse the Auto-dub feature of Youtube to view this video in english",
        "upvotes": 6,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zWIqKL5J69tPsfpIgavrGlBrsVCjdp8caDwEAIPWT_A.jpeg?auto=webp&amp;s=3ab1bd15aa186e2539ab8c0fa46ab5be6bf34767"
        },
        "permalink": "/r/realmadrid/comments/1okyudx/excellent_analysis_of_our_press_that_resulted_in/"
    },
    {
        "id": "1ojxhsm",
        "author": "kanon951",
        "title": "Question: Is Lamine the youngest player to unfollow Carvajal on Instagram?",
        "content": "",
        "upvotes": 1011,
        "comments": 88,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2b6xznn0m8yf1.jpeg?auto=webp&amp;s=52c2dbb78d031d115f381df6ce98af19410a7bfd"
        },
        "permalink": "/r/realmadrid/comments/1ojxhsm/question_is_lamine_the_youngest_player_to/"
    },
    {
        "id": "1oklkog",
        "author": "6ix9ineisGoat",
        "title": "Best striker currently",
        "content": "Who is the best striker currently acc to yall?\n\nOne of the youtubers I follow set a poll in 3 diff social media and he got 3 diff answers .\n\nHe did not try this in reddit  \n\nIn youtube poll - kane \nIn x poll - haaland\nIn instagram - mbappe\n\nSo I wanted to know what about reddit .\n\nAnd i am unable to generate a poll here ",
        "upvotes": 43,
        "comments": 101,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oklkog/best_striker_currently/"
    },
    {
        "id": "1okctdp",
        "author": "ManuMora98",
        "title": "[Basket] BIG WIN in Euroleague against current champions Fenerbahçe 84-58",
        "content": "",
        "upvotes": 102,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6c9p384ilbyf1.jpeg?auto=webp&amp;s=cf2068bf1578bc6fd1aab2c5b5e2e2f3dc2ab26b"
        },
        "permalink": "/r/realmadrid/comments/1okctdp/basket_big_win_in_euroleague_against_current/"
    },
    {
        "id": "1ojvq0c",
        "author": "Leekeew",
        "title": "We are about to buy Barca and ship the entire squad for fun",
        "content": "",
        "upvotes": 711,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6sdxeolf48yf1.jpeg?auto=webp&amp;s=db0d1e4f272cbba3230e681e869d438ea16e904d"
        },
        "permalink": "/r/realmadrid/comments/1ojvq0c/we_are_about_to_buy_barca_and_ship_the_entire/"
    },
    {
        "id": "1ojqw2b",
        "author": "Emergency-Hornet-594",
        "title": "Bellingham brilliant thread pass to Mbappé analysis",
        "content": "\nI found this on facebook, Bellingham dummy moves are so brilliantly time. I hope friendship Fc be back this season. \n\nAlso, Camaving is everywhere. I know he gave away possession 1 2 many times but overall he is so good. He need to improve his passing and vision.\n\nLink to the source : https://www.facebook.com/share/r/17Pgz92C1g/",
        "upvotes": 1319,
        "comments": 43,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i85vx2j9k6yf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ojqw2b/bellingham_brilliant_thread_pass_to_mbappé/"
    },
    {
        "id": "1ojuc6f",
        "author": "cyrusmancub",
        "title": "Xabi Alonso has been left very pleased with Vini’s apology and believes it’s an important step forward for the team’s dynamics",
        "content": "",
        "upvotes": 423,
        "comments": 95,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ojuc6f/xabi_alonso_has_been_left_very_pleased_with_vinis/"
    },
    {
        "id": "1ojyabv",
        "author": "No-Independent2522",
        "title": "Presentation ceremony of the 2024-2025 Golden Boot to Kylian Mbappé will be held tomorrow, October 31, at 1:30 p.m., in the VIP box of the Santiago Bernabéu stadium (live on Realmadrid TV).",
        "content": "",
        "upvotes": 171,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1ojyabv/presentation_ceremony_of_the_20242025_golden_boot/"
    },
    {
        "id": "1okt0hl",
        "author": "MexicanSkywalker",
        "title": "Compra/Venta de Boletos",
        "content": "Comprar boletos es una pesadilla para turistas que son no socios, me imagino que es igual para gente que vive en Madrid.\n\nMi pregunta es, hay algún grupo que compra/venta de boletos? Pagar x4 lo que cuesta un boleto en StubHub es algo de locos. \n\nLlevo desde el día que salieron los boletos al público intentando comprar dos desde la página oficial sin tener suerte. Tengo meses planeando, entraba diario a la página para ver si ya estaban en venta, llegué hasta escoger boletos para el partido de Champions vs la Juve y había disponibilidad. \n\nHay alguna rivalidad fuere vs Valencia que haga imposible conseguir los boletos?\n\n————\n\nBuying tickets is a nightmare for tourists who are not members, I imagine it is the same for people who live in Madrid.\n\nMy question is, is there any group that buys/sells tickets? Paying x4 what a ticket costs on StubHub is crazy.\n\nI've been trying to buy two from the official website since the day the tickets came out without any luck. I have been planning for months, I entered the page daily to see if they were already on sale, I got to choose tickets for the Champions vs Juve match and there was availability.\n\nIs there any rivalry between Valencia that makes it impossible to get the tickets?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1okt0hl/compraventa_de_boletos/"
    },
    {
        "id": "1ojtk2u",
        "author": "Emmanuel_I",
        "title": "Real Madrid seeks more than €4bn in damages from Uefa over Super League debacle",
        "content": "",
        "upvotes": 348,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GOVJGfQmuH33CKLi-SGGij0stwZ5Rls2v08sEMdG_7E.jpeg?auto=webp&amp;s=8b066fba41997368005abae506b0887f3a2d8827"
        },
        "permalink": "/r/realmadrid/comments/1ojtk2u/real_madrid_seeks_more_than_4bn_in_damages_from/"
    },
    {
        "id": "1ok8cqy",
        "author": "ManuMora98",
        "title": "[Basket - Official] Alex Len joins Real Madrid on a 2 year deal",
        "content": "Real Madrid CF has reached an agreement with Alex Len, a center who played last season for the Los Angeles Lakers, by which the player remains linked to the club until June 30, 2027.\n\nInternational with Ukraine, Len arrives at Real Madrid after 12 seasons in the NBA. In the North American league, Len has played for the Phoenix Suns (2013-2018), Atlanta Hawks (2018-2020), Sacramento Kings (2020), Toronto Raptors (2020-2021), Washington Wizards (2021), Sacramento Kings (2021- 2025) and Los Angeles Lakers (2025).\n\nAlex Len arrives at Real Madrid after accumulating extensive experience of 708 games as an NBA player.",
        "upvotes": 20,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1ok8cqy/basket_official_alex_len_joins_real_madrid_on_a_2/"
    },
    {
        "id": "1ojj2mc",
        "author": "victormarkno",
        "title": "KYLIAN MBAPPÉ &amp; VINÍCIUS JR x LOUIS VUITTON",
        "content": "source: [L’OFFICIEL](https://www.hommessingapore.com/style/louis-vuitton-real-madrid-partnership-mbappe-bellingham-fashion-football-sports-news)",
        "upvotes": 599,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wcyms441p4yf1.jpeg?auto=webp&amp;s=71aa0858cb4b4359befa70fe7a46dc31fa16a2a0"
        },
        "permalink": "/r/realmadrid/comments/1ojj2mc/kylian_mbappé_vinícius_jr_x_louis_vuitton/"
    },
    {
        "id": "1ok6zns",
        "author": "No_Perception_8707",
        "title": "Thoughts on the 95/96 season?",
        "content": "A while ago I watched all 24 games from the 95/96 season that are on footballia and it was incredibly painful and just plain sad watching us play, especially after the title win. I've seen some bad seasons in my time but it rly felt like only Raúl, Redondo, Zamorano and Hierro were good at all and the amount of shocking players was insane. Those who have experienced this season in any way: are my feelings justified to you?",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ok6zns/thoughts_on_the_9596_season/"
    },
    {
        "id": "1okozdy",
        "author": "AmadisHali",
        "title": "Is anyone else getting a strong 2011/12 vibe from our current squad?",
        "content": "The majority of people at this point have noticed how much the Mbappe-Guler duo is reminiscent of Ronaldo-Ozil, but the deeper I look into the squad, the more it reminds me of the Mourinho era. Some fans have also noted that Alonso perhaps has a few more Mourinho-type traits than Ancelotti-type.\n\nI noticed as well that a lot of times this season, our lineup is being displayed as a 4-2-3-1 rather than a 4-3-3. It’s a very subtle difference, but that’s how it was displayed under Mourinho.\n\nHere are all the connections I’ve made:\n\n**Attacking Parallels**\n\nMbappe - Ronaldo (main goalscorer)\n\nVinicius - Benzema (the sidekick)\n\nRodrygo - Higuain (fighting sidekick for minutes)\n\nMastantuono - Di Maria (right-sided Argentine)\n\nBrahim - Callejon (reliable Spanish backup)\n\n**Midfield Parallels**\n\nGuler - Ozil (Arda literally feels like a regen)\n\nBellingham - Kaka (not overly similar but didn’t want to exclude them for the sake of squad depth emphasis)\n\nTchouameni - Alonso himself (again, same idea as Bellingham - Kaka)\n\nValverde - Khedira (this is borderline disrespectful to Fede but still sorta makes a bit of sense?)\n\nCamavinga - Diarra (versatile French workhorse)\n\nCeballos - Granero (reliable Spanish backup)\n\n**Defensive Parallels**\n\nCarvajal - Arbeloa (seasoned RB)\n\nHuijsen - Ramos (ball-playing CB)\n\nMilitao - Varane (agile CB)\n\nRudiger - Pepe (roughhouse CB)\n\nAlaba - Carvalho (seasoned CB)\n\nAsencio - Albiol (Spanish CB)\n\nCarreras - Marcelo (not overly similar)\n\nFran/Mendy - Coentrao (backup LB)\n\nCourtois - Casillas (world class GK)\n\nLunin - Adan (backup GK)\n\nRemainders: Trent, Gonzalo, Endrick, Sahin, Altintop\n\nThere’s reason to believe that 11/12 was Xabi’s favourite season that he played for us. Is it a stretch to believe he’s trying to emulate it? It’s also worth considering that this was the last season before now that we didn’t have Modric in our squad, who obviously had a colossal impact on the way we play.",
        "upvotes": 2,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1okozdy/is_anyone_else_getting_a_strong_201112_vibe_from/"
    },
    {
        "id": "1oj32g6",
        "author": "cyrusmancub",
        "title": "Vini’s official statement issued to address his Clásico substitution",
        "content": "",
        "upvotes": 2410,
        "comments": 283,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ko7872acn1yf1.jpeg?auto=webp&amp;s=e25b958a143801f9631bd3bab66d5ace53f0c745"
        },
        "permalink": "/r/realmadrid/comments/1oj32g6/vinis_official_statement_issued_to_address_his/"
    },
    {
        "id": "1ojy0i4",
        "author": "Thesheeshmonster",
        "title": "Appreciation post- the midfield with camavinga and tcho. Don’t forget Militao and finally Vini",
        "content": "We all knew how good tcho is same with camavinga. I had my concerns after a long time away from the field because of serious injuries. But man did these two provide balance. Belli and Guler have the freedom to room preferably to the right side since thats most definitely our weakest offensive side. \n\nWe also knew huujsen is good especially on the ball at least I did before the signing. I was advocating for another center back in that same transfer window even though knowing madrids transfer strategy that was impossible.  I wasn’t expecting these sort of performances from him but Militao 2 acls later and still the same spirit and absolutely serviceable back next to huujsen. I do still believe we do need a center back, one is great at winning aerial duels and that aggression leadership and no bullshit similar to ramos but for now militao’s a very pleasant surprise. (I say this because the multiple serious injuries he’s come back from- also get rid of alaba lol) (main candidates for new cb next year are honestly either one of the two arsenal center backs lol) The reason I say that is I think that is the piece that will elevate madrid to dominate every competition every year and restart that dynasty. militao would be a world class backup in case anything happens to either starter.\n\n\nBack to the point, even though I don’t really believe a midfielder is a priority especially since we have too many of them and we haven’t even gotten into valverde and how as it seems his best position for the squad is at rb. (not his best positon overall) he provides his workrate energy and defense there which allows us to have tcho and camavinga both start which covers a lot more of our of the defensive struggles and allows guys like guler and  belli to roam and provide.\n\n\nVini- criticized for his antics and lack of press. I wouldn’t say he has stopped his antics really maybe lessened lol. But watch the last 5/6 games closely he is actually determined to press and most noticeably in the barca game. Vini with a chip on his shoulder or with a child from the other team talking shit lights a fire in him and gives us him best version. Like or not the best vini is the one with that fire lit.",
        "upvotes": 31,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ojy0i4/appreciation_post_the_midfield_with_camavinga_and/"
    },
    {
        "id": "1ojqf1t",
        "author": "maybeMichaelScarn",
        "title": "How are we feeling before Liverpool at Anfield?",
        "content": "With Liverpool's loss to Crystal Palace 3-0 yesterday and crashing out of the EFL Cup, I personally think they will have a point to prove. Haven't watched them play much this year apart from the Arsenal match at the start of the season (which they won 1-0), the ATM match in UCL (which they also won 3-2), and the United match couple of weeks back (which they lost 2-1). Watched the highlights of the Frankfurt game and tbh, while they played well, Frankfurt was horrendous. \n\nI definitely don't think it will be an easy match specially since it's an away match for us. The Anfield crowd will make it tough and Liverpool will have a definite point to prove (and would do so) if they are able to defeat Real Madrid. \n\nLet's hope we play with the same intensity and don't take it lightly. Also it will be a homecoming for Trent and Xabi. ❤",
        "upvotes": 107,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ojqf1t/how_are_we_feeling_before_liverpool_at_anfield/"
    }
]