[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p7oxqd",
        "author": "Acrobatic-Apricot874",
        "title": "Netflix broken?",
        "content": "Anyone else's netflix just break?? I was trying to watch season 5 of stranger things because it just dropped a minute ago but my netflix isn't letting me into anything...",
        "upvotes": 107,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1p7oxqd/netflix_broken/"
    },
    {
        "id": "1p79ilm",
        "author": "intelerks",
        "title": "Linda Hamilton refuses to chase youth in 'Stranger Things': \"I do not spend a moment trying to look younger\"",
        "content": "",
        "upvotes": 438,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1p79ilm/linda_hamilton_refuses_to_chase_youth_in_stranger/"
    },
    {
        "id": "1p7pc8k",
        "author": "TheMirrorUS",
        "title": "Netflix crashes with Stranger Things Season 5 release",
        "content": "",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p7pc8k/netflix_crashes_with_stranger_things_season_5/"
    },
    {
        "id": "1p7iqtt",
        "author": "Gamer_8887",
        "title": "In my opinion Stranger Things is the best Netflix show I've ever watched and I am sad to know that it's coming to an end",
        "content": "I started watching it in 2020, at the time I bingewatched seasons 1-3 and I was so addicted. Season 4 in 2022 really blew me away, especially the Max episode, I still listen to that song till today. It's really good. With the final season volume 1 around the corner, I just wanted to make this post before it airs. I will miss this masterpiece of a show when it ends 😭.",
        "upvotes": 28,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1p7iqtt/in_my_opinion_stranger_things_is_the_best_netflix/"
    },
    {
        "id": "1p7p1sv",
        "author": "Signal-Necessary-324",
        "title": "Stranger things",
        "content": "Netflix is not down in alberta! Hahaha. Just sat down to watch. Kids are so excited they ate dinner at record speed. Feel free to use this as an open live episode drop chat ",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1p7p1sv/stranger_things/"
    },
    {
        "id": "1p7p1bt",
        "author": "WibbyWobbles",
        "title": "So… did Netflix just crash?",
        "content": "We all in this together or is it just me and a select group of others? I hit play on S5 of Stranger Things and it immediately gave me error code NSES-500. Now I can’t even access Netflix. \n\nJust me? ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p7p1bt/so_did_netflix_just_crash/"
    },
    {
        "id": "1p6x7e9",
        "author": "ChiefCrazybull",
        "title": "Could Guillermo Del Toro's new Frankenstein movie be a Santa Clause origin story?",
        "content": "Obviously there are spoilers, so if you haven't seen the movie then stop reading.\n\nI just finished watching the 2025 Frankenstein, and the first thing that occurs to me is that it sets the Creature up perfectly to be the origin story for Santa Claus. Here are some of the reasons:\n\n* The movie ends with the Creature walking towards the north pole, which is always thought of as the remote home of Santa Claus.the Creature\n* The Creature has a good heart and just wants to help people (he cares for the family, helps the old man, and frees the ship from the ice at the end)\n* The Creature is immortal, just like Santa.\n* Furthermore, his immortality implies some sort of magic being involved (surviving an exploding stick of dynamite goes beyond scientific explanation), which could explain some of the magical aspects of Santa.\n* The Creature begins to look like Santa at the end of the movie (with a long heavy coat like Santa's). Since he doesn't want to scare people, a big hat and beard would also make sense.\n* One of the first scenes after he escapes the lab is him befriending reindeer, foreshadowing his future as Santa.\n* After that, the Creature hid during the day and only came out at night, where he would leave seemingly magical gifts for people (much like Santa leaves gifts while everyone is sleeping). The family would also leave food or other things for him (like leaving cookies for Santa).\n* Elizabeth, who shares a mutual love with the Creature, looks shockingly similar to Jessica from the 1970 movie Santa Clause is Coming to Town (both are pale with long red hair parted in the middle). This movie is a Santa Claus origin story, so it would be a clear Mrs. Claus Easter Egg if Guillermo Del Toro intentionally styled Elizabeth like Jessica.\n* Furthermore, all the Creature ever wants is someone like him to live with. Assuming he is able to eventually create such a person (maybe using the notes he found outside the lab), then this person would also be immortal and would fit perfectly as Mrs. Claus (it would also make sense that he might make this person look like his love Elizabeth).\n* Perhaps the elves are also immortal, good creatures created by the Creature (but since he always says he wants just one other person like him, maybe he made them better suited to creating toys as craftsmen).\n* The movie takes place in 1857, which is still before Santa Claus becomes a mainstream part of Christmas.\n\nEdit: changed Frankenstein to the Creature, and changed Santa Clause to Santa Claus",
        "upvotes": 224,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1p6x7e9/could_guillermo_del_toros_new_frankenstein_movie/"
    },
    {
        "id": "1p7p2b9",
        "author": "alusitano",
        "title": "Can't access Stranger Things Season 5 on my PC, anyone else?",
        "content": "Hey everyone,  \nWith the release of *Stranger Things* Season 5, I tried watching it through the web version of Netflix on my computer, but it just won’t load. The homepage works fine, but as soon as I click on the show, the page freezes or gives an error.\n\nIs anyone else experiencing this?  \nDid Netflix break something with the release, or is it just me?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p7p2b9/cant_access_stranger_things_season_5_on_my_pc/"
    },
    {
        "id": "1p7ae7i",
        "author": "amelix34",
        "title": "You just found out that one of the main characters in your favourite TV series is not a good person in real life. Do you keep watching?",
        "content": "There is a comedy show that I absolutely love (most of its seasons) and I rewatch it from time to time. Some time ago I read that one of the main characters was recently accused of sexual assault in real life, and as I read it was not the first time. I also saw some discussions on Reddit about them and it seems that it's established fact that a lot of people have zero respect for this person.\n\nI'll be honest it breaks my heart because I truly love the show and their character, and now when I'm rewatching the show it just feels different, everytime I see scene with them my brain reminds me who they are in real life and it's difficult to enjoy the show like I always did. I regret reading about this stuff\n\nI wonder what's your take on this.",
        "upvotes": 14,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1p7ae7i/you_just_found_out_that_one_of_the_main/"
    },
    {
        "id": "1p6ztg8",
        "author": "AffectionateAge1448",
        "title": "Dont Worry Darling",
        "content": "This movie is super creepy. It made me think about how women in the early 1900s used to be treated. It made me think that this is probably  how the first women who started to see through their social conditioning felt. Or any women that went agaisnt  their husbands.   It was common for women to be labeled mentally unwell, and recieve lobotomies if they did things like show anger, go agaisnt  their husbands  wishes, or step out of line with the social norms. Much like in this movie.  In the movie when the women step out of line they are labeled mentally ill, and then their brains are \"restarted\".  Women were expected to be exactly as the women in this movie are. \n\nImagine the first women in the 1940s that started to question  \"why are we house wives, why do we all dress the same, why are we servants to men, why cant we have jobs, why cant we drive , why cant we vote what is going on,  why are we given lobotomies if we show emotion or disobey our husbands\"? And then she slowly started to realize women were  being brainwashed and that women are fully capable of doing things outside of their house duties. I imagine it was much like this movie, like seeing through the simulation like social conditioning, and then being condemned by society for speaking out, and sometimes being forced to have lobotomies to make women  fall back in line with the social norms. ",
        "upvotes": 67,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ztg8/dont_worry_darling/"
    },
    {
        "id": "1p7lqcw",
        "author": "makeitrealforme",
        "title": "Netflix auto play",
        "content": "What's with Netflix nowadays where it doesn't even give you the option to see information about the movie/show you're interested in watching; it just automatically plays when you click it when before it allowed you to see the details before deciding to play. It's annoying.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p7lqcw/netflix_auto_play/"
    },
    {
        "id": "1p7onhz",
        "author": "ExchangeSea",
        "title": "Is Stranger Things Season 5 going to be on the Standard with Ads plan?",
        "content": "So i dont have netflix and im kinda poor and i really want to watch ST S5 when it comes out in like 12 minutes and my question was just if it is going to be available to watch on the standard with ads plan. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p7onhz/is_stranger_things_season_5_going_to_be_on_the/"
    },
    {
        "id": "1p7hfp6",
        "author": "kebmpb",
        "title": "We betting on “yes” that the servers crash tonight at 8:00pm est?",
        "content": "Gonna be Mike Tyson/Jalke Paul all over again or have they beefed up the server since then? Did they ever come out and say why they didn’t do a midnight release?\n\nShould be interesting to say the least!",
        "upvotes": 7,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1p7hfp6/we_betting_on_yes_that_the_servers_crash_tonight/"
    },
    {
        "id": "1p6tnrd",
        "author": "Far_Pen3186",
        "title": "Matthew Macfadyen Gives An Incredible Performance As James Garfield’s Assassin in ‘Death By Lightning’",
        "content": "This character is infuriating, a pest, delusional, annoying as FK, pathetic, a loser, etc. The actor did a great job in making the viewer disgusted with this character! Even his voice is grating.",
        "upvotes": 139,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1p6tnrd/matthew_macfadyen_gives_an_incredible_performance/"
    },
    {
        "id": "1p7p31x",
        "author": "sgudeman",
        "title": "Opened Netflix app on Apple TV and was logged into somebody else’s account at my house… what??",
        "content": "So I opened up Netflix on my Apple TV and the account profiles were all somebody else’s account… Terrance, kids, Matthew, Michael, and Jacob. None of whom live at my house or who I have on my Netflix account. It was so weird! Had to log out and log back in as me… it was like being at an Airbnb where somebody else had forgot to log out except this was at my own house. Anyone else have this happen ever?? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p7p31x/opened_netflix_app_on_apple_tv_and_was_logged/"
    },
    {
        "id": "1p7ouat",
        "author": "SundaeNumerous9729",
        "title": "recomendação",
        "content": "Alguma recomendação de filmes ou série estilo A Diplomata e House Of Cards? Gosto de politica, suspense, drama. Até mesmo alguma recomendação de algo sobre 2 Guerra Mundial sem ser a guerra em si, mas a vida dos nazist@s",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p7ouat/recomendação/"
    },
    {
        "id": "1p7lsua",
        "author": "Jumpy-Beginning3686",
        "title": "The devil next door",
        "content": " Rewatched the devil next door \n\n Anyone else not  surprised how corrupt the isreali justice  system was when  dealing with this case.\n\nFirstly  for the USA to exudate Demjanjuk to israel to be held on trial for war crimes without any real evidence is ridiculous.\n\nSubsequently the case was a complete witch hunt; witnesses had dementia or were caught blatantly lying and changing  thier stories  , the expert witness  looked terrified when defence lawyer  were questioning ,as she knew she was full of sh-t aswell\n\nI don't think Demjanjuk was Ivan the terrible . Just another victim to a corrupt system \n\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p7lsua/the_devil_next_door/"
    },
    {
        "id": "1p75mit",
        "author": "huffpostuk",
        "title": "Netflix Announces New Diddy Documentary Sean Combs: The Reckoning",
        "content": "",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p75mit/netflix_announces_new_diddy_documentary_sean/"
    },
    {
        "id": "1p7ktiw",
        "author": "National-Catch-6324",
        "title": "Disable autoplay when on a movie/series page?",
        "content": "When I click on a movie/series to look at it, the show automatically starts playing. Or if I'm on the page then run to get snacks or a drink it automatically starts after a few seconds. I have no autoplay settings on, this is really annoying!!!\n\nnote: not the browsing page, the page when you actually click on one",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p7ktiw/disable_autoplay_when_on_a_movieseries_page/"
    },
    {
        "id": "1p7jx0w",
        "author": "Intelligent_Entry377",
        "title": "What's a movie yall would recommend..[desc]",
        "content": "Uh I mean late night ish..smth not boring ..haven't watched movies in years so I have no idea \n\nUh I mean late night ish..smth not boring ..haven't watched movies in years so I have no idea (fille)",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1p7jx0w/whats_a_movie_yall_would_recommenddesc/"
    },
    {
        "id": "1p7ooot",
        "author": "eubyfied",
        "title": "Techs Onsite???",
        "content": "i want to know how many network technicians are onsite and on call to make sure the servers are good for the premiere goes off without troubles. \n\n  \ni would think a lo…",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p7ooot/techs_onsite/"
    },
    {
        "id": "1p7huhf",
        "author": "thelionbg",
        "title": "Kdrama recomendarions",
        "content": "Can anyone recommend something to watch? I like crime/thriller/ mystery K-dramas. You can take a look at my MLD profile, as I'm not exactly sure what my taste is. But if there's murder and drama, it's for me, here's the link: [https://mydramalist.com/dramalist/niki0104](https://mydramalist.com/dramalist/niki0104) Thanks everyone! Have a lovely evening ❣️",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p7huhf/kdrama_recomendarions/"
    },
    {
        "id": "1p7f4cz",
        "author": "tnauji",
        "title": "Zero Day SPOILER ALERT!",
        "content": "Did anyone else think that George Mullen is the one who killed Kiddler? I remember he asked to talk to her the very next morning and once she was found dead I don’t think we got Mullens reaction to her death, the cameras being looped also gives the clue it was an inside job",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p7f4cz/zero_day_spoiler_alert/"
    },
    {
        "id": "1p7ozrs",
        "author": "KumingaCarnage",
        "title": "Yes, Netflix is down because of the S5 release.",
        "content": "Yes we get it, it’s down. And it’s gonna be down for the next several hours at least so stop spamming this subreddit with comments and additional posts asking if everyone else’s is down.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1p7ozrs/yes_netflix_is_down_because_of_the_s5_release/"
    },
    {
        "id": "1p6rstq",
        "author": "57829",
        "title": "Eva Green Joining ‘Wednesday’ Season 3 As Aunt Ophelia",
        "content": "",
        "upvotes": 22,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p6rstq/eva_green_joining_wednesday_season_3_as_aunt/"
    },
    {
        "id": "1p7bk0j",
        "author": "cocoquinnxo",
        "title": "What should I watch",
        "content": "Hey, I’ve been looking for series to watch but can’t find any that suit my taste. I’m currently in Germany and mostly like comedy. I’m open to other genres, but I’m out on romance, horror, sad stuff, or superhero/comic things. In a few weeks I’ll be back home in Cali, but until then I need something to watch. Would love some ideas, thanks!",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1p7bk0j/what_should_i_watch/"
    },
    {
        "id": "1p6yqwo",
        "author": "GuineaPKilledMe",
        "title": "Thoughts on Acting My Age by Kevin Hart?",
        "content": "His last two stand up specials just do not hold the same level of humor for me anymore. I'm halfway through this one and I honestly haven't given more than a chuckle so far. It also seems he just blatantly makes up fake scenarios just to get his joke across. Is anyone enjoying  it or am I being too harsh?",
        "upvotes": 9,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1p6yqwo/thoughts_on_acting_my_age_by_kevin_hart/"
    },
    {
        "id": "1p77a51",
        "author": "SmartPEG",
        "title": "Landscape fullscreen dead for Netflix on my iPad",
        "content": "I watch movies on my iPad exclusively. Landscape fullscreen works perfectly on Prime Video, AppleTV+, Fandango, Roku, Mubi, Shudder, Criterion, HBO Max, Hulu, Peacock, and Paramount Plus. Three days ago, Netflix became incompatible with landscape fullscreen. It's stuck in portrait orientation, so the landscape image is very small, in the middle of the screen. What is wrong with Netflix on the iPad app?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p77a51/landscape_fullscreen_dead_for_netflix_on_my_ipad/"
    }
]