[
    {
        "id": "1hkx7rr",
        "author": "SanderSo47",
        "title": "December 20-22 Box Office Recap: 'Sonic the Hedgehog 3' tops 'Mufasa: The Lion King' in the domestic market. While 'Mufasa' leads overseas, its $122.2 million worldwide debut is very underwhelming. Meanwhile, 'Kraven' and 'War of the Rohirrim' collapsed 72% and 73%, respectively.",
        "content": "https://preview.redd.it/pa090wakvn8e1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=bad30e582d782417c82593228c0a7bf97e777c0f\n\nThere was a new box office king, and it wasn't Mufasa or any other lion.\n\nThat honor belonged to ***Sonic 3***, which managed to outgross ***Mufasa*** to top the box office. The latter still won the foreign box office, even if the numbers are way below the expectations. In limited release, A24's ***The Brutalist*** had one of the best per-theater averages of the year so far. While last week's newcomers, ***Kraven*** and ***The Lord of the Rings: The War of the Rohirrim*** had poor drops after their anemic starts.\n\nThe Top 10 earned a combined $139.7 million. That's up a massive 62% from last year, when ***Aquaman and the Lost Kingdom*** topped and flopped.\n\nDebuting in first place, Paramount's ***Sonic the Hedgehog 3*** earned $60.1 million in 3,761 theaters. That's below the $72 million debut from the previous film, but that's not really a cause for concern as of now; December titles are often known for decreasing openings but strong legs.\n\nWhile not a franchise best, this is still a very solid debut. As the previous film teased, the introduction of Shadow was key to the hype. Adding Keanu Reeves to the mix was also a strong choice to get the Internet going wild. It's a film where Paramount aggressively campaigned and got people talking. The fact that there were 3 ***Sonic*** films in the span of almost five years is impressive, especially when the third film has the strongest reviews so far. While it might sound disappointing that the film didn't outperform the second film, at least it has the December excuse. \n\nAccording to Paramount, 59% of the audience was male and 43% was in the 18-34 demographic. They gave it a strong \"A\" on CinemaScore, which is the same score as the previous films. Despite its lower-than-expected opening, it's gonna have some legs through the holidays. For now, $200 million should happen. Paramount clearly believes in the franchise; they already announced development on a fourth film before the film even opened. \n\nHaving to settle for second place, Disney's ***Mufasa: The Lion King*** earned just $35.4 million in 4,100 theaters. That's down a massive 82% from the 2019 film, which broke so many records back then. Even if we have to accept that December lowers the opening weekend numbers, that's still a horrible drop.\n\nDisney clearly believed in the potential of the 2019 ***Lion King*** remake. After all, it earned $1.6 billion worldwide. But the thing is that the film's reputation is not the same as it was 5 years ago. The audience liked the film and ate it up, but like a lot of live-action remakes, the audience moved on afterwards. All while the criticism for the 2019 film just increased. \n\nBut still, how can it explain a 82% drop? Even if we have to ignore the fact that people moved on from the 2019 version, there's the fact that this is completely new story with new songs. There's no nostalgia to be milked here, and the prequel aspect is also a double-edged sword; we already know Mufasa and Scar will live and eventually become enemies. Audiences can simply skip the film and won't really miss anything, unless you're insanely passionate to learn questions like... how did Rafiki got his staff? Even with the presence of a fantastic filmmaker like Barry Jenkins, you can tell this was just a paycheck; it's sitting at a weak 57% on RT. So if you didn't care or forgot about the 2019 film, there are no reasons to check this out.\n\nAccording to Disney, 54% of the audience was female and 39% was in the 18-34 demographic. They gave it a fine \"A–\" on CinemaScore, which is lower than the previous film. Even if the film legs out to a 6x multiplier, that would still be just $212 million, which is like 60% down from the previous film. Needless to say, it's unlikely there will be a third ***Lion King*** film.\n\nUniversal's ***Wicked*** was on third place, easing just 38% and adding $14.1 million. That takes its domestic total to $384.5 million, and it should continue holding incredibly well through the holidays.\n\nAfter topping the box office for three weekends, ***Moana 2*** was hit by ***Sonic*** and ***Mufasa***. The film fell to fourth place, and it had another rough drop, officially losing to ***Wicked*** on the weekends. This time, it fell 50%, adding $13.2 million this weekend. While the film has had a huge opening weekend, the legs are leaving a lot to be desired. The film has made $359.1 million, and it has zero shot at hitting $450 million domestically. That's quite disappointing, signaling that the film was very front-loaded.\n\nAngel Studios also released ***Homestead*** this weekend. Opening in 1,886 theaters, it earned a solid $6 million. While critics lambasted the film, the audience gave it a middling \"B\" on CinemaScore. It should hold well thanks to the holidays, but it would be a surprise if it came anything close to $30 million by the end of its run.\n\n***Gladiator II*** is still showing some legs, even if they arrived a little too late to make a difference. The film dropped 40%, adding $4.5 million this weekend. The film has made $154 million so far, and the holidays should get it to around $170 million.\n\nAfter its pathetic debut, ***Kraven the Hunter*** didn't save face on its second weekend. The film earned just $3 million, which marks a horrible 72% drop, almost on par with ***Morbius***. Through ten days, the film has made a poor $17.3 million so far, and with four films opening in wide release, it will continue falling. Even with the holidays, it'd be a surprise if it made much more than $25 million domestically.\n\nAmazon's ***Red One*** had its worst drop so far, falling 65% and earning only $1.4 million. With more theater drops on the way, it's now guaranteed to finish below $100 million, which is quite disappointing.\n\nSo ***Kraven*** had a horrible drop, yet ***The Lord of the Rings: The War of the Rohirrim*** was ready to introduce itself. It made just $1.2 million this weekend, which is a horrible 73% drop and the worst drop in the franchise. The film has earned a meager $7.3 million, and it's gonna struggle to hit $10 million lifetime, which is just pathetic. Just a few minutes ago, it was announced that the film will hit digital at home on December 27, just 2 weeks of theatrical exclusivity. Ouch.\n\n***The Best Christmas Pageant Ever*** rounded up the Top 10, earning $780,000 this weekend. That takes its domestic total to $38.4 million. It has a few more days to make money before completely free falling.\n\nA24's ***The Brutalist*** debuted in 4 theaters. Despite its commanding 215-minute runtime, the film earned $266,791, which translates to a very strong $66,698 per-theater average (third best of the year). With strong awards buzz on the way, the film will continue expanding in the coming weeks.\n\n#**OVERSEAS**\n\nIn some consolation, ***Mufasa*** topped the foreign box office. Even though that's by default; ***Sonic*** didn't debut in any market, opting to start its international run on Christmas.\n\nWith that out of the way, ***Mufasa*** debuted with $87.2 million in the overseas markets, for a $122.2 million worldwide debut. That's far below the projected $180 million debut, and a far cry from the original. It had soft debuts across the world, with its best numbers in China ($7.8M), France ($7.7M), Mexico ($7.1M), the UK ($5.5M) and Germany ($5M). Even with the benefit of holidays, it's tough to see the film making much more than $600 million worldwide, more than $1 billion below the 2019 title. Which means it will break the record for the biggest sequel-to-original drop.\n\n***Moana 2*** added $32.8 million this weekend, as its worldwide total is nearing $800 million. The best markets so far are France ($46M), UK ($37.6M), Germany ($29M); Mexico ($26.2M) and Brazil ($24M). That billion is gonna take a few more weeks.\n\n***Wicked*** added $12.6 million this weekend, taking its worldwide total to $572 million. The best markets are the UK ($60.8M), Australia ($22.5M), Korea ($13.1M), Mexico ($9.6M) and Germany ($8M). \n\nIn some notable news, ***Gladiator II*** has finally crossed $400 million worldwide, with a $416.3 million run so far.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**THIS WEEK**\n\nWe'll have four films hitting wide release.\n\nThe first is Robert Eggers' new film ***Nosferatu***, a remake of the 1922 film. Eggers is coming off ***The Northman***, which was his highest grossing film. Even though it wasn't theatrically successful, it was reported that it broke even through ancilliaries, which is why this film exists. Pre-sales are very strong for its opening day, and with fantastic reviews so far, it looks like Eggers might have a new highest grossing film.\n\nAnother release is Searchlight's ***A Complete Unknown***, which stars Timothée Chalamet as Bob Dylan. The film has earned very good reviews, but Chalamet has received acclaim so far, building strong awards buzz. Perhaps we're looking at another sleeper hit.\n\nA24 is also releasing ***Babygirl***, which stars Nicole Kidman and Harris Dickinson. Once again, another title with decent reviews so far, and Kidman earning Oscar buzz for her performance.\n\nThe final title is Amazon's ***The Fire Inside***, which marks Rachel Morrison's directorial debut, written by Barry Jenkins. The film stars Ryan Destiny and Brian Tyree Henry, and follows the true story of American professional boxer Claressa \"T-Rex\" Shields as she trains for the 2012 Summer Olympics. Amazon's ***The Boys in the Boat*** performed quite well last year, so perhaps this could surprise.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 206,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wFGUs2fqXnoz34Csnmk0CxkDpAHLyF8g1YQUCh8Lvq0.png?auto=webp&amp;s=b09b32366c077c8ba739f38a3628063c4640d380"
        },
        "permalink": "/r/movies/comments/1hkx7rr/december_2022_box_office_recap_sonic_the_hedgehog/"
    },
    {
        "id": "1hlsind",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (A Complete Unknown / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n**Nosferatu discussion coming on the 25th @9pm CST**\n\n**Babygirl discussion coming on the 25th @9pm CST**\n\n# Streaming Releases\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hlsind/official_discussion_megathread_a_complete_unknown/"
    },
    {
        "id": "1hm39va",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘Love Me’ Starring Kristen Stewart &amp; Steven Yeun - A postapocalyptic romance in which a buoy and a satellite meet online and fall in love after the end of human civilization",
        "content": "",
        "upvotes": 728,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gr5jqbtip09e1.jpeg?auto=webp&amp;s=63aa733713272f00ce6555cce07b725dbf90c129"
        },
        "permalink": "/r/movies/comments/1hm39va/official_poster_for_love_me_starring_kristen/"
    },
    {
        "id": "1hm1kod",
        "author": "Bennett1984",
        "title": "Sherlock Holmes at 15: The Story Behind Guy Ritchie's Reimagining of the Baker Street Super Sleuth",
        "content": "",
        "upvotes": 757,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6FJX0_8247i4QNGu44q04tgxC7t-UsgUZ7nuPmSu1nw.jpg?auto=webp&amp;s=648397a7c67d32e99c67d8d5527239b3fac01583"
        },
        "permalink": "/r/movies/comments/1hm1kod/sherlock_holmes_at_15_the_story_behind_guy/"
    },
    {
        "id": "1hltzum",
        "author": "No-Zookeepergame5954",
        "title": "Movies with an opening scene that is vastly superior to the rest of the film?",
        "content": "To me, what comes to mind is La La Land.\n\nDon't get me wrong, I think it is a very good movie. But by far, the best scene (in my opinion) is the opener of \"Another Day of Sun.\" The singers and dancers are stronger than Emma Stone and Ryan Gosling and the camerawork is simply on a whole other level than the rest of the film.\n\nWhat other films fit this criteria of having a decline (slight or massive) after the opening scene?",
        "upvotes": 971,
        "comments": 1436,
        "media": null,
        "permalink": "/r/movies/comments/1hltzum/movies_with_an_opening_scene_that_is_vastly/"
    },
    {
        "id": "1hlyk1b",
        "author": "Puzzled-Tap8042",
        "title": "‘The Peanut Butter Falcon’ Writers Directors Tyler Nilson and Michael Schwartz are Currently Developing a New Take on Treasure Island for Disney.\n",
        "content": "",
        "upvotes": 283,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rX39z9zaOi4COzgrPfmforrQ9Wc5oIeoy8hlyG3cgXQ.jpg?auto=webp&amp;s=13d9708149644806551725bb4e57d02bfe333545"
        },
        "permalink": "/r/movies/comments/1hlyk1b/the_peanut_butter_falcon_writers_directors_tyler/"
    },
    {
        "id": "1hm21t7",
        "author": "MollyMoviola",
        "title": "Mad Max Beyond Thunderdome is sheer insanity. Tina Turner rarely acted but when she showed up, you noticed.",
        "content": "It is unfortunate Tina Turner didn't act more because she was genuinely good in movies. I'm still bitter she said no to The Color Purple though I understand why, because she said she already lived through it. \n\nMad Max Beyond Thunderdome is generally seen as the weakest Mad Max movie of the series but I happen to love it, just not as much as Road Warrior and Furiosa. \n\nI liked the arc of Max ending up in Aunty Entity's territory and being forced to fight against another bad guy and becoming kind of a Guardian to a group of lost children who live under the hope of a desired, fantasy land. \n\nThe train sequence is incredible. Tina Turner is spectacular as Auntie Entity: strong, fearsome, bold. I wish we got to see Auntie fight Max in the movie, we rarely see her do much, but when she gets into action, you realize how powerful she is, like when she jumps from her bike into the moving train. \n\nMel Gibson was great as usual as Max. He's a bit more tolerant than usual. The kids didn't bother me because they weren't trying to be cute and cloying, they're more like the kids from the Lord of the Flies (without the turning homicidal part). Helen Buday is particularly adequate as Savannah Nix, the older kid who rebels against Max.",
        "upvotes": 115,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1hm21t7/mad_max_beyond_thunderdome_is_sheer_insanity_tina/"
    },
    {
        "id": "1hluoh6",
        "author": "mattybgcg",
        "title": "Aerosmith showing up at the end of Polar Express is highly jarring",
        "content": "We've watched this a handful of times now with the 7yo, and this movie has gotten better with multiple viewing. I haven't seen the end more than once or twice due to sleep, and every time I do and Aerosmith shows up, it's from way out of left field. I know the animation turns a lot of people off and it's one of the things I've learned to accept, but Aerosmith really takes me out of it. ",
        "upvotes": 536,
        "comments": 195,
        "media": null,
        "permalink": "/r/movies/comments/1hluoh6/aerosmith_showing_up_at_the_end_of_polar_express/"
    },
    {
        "id": "1hlf0g2",
        "author": "Amaruq93",
        "title": "25 years ago, \"Galaxy Quest\" (a One-of-a-Kind Sci Fi comedy), captured the hearts of Star Trek fans everywhere",
        "content": "",
        "upvotes": 7025,
        "comments": 483,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4XqL8g8wUAl0kzgeuew3NBodGkq09e9LC9FKLuY65Ng.jpg?auto=webp&amp;s=1e0b6fdeddf27ce60af174a6cc9cbd8359a288e7"
        },
        "permalink": "/r/movies/comments/1hlf0g2/25_years_ago_galaxy_quest_a_oneofakind_sci_fi/"
    },
    {
        "id": "1hlsi27",
        "author": "LiteraryBoner",
        "title": "Official Discussion - A Complete Unknown [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/vNt33aq3Cw3i)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/vNt33aq3Cw3i)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nIn 1961, unknown 19-year-old Bob Dylan arrives in New York City with his guitar. He forges relationships with music icons of Greenwich Village on his meteoric rise, culminating in a groundbreaking performance that reverberates worldwide.\n\n\n**Director:**\n\nJames Mangold\n\n**Writers:**\n\nJames Mangold, Jay Cocks, Elijah Wald\n\n**Cast:**\n\n* Timothee Chalamet as Bob Dylan\n* Edward Norton as Pete Seeger\n* Elle Fanning as Sylvie Russo\n* Monica Barbaro as Joan Baez\n* Joe Tippett as Dave Van Ronk \n* Eriko Hatsune as Toshi Seeger\n* Scoot McNairy as Woodie Guthrie\n\n**Rotten Tomatoes:** [78%](https://www.rottentomatoes.com/m/a_complete_unknown)\n\n**Metacritic:** [70](https://www.metacritic.com/movie/a-complete-unknown/)\n\n**VOD:** Theaters",
        "upvotes": 438,
        "comments": 173,
        "media": null,
        "permalink": "/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/"
    },
    {
        "id": "1hlow2x",
        "author": "Open-Platform9637",
        "title": "Is there a dystopian movie about if it dosent stop snowing",
        "content": "Imagine everyday and every night it continuesly snows in this city, causing a natural disaster, apocalypse and catastrophe. The entire infrastructure would collapse, buildings would rumble under all the weight of the snow. Power failure, Electricity and water shortages. Moral sinking. People fighting over food etc. The government trying to find solutions. I thought of this idea because we want to go to Bosnia for the holiday, where it’s been snowing for the past 3 days, so it’s going to be hard driving there. There’s also been a power out today. Hopefully tap water will stay and power will probably come back tomorrow. That made me think what if it just dosent stop snowing, how would civilisation survive. I would love see my imagined scenario visualized to watch a movie, if there isn’t one there definelty should be one.",
        "upvotes": 873,
        "comments": 514,
        "media": null,
        "permalink": "/r/movies/comments/1hlow2x/is_there_a_dystopian_movie_about_if_it_dosent/"
    },
    {
        "id": "1hllvi2",
        "author": "Amaruq93",
        "title": "How \"the Grinch\" stole Hollywood | The crazy story behind Ron Howard's 2000 adaptation",
        "content": "",
        "upvotes": 1214,
        "comments": 229,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GMaQTDmKwoR1KbJC4mI0n8y4siuf0jFr9N1BEUc3FvE.jpg?auto=webp&amp;s=283e81ebcb3ea8a53126257939b33da359b887ee"
        },
        "permalink": "/r/movies/comments/1hllvi2/how_the_grinch_stole_hollywood_the_crazy_story/"
    },
    {
        "id": "1hlxk1v",
        "author": "MollyMoviola",
        "title": "A sad scene from a Disney picture, \"The Rescuers\": Penny &amp; Rufus",
        "content": "",
        "upvotes": 99,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n5qVY35ZtlsHgw6hLGNPq71dwuiZXd6-CxdpnnLmc8Q.jpg?auto=webp&amp;s=fe1f94eda2daf68f61da00d975e5fdfe618716d4"
        },
        "permalink": "/r/movies/comments/1hlxk1v/a_sad_scene_from_a_disney_picture_the_rescuers/"
    },
    {
        "id": "1hlznz9",
        "author": "LoneWolfIndia",
        "title": "The Abyss- Close Encounters in the Deep",
        "content": "https://preview.redd.it/0ze8spwxgz8e1.png?width=184&amp;format=png&amp;auto=webp&amp;s=9d24f5a5c6af276c8789d3a25c7d3592d5d58568\n\nThis remains among my favorite James Cameron movies, right up there with Aliens and Terminator 2, basically ET meets Close Encounters Of 3rd Kind under the sea.\n\nThe movie starts off with an American submarine USS Nebraska, sinking in the Cayman trough, after it has an encounter with a mysterious moving object. In order to counter the Soviets, who are approaching there, the US Govt, arranges a **SEAL** team, which would use an experimental, underwater oil rig as a base for their operations.\n\nhttps://preview.redd.it/ltaqjolchz8e1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=388678361db5426bd6735f4bff52ee439adf9d9b\n\nOne of the team members is **Dr.Lindsey Brigman( Mary Elizabeth Mastrantonio),** who designed that underwater rig, while in typical Hollywood style, her ex husband **Virgil Brigman aka Bud( Ed Harris)**, is now a blue collar oil rig worker on the same platform. The leader of the team **Lt.Coffey( Michael Biehn)** is a grumpy paranoid soul.\n\nThe rig has a bunch of workers, that includes  **Catfish De Vries(Leo Burmester), Alan Hippy( Todd Graff), Lisa** ***“One Night”*** **Standing(Kimberley Scott)**.  As the team begins to search for the missing sub along with the rig workers, there is a whole lot that happens, including a nasty storm, that nearly ends up wrecking the underwater rig. And that is when the team has the encounter with the alien, that keeps changing shape. However Coffey, now decides to nuke the aliens, in the trench where he believes they come from.\n\nhttps://preview.redd.it/jgyi7d68kz8e1.png?width=1296&amp;format=png&amp;auto=webp&amp;s=5fa7ac22e012b9e95e25339a3154f2703531c88a\n\n\n\nThe movie has some of the best special effects ever, especially the alien encounter for the first time, and the morphing technique used.  Also Lindsey's near encounter with an alien.  Of course the last scene where the entire city rises from underwater,  is what you go to the theaters for, recall seeing it on big screen, and was absolutely stunning.\n\nThe scene where the rig gets flooded, is brilliantly shot, superb editing. As also the scene where Bud descends into the Abyss.\n\nThe human emotions part is the strong factor of this movie, especially the strained relationship between Bud and Lindsey, their ego clashes, and reunion is well shot. It helps that both Ed Harris and Mary Elizabeth Mastrantonio are both good actors. Though would not rate this among one of Harris best performances, he still lends the much needed gravitas, while Ms.Mastrantonio is equally good as the feisty, yet vulnerable Lindsey.\n\nhttps://preview.redd.it/zd1kk7sfkz8e1.png?width=566&amp;format=png&amp;auto=webp&amp;s=92acf5c02dc664b5dc73e0363280eb51101e29bb\n\nMichael Biehn, who had earlier appeared in Terminator and Aliens, is suitably nasty as Coffey, making him a strong antagonist, conveying the hate and paranoid nature really well.\n\nOf course being Cameron being Cameron, he does stretch that ending by a good 15-20 minutes, till you start looking at your watch. It's only the ending shot that makes up for the overlong climax.\n\nI personally would rate this among Cameron's best movies, liked it more than more Titanic or Avatar. Notwithstanding  a dragged out climax, it's worth a watch for it's brilliant special effects and some great performances by Ed Harris, Mastrantonio and Biehn.",
        "upvotes": 38,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1hlznz9/the_abyss_close_encounters_in_the_deep/"
    },
    {
        "id": "1hlrcnz",
        "author": "AntawnSL",
        "title": "Hundreds of Beavers: the most original movie experience of the year",
        "content": "It was a slow start, and a bit of a wilder ride than expected, but it held my attention for the whole 108min runtime (with ads on prime) as a mostly silent film. A major accomplishment in the year of our lord 2024. A couple laugh out loud moments. A couple big ideas that deserve a little more consideration. 100% would recommend this weird, goofy movie.",
        "upvotes": 265,
        "comments": 65,
        "media": null,
        "permalink": "/r/movies/comments/1hlrcnz/hundreds_of_beavers_the_most_original_movie/"
    },
    {
        "id": "1hm3lj6",
        "author": "destructomofoyo",
        "title": "If you liked taken or John wick .. I implore you to watch 'the man from nowhere'",
        "content": "I honestly am not too big a fan of movies like John wick but man when they get it right ... \n\nThe movie is about a pawn shop owner who is an outcast type... Making a friendship with a little girl  who is neglected by her mother .. the mother gets in deep with some bad people and they kidnap the little girl... Pawn shop owner to the rescue... This synopsis does not do the film justice tho as for an action film it definitely made me feel alot ... Worth a watch",
        "upvotes": 17,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1hm3lj6/if_you_liked_taken_or_john_wick_i_implore_you_to/"
    },
    {
        "id": "1hlhb1v",
        "author": "JannTosh50",
        "title": "When Goldfinger Essentially Rebooted the James Bond Franchise",
        "content": "",
        "upvotes": 997,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/v9zkf7fp-9004tc8sQX9keOBs8JhtPlnfg1i5BRYCKU.jpg?auto=webp&amp;s=e6e5ad6d3d066d8fa3e7c531bdc2b0feca668ed1"
        },
        "permalink": "/r/movies/comments/1hlhb1v/when_goldfinger_essentially_rebooted_the_james/"
    },
    {
        "id": "1hlg77m",
        "author": "SweetTeaRex92",
        "title": "Lines that live rent free in your head?",
        "content": "*\"Check it out. Dustin Hoffman, 'Rain Man,' look retarded, act retarded, not retarded. Counted toothpicks, cheated cards. Autistic, sho'. Not retarded. You know Tom Hanks, 'Forrest Gump.' Slow, yes. Retarded, maybe. Braces on his legs. But he charmed the pants off Nixon and he won a ping-pong competition. That ain't retarded. He was a goddamn war hero. You know any retarded war heroes? You went full retard, man. Never go full retard. You don't buy that? Ask Sean Penn, 2001, \"I Am Sam.\" Remember? Went full retard, went home empty-handed.\"*",
        "upvotes": 1129,
        "comments": 1437,
        "media": null,
        "permalink": "/r/movies/comments/1hlg77m/lines_that_live_rent_free_in_your_head/"
    },
    {
        "id": "1hlsi4b",
        "author": "LiteraryBoner",
        "title": "Official Discussion - The Order [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/KQEnIFL5mSTl)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/KQEnIFL5mSTl)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nA series of bank robberies and car heists frightened communities in the Pacific Northwest. A lone FBI agent believes that the crimes were not the work of financially motivated criminals, but rather a group of dangerous domestic terrorists.\n\n**Director:**\n\nJustin Kurzel\n\n**Writers:**\n\nZach Baylin, Gary Gerhardt, Kevin Flynn\n\n**Cast:**\n\n* Jude Law as Terry Husk\n* Nicholas Hoult as Bob Mathews\n* Tye Sheridan as Jamie Bowen\n* Marc Maron as Alan Berg\n* George Tchortov as Gary Yarbrough\n\n**Rotten Tomatoes:** [90%](https://www.rottentomatoes.com/m/the_order_2024)\n\n**Metacritic:** [76](https://www.metacritic.com/movie/the-order-2024/)\n\n**VOD:** VOD",
        "upvotes": 104,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/"
    },
    {
        "id": "1hl29op",
        "author": "MarvelsGrantMan136",
        "title": "Alec Baldwin Manslaughter Case Is Over, as ‘Rust’ Prosecutor Drops Appeal",
        "content": "",
        "upvotes": 14983,
        "comments": 1720,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/96tYviSJwfPyEriLFcKOffr_Km6PjzaMbfJKTUBdJXs.jpg?auto=webp&amp;s=41f4d703bf826fcbae3e5bfd13129ec7bd30d8a3"
        },
        "permalink": "/r/movies/comments/1hl29op/alec_baldwin_manslaughter_case_is_over_as_rust/"
    },
    {
        "id": "1hm3r5b",
        "author": "Extreme_Homework7936",
        "title": "Richard Curtis on Crafting Holiday Magic with \"That Christmas\"",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sbjFkmyzVsWSRGDqzPiuJRaBumLz435g7ZcHFIck7nM.jpg?auto=webp&amp;s=bfaae336dae35c09423336dc6e6fd8394592466a"
        },
        "permalink": "/r/movies/comments/1hm3r5b/richard_curtis_on_crafting_holiday_magic_with/"
    },
    {
        "id": "1hlih4o",
        "author": "Strange_Depth_3247",
        "title": "The Beauty of It’s a Wonderful Life",
        "content": "Detailing the circumstances that led to this miracle movie and why it continues to endure. \n“And old George, standing in that same living room as he had an hour ago wanting to take his own life, is overjoyed. But not a thing has changed in George’s life, he is not loved anymore than when he wished to die. He simply knows, now, how much he is loved.\nAnd if you can have sympathy and forgive old George for ever letting himself feel down, do the same for yourself. This world would not be the same without you in it. Take the time to enjoy it, and to let those you love your world would not be the same without them in it.”\nI’d love to hear what this movie means to you. ",
        "upvotes": 433,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-F4kjIqucatcLnY-Kd8pR8r1GVNSw9YPhKm5GGjwntA.jpg?auto=webp&amp;s=5fe3a3b2bb344152c7edae8af77b947d18a38955"
        },
        "permalink": "/r/movies/comments/1hlih4o/the_beauty_of_its_a_wonderful_life/"
    },
    {
        "id": "1hlo6ye",
        "author": "Evil_Spike",
        "title": "Revival House is Australia's only cinema dedicated to exclusively showing films on film",
        "content": "",
        "upvotes": 168,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MVVEDv6PViDr2IC1zJiuV27ckDeMGDUG-IaWs9afOw8.jpg?auto=webp&amp;s=01df853d2999fb27f72585e557d12d5fca67f81a"
        },
        "permalink": "/r/movies/comments/1hlo6ye/revival_house_is_australias_only_cinema_dedicated/"
    },
    {
        "id": "1hkytk8",
        "author": "MarvelsGrantMan136",
        "title": "Christopher Nolan’s Next Movie is an Adaptation of Homer’s 'The Odyssey'",
        "content": "",
        "upvotes": 27886,
        "comments": 2890,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aII8wcddxsfzksSiagxGj6JKRFQA8yQVH28t-bHWmsE.jpg?auto=webp&amp;s=01b2449f0602ec09416d4e83589cbd5390455e07"
        },
        "permalink": "/r/movies/comments/1hkytk8/christopher_nolans_next_movie_is_an_adaptation_of/"
    },
    {
        "id": "1hm463x",
        "author": "Seraphenigma",
        "title": "Happy Gilmore 2 (2025)",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l-CaD-hKo8SMtUhd8Wy9QqY1ewJgQwhNCk3kUJSdzhw.jpg?auto=webp&amp;s=8e12d13a3ad661a23494307fb540a3b703ffbb01"
        },
        "permalink": "/r/movies/comments/1hm463x/happy_gilmore_2_2025/"
    },
    {
        "id": "1hm03fl",
        "author": "remmuchan",
        "title": "The Last Dance",
        "content": "I have been wanting to see a really good movie for weeks now and I had run out because I watched all the ones I'm interested in. I went to the cinema not knowing what to expect until I found \"The Last Dance\", a Hong Kong movie that had a very interesting plot and English subtitles. \n\nNever did I think I'd end up laughing, crying, sobbing, laughing again, grieving, feeling happy, feeling sad, then happy again and it goes on...all in the span of 2 hours.  \n\nThis movie is brilliant. It has a message and that message is strong and meaningful, unlike a lot of movies these days. People around me were also crying and we all left the cinema sniffling. \n\nHighly recommend this movie. It is full of lessons about life and death and everything in between. Absolutely beautiful. \n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1hm03fl/the_last_dance/"
    },
    {
        "id": "1hlhnws",
        "author": "tangledapart",
        "title": "The Way of the Gun is the grandfather to so many projects since.",
        "content": "From not so likeable characters you do in fact like. A labyrinth of a plot. The unique percussive score goes for broke. The violence is surprising. This film would've had major legs as a miniseries. It created a new tone for noir. And since then, I don't think one film has come close to matching this blend of genres. A tin of TV shows have tried their hand. And some are quite brilliant (Better Call Saul, Poker Face, Ozark). I promise you if you seek this flick out, you will thank me. And if you don't like Sarah Silverman, the start of this movie is just for you.",
        "upvotes": 241,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1hlhnws/the_way_of_the_gun_is_the_grandfather_to_so_many/"
    },
    {
        "id": "1hl4rde",
        "author": "jdcmopwjdmw",
        "title": "Why aren’t we talking about The Green Knight more?",
        "content": "I just rewatched The Green Knight at a screening, and it's absolutely astounding about how absolutely gorgeous this movie is. Every single frame looks like it belongs in a museum - from the opening shot, the blocking, compositions, lighting, mind-blowingly masterful. The cryptic, unexplored elements of the universe (the giants!). The Green Knight himself. \n\nBut seriously, why don’t more people bring this one up when they’re talking about A24’s best? It’s weird in all the best ways, super ambitious, and just unapologetically doing its own thing. I get that it’s not for everyone—it’s slow and kinda cryptic, but that’s what makes it so good, IMO. It feels like an old-school myth come to life, and it’s just dripping with atmosphere. Anyone else feel the same? Also, kind of a Christmas movie in a strange way.",
        "upvotes": 1868,
        "comments": 510,
        "media": null,
        "permalink": "/r/movies/comments/1hl4rde/why_arent_we_talking_about_the_green_knight_more/"
    },
    {
        "id": "1hl2iu2",
        "author": "Odd_Advance_6438",
        "title": "The whole opening montage of Watchmen is incredible, and I forgot how tragic it really is",
        "content": "One of my favorite opening scenes, and one of the best sequences Snyder has ever directed. Condenses a really in depth alternate history into a 5 minute sequence set to “the times they are a changin”\n\nWe see the rise and fall of costumed heroes, and after reading the “before Watchmen comics” the fate of the Minutemen seems even sadder. Dollar Bill is killed from his cape getting stuck in a revolving door. Silhouette is killed in a hate crime after revealing her homosexuality. Mothman is forcefully sent to a mental hospital after a mental breakdown. In the corner of the last supper scene, you can see Hooded Justice and Captain Metropolis confiding in one another, a little Easter egg to their own relationship that they always had to keep secret\n\nThere’s something incredibly disturbing to me seeing the images of these cheesy golden age parodies having such dark ends, which I think is really well done. The contrast of Dollar Bill’s bright blue and red starred suit being covered with blood in a very unceremonious situation",
        "upvotes": 1975,
        "comments": 215,
        "media": null,
        "permalink": "/r/movies/comments/1hl2iu2/the_whole_opening_montage_of_watchmen_is/"
    },
    {
        "id": "1hm0r65",
        "author": "Sea-Brief-3414",
        "title": "“ALIVE” v. “Society of the Snow”",
        "content": "I just watched SOTS for the second time. I did not love it the first time, but people I know raved about it so I gave it a second chance. \n\nEvery aspect of this film just reminds me of how great, ALIVE is. SOTS is a really good movie, but for me ALIVE is one of my favorite films ever. Maybe I was too young to watch it and that why it stuck with me, maybe I just love Ethan Hawke. \n\nAlive for me is the definitive version of this story. There is always room for more IMO, but ALIVE for me was a perfect movie (as far as depicting the horrors or a real life tragedy). \n\nI am also 36, so I feel like people who grew up with Alive may favor that, and younger viewers may favor SOTS. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1hm0r65/alive_v_society_of_the_snow/"
    },
    {
        "id": "1hm3nzl",
        "author": "Upset_Log_934",
        "title": "Au Revoir, Les Enfants",
        "content": "I absolute adore Au Revoir, Les Enfants ([ARLE] for the rest of this post) and have seen other films such as “The Martyrs” and “Night and Fog.” These are just a few of the french films I have pleasantly enjoyed. I unfortunately only know enough french to have conversation with a native french middle schooler, so I would need to be able to have subtitles. This is me asking for recommendations similar to ARLE. Or just foreign films you may enjoy. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1hm3nzl/au_revoir_les_enfants/"
    },
    {
        "id": "1hkx04d",
        "author": "DemiFiendRSA",
        "title": "‘Lord Of The Rings: The War Of The Rohirrim’ Heading Into Homes on December 27 After 14-Day Theatrical Window",
        "content": "",
        "upvotes": 3060,
        "comments": 330,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GrjtM2b4BkvkJ0R74xDGNam5x93ifp_5ySmnpd8UwOY.jpg?auto=webp&amp;s=2ef8a0fe3b7d0ab3a895b18e1c624d738743beec"
        },
        "permalink": "/r/movies/comments/1hkx04d/lord_of_the_rings_the_war_of_the_rohirrim_heading/"
    }
]