[
    {
        "id": "1l1e3h0",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 18,
        "comments": 4283,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l1e3h0/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1l43lyx",
        "author": "IcefoxX5",
        "title": "[OC] Real Madrid Castilla - 2024/25 player-by-player squad review",
        "content": "DISCLAIMER: My comments and ratings are based on my own observations and perception of the players' performances this season. I decided to only rate players with at least 500 minutes played. \"Future at Madrid\" and \"Next season\" are not what will officially happen, but just my personal predictions.\n\nhttps://preview.redd.it/0yfsv509z45f1.png?width=4070&amp;format=png&amp;auto=webp&amp;s=65cdb37620fe09761bed5fe8215414d4f7c1769b\n\n**#1 Diego Piñeiro - GK - 🇪🇸 - 2004**\n\n**8 matches - 720 minutes (21.1%) - 3 clean sheets**\n\nAfter a season without any appearances in 2023/24, Piñeiro hoped to see much more of the pitch this season. He got a few appearances throughout the season, but still ended up as the keeper with the least minutes played. He was not entirely convincing in the matches he played, but also showed some promise, for example on the last matchday against Alcoyano where he held the clean sheet with 6 saves. Next season, it's most likely he will leave, as according to transfermarkt, his contract is running out this summer.\n\n**My rating:** 5.5/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\n**#13 Fran González - GK - 🇪🇸 - 2005**\n\n**19 matches - 1720 minutes (50%) - 5 clean sheets**\n\nFran was the number one goalkeeper for Castilla this season, playing exactly 50% of minutes while Piñeiro and de Luis had to share the rest of the minutes. Internally in the club, he seems to be the highest rated keeper of the bunch, with people comparing him to Courtois due to his height and reach, but this season, he has not looked the part in most matches. In the first half of the season, he made various mistakes, smaller and bigger, that led to the team conceding goals. When he lost his spot to de Luis at the start of the year, suddenly the team's defense was much more stable and steady. Nonetheless, he also had good matches, reaching some balls that I doubt de Luis or Piñeiro could've reached, and he got to make his first team debut against Valencia, which sadly ended in a loss through no fault of his own. Next season, I assume he will keep on starting for Castilla.\n\n**My rating:** 5/10\n\n**Future at Madrid:** unlikely\n\n**Next season:** Castilla starter\n\n \n\n**#24 Mario de Luis - GK - 🇪🇸 - 2002**\n\n**11 matches - 990 minutes (28.9%) - 4 clean sheets**\n\nMario de Luis surprisingly stayed with Castilla for another year despite already having been banished by Raúl in 2023/24. I never understood Raúl's treatment of him,  he was simply outstanding in his first Castilla season, but then never really got close to the same opportunities again. This season, after warming the bench for the first half of the season again, suddenly he took the starting spot at the start of the year, and as I expected him to be, he was as great as always, making various impossible saves while also not making any costly mistakes. His performances led to him getting called up to and debuting for Spain U21s. Due to his age, he needs to leave the club this summer and finally fulfill his big potential somewhere else.\n\n**My rating:** 7.5/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\nhttps://preview.redd.it/2b40yvqaz45f1.png?width=4070&amp;format=png&amp;auto=webp&amp;s=814f233671122cc5ec6b514ca1b2fdf8904b0f9a\n\n**#2 Lorenzo Aguado - RB - 🇪🇸 - 2002**\n\n**23 matches - 1059 minutes (31%) - 1 goal - 1 assist**\n\nTo the surprise of many that follow the academy, Lorenzo was the right back that Ancelotti picked for the first team dynamic over other players like David Jiménez and Fortea, making 3 appearances for the first team. In Castilla however, he was just the backup for David - if Lorenzo started, it was usually because he was needed in the 3atb behind David. When he played, he was mostly solid, offering a good balance between attack and defense, not being outstanding in either direction however. His contract is running out this summer according to transfermarkt, and being one of the oldest players in the squad, he should leave in any case.\n\n**My rating:** 5/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\n**#3 David Cuenca - LB - 🇪🇸 - 2002**\n\n**5 matches - 292 minutes (8.5%)**\n\nDavid Cuenca, who surprisingly got to feature a lot for Castilla last season, started this season off sharing minutes with Youssef at left back. Sadly, a very persistent case of pubalgia that needed surgery saw him missing the entire rest of the season. Due to his age, he should leave Castilla this summer.\n\n**My rating:** \\--/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\n**#4 Edgar Pujol - CB - 🇩🇴 - 2004**\n\n**23 matches - 1548 minutes (44.3%) - 1 assist**\n\nAfter playing in the Olympics last summer for the Dominican Republic, Edgar started his 3rd Castilla season with some injury struggles. When Asencio joined the first team and the personnel situation at center back got dire, he claimed a starting spot in the back three, but he was not very convincing most of the time. He is still a good talent and is a great asset in build-up play, but his presence and awareness in defense leaves a lot to be desired, and I felt like the defense was more stable with Quique Ribes in his place. He could stay with Castilla for yet another season, but I think he would just block the progress of the great talents we have at center back, like Jacobo, Rivas, Joan, Diego Aguado, Valdepeñas or Laimini Fati.\n\n**My rating:** 5/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\n**#5 Raúl Asencio - CB - 🇪🇸 - 2003**\n\n**11 matches - 990 minutes (28.9%)**\n\nNow, this will be a very interesting bit of text to write, because no matter what I write here, it will look very confusing and surreal for the people who have only watched him for the first team so far. Asencio's season is an absurd and perfect example of what are the most important qualities of an academy prospect, even more than talent or physical disposition: seizing opportunities, playing with natural confidence, and plain and simply, some luck and mere coincidences. The amount of players that had to get injured to catapult Asencio to where he is now is of an almost comedic length, from Marvel, Carrillo and Jacobo last season to Alaba, Militão, Vallejo, Tchouaméni, Jacobo and Joan this season, but he seized the opportunity like I've barely seen it before, flipped a switch and completely locked in from the first moment he stepped on the pitch for the first team. He didn't convince me whatsoever in his time with Castilla, and at the start of the season he showed his usual, mediocre level. Stepping out of the line too aggressively, showing lack of tactical discipline and positioning himself awkwardly on many of the goals he conceded. Purely on his performances for Castilla, I can't rate him any higher than a 4 out of 10, but generally speaking, for what you want to see in a Castilla player's development, this season could literally not have gone any better with him seeing starter-level minutes for the first team. Next season, he will surely play with the first team again, unless his court case develops in an unfavourable manner.\n\n**My rating:** 4/10 (Castilla), 10/10 (overall)\n\n**Future at Madrid:** yes (court case?)\n\n \n\n**Next season:** Real Madrid first team\n\n**#14 Jacobo Ramón - CB - 🇪🇸 - 2005**\n\n**15 matches - 1305 minutes (38.2%) - 4 goals**\n\nJacobo's season started just like last season went for him, persistent muscular injuries keeping him out for months. When he finally returned to the team, he immediately showed an amount of leadership and dominance in defense that the team had direly missed before. Castilla's defense was more stable from that moment on, and while his performance in defence was already more than sufficient, Jacobo scored 4 goals for Castilla as a bonus, being a consistent source of danger from set-pieces. He got to play 5 matches for the first team, and even managed to score his first goal against Mallorca, though his general performance was relatively shaky and lacking composure. He really was the anti-Asencio this season, but if Xavi and Arbeloa can somehow instill more conficence into him, he could start translating his performances to the first team as well. Next season, he will definitely start and lead Castilla's defense.\n\n**My rating:** 8/10\n\n**Future at Madrid:** maybe\n\n**Next season:** Castilla starter\n\n \n\n**#15 Quique Ribes - CB - 🇪🇸 - 2004**\n\n**29 matches - 2059 minutes (60.2%) - 2 goals**\n\nAfter his surprising rise from Real Madrid C player to Castilla starter last season, Raúl trusted Quique once more and played him a lot in the earlier parts of the season. When Edgar Pujol returned from injury, he spent more and more time on the bench, still getting decent minutes here and there though. He was mostly solid, but didn't really stand out positively in the way Rivas or Jacobo did in many matches, and was one of the faces of the slump the entire squad and also the defense went through in the early part of the season. He should move on to make space for the huge center back talents that are coming up next season.\n\n**My rating:** 6/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\n**#17 David Ruiz - LB - 🇪🇸 - 2003**\n\n**18 matches - 714 minutes (20.9%)**\n\nDavid Ruiz is one of quite a few players that would not even have gotten promoted to Castilla if it wasn't for the extraordinarily dire situation of the squad in the summer - he was good for Real Madrid C the season before, although not spectacular. He was a sub option for Youssef or on the left wing throughout most of the season, and couldn't leave his mark on the league in his minutes this season, not being more reliable in defense than Youssef while also being much less dynamic and technical than him in attack. He should most likely leave the club this summer.\n\n**My rating:** 3.5/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\n**#22 - David Jiménez - RB - 🇪🇸 - 2004**\n\n**37 matches - 3103 minutes (90.7%) - 3 goals - 5 assists**\n\nDavid had already earned a promotion to Castilla before this season, after his simply spectacular season with Juvenil A (5 goals, 17 assists) in 2022/23. He had to take the longer path and spend a season with Real Madrid C, where he also excelled and finally got his deserved spot in the Castilla squad. He was the nailed-on starter at right (wing) back from the get-go, and his extraordinary technique was visible throughout the entire season. He consistently put in great crosses, made 5 assists and could've had even more, while also scoring 3 goals, including a beautiful free kick. However, he is neither strong, tall, nor fast, so he is always a bit of a liability in defense, and this will probably get exacerbated in higher levels even more. Nonetheless, for what Castilla needed from their right back this season especially with the lack of other creative outlets like Arribas or Nico the seasons before, he did extremely well. He will probably compete with Fortea for his spot next season.\n\n**My rating:** 8/10\n\n**Future at Madrid:** maybe\n\n**Next season:** Castilla starter\n\n \n\n**#23 - Youssef Enríquez - LB - 🇲🇦 - 2005**\n\n**35 matches - 2741 minutes (80.1%) - 1 goal - 3 assists**\n\nYoussef earned promotion to Castilla through his great season with Juvenil A with 2 goals and 12 assists last season. At the start of the season, he struggled to pick up the same rhythm and was found out in defense a multitude of times, while failing to connect with his crosses up front when his counterpart David Jiménez was already putting in dimes for our attackers. But as the season went on he got much more comfortable and confident, as the rest of the defense improved he also found his footing, and he found his usual, high level again with his play in attack. There is a lot more potential in him that is waiting to be unlocked in the next seasons, and if he doesn't stay with Castilla, he might make a move this summer already, with Alavés apparently being highly interested.\n\n**My rating:** 6.5/10\n\n**Future at Madrid:** maybe\n\n**Next season:** transfer/Castilla starter\n\n \n\n**#29 Mario Rivas - CB - 🇪🇸 - 2007**\n\n**30 matches - 2658 minutes (77.7%) - 1 assist**\n\nMario Rivas is one of Raúl's chosen ones, one of the players he just picks out of the younger ranks one day, and sticks with him, like Mario Martín and Álvaro Rodríguez before him. Despite his young age, he was the mainstay in the center of Castilla's defense, mainly obviously because injuries in the first team prevented Asencio and Jacobo from playing more minutes with Castilla - but despite his young age, he was absolutely solid with some genuinely great performances in the second half of that season. Although he struggles with the physicality of Primera Federación and could be more daring in his defending sometimes, he still plays with nice composure and conficence for his age. Next season, he will surely be part of Castilla again, although he will have much fiercer competition at center back than before.\n\n**My rating:** 7.5/10\n\n**Future at Madrid:** maybe\n\n**Next season:** Castilla squad\n\n \n\n**#37 Víctor Valdepeñas - LB/CB - 🇪🇸 - 2006**\n\n**14 matches - 439 minutes (12.8%) - 1 goal**\n\n\"Valde\" was a regular sub option for Raúl in the final part of the season, both at LCB and LB. He was quite convincing in the minutes he got, offering a good balance, confident on the ball with some drive in attack, scoring his first Castilla goal, while also being solid defensively since he is naturally a center back. Normally, he would be a safe bet to get promoted to Castilla next season, but his contract is apparently running out this summer, and with teams like Arsenal and Dortmund apparently interested, he could also be leaving the club.\n\n**My rating:** \\--/10\n\n**Future at Madrid:** maybe\n\n**Next season:** transfer/Castilla squad\n\n \n\n**#38 Diego Aguado - LB/CB - 🇪🇸 - 2006**\n\n**2 matches - 24 minutes (0.7%)**\n\nJuvenil A's defensive leader Diego Aguado got subbed on as a left back in two matches for Castilla this season. In the end, he played more minutes for the first team (90) than for Castilla this season, but his performances for Juvenil A were exceptional, and I'm very excited to see what Arbeloa does with him in Castilla next season, and if he sees him as a left back or center back.\n\n**My rating:** \\-/10\n\n**Future at Madrid:** maybe\n\n**Next season:** Castilla squad\n\n \n\n**#41 Manu Serrano - LB/CB - 🇪🇸 - 2004**\n\n**1 matches - 5 minutes (0.1%)**\n\nManu Serrano got rewarded for his performances for Real Madrid C with a 5 minute cameo on the final matchday. I don't see him fit to be promoted to Castilla, so if he doesn't want to play for Real Madrid C for yet another season, he'd need to leave the club.\n\n**My rating:** \\-/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\nhttps://preview.redd.it/zunxp8fcz45f1.png?width=2048&amp;format=png&amp;auto=webp&amp;s=0dda03ac3a3d5dec1e6426e48e2f30868ac21a54\n\n**#6 José María Andrés 'Chema' - CDM - 🇪🇸 - 2005**\n\n**32 matches - 2737 minutes (80%) - 1 red card**\n\nChema was a strong presence in Castilla's midfield all throughout the season, his impressive physique and qualities on the ball being very important to the balance of the team. However, I think his season was pretty hit or miss - he caused the team to concede goals multiple times with errors in the buildup play in the first half of the season, and due to his slow pace, he consistently arrives late in challenges, leading to him getting caught out in devensive transitions and getting 14 yellow cards and one red card throughout the season. He needs to be more aware of his surroundings, both in situations where the opponent presses high and where the team is in danger of getting attacked on the counter. Nonetheless, it was a overall a decent first season for Castilla for him, getting rewarded with some short appearances for the first team, and he will play an important part of Castilla next season again.\n\n**My rating:** 6/10\n\n**Future at Madrid:** maybe\n\n**Next season:** Castilla starter\n\n \n\n**#8 Manuel Ángel - CM - 🇪🇸 - 2004**\n\n**17 match - 1152 minutes (33.7%) - 2 assists - 1 red card**\n\nCastilla's captain had a rather disappointing season, riddled with smaller and recurring injuries from the very start. Whenever he played it was obvious he is the most technically gifted midfielder Castilla has, but he struggled with the physicality and pace of the division on a variety of occasions, struggling to find rhythm after his injuries. I still think Raúl doesn't utilise him in the best way, but Arbeloa will definitely change that as it's well known he's one of his absolutely favourite players. He will be Castilla's captain and Arbeloa's right hand man on the pitch next season, and I hope he develops well so maybe Xabi sees him as a solution in the first team's midfield too after Modrić's departure.\n\n**My rating:** 5.5/10\n\n**Future at Madrid:** maybe\n\n**Next season:** Castilla starter + captain\n\n \n\n**#10 César Palacios - 🇪🇸 - CAM - 2004**\n\n**4 matches - 92 minutes (2.7%)**\n\nAfter his tragic ACL injury in the first team summer pre-season, he was sidelined for almost the entire season. He returned to the matchday squads a couple of weeks ago, and has made 4 appearances off the bench, instantly showing glimpses of his quality again, especially on the last matchday where he could or should have had a goal and an assist. Next season, he will most likely be a key part of the team, depending on how he recovers from his injury.\n\n**My rating:** \\-/10\n\n**Future at Madrid:** unlikely\n\n**Next season:** Castilla starter\n\n \n\n**#16 Antonio David - CDM - 🇪🇸 - 2005**\n\n**27 matches - 1079 minutes (31.5%)**\n\nAntonio David, another Real Madrid C regular from last season, surprisingly made the Castilla squad through lack of other options in the summer. He was Chema's backup in defensive midfield, and started whenever he was injured, suspended or needed some rest. He doesn't have the physical presence or the quality on the ball of Chema, but he was mostly solid when called upon, never making any grave errors. Age-wise, he could continue with Castilla for another season, but I don't think he has enough quality or talent for us to build on, especially with other, promising defensive midfielders coming up, like Cristian David, Jorge Cestero or Izan Regueira.\n\n**My rating:** 5/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer/Castilla backup\n\n \n\n**#20 Andrés Campos - CAM - 🇪🇸 - 2002**\n\n**17 matches - 617 minutes (18%) - 1 assist**\n\nPromoting a 2002-born player who had a decent, but not exceptional season for Real Madrid C to Castilla was the epitome of the disappointing squad planning at the start of the season. And even though many of the players exceeded expectations, Campos was not one of those. He was a regular attacking sub for Raúl, but didn't provide much danger or dynamism off the bench, provided no goals or assists, and even though he played over 600 minutes, I can't remember more than a handful of memorable plays he made this season. Next season, he should definitely leave, if not for his level, then definitely for his age.\n\n**My rating:** 3/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\n**#26 Hugo de Llanos - CAM (RW) - 🇪🇸 - 2005**\n\n**16 matches - 895 minutes (26.2%) - 2 goals**\n\nAfter his amazing 34G+A season with Juvenil A, he was supposed to be the highest quality addition to Castilla's attack wirh the lack of external signings. So, he got lots of minutes at the start of the season, but sadly, he was mostly a non-factor apart from a brace against dead-last Intercity. He was very timid and inefficient in the minutes he played, and Raúl quickly dropped him from the squad entirely, so he went down to Real Madrid C to help them stay up, successfully so. He will get another shot at Castilla with Arbeloa for sure next season.\n\n**My rating:** 3.5/10\n\n**Future at Madrid:** unlikely\n\n**Next season:** Castilla squad\n\n \n\n**#27 Pol Fortuny - CAM (RW) - 🇪🇸 - 2005**\n\n**25 matches - 1918 minutes (56.1%) - 1 goal, 8 assists**\n\nPol Fortuny had just returned from his unfortunate ACL injury at the end of last season, when he had an amazing U19s Euro, being one of the key players for Spain with 3 assists in 3 group stage matches and the winning goal in added time in the semi-final. The level he demonstrated made it impossible not to promote him to Castilla, even though he was officially registered with Real Madrid C. Even though he did struggle a bit with the physicality of senior football and was not really able to advance into the box and drive towards goal, he was the main creative outlet of the team, feeding passes to the more physical Gonzalo and Víctor with his elegant left foot. He ended the season with 8 assists, being the team's top assister. Next season, he will surely play an important role for Castilla again\n\n**My rating:** 7.5/10\n\n**Future at Madrid:** unlikely\n\n**Next season:** Castilla starter\n\n \n\n**#33 Cristian David - CDM - 🇪🇸🇨🇴 - 2005**\n\n**4 matches - 158 minutes (4.6%) - 1 assist**\n\nI expected Cristian David to have a bigger role with Castilla this season after being Arbeloa's captain last season in Juvenil A, but he was busy helping Real Madrid C barely scrape by in Segunda Federación. In the end, he started one match and was subbed on in 3 more, but I'm sure Arbeloa will bring him along with him to Castilla next season.\n\n**My rating:** \\-/10\n\n**Future at Madrid:** maybe\n\n**Next season:** Castilla squad\n\n \n\n**#39 Bruno Iglesias - CAM - 🇪🇸 - 2003**\n\n**1 match - 7 minutes (0.2%)**\n\nBruno's tragic story got a new chapter this season - to the surprise of everyone, he was called up once this season by Raúl against Alcoyano, and Raúl, the coach that basically banished him from Castilla, stopping the meteoric rise of the former supertalent, actually subbed him on for his Castilla comeback, more than two years later. But the nice, full-circle-moment story ends here, because after he stepped on the pitch, he played one pass, slipped and injured his shoulder, leading to him getting subbed off again and being sidelined a couple of weeks. This summer, as much as there's a small part of me that hopes he gets a final chance under Arbeloa, he will certainly leave the club as his contract is running out.\n\n**My rating:** \\-/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer\n\n \n\nhttps://preview.redd.it/033i6r2ez45f1.png?width=2048&amp;format=png&amp;auto=webp&amp;s=f42d8a3964b1f7d95fa82a9cc948252b2d176a27\n\n**#7 Gonzalo García - LW (ST) - 🇪🇸 - 2004**\n\n**36 matches - 3186 minutes (93.2%) - 25 goals - 4 assists**\n\nEven though he had disappointing season with Castilla in 2023/24, scoring just 5 goals, everyone that followed him the year before, where he scored 35 goals for Juvenil A, knew that Gonzalo was a goal-scoring machine waiting to be awakened. And that's exactly what Raúl managed to do, making Gonzalo the focal point of the attack. Unlike in past seasons, he didn't switch between positions throughout the season, but still his versatility saw him score from all sorts of situations, headers, penalties, tap-ins, shots from distance, or cutting inside from the left wing and scoring after a nice run. His vast skillset made him unstoppable for most defences in Primera Federación, and he ended up with 25 goals, which is a new record in Primera Federación and equals Mariano's record of goals in one Castilla season. He got well deserved minutes for the first team as well where he was just as convincing, scoring the winner against Leganés in Copa del Rey and providing an assist for Bellingham against Valencia. His goals made Castilla sail smoothly through a season with a huge amount of injuries, no signings, a shaky defense and a lack of quality and experience throughout the team. Clubs from all over Europe will be after him in summer, but maybe he could be a valuable part of the first team if we don't sign a striker like Budimir.\n\n**My rating:** 9.5/10\n\n**Future at Madrid:** maybe\n\n**Next season:** transfer/Castilla starter + first team minutes\n\n \n\n**#9 Víctor Muñoz - RW - 🇪🇸 - 2003**\n\n**34 matches - 2742 minutes (80.2%) - 11 goals, 7 assist**\n\nVíctor was always insanely quick, showing flashes of his talent here and there, but before this season, he was an average talent, if even that - having little to no impact off the bench for Castilla last season. This season however, he developed all aspects of his game, has a great eye for both the goal and his teammates, great crossing technique, good finishing (I know, I know, why didn't he show that against Barça...) and was a key part of Castilla's success this season. When Gonzalo went through a drought in early spring, he was the team's main source of danger, and his performance against Recreativo away, with 2 goals and 2 assists, one prettier than the other, was among the best if not the single best individual performances I've ever seen by a Castilla player. Raúl's fast, counter-attacking setup was perfect for him to shine, and Víctor got rewarded with well-deserved first team minutes at the end of the season, which I wouldn't have believed if you told me at the start of the season. I assume first and second division clubs will be after him, so it's to be seen if he stays at the club.\n\n**My rating:** 8.5/10\n\n**Future at Madrid:** maybe\n\n**Next season:** transfer/Castilla starter\n\n \n\n**​#11 Borja Alonso - RW - 🇪🇸 - 2004**\n\n**17 matches - 807 minutes (23.6%) - 4 assists**\n\nBorja got rewarded with promotion to Castilla after a good season with Real Madrid C. He started on the first two matchdays, then got a grave injury that kept him out from August to January. When he returned, Raúl mostly used him as an attacking sub with Víctor having the right wing spot locked down, and he showed some promise every now and then, putting in some lovely crosses and providing 4 assists in the second half of the season. He will probably play another season with Castilla, but it's not completely certain with a different coach in Arbeloa coming in.\n\n**My rating:** 5.5/10\n\n**Future at Madrid:** no\n\n**Next season:** Castilla squad/transfer\n\n \n\n**​#19 Loren Zúñiga - ST - 🇪🇸🇬🇶 - 2003**\n\n**27 matches - 1444 minutes (42.2%) - 5 goals - 2 assists - 1 red card**\n\nLoren Zúñiga was basically the team's only real number 9 this season, so he started the season off as a starter at the striker position. He didn't really succeed at his main task of scoring goals, so he was quickly dropped to the bench, then missed a few months with injury. When he returned, he was mostly a sub option, and after he got a really stupid double-yellow against Atlético B, I thought Raúl wouldn't bother with him anymore, but quite on the contrary, he finished the season with a good stretch of matches, scoring 3 and assisting 1 while always playing from the beginning. Due to his age, he could leave the club this summer, or maybe play another season at Castilla since there are not many other striker options at the club right now.\n\n**My rating:** 6/10\n\n**Future at Madrid:** no\n\n**Next season:** transfer/Castilla squad\n\n \n\n**​#21 Jeremy de León - RW - 🇵🇷 - 2004**\n\n**4 matches - 39 minutes (1.1%)**\n\nOur \"talisman\" in the 2024 UCL win does still not have any sporting relevance at the club after his first full season. He was nothing more than an emergency sub at the start of the season, injured his shoulder, came back, and then somehow severely injured his other shoulder, leading him to need surgery that kept him out for the remainder of the season. Let's see if he gives it another go next season, I assume he will be a backup for Castilla once he recovers fully.\n\n**My rating:** \\-/10\n\n**Future at Madrid:** no\n\n**Next season:** Castilla squad/transfer\n\n \n\n**​#32 Ángel Carvajal - ST - 🇪🇸 - 2004**\n\n**1 matches - 19 minutes (0.6%)**\n\n**My rating:** \\-/10\n\nRM C's Ángel Carvajal was brought on for the last 20 minutes on MD2 to rescue some points against Valencia. After that, he was called up with Castilla two more times, but didn't feature again. He could leave the club next season or spend another season with Real Madrid C.\n\n**Future at Madrid:** no\n\n**Next season:** transfer/Real Madrid C squad\n\n \n\n**#35 Jacobo Ortega - ST - 🇪🇸 - 2006**\n\n**1 match - 5 minutes (0.1%)**\n\nJacobo was subbed on in the dying minutes once due to lack of other options. Real Madrid C's main striker will probably play there for another season.\n\n**My rating:** \\-/10\n\n**Future at Madrid:** no\n\n**Next season:** Real Madrid C starter\n\n \n\n**#36 Dani Yáñez - RW - 🇪🇸 - 2006**\n\n**13 matches - 272 minutes (8%) - 1 goal**\n\nDani Yáñez was rewarded for his clutch performances with Juvenil A in the earlier part of the season both with a very short appearance for the first team as with some call-ups and minutes for Castilla, and eventually became a regular sub for Raúl. He managed to score his first Castilla goal, but he could not yet translate his performances from the youth levels to senior football yet. I think going back and forth between Castilla and Juvenil A really took some momentum and rhythm out of his season with the U19s too. Next season, I expect Arbeloa to take him along with him to Castilla.\n\n**My rating:** \\-/10\n\n**Future at Madrid:** maybe\n\n**Next season:** Castilla squad\n\n \n\n**​#40 Baba Diocou - RW - 🇸🇳 - 2005**\n\n**4 matches - 39 minutes (1.1%)**\n\nBaba got some short cameos throughout the season, very surprising to me since he is not even an important player for Real Madrid C. I can't remember him doing anything of note in the little time he spent on the pitch for Castilla. Next season, he might leave the club, or play another season with Real Madrid C.\n\n**My rating:** \\-/10\n\n**Future at Madrid:** no\n\n**Next season:** Real Madrid C squad\n\nhttps://preview.redd.it/q7083q3jz45f1.png?width=2048&amp;format=png&amp;auto=webp&amp;s=973461cc40b35a6f90a268c888b1966baddcce6c\n\n**Coach - Raúl González - 🇪🇸**\n\nPeople who follow my Castilla content know that I haven't always been fond of Raúl as a coach, that I had lots of things to criticise and couldn't understand various of the decisions he made throughout his 6 years of coaching Castilla, but this season, I said from the very first moment - if Castilla fail to hold the division, it will be through no fault of his, as he was left with a very imbalanced squad that quite apparently lacked quality and experience. Multiple important players like Nico, Álvaro, Obrador, Marvel, Carrillo, Vini Tobías left the team, and the club didn't make any signings to replace them. The squad was filled up with players from Juvenil A (de Llanos, Youssef, Fran González etc.), who had a pretty disappointing season and lack senior football experience, and players from Real Madrid C (Campos, Antonio David, David Jiménez etc.), who were just promoted from the 5th into the 4th division. As expected, the team struggled a lot in the first half of the season, consistently placing in the relegation spots, even dropping down to last place temporarily. The team was naive in defense, had no urgency and definition in attack, and at one point, I was certain the team would inevitably get relegated if the club made no winter signings. The club didn't make any winter signings, but instead, Raúl worked with what he had, set the team up to play simple and precise football on the counter, finally no weird positional experiments anymore, all of which made players like Gonzalo and Víctor literally explode in their performances while Castilla turned into a cold-blooded goalscoring machine, finishing the league with the highest amount of goals scored. The defense, while still being shaky and naive at times and making costly errors in tighter matches, also became more stable with the return of Jacobo Ramón, Raúls decision to put de Luis back between the goalposts, and, I know it sounds weird, but also the de facto-promotion of Asencio to the first team. They finished 6th, just outside the playoff spots, which was nothing short of a miraculous turnaround after fighting relegation throughout the entire first half of the season. The team only lost a single match in 2025. After all, with the conditions set by the club at the start of the season, this season was more than succesful for Raúl and his boys, and this season honestly might have been one of his best as a coach so far, turning the extremely dire situation around in this way has left me hugely impressed. As bad as the first half of the season was, the end was a more than conciliatory ending to his time as Castilla's coach, and I'm very excited to see where he goes next.\n\n**My rating:** 8/10\n\n**Future at Madrid:** unlikely\n\n**Next season:** ?",
        "upvotes": 47,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l43lyx/oc_real_madrid_castilla_202425_playerbyplayer/"
    },
    {
        "id": "1l51itu",
        "author": "Thunder0V",
        "title": "Don Florentino Perez",
        "content": "Xabi ☑️ \nTrent ☑️ \nHuijsen ☑️ \nCarreras ⏳\nMastantuono ⏳\nStiller ⏳\nBudimir ⏳",
        "upvotes": 214,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2euqlw2s0d5f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1l51itu/don_florentino_perez/"
    },
    {
        "id": "1l4usjl",
        "author": "Efficient-Growth-390",
        "title": "Mbappe becomes the player with the most goal contributions (49 goals + 31 assists) for France NT at just 26 years old.",
        "content": "",
        "upvotes": 464,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m4yfbvakob5f1.png?auto=webp&amp;s=0b8be99b2e91c7aa031d62e1210c113357a17c5d"
        },
        "permalink": "/r/realmadrid/comments/1l4usjl/mbappe_becomes_the_player_with_the_most_goal/"
    },
    {
        "id": "1l4op8v",
        "author": "MoreanSwordsman",
        "title": "Did they forget the \"R\".... again?",
        "content": "",
        "upvotes": 985,
        "comments": 91,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l4op8v/did_they_forget_the_r_again/"
    },
    {
        "id": "1l54arh",
        "author": "Miserable-Subject-87",
        "title": "Real Madrid's new home kit with the Club World Cup badge and the Intercontinental Cup winner badge in the official store.",
        "content": "",
        "upvotes": 96,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pmerywenmd5f1.jpeg?auto=webp&amp;s=491060bbf71398e34c1f5ff7d2321720c662cb1f"
        },
        "permalink": "/r/realmadrid/comments/1l54arh/real_madrids_new_home_kit_with_the_club_world_cup/"
    },
    {
        "id": "1l4nom8",
        "author": "Miserable-Subject-87",
        "title": "This is the new jersey for the 2025-26 season.",
        "content": "",
        "upvotes": 928,
        "comments": 50,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/uw9wfks4u95f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1l4nom8/this_is_the_new_jersey_for_the_202526_season/"
    },
    {
        "id": "1l4l71l",
        "author": "aprilhyped",
        "title": "Huijsen posted an IG story screenshot of him wishing Isco 'Happy Birthday' in 2017",
        "content": "",
        "upvotes": 968,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l4l71l/huijsen_posted_an_ig_story_screenshot_of_him/"
    },
    {
        "id": "1l4pzr1",
        "author": "DoriOli",
        "title": "Any others here fan of this kit ?",
        "content": "",
        "upvotes": 351,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9pr4zhdvka5f1.jpeg?auto=webp&amp;s=92a1f5a4d0ab446121a03ab3e3c683c71ee242d2"
        },
        "permalink": "/r/realmadrid/comments/1l4pzr1/any_others_here_fan_of_this_kit/"
    },
    {
        "id": "1l4vh39",
        "author": "Most-Attitude2430",
        "title": "Surely it's time for Mendy to go?",
        "content": "Obviously, I say this assuming we complete the Carreras signing. I'm grateful for what Mendy could give us up to this point but I think his time at Madrid has run its course. \n\nThis was one of his worst seasons considering he stuggled to hold his place through a combination of injuries (as usual) and Fran Garcia putting up a fight despite his lack of quality. Noone is shocked anymore when he gets injured and even when fit, the results not worth the spot he takes up. We need players on the left to link up better with Vini and Mbappe. \n\nMendy for all his defensive ability either couldn't stop any Yamal from smoking him time and time again or wasn't even available to try. We just need a more balanced left back for this team. Maybe it doesnt have to be a Marcelo type but a Coentrao type will do (I think Carreras actually reminds me a bit of him).\n\nIt doesnt make sense yet to ship off Fran Garcia. I would give him one more season with a coach that can maybe get more out of him but we've seen all that Mendy has to offer in my opinion. It's always possible that I'm wrong on that but I also think most Madrid Fans are too tired of getting half the promised product (mostly good defending, almost nothing in attack) especially on a team this talented and versatile.",
        "upvotes": 121,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l4vh39/surely_its_time_for_mendy_to_go/"
    },
    {
        "id": "1l4lscs",
        "author": "TimothyX7",
        "title": "Jude and Brahim in the new 25/26 home kit 👕",
        "content": "",
        "upvotes": 576,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l4lscs/jude_and_brahim_in_the_new_2526_home_kit/"
    },
    {
        "id": "1l53tx2",
        "author": "ManuMora98",
        "title": "[Basket] We qualify to the League Semifinal after beating Baskonia 103-112 in the 2nd match, in which we will face the winner of Unicaja-Barça (Unicaja tied the series today 1-1 after winning 59-81, final match on Unicaja's court) on a Best of 5 series (2 home, 2 away, 1 home)",
        "content": "",
        "upvotes": 38,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1bjk45q0jd5f1.jpeg?auto=webp&amp;s=729ed20a90c65381f97c053323bc1893f54ecbd4"
        },
        "permalink": "/r/realmadrid/comments/1l53tx2/basket_we_qualify_to_the_league_semifinal_after/"
    },
    {
        "id": "1l51405",
        "author": "Ghost-Ripper",
        "title": "The 3 Best.. Add „R“ and its complete… sets Bernabéu in fire…",
        "content": "",
        "upvotes": 44,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lub6hoceyc5f1.jpeg?auto=webp&amp;s=4ff42cf80a6c14dc300f5cb64886b99f5fe13f58"
        },
        "permalink": "/r/realmadrid/comments/1l51405/the_3_best_add_r_and_its_complete_sets_bernabéu/"
    },
    {
        "id": "1l4pszz",
        "author": "FlyingWaterMen",
        "title": "Curious: Which countries are you all from?",
        "content": "My friend and I were just chatting about how global Real Madrid's support really is. I mentioned that I've noticed a lot of new fans popping up in African countries lately, but it got me wondering about other countries outside of Spain.\n\nIf you're comfortable sharing, I'd love to know where you all support Madrid from! Let's see how far our community reaches.\n\nThanks a lot!",
        "upvotes": 180,
        "comments": 555,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l4pszz/curious_which_countries_are_you_all_from/"
    },
    {
        "id": "1l4w74n",
        "author": "IcefoxX5",
        "title": "[Silvia Tamaral/MARCA] Real Madrid expect Gonzalo and Víctor Muñoz to leave the club this summer - in exchange, Bruno Iglesias, Dani Yáñez and Hugo de Llanos will be promoted to Arbeloa's Castilla, Álvaro Leiva returns from loan, and the club will search for a striker on the transfer market",
        "content": "",
        "upvotes": 68,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FZclAmR23l6U9VxS7E6iJ7QmqUJHF5lZ8TBAhpkWW5U.jpg?auto=webp&amp;s=b1b9d46d569ff12cfc7f5941fe18d5020488245f"
        },
        "permalink": "/r/realmadrid/comments/1l4w74n/silvia_tamaralmarca_real_madrid_expect_gonzalo/"
    },
    {
        "id": "1l4pv8v",
        "author": "Sneijder4BallondOr",
        "title": "Luka Modrić scores nothing but bangers",
        "content": "",
        "upvotes": 145,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4vbze8nyia5f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1l4pv8v/luka_modrić_scores_nothing_but_bangers/"
    },
    {
        "id": "1l4lj73",
        "author": "EffectiveTie3144",
        "title": "Happy Birthday to Real Madrid club legend Fernando Carlos Redondo Neri 🇦🇷",
        "content": "",
        "upvotes": 360,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l4lj73/happy_birthday_to_real_madrid_club_legend/"
    },
    {
        "id": "1l4er03",
        "author": "amungus45",
        "title": "Marcelo cheers on his son and his team as Real Madrid U16 scores their fifth goal against Barcelona U16 in the Al Abtal International Cup final.",
        "content": "",
        "upvotes": 1078,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qr0nvrjl875f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1l4er03/marcelo_cheers_on_his_son_and_his_team_as_real/"
    },
    {
        "id": "1l51mxf",
        "author": "basedzone",
        "title": "What about Alvaro Carreras?",
        "content": "Hey everyone, what’s the latest update on the situation? \n\nAre we actually in a strong position to sign him, or is it still uncertain at this point? \n\nAlso, do we genuinely need him on the team right now, considering our current lineup and future plans? Or would it be more strategic to shift our focus toward exploring other potential left-backs who might be a better fit or offer more value in the long run?",
        "upvotes": 23,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l51mxf/what_about_alvaro_carreras/"
    },
    {
        "id": "1l4nqn9",
        "author": "Ruben12ES",
        "title": "Real Madrid Femenino - Athenea, L.Caicedo, and Bruun have been chosen to present the 2025-26 season jersey.",
        "content": "",
        "upvotes": 155,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l4nqn9/real_madrid_femenino_athenea_lcaicedo_and_bruun/"
    },
    {
        "id": "1l4n8e2",
        "author": "Miserable-Subject-87",
        "title": "Real Madrid has practically finalized the signing of Abdellah Ouazane.",
        "content": "",
        "upvotes": 140,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FxwwQ9x81Ny4f7osaFzgqIrHuo8sDI-tarLDE9G7Za0.jpg?auto=webp&amp;s=2a5735c6c3aaa6417ff121b158577cbfd55fb34a"
        },
        "permalink": "/r/realmadrid/comments/1l4n8e2/real_madrid_has_practically_finalized_the_signing/"
    },
    {
        "id": "1l52kpo",
        "author": "Fabulous_Rip6087",
        "title": "Mastantuono and Arda differences/similarities?",
        "content": "How similar/different would you say the two are?\n\nIt’s nice to see that we’re finally not stuck with just 3 LWs and potentially have 2 natural RWs but in my personal opinion, I really liked seeing Arda at CAM or even as a deep lying playmaker. I think he’s decent at RW but he provides more control from the middle.\n\nHow different could Mastantuono be at RW? I feel like he’s more explosive.\n\nNote: I know we might not even play with wingers depending on Xabi’s system but just a thought.",
        "upvotes": 13,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l52kpo/mastantuono_and_arda_differencessimilarities/"
    },
    {
        "id": "1l440e3",
        "author": "o6ohunter",
        "title": "Mbappé recreated the photo 12 years later",
        "content": "",
        "upvotes": 1293,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l440e3/mbappé_recreated_the_photo_12_years_later/"
    },
    {
        "id": "1l4qtpe",
        "author": "ace-s",
        "title": "Our players have it in them to play beautiful football but the first step is discipline and trusting the process",
        "content": "Especially this season, the idea of playing beautiful football was something unreachable. I'd look at some of the other top teams and I'd be jealous of how fluid they played. \n\nI've been looking at alot of Xabi interviews. His philosophy is that controlling the ball is the most important thing, he wants us to keep possession of the ball. That requires a lot of movement, good link ups and crazy work rate and pressing. I saw Johnathan Tah talk about doing long ball passing drills under Xabi and despite being able to accurately pass the ball but Xabi would want him to pass the ball at a sharper angle. These small little details are what Xabi wants from the team.\n\nWe can clearly see what Xabi wants to do with the team in our signings so far. Huijsen was signed because he excels at carrying the ball forward and progressive passing just like Ramos, either by passing or carrying the ball himself. Álvaro Carreras has [progressive passing stats](https://pbs.twimg.com/media/Gsb0IAXWMAAYy3M?format=jpg&amp;name=large).  More so, Franco Mastuntuano at the age of 17 is River Plate's best player with impressive 1v1 and passing abilities. On top of all that, we have the passing king himself Trent playing for us. \n\nWe have added 5 players that excel at passing the ball to the team, on top of players like Bellingham, Guler and Fede who are also amazing at passing the ball.\n\n",
        "upvotes": 29,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Tl02RJfN-rRTKUbCJp2hCwpjtTzj7Z6nYntNT1gaevE.jpg?auto=webp&amp;s=0df3b90780cb4fb765f1367e68d34e005e7296ec"
        },
        "permalink": "/r/realmadrid/comments/1l4qtpe/our_players_have_it_in_them_to_play_beautiful/"
    },
    {
        "id": "1l4a20u",
        "author": "WhySoWeirdUsername",
        "title": "Real Madrid have agreed to sign River Plate's young forward Franco Mastantuono for an initial fee of about $45 million, a spokesman for the Argentine club told Reuters on Thursday",
        "content": "",
        "upvotes": 492,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nOiCnkktSxYSSuZVs41eh3-BOZA1GCrtHgQJxKi4E3A.jpg?auto=webp&amp;s=af125b935034164738930ecb391f4aee081efd82"
        },
        "permalink": "/r/realmadrid/comments/1l4a20u/real_madrid_have_agreed_to_sign_river_plates/"
    },
    {
        "id": "1l4qzkm",
        "author": "blueXwho",
        "title": "About the 3 CB talks",
        "content": "I know a lot of people link Xabi Alonso with the 3 CB formation, however, I doubt that would be the case for us, at least not at the moment.\n\nIt is not about that tactic being defensive or lesser than others (I think that's nonsense), but more about our current squad.\n\nWe have so much talent in the midfield and offensive midfield, it would be impossible to keep them all happy if we only play with three.\n\nKeep in mind we have Tchouameni, Ceballos, Camavinga, Valverde, Bellingham, Arda, and there is a strong possibility of getting Mastantuono. I believe it would be either Franco or Nico Paz, but there is a possibility of getting them both.\n\nWith that in mind and adding Brahim and Rodrygo, there's no way Xabi Alonso is only using 3 put of 7-8 players. Even with heavy rotations, it doesn't make sense.\n\nTchouameni will probably be the key to transition from a 4 4 2 to a 3 5 2, just dropping between the CBs when needed.\n\nOf course, that's just speculation, but that's fun while we wait for our first game. Hala Madrid!",
        "upvotes": 23,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l4qzkm/about_the_3_cb_talks/"
    },
    {
        "id": "1l4pdqg",
        "author": "fancybrothers",
        "title": "Can we get a dedicated thread for confirmed transfers/rumors?",
        "content": "With the transfer window heating up, it's getting harder to keep track of all the rumors and confirmed moves flying around from different sources. Wouldn't it make sense to have a megathread where everything is organized in one place? It’d be super helpful for everyone to follow the latest updates without digging through multiple posts.\n\nEdit: Found this really helpful comment in a recent thread (credit to u/94Temimi):\n\nWe signed Trent\nWe signed Dean\nWe've basically completed the signing of Carreras\nSame thing with Franco Mastantuono\nAs well as a young talent from Ajax (Abdellah Ouazane)\n\nWe're linked with Stiller (nothing concrete will come out until after CWC)\nWe're working on a potential return for Nico Paz (will be dealt with after CWC)\n\nThere are potential departures in Rüdiger and Rodrygo (no solid info, just rumours)\nIt's also been confirmed that if players leave, depending on who leaves, we’ll enter the market for a replacement.\n\nThat’s basically the whole story for us this summer.\n",
        "upvotes": 27,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1l4pdqg/can_we_get_a_dedicated_thread_for_confirmed/"
    },
    {
        "id": "1l45u7m",
        "author": "WhySoWeirdUsername",
        "title": "[Marca] Asencio breaks up with his lawyer and Real Madrid's legal services will defend him",
        "content": "",
        "upvotes": 655,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n1WwI08gCw16UzX8NyvrglpD76oHSLB0isKQDXgsxf8.jpg?auto=webp&amp;s=a44082b7681a4a9cbe8e5f5d93118b3d18248bfd"
        },
        "permalink": "/r/realmadrid/comments/1l45u7m/marca_asencio_breaks_up_with_his_lawyer_and_real/"
    },
    {
        "id": "1l40fbw",
        "author": "Hakaribiggestfan",
        "title": "[Fabrizio Romano] Understand Franco Mastantuono has decided to join Real Madrid! 🇦🇷\n\nHis dream is Real Madrid… and all parties are informed with personal terms in place.\n\nReal Madrid will now try to negotiate with River on exit terms instead of paying the clause; PSG remain attentive.",
        "content": "",
        "upvotes": 687,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/91UC27i1qLx6ppuQb25EtC2c5eVGedkTULHCgyDxqpo.jpg?auto=webp&amp;s=0fe79755163ff1f4eb203195b7a1e25e132108dc"
        },
        "permalink": "/r/realmadrid/comments/1l40fbw/fabrizio_romano_understand_franco_mastantuono_has/"
    },
    {
        "id": "1l46zlt",
        "author": "Hakaribiggestfan",
        "title": "Di Stefano has returned to madrid after 65 years",
        "content": "",
        "upvotes": 258,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j5kpy1wdl55f1.jpeg?auto=webp&amp;s=fed78dab3facad08c4355330acd6bff2769acb02"
        },
        "permalink": "/r/realmadrid/comments/1l46zlt/di_stefano_has_returned_to_madrid_after_65_years/"
    },
    {
        "id": "1l42rib",
        "author": "94Temimi",
        "title": "Real Madrid’s Juni Calafat returns to Spain after deal in place on personal terms with Franco Mastantuono. Long term deal in place and Real Madrid now working to seal the agreement with River Plate, different structure than the clause. Mastantuono loved the call with Xabi.",
        "content": "",
        "upvotes": 378,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CbbqnvZnnrx0c9O9-b-AT6J2MMCqYJts8O6yc0fsHY0.jpg?auto=webp&amp;s=480b79d16114cce5dff0d18d1c716f59e1925c8a"
        },
        "permalink": "/r/realmadrid/comments/1l42rib/real_madrids_juni_calafat_returns_to_spain_after/"
    },
    {
        "id": "1l40jxt",
        "author": "Superb-Wolf1008",
        "title": "Raul Asencio in Starting XI",
        "content": "I feel like he showed us enough this season to know we can rely on him so from next season I am hoping I see him in our starting xi cause he's a gem and I've grown to love this player. He's extremely good in the CB position and like huijsen he can play ball really well up forward so him x huijsen is something we HAVE to use next season",
        "upvotes": 428,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4734hrp6c45f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1l40jxt/raul_asencio_in_starting_xi/"
    }
]