[
    {
        "id": "1n8sw5t",
        "author": "mi-16evil",
        "title": "Official Discussion Megathread (The Conjuring: Last Rites, Hamilton) plus throwback discussions",
        "content": "**New In Theaters**:\n\n* [The Conjuring: Last Rites](https://www.reddit.com/r/movies/s/kqpgXYUJF3)\n* [Hamilton \\[2020\\] (Theatrical Release)](https://www.reddit.com/r/movies/comments/hkm7e5/official_discussion_hamilton_2020_spoilers/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Highlander: Endgame](https://www.reddit.com/r/movies/s/McksjhzFbX)\n* [Whipped](https://www.reddit.com/r/movies/s/Shi0nfwGUC)\n\n**Still In Theaters**:\n\n* [The Toxic Avenger (2025)](https://old.reddit.com/r/movies/comments/1n2v42x/official_discussion_the_toxic_avenger_2025/?)\n* [Caught Stealing](https://old.reddit.com/r/movies/comments/1n2v46f/official_discussion_caught_stealing_spoilers/?)\n* [The Roses](https://old.reddit.com/r/movies/comments/1n2v49v/official_discussion_the_roses_spoilers/?)\n* [Nobody 2](https://old.reddit.com/r/movies/comments/1mqleeh/official_discussion_nobody_2_spoilers/?)\n* [Weapons](https://old.reddit.com/r/movies/comments/1mkiuk7/official_discussion_weapons_spoilers/?)\n* [Honey Don't!](https://www.reddit.com/r/movies/comments/1mwu2vw/official_discussion_honey_dont_spoilers/?)\n* [Primitive War](https://www.reddit.com/r/movies/comments/1mwu35t/official_discussion_primitive_war_spoilers/?)\n* [Ne Zha II](https://www.reddit.com/r/movies/comments/1j5dv7y/official_discussion_ne_zha_2_spoilers/)\n\n**New On Streaming:**\n\n\n* [Highest 2 Lowest](https://old.reddit.com/r/movies/comments/1n9h173/official_discussion_highest_2_lowest_spoilers/?)\n* [The Thursday Murder Club](https://old.reddit.com/r/movies/comments/1n5045m/official_discussion_the_thursday_murder_club/?)\n* [The Home](https://old.reddit.com/r/movies/comments/1n5046o/official_discussion_the_home_spoilers/?)\n* [Eenie Meanie](https://old.reddit.com/r/movies/comments/1n5043w/official_discussion_eenie_meanie_spoilers/?)\n* [Fixed](https://old.reddit.com/r/movies/comments/1ms61cu/official_discussion_fixed_spoilers/?)\n* [Night Always Comes](https://old.reddit.com/r/movies/comments/1ms61j7/official_discussion_night_always_comes_spoilers/?)\n* [War of the Worlds (2025)](https://old.reddit.com/r/movies/comments/1mek72y/official_discussion_war_of_the_worlds_spoilers/?)",
        "upvotes": 22,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1n8sw5t/official_discussion_megathread_the_conjuring_last/"
    },
    {
        "id": "1n6mf61",
        "author": "TheCutAMA",
        "title": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. It premiered at TIFF 2024. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!",
        "content": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!\n\nThe film had its World Premiere at the Toronto International Film Festival last year. Here to answer your questions.\n\nRepublic Pictures will release THE CUT In Select Theaters September 5th!\n\nCheck out the Trailer: [https://paramnt.us/TheCutTrailer](https://paramnt.us/TheCutTrailer)\n\nSYNOPSIS: After a career-ending defeat, a former champion trains for redemption – but as obsession takes hold and reality unravels, he may be spiraling into something far more terrifying.\n\nHere are all of my credits:\n\n[https://www.imdb.com/name/nm1193346/](https://www.imdb.com/name/nm1193346/)\n\nAsk me anything! I'll be back at 11:00 AM ET tomorrow (Wednesday 9/3) to answer your questions!",
        "upvotes": 55,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wdz0f96wqrmf1.jpeg?auto=webp&amp;s=d5685cf32f3353080b4a130229ceb6f076d98877"
        },
        "permalink": "/r/movies/comments/1n6mf61/hey_reddit_im_sean_ellis_director_of_the_cut/"
    },
    {
        "id": "1nad0vh",
        "author": "kanethekiller90",
        "title": "One thing thats always irritated me about Interstellar",
        "content": "Cooper is desperate to get back to his children. He goes back and see’s Murph in the hospital etc. but theres no mention of his son. Presumably his son’s dead considering Murphs age and condition. But surely there could have been a small bit of dialogue about it. He was hell bent on getting back to them. I dunno, it’s like his son’s just completely forgotten about at the end…",
        "upvotes": 1652,
        "comments": 364,
        "media": null,
        "permalink": "/r/movies/comments/1nad0vh/one_thing_thats_always_irritated_me_about/"
    },
    {
        "id": "1nam06o",
        "author": "MicV66",
        "title": "What's a speech given in a movie that you love.",
        "content": "With Honor is the Movie",
        "upvotes": 268,
        "comments": 128,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/35ba9vtvponf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nam06o/whats_a_speech_given_in_a_movie_that_you_love/"
    },
    {
        "id": "1namdgn",
        "author": "ChiefLeef22",
        "title": "'Wake Up Dead Man: A Knives Out Mystery' - Review Thread",
        "content": "*World-renowned detective Benoit Blanc returns for his most dangerous case yet.*\n\nDirector: Rian Johnson\n\nCast: Daniel Craig, Cailee Spaeney, Jeremy Renner, Andrew Scott, Mila Kunis, Thomas Haden Church, Glenn Close, Josh Brolin, Kerry Washington, Josh O'Connor\n\n**Rotten Tomatoes:** [100%](https://www.rottentomatoes.com/m/wake_up_dead_man_a_knives_out_mystery)\n\n**Metacritic:** [85/100](https://www.metacritic.com/movie/wake-up-dead-man-a-knives-out-mystery/)\n\nSome Reviews:\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/wake-up-dead-man-a-knives-out-mystery-review-daniel-craig-1236510178/)\n\n&gt;Wake Up Dead Man: A Knives Out Mystery is an enticingly clever and droll, nearly pitch-perfect piece of murder-mystery fun — a whodunit that lives up to the expectations set six years ago by “Knives Out,” which offered its own perfect revival of the Agatha Christie spirit, with a tasty frosting of meta cheekiness.\n\n[TheWrap - Chase Hutchinson](https://www.thewrap.com/wake-up-dead-man-review-rian-johnson-daniel-craig-knives-out-3/)\n\n&gt;Although “Wake Up Dead Man” is the “Knives Out” movie that’s most preoccupied with existential questions surrounding death, writer/director Rian Johnson’s third film in the series is also the one that’s most full of life.\n\n[DEADLINE - Damon Wise](https://deadline.com/2025/09/wake-up-dead-man-a-knives-out-mystery-review-rian-johnson-daniel-craig-1236510199/)\n\n&gt;After the bright, light, summery holiday special that was *Glass Onion*, the *Knives Out* franchise returns to its gothic roots with a wintry whodunit that, for some at least, might endure as the the best one yet. Where the first and second used the murder-mystery as a jumping-off point for some very funny contemporary satire, *Wake Up Dead Man* is much more introspective. In a funny way, it’s a little analogous to *Joker 2*, not because it unloads on its audience in the same acerbic way but because it poses similarly metaphysical questions about its own popularity. Why do people respond so eagerly to stories of murder and betrayal? To answer that, director [Rian Johnson](https://deadline.com/tag/rian-johnson/) goes back to the greatest story ever told, using a small religious community as the setting for the third instalment.\n\n[IndieWire - Kate Erbland](https://www.indiewire.com/criticism/movies/wake-up-dead-man-review-rian-johnson-third-knives-out-1235149631/) \\- 'B+'\n\n&gt;It works, and it’s no big mystery why — Johnson knows his form and format, and delivers on it, playing with tone and message but never losing sight of why these stories are so damn entertaining to watch and unravel.\n\n[Awards Radar - Joey Magidson](https://awardsradar.com/2025/09/07/tiff-review-wake-up-dead-man-a-knives-out-mystery-is-rian-johnsons-best-and-most-ambitious-installment-yet/) \\- 3.5 / 4\n\n&gt;Filmmaker Rian Johnson trusts the strength of his franchise to play around with format and theme. The gothic elements on display, as well as the religious aspect, may initially seem like a left turn, but it all ends up fitting like a glove. He knows the must haves for a *Knives Out* flick and absolutely delivers. A few big sequences here at TIFF received ovations once completed. You just can feel that you’re in the hands of a master storyteller, so you’ll follow him anywhere. Johnson knows that and 100% makes the most of it.\n\n[The Daily Beast - Nick Schager](https://www.thedailybeast.com/obsessed/wake-up-dead-man-knives-out-3-finds-god-and-is-so-good-because-of-it/)\n\n&gt;In terms of pure, heady kicks, it outpaces *Knives Out* but falls just short of *Glass Onion*. In the big picture, however, such distinctions are rather inconsequential; more important is that Johnson’s franchise remains a sly and sure-footed delight, as well as demonstrates, with its religiously minded latest, that it’s capable of coloring its Christie-esque mysteries in a variety of shades.",
        "upvotes": 235,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fIYpdc8nom8ZtELZywKtatTiDUv459rA98wOjyUOqJM.jpeg?auto=webp&amp;s=1b6126b416858cea28015e58202287deb62e8e00"
        },
        "permalink": "/r/movies/comments/1namdgn/wake_up_dead_man_a_knives_out_mystery_review/"
    },
    {
        "id": "1n9x5m2",
        "author": "Amaruq93",
        "title": "The Phantom (Lon Chaney) is unmasked by Christine (Mary Philbin) - The iconic moment from the silent film \"The Phantom of the Opera\", which premiered 100 years ago on Sept 6th, 1925",
        "content": "",
        "upvotes": 7505,
        "comments": 305,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zp53rpeb4jnf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n9x5m2/the_phantom_lon_chaney_is_unmasked_by_christine/"
    },
    {
        "id": "1na23mj",
        "author": "MarvelsGrantMan136",
        "title": "‘28 Years Later’ Gets Netflix Release Date - September 20",
        "content": "",
        "upvotes": 2064,
        "comments": 190,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fUjFkXagsvtJn_-saNdGG0JicWzO95R6KJaJ_z1jwL0.jpeg?auto=webp&amp;s=b908fded19a8917a8525137dc652b4b8d8fd0d8c"
        },
        "permalink": "/r/movies/comments/1na23mj/28_years_later_gets_netflix_release_date/"
    },
    {
        "id": "1nahu2n",
        "author": "MarvelsGrantMan136",
        "title": "'Rebel Ridge' Wins the Emmy for Outstanding Television Movie",
        "content": "",
        "upvotes": 249,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3_92vJU4yAYk2NhgIVs1_o_m5AxQkGexRAX0CQmacj4.jpeg?auto=webp&amp;s=0a40b086cb84027a54aa340bdf7237f4f9d71502"
        },
        "permalink": "/r/movies/comments/1nahu2n/rebel_ridge_wins_the_emmy_for_outstanding/"
    },
    {
        "id": "1na92l0",
        "author": "Stankassmfgorilla",
        "title": "What film would you consider to be “perfect”",
        "content": "Or at least, as close to perfect as a film can get. \n\nIt had been years since I watched Jaws, probably since I was in high school as a freshman, and I just went a few days ago to see it in IMAX for its 50th anniversary. It felt like watching it again for the first time. What I couldn’t believe was how, despite having watched the film countless times as a kid, and remembering everything even after not having seen it in years, it felt like the first time watching it again. The movie magic was there in a way I haven’t felt in a really long time. This was driven home by the fact I really couldn’t find a single flaw with this film. \n\nYes, some minor visual stuff with some shark props, but that’s excusable since it’s a film from 1975 and this was a 4K remaster. Of course there will be at least a few visual things to notice. I don’t count that, because those weren’t mistakes. Simply limitations of the time. The effect for the shark in the water still looks great, and the editing between the animatronic and live shark footage was seamless. The cinematography is still outstanding. Spielberg’s use of long takes has always been my favorite staple of him. \n\nI truly think Jaws is about as close to a perfect film as you can really get. It truly is flawless from a filmmaking perspective, especially considering how troubled the production was, it’s miraculous the movie even exists, let alone with the level of quality it has. Literally every single facet of the filmmaking was dialed to perfection, and Spielberg maintained this with a multitude of films in his career. Just breathtaking to finally see it on the big screen. It was a real treat.",
        "upvotes": 695,
        "comments": 2280,
        "media": null,
        "permalink": "/r/movies/comments/1na92l0/what_film_would_you_consider_to_be_perfect/"
    },
    {
        "id": "1na87jr",
        "author": "husky_whisperer",
        "title": "What's the sickest PG burn you've ever heard?",
        "content": "For me it is this gem from [Down Periscope](https://www.imdb.com/title/tt0116130/?ref_=ext_shr_lnk) (1996)\n\n  \n**Rear Admiral Yancy Graham**: *You watch yourself, Dodge! You are addressing a superior officer.*  \n  \n**Lueutenant Commander Dodge**: *No... Merely a higher ranking one. CATCH US IF YOU CAN!*",
        "upvotes": 591,
        "comments": 349,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Nsgbwt5WGGulUY1I_nEvJJXT1ovqn9PrX_xIFGJgNk.jpeg?auto=webp&amp;s=ac294e0443cc24381e59926e78d0b278dff415bf"
        },
        "permalink": "/r/movies/comments/1na87jr/whats_the_sickest_pg_burn_youve_ever_heard/"
    },
    {
        "id": "1na4hju",
        "author": "demolcd",
        "title": "John Candy interview at his rural Ontario home (1985)",
        "content": "In the early 1980s, This Is Your Life interviewed John Candy at his Queensville, Ontario farm, a serene retreat near Newmarket where he relaxed with family and friends like Martin Short, Catherine O’Hara, Eugene Levy, and even Robert DeNiro. Already a star from The Second City Toronto (joined in 1972) and SCTV with Rick Moranis, Dan Aykroyd, and Dave Thomas. This rural haven inspired his everyman roles in Splash and Uncle Buck.",
        "upvotes": 861,
        "comments": 37,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r4f81o0oqknf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1na4hju/john_candy_interview_at_his_rural_ontario_home/"
    },
    {
        "id": "1na0n33",
        "author": "MarvelsGrantMan136",
        "title": "Orson Welles Estate Opposes AI Company’s Plan to Recreate Lost Scenes of ‘Magnificent Ambersons', Calling it a Publicity Stunt",
        "content": "",
        "upvotes": 1277,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6jBs6nDchS6t521m2GuD2KIBM3JVDrmtDW43zw9_Xhc.jpeg?auto=webp&amp;s=8d91336c353790e77187c289d17d996cec296e3e"
        },
        "permalink": "/r/movies/comments/1na0n33/orson_welles_estate_opposes_ai_companys_plan_to/"
    },
    {
        "id": "1naj2e9",
        "author": "Fortestingporpoises",
        "title": "What's the best three movie run within a franchise not starting with the first film?",
        "content": "So I just rewatched Star Trek 3 The Search for Spock, which I find to be the most underrated Star Trek film.  This is particularly impressive given the most compelling original cast character is barely or arguably not in it at all.\n\nI also find that run of Wrath of Kahn, Search for Spock, and Voyage Home to be among the best three movie runs within a franchise that don't start with the first movie.  \n\nUsually the fist movie of the franchise is good enough to get a franchise going and usually franchises tend to go downhill fast after the third film, so the original cast Star Trek movies are one of the few exceptions as far as I can tell.\n\nI can think of a horror franchise and an action franchise that both apply to this topic.\n\nThoughts?",
        "upvotes": 77,
        "comments": 173,
        "media": null,
        "permalink": "/r/movies/comments/1naj2e9/whats_the_best_three_movie_run_within_a_franchise/"
    },
    {
        "id": "1na8r69",
        "author": "Flash_SA",
        "title": "How does First Blood (1982) look so good?",
        "content": "My father loves Rambo so we sat down to watch it together. The whole time my father was fighting with me on whether this was the first or second movie (they’re literally called first blood and first blood II) but I didn’t pay it much mind as I was enamored by how marvelous this film looked.\n\nI’m almost 100% exaggerating but this might be the best looking action movie I’ve ever seen. Some of the shots in this film are breathtaking. I could hang that scene with Rambo in the cave lighting a match on my wall, that’s how good it looked. The story itself was also better than expected but goddamn this movie looks fantastic.\n\nAnyone else blown away by its visuals or do I just have low expectations?",
        "upvotes": 265,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1na8r69/how_does_first_blood_1982_look_so_good/"
    },
    {
        "id": "1n9sjfw",
        "author": "Maleficent_Ad9303",
        "title": "Friendship pissed off my whole family",
        "content": "Back when the movie released in theaters, I watched it in a crowded AMC with a friend and absolutely loved it. I was not familiar with Robinson’s work, but I loved the absurdity and awkwardness. I think my initial reaction was also influenced by the energy of the theater, which was full of cackles and laughs throughout most of the movie. \nI got home and thought “man, my husband would have loved that.”\n\n\nSo 2 months ago I made him watch it with me, thinking he’s for sure going to be laughing the entire time just as me and the whole theater were - and he absolutely hates it. Halfway through he’s like, “does it get better?” And I was like “I mean… No… but it’s good!”\nBut by that point I was also feeling completely different about this movie too. The experience of watching it in my apartment next to my extremely unsettled husband was of course a big vibe shift, but I admittedly was also more uncomfortable this time around. But I’m thinking ‘no it’s good I remember laughing so much we HAVE to stick it out.’\nAnyways, it ends, and my husband is just sick of it. Like it emotionally drained him, and ruined his mood. And I felt terrible, and weirdly similar. \n\n\nWhat I had forgotten was that I had messaged my family after my experience watching it in theaters, of course giving it a glowing review lmao\n\nWell now it’s on HBO Max, so my mom tells me she sat my brother and dad down and watched it - and they all had the same reaction as my husband. Just HATED it.\n\n \nMy mom is messaging me through the whole thing going “your brother couldn’t stand 15 months and went to bed”, “your dad is taking a break - does it get any better?”, “he just licked the toad”, “this is an extremely weird movie why did you tell us to watch this”, “your dad is genuinely mad”,\nand finally, my favorite message\n\n\n “That movie put everyone in a mood \nWe are all moody  now \nI’m going to bed “\n\n\nThe last time a movie got a reaction like this from my family the movie was Hereditary. \nAlthough I feel bad for pissing everyone off, I do find it pretty incredible that a comedy movie could make so many people feel so deeply uncomfortable that it psychologically impacts them to such a degree, and I just needed to share this with someone. What did you think of this movie lol?\n ",
        "upvotes": 2232,
        "comments": 450,
        "media": null,
        "permalink": "/r/movies/comments/1n9sjfw/friendship_pissed_off_my_whole_family/"
    },
    {
        "id": "1na4uc1",
        "author": "OtterlyFoxy",
        "title": "Most obscure movie you’ve seen that you can remember?",
        "content": "Yes I know movie is a large catch all term for any film but for the purposes of this question I am limiting it to fiction-based feature films (at least 40 minutes), so please don’t name a 5 minute short you made for film class. It doesn’t matter if you’ve seen it in cinemas or at home. You can name multiple possible ones if you don’t remember a singular one. \n",
        "upvotes": 283,
        "comments": 1028,
        "media": null,
        "permalink": "/r/movies/comments/1na4uc1/most_obscure_movie_youve_seen_that_you_can/"
    },
    {
        "id": "1na3gby",
        "author": "and_so_I_adore_it",
        "title": "Cillian Murphy talks about his 28 Years Later return",
        "content": "",
        "upvotes": 331,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vrzApu1Bv_dC7veLJK5N2Cabnq3T2Y-8UtUpGbiSiRg.jpeg?auto=webp&amp;s=70c12d5fcf4f082dc969731634b4d1efd7ece47e"
        },
        "permalink": "/r/movies/comments/1na3gby/cillian_murphy_talks_about_his_28_years_later/"
    },
    {
        "id": "1n9xltp",
        "author": "Eddieabdull",
        "title": "What is the most violent movie?",
        "content": "Hey there! I just dove into an intense documentary about Scarface, and the narrator boldly claimed it's the most violent movie of all time! Now, I'm on a mission to craft an epic list of the most jaw-droppingly violent films across all genres.\n\nI'm looking for movies that pack a punch in terms of bloodshed, along with their ratings and how much they've raked in at the box office or how many viewers they have. And don’t worry, I won’t spoil any thrilling moments—gotta keep the suspense alive! If you have any suggestions, let’s hear them!",
        "upvotes": 638,
        "comments": 1017,
        "media": null,
        "permalink": "/r/movies/comments/1n9xltp/what_is_the_most_violent_movie/"
    },
    {
        "id": "1na62sd",
        "author": "LetMeExplainDis",
        "title": "Characters being dumb for the sake of exposition",
        "content": "Eva Green's character in Casino Royale knows nothing about poker, which is hilarious because her job is to literally monitor the game and approve a potential $5m rebuy if Bond's chances of success are good enough. It's an effective storytelling device because the other M16 guy can then explain to her (and the audience) what's going on during tournament. \n\nAnother one would be in The Big Short where Steve Carrel doesn't know what a quant is, even though his character's a hedge fund manager. What other examples can you think of?",
        "upvotes": 167,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1na62sd/characters_being_dumb_for_the_sake_of_exposition/"
    },
    {
        "id": "1na7ogu",
        "author": "AvailableReality557",
        "title": "What’s a movie where the side character or villain ends up more compelling than the actual protagonist?",
        "content": "Sometimes you finish a movie and realize you cared way more about the supporting cast than the lead. Maybe the villain completely stole the show, maybe a side character’s arc felt richer than the main plot. Either way, it can flip the whole movie on its head. Which film made you feel like the “wrong” character was in the spotlight?",
        "upvotes": 126,
        "comments": 294,
        "media": null,
        "permalink": "/r/movies/comments/1na7ogu/whats_a_movie_where_the_side_character_or_villain/"
    },
    {
        "id": "1naivxn",
        "author": "hnglmkrnglbrry",
        "title": "The Patriot is one or the most gorgeously lit movies I've ever seen",
        "content": "Countless shots are utterly breathtaking. Roland Emmerich (director)and Caleb Deschanel (cinematographer) did an incredible job using natural light - especially golden hour - to create an incredible atmosphere. Every environment whether it be interior or exterior feels fully alive. \n\nYou can see why Deschanel was nominated for an Oscar for this film. ",
        "upvotes": 29,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1naivxn/the_patriot_is_one_or_the_most_gorgeously_lit/"
    },
    {
        "id": "1n9ya2i",
        "author": "SafeBodybuilder7191",
        "title": "‘Steve’ Review: Cillian Murphy Turns Inspirational Teacher Tropes Upside Down in the Year’s Best Netflix Movie",
        "content": "",
        "upvotes": 240,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iLViZs3gCe7XBEjxNKk3bUmKfjJYSQO0_PRjGXnE2A4.jpeg?auto=webp&amp;s=4497cb5de4d7164f32a6f723c64a16063019f881"
        },
        "permalink": "/r/movies/comments/1n9ya2i/steve_review_cillian_murphy_turns_inspirational/"
    },
    {
        "id": "1n9gs3k",
        "author": "MarvelsGrantMan136",
        "title": "Djimon Hounsou Joins Henry Cavill in ‘Highlander’ Remake",
        "content": "",
        "upvotes": 3969,
        "comments": 332,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eGcPGdaQ1xWs1ytDPc9TuWAby9fBh_mWtWLgKgmRfgw.jpeg?auto=webp&amp;s=1fd20608de3b23b0ddc9fad3951a7581b695623d"
        },
        "permalink": "/r/movies/comments/1n9gs3k/djimon_hounsou_joins_henry_cavill_in_highlander/"
    },
    {
        "id": "1na7x46",
        "author": "arbab_islam12",
        "title": "Which movies do you think badly need a sequel, despite it surely not happening",
        "content": "For me, I would like to see sequels of -\n\nworld war z - what happens later as jerry is entrusted with another task  \n2012 - what happens to the world, the new one after they land at cape of good hope, in africa  \ntrain to busan - just keeping aside that awful 'peninsula', I want an actual sequel of the first one.\n\nwhat are yours?\n\n",
        "upvotes": 65,
        "comments": 290,
        "media": null,
        "permalink": "/r/movies/comments/1na7x46/which_movies_do_you_think_badly_need_a_sequel/"
    },
    {
        "id": "1nan1wi",
        "author": "1289-Boston",
        "title": "Futuristic movies that hinge on video evidence which we now know can be AI faked",
        "content": "I can think of two sci-fi movies, Robocop and Minority Report, set in a technologically advanced future, where the climax is the bad guy being caught on video admitting to his crime. But in the \"real\" future, all the bad guy has to say is \"AI! Fake!\" Are there others which hinge on this now redundant premise?",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1nan1wi/futuristic_movies_that_hinge_on_video_evidence/"
    },
    {
        "id": "1n9mp10",
        "author": "Suspicious-Elk-3631",
        "title": "Tucker and Dale vs. Evil",
        "content": "Holy fuck this movie made me laugh like a giggling idiot. It is so much better than it has any right to be and was just to refreshing to watch. I was going to watch a romcom tonight but watched this on an impulse and am so glad I gave it a chance and now think I've kicked off the spooky season early. Anyone care to share their thoughts on this movie I'm happy to discuss your opinion. Or if you hated it that's fine too I suppose,  Dale would want to play a boardgame with you anyway.                                          ",
        "upvotes": 1547,
        "comments": 189,
        "media": null,
        "permalink": "/r/movies/comments/1n9mp10/tucker_and_dale_vs_evil/"
    },
    {
        "id": "1nangmg",
        "author": "pastamuente",
        "title": "What are some of the greatest animated movies of all time?",
        "content": "Shrek 2 is very amazing movie. The humor is clever. The pop music is memorable, I need a hero G minor rendition by the fairy godmother made the climactic fight scene memorable. And the story and message is heartwarming and thoughtful.\n\nThere are many Disney movies, like the lion king or beauty and the beast. But what are your favorite personal picks do you enjoy and love.",
        "upvotes": 5,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1nangmg/what_are_some_of_the_greatest_animated_movies_of/"
    },
    {
        "id": "1nactyy",
        "author": "Sunflower13Poppy",
        "title": "What's your favorite performance in a black-and-white movie?",
        "content": "For me, Bette Davis in All About Eve is hard to top. Her perfect mix of charm, wit, and cutting sarcasm is iconic. \n\nBut I’m curious, who do you think delivered the most memorable performance in a black-and-white film? \nWould love to hear your thoughts and recommendations, there are so many great ones out there! ",
        "upvotes": 30,
        "comments": 117,
        "media": null,
        "permalink": "/r/movies/comments/1nactyy/whats_your_favorite_performance_in_a/"
    },
    {
        "id": "1na7stu",
        "author": "ChiefLeef22",
        "title": "Venice Film Festival 2025: Benny Safdie Wins Best Director Silver Lion for 'The Smashing Machine', Jim Jarmusch Wins Golden Lion for 'Father Mother Sister Brother', 'The Voice of Hind Rajab' Wins Grand Jury Prize",
        "content": "",
        "upvotes": 48,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8QcP-EFH_PqdX7SfNl7mN3M5WhUOn6Uft4x277iVIcA.jpeg?auto=webp&amp;s=060839d61ad09cf187364731a77e2ee8626c274d"
        },
        "permalink": "/r/movies/comments/1na7stu/venice_film_festival_2025_benny_safdie_wins_best/"
    },
    {
        "id": "1n9br72",
        "author": "MarvelsGrantMan136",
        "title": "‘Alien: Romulus’ Sequel Script is Complete But Fede Álvarez Will Not Direct",
        "content": "",
        "upvotes": 3880,
        "comments": 633,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0e_hBcMBcJElVzlEqpmMInh02qORr4C3tkUjfcBp6w8.jpeg?auto=webp&amp;s=8116637df2ed8741b9c1fac4a01b11b1b2ffc625"
        },
        "permalink": "/r/movies/comments/1n9br72/alien_romulus_sequel_script_is_complete_but_fede/"
    },
    {
        "id": "1nan8yb",
        "author": "Boss452",
        "title": "Director Darren Aronofsky Breaks Down His Most Iconic Films",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AV6dE197_b2P-vaU5lvf_5gGzPWqtnpA_uargZG5zfw.jpeg?auto=webp&amp;s=19b3f360c96739f25f7a34b5b5591d31b04624cc"
        },
        "permalink": "/r/movies/comments/1nan8yb/director_darren_aronofsky_breaks_down_his_most/"
    },
    {
        "id": "1n9q4fn",
        "author": "J_Greer20",
        "title": "What’s the most jarring plot twist?",
        "content": "Which plot twist was the most jarring? I have always loved a good twist no matter the genre. \n\nOrphan (2009) is one of my favorites because it completely took me by surprise. It gets some hate, but it’s a lot to fun.\n\nCrazy, Stupid, Love. (2011) is another one. Completely unexpected and made the movie better.",
        "upvotes": 473,
        "comments": 450,
        "media": null,
        "permalink": "/r/movies/comments/1n9q4fn/whats_the_most_jarring_plot_twist/"
    }
]