[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 107,
        "comments": 649,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1n5dn3t",
        "author": "ResistheSouth4896",
        "title": "Khloe's Parents - High School Catfish?",
        "content": "Why do they play up the victim so hard, and get so mad at Lauren and Shawn although they didn't do anything wrong? Khloe's Mum says and I quote \"I told someone else that Shawn and Lauren are going to play this off like they were the victim in this shit, they had no clue what was going on and they're going to get away with it.\" Not only were Lauren and Shawn the victims but their life has been ruined forever. Your daughter was interviewed and maybe the rest of High School sucked, but Lauren and Shawn are going to have to live with, and carry this forever. I dunno it just kind of pissed me off that they were tryna grab onto the \"fame\" and blame other's that had nothing to do with it.",
        "upvotes": 165,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1n5dn3t/khloes_parents_high_school_catfish/"
    },
    {
        "id": "1n587m2",
        "author": "ABottleOfJackDaniels",
        "title": "Good Documentaries?",
        "content": "I love documentaries, I don't even care what they're about as long as they're done well enough and I would like to hear some recommendations and why you'd recommend it. I'm gonna go smoke a DOOBIE and hopefully yall will have some good ones for me ",
        "upvotes": 170,
        "comments": 358,
        "media": null,
        "permalink": "/r/netflix/comments/1n587m2/good_documentaries/"
    },
    {
        "id": "1n526gk",
        "author": "Subject-Hunter3395",
        "title": "Jussie Smollett Netflix Documentary",
        "content": "Just finished the Jussie Smollett doc on Netflix and wow… what a joke. Instead of finally owning up, it felt like one long attempt to keep the lie alive.\n\nHonestly, people would have respected him way more if he just came clean years ago. Dragging this story out only makes him look worse. He’s not some A-list celebrity, he’s acting like the world revolves around him when, in reality, he’s just not that important.\n\nThe ego, the facade, the refusal to admit the obvious it’s exhausting. Imagine if he had just said “yeah, I messed up, I lied.” The redemption arc could’ve actually worked in his favor. Instead, we get a documentary trying to polish a lie.\n\nCome on, man. 🤦🏽‍♀️ \n\nWhat are your thoughts? ",
        "upvotes": 225,
        "comments": 106,
        "media": null,
        "permalink": "/r/netflix/comments/1n526gk/jussie_smollett_netflix_documentary/"
    },
    {
        "id": "1n4s7vw",
        "author": "Emmarrrrawr",
        "title": "Strangest part in unknown number high school catfish..",
        "content": "The strangest part for me was when the police go to Kendra’s house and say they’ve tracked the IP address back to this house. When the police call Lauryn inside the house and tells her what’s been going on she doesn’t really seem shocked. She doesn’t confront her mom at all. She doesn’t say anything! \n\nThen the dad is told to come over by the police, outside the police explains what has happened and that Kendra has also lied about having a job.\n\nWhen the dad goes inside he’s only bothered about when Kendra was laid off her job, he doesn’t mention anything at all about the fact Lauryn’s mom has been aggressively cyber bullying their daughter for over a year! \n\nI don’t know it’s just strange none of them seem remotely surprised about the cyber bullying.\n",
        "upvotes": 748,
        "comments": 539,
        "media": null,
        "permalink": "/r/netflix/comments/1n4s7vw/strangest_part_in_unknown_number_high_school/"
    },
    {
        "id": "1n56yo8",
        "author": "ViciousIsland",
        "title": "I'm a little surprised that the Highschool Catfish investigators didn't suspect an adult until way later in the investigation.",
        "content": "As I was reading some of the texts, I thought, \"A kid didn't write this,\" but not (only) because of the graphic sexual content. I forget which texts stood out to me, but some strongly struck me as being written by someone over the age of 30 because the phrasing or word choices were very distinctly millennial (I'm a millennial), and the use of Gen Z slang and abbreviations seemed off. Did anyone else notice that? I'm no Gen Z expert though, and I don't have kids, so maybe I'm totally wrong here lol. ",
        "upvotes": 94,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1n56yo8/im_a_little_surprised_that_the_highschool_catfish/"
    },
    {
        "id": "1n5b5vr",
        "author": "CeeZee213",
        "title": "My issue with Unknown Catfish",
        "content": "Kendra brings up the trauma from her past. And I wouldn’t say she uses it as justification for what she’s done, but more to explain what her mind set was. And she specifically says something along the lines of her daughter starting to get older, and her own fears of what happened to her as a teenager happening to her daughter. So in her sick mind, this was her way of protecting her. At least thats the point I think she was trying to make, regardless of how deluded it might be. \n\nOkay, fine….thats where your head was at. \n\nSo…why did you message Owen’s new girlfriend’s mother? Were you trying to ‘protect’ her too? \n\nThe fact that the producers at no point thought it necessary to focus on that aspect and force her to confront it is where this whole thing falls apart for me. \n\nAnd for the record, she didn’t do NEARLY enough time. \n\nEdit - Unknown Number (can’t change the title) ",
        "upvotes": 41,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1n5b5vr/my_issue_with_unknown_catfish/"
    },
    {
        "id": "1n541po",
        "author": "Familiar-Song6146",
        "title": "Unknown Number: why didn’t Netflix elaborate more on this thing that Khloe’s dad said",
        "content": "Throughout most of this documentary the people interviewed paint Kendra as a normal parent who is very helpful and involved in her community. I get that from an entertainment standpoint they did this to increase the shock factor when it’s revealed that she was the catfish but I don’t think they did enough to explain other people’s perspectives of her behavior.\n\nOwen says that he felt she gave him extra attention in a way that didn’t feel normal. And the examples he gives probably would have been hard for other adults to pick up on as they would likely just seem like Kendra being somewhat maternal towards him.\n\nBut then Khloe’s dad said that he thought early on that it was Kendra and even mentioned it to the sheriff. But then Netflix completely failed to dive into the reasons WHY he would think that. This makes me think that she was probably doing other strange things if other adults suspected her, whether it’s a history of manic behaviors or inappropriate behavior towards minors it would have made sense to touch on that more rather than trying to stick to this story that she was some completely normal mom who just happened to wake up one day and start tormenting and sexually harassing teenagers out of the blue ",
        "upvotes": 64,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1n541po/unknown_number_why_didnt_netflix_elaborate_more/"
    },
    {
        "id": "1n5ahz8",
        "author": "Short-Complex4819",
        "title": "High School Catfish - Questions (Spoilers involved)",
        "content": "So I watched this twice. Once when I didn't know who it was and then watched it after to see the texts through the lens of this being her mother.   \n  \nA few observations:  \n\\-Kendra says \"we've all broken the law at one point and haven't gotten caught\". LADY, no one else has stalked minors and adults with sexual content texts for 22 months as an OOPSIE. Did this make anyone else want to scream at the TV!?\n\n\\-She lies that she started doing this to find out who sent the original texts. She started off aggressive with those texts out of the gate and they escalated. Did anyone else believe her?\n\n\\-She was absolutely obsessed with Owen, and I believe she was hoping to push her daughter, Owen, Khloe or someone to snap and do something.\n\n\\-I think she got off way too easy in this documentary. I am sure they had to make some agreement with her so she'd appear, but man I wish they would've pushed back.\n\n\\-Can anyone answer why she didn't get charged with anything as far as the sexual content to minors went? I mean her texts to Owen and Lauryn were beyond disgusting for 14 year olds. Why was it only stalking and nothing in the substance of the texts? Genuinely asking anyone who knows the law why this would be the case.\n\n\\-I can't imagine all these people living in the small town together after this all went down. I genuinely feel awful for this poor girl Lauryn. You can tell the difference in her after she had gotten some space from her mother's grip and had time to process. Those interviews she was different. She also says \"I hope that my mom gets the help she needs so it doesn't go back to the way it was before.\" I don't think she's just referring to the texts. She's probably been awful on other things.  \n  \nThose are my thoughts / questions. No one I know has watched it yet and dying to hear people's thoughts!!\n\n",
        "upvotes": 24,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1n5ahz8/high_school_catfish_questions_spoilers_involved/"
    },
    {
        "id": "1n4x495",
        "author": "Historical_Champion5",
        "title": "How was Highschool Catfish even possible to film?",
        "content": "My husband and I just watched the documentary and I keep wondering how was it even possible to interview these people for millions of us around the world to see them? How will they be able to go back to their normal life after this? All of these teenagers are still so young, I am not even sure that all of them were above 18. I wonder if it needed to be a Netflix show - maybe it would have been better for this to die down as a local news story, to protect everyone involved’s sanity. \n\nOn a bright side, I wonder if the attention to this might lead to more checks so that what all of us noticed - it was a sexual harassment of minors rather than just catfishing - gets properly investigated and hopefully leads to either more jail time or stricter consequences. ",
        "upvotes": 113,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1n4x495/how_was_highschool_catfish_even_possible_to_film/"
    },
    {
        "id": "1n5dywc",
        "author": "Tall-Banana-6551",
        "title": "phone case",
        "content": "how did kendra even get that photo of his phone case on christmas? \n\nthe only likely explanation i would have is that jill sent that photo to kendra. but a) she would’ve noticed/ mentioned that the photo was taken by her and b) would have put 2 + 2 together that it was sent to kendra.\n\nidk, this small detail has thrown me for a loop. \n\nEdit: UNKNOWN NUMBER ",
        "upvotes": 10,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n5dywc/phone_case/"
    },
    {
        "id": "1n59fgv",
        "author": "Lonely_Meeting_9018",
        "title": "Unknown number high school catfish",
        "content": "I definitely think Khloe did bully people and was mean. Im not saying she deserves to be tormented like that by an adult and be accused by something so serious. But she was a bully just by how her parents are behaving about their daughter being a potential bully and overall how her parents dealt with this matter. Not to mention her friends saying Adriana Owen’s cousin “spread a rumour” about them bullying her in middle school. They were soo quick to blame Adriana and point fingers but her parents were offended that someone would blame their child.",
        "upvotes": 18,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n59fgv/unknown_number_high_school_catfish/"
    },
    {
        "id": "1n5f8uo",
        "author": "Babies_",
        "title": "Why is Owen mad at Lauryn?",
        "content": "Okay if you seen the documentary unknown number: high school catfish you know her mom was sending those messages to her but at end Owen said that he was mad at Lauryn why? She a victim just like she was? ",
        "upvotes": 7,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1n5f8uo/why_is_owen_mad_at_lauryn/"
    },
    {
        "id": "1n57pp0",
        "author": "goblinscry",
        "title": "Unknown Number High School Catfish",
        "content": "Overall we know Kendra is an insane person. It’s extremely clear she was in some sort of distorted reality she still considers real. \nWhat really shocked me was her bringing up how she was raped at 17 as if that is any justification for her abuse toward her daughter and other children. “I got scared that would happen to her too” …. so you sent her messages about her body and weird sexual messages about her boyfriend??????\nI’m also shocked that there were no charges placed or even any conversation about her obsession with Owen. \nShe ruined her daughter’s high school experience and this will likely cause a lot more socialization issues into her adult life. \nI need to read her psych evaluation like yesterday. ",
        "upvotes": 22,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1n57pp0/unknown_number_high_school_catfish/"
    },
    {
        "id": "1n5go6m",
        "author": "roberta_sparrow",
        "title": "How do they get people to sit for interviews like in Unknown Number?",
        "content": "It’s crazy to me that these people would want to speak on camera.  That Kendra would go on camera could be because of her narcissism but the others…the husband, the daughter, Owen.  Do they pay them a lot of money?  This is heavy and relatively recent content to discuss and the interviews are very stylized and they also had the subjects do b roll.  ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n5go6m/how_do_they_get_people_to_sit_for_interviews_like/"
    },
    {
        "id": "1n5gw27",
        "author": "vanhype",
        "title": "How to switch back to old layout?",
        "content": "A few days back my Netflix layout changed (on Roku TV display) now TV SHOWS MY NETFLIX buttons are at the top (previously they were on left side panel) how do I change it back to previous layout? ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n5gw27/how_to_switch_back_to_old_layout/"
    },
    {
        "id": "1n5day5",
        "author": "PrestigiousFlower714",
        "title": "Hostage - I thought it would be like The Bodyguard or The Diplomat but LOL",
        "content": "To watch it, you have to live in a world where the British Prime Minister and French President and their families have absolutely 0 security whatsoever.. like literally, people get taken hostage (not a spoiler, this is literally the title) and even AFTER that - 0 security, zero secret service, zero actual any government security or espionage or investigation agencies, just two leaders of European nuclear powers personally handling and resolving all threats to themselves and their families.\n\nActually the acting was quite talented. Especially from the leading ladies, but god what drivel the writing was. ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n5day5/hostage_i_thought_it_would_be_like_the_bodyguard/"
    },
    {
        "id": "1n5fta3",
        "author": "girlwearsred",
        "title": "Highschool Catfish: Why they waited a whole year to call the police?",
        "content": "It seems like the most logic thing to do in this situation would be to call the authorities! Specially with the amount of texts she was receiving per day and the severity of the content. It seems weird to me that the school waited a year to call the police. \nI also don't understand why the parents of the boyfriend Owen or Lauryn's dad wouldn't call them instead of going to the school when it started to happen. \nWhat a crazy case! ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n5fta3/highschool_catfish_why_they_waited_a_whole_year/"
    },
    {
        "id": "1n5fi3i",
        "author": "lostOGaccount",
        "title": "Documentaries vs docuseries",
        "content": "What docuseries have you seen that you felt should've been a single 90 - 120 min documentary? What documentary did you finish wanting to more nuance and detail out of perhaps in the form of a docuseries?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n5fi3i/documentaries_vs_docuseries/"
    },
    {
        "id": "1n4c5f3",
        "author": "WebConsistent3251",
        "title": "Unknown Number the Highschool Catfish- I'm sorry did I just watch Netflix give a platform to a predator completely glossing over the fact that she was sexually aggressive with minors?",
        "content": "She's a pedophile and a predator. I'm disgusted. She took no accountability and Netflix tried giving her some sympathetic image? Gross. Her daughter needs tons of therapy\n",
        "upvotes": 702,
        "comments": 352,
        "media": null,
        "permalink": "/r/netflix/comments/1n4c5f3/unknown_number_the_highschool_catfish_im_sorry/"
    },
    {
        "id": "1n5ivwd",
        "author": "rudro_c",
        "title": "Netflix’s most-watched movie of all time could have been a slam dunk for Sony Entertainment — what went wrong?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n5ivwd/netflixs_mostwatched_movie_of_all_time_could_have/"
    },
    {
        "id": "1n51cg4",
        "author": "R_Steelman61",
        "title": "Thursday Murder Club",
        "content": "What a fun movie! Now for context I'm in my 60s and have watched all of the main actors for decades so much of the fun is watching these great actors effortlessly play their roles.\nThe plot is interesting enough but it's watching the actors and characters interact that's the real treat here. ",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n51cg4/thursday_murder_club/"
    },
    {
        "id": "1n5hu4l",
        "author": "Xelariq04",
        "title": "Why isn't anyone writing about My Life with the Walter Boys?",
        "content": "I see comments and posts about the series TSITP on every social media channel. However, my Life of the Walter Boys is always compared to the Wish/Temu version of TSITP. I don't think that's true: although both series feature a love triangle, they have different backstories and plots. What I don't understand is how cheating is becoming normalised, which I find really weird. What do you guys think?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n5hu4l/why_isnt_anyone_writing_about_my_life_with_the/"
    },
    {
        "id": "1n4kcw0",
        "author": "lululegume",
        "title": "Unknown Number: The HS Catfish",
        "content": "Can someone explain why Khloe’s dad was talking about Kendra being untrustworthy at 1:29:40….but then her mom pipes in and blames Lauryn and her dad Shawn, like they were in on it?   \n\nI need more details about this case. I need to know more about what kind of messages Owen was getting, we mostly only saw Lauryn’s. I need to know why Chloe‘s parents would suspect Shawn and Lauren were going to claim to be a victims? I am left with so many questions and I also feel disgusted at the same time.",
        "upvotes": 142,
        "comments": 173,
        "media": null,
        "permalink": "/r/netflix/comments/1n4kcw0/unknown_number_the_hs_catfish/"
    },
    {
        "id": "1n4mfqz",
        "author": "Glass_Addiction",
        "title": "The Thursday Murder Club’s ending made me so mad",
        "content": "I was really enjoying the movie and the comedy until the end. It was so bad, I kept expecting a last minute reveal but there was none. So this whole time you have Elizabeth, this former MI6 agent investigating four murders, and then she finally cracks them, and despite their morally ambiguous nature she takes them to the police anyway. Like Penny killed a man for a woman who would never get justice in the courts. Totally valid in my opinion! There was no justice for women in that day. And then you have Penny’s husband killing a piece of trash businessman to protect his wife. Again, I personally wouldn’t complain. But instead of understanding and saying “hm maybe we should not pursue this mystery” she confronts the husband which leads him to killing himself and his wife. And of course this is expected, because jail at that age?? Meanwhile, she lets a crime boss who cut off people’s fingers, steals people’s passports, and is essentially facilitating modern slavery live his life as a floralist because she wants the retirement home to stay open. Talk about double standards?! She has a moral superiority complex for sure. And the Polish guy, Bogdan, was literally just trying to escape what was essentially slavery to see his dying mother, and yet his story is ended when he’s arrested as well. It left such a sour taste in my mouth. These people, who had good reasons to do what they did, got arrested and a crime lord didn’t? And that’s just the end of the movie and Elizabeth gets to dance and pretend like she didn’t ruin three peoples lives? Like WTF??\n\nAlso what is it with everyone confessing to their crimes?? There was no evidence to prove Penny and her husband did anything, but he just admits to it with the slightest pressure. He would’ve been fine otherwise. And Bogdan telling Elizabeth’s husband even though he also had no evidence? Come on, lazy way to conclude the story.\n\nAnyway, TLDR it had so much potential but the ending ruined it",
        "upvotes": 86,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1n4mfqz/the_thursday_murder_clubs_ending_made_me_so_mad/"
    },
    {
        "id": "1n5g28k",
        "author": "BE_Tries",
        "title": "Unknown number - why a groupchat?",
        "content": "Okay i don’t know why this has been bothering me but why did the girls mom make a groupchat with her daughter and her bf?? she claims to have wanted to protect her daughter so why not message her daughter or the bf separately? the groupchat thing seems off. she was obsessed with the bf so why not just message him? i cannot wrap my head around this.\n\nthe groupchat thankfully led to the bfs mom to find out and really push push push to get this figured out. i think if the messages were being sent directly to just her daughter nothing would have been done to stop them since the daughters mom kept telling her to just ignore it and it wasn’t until the bfs mom got involved did things escalate. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n5g28k/unknown_number_why_a_groupchat/"
    },
    {
        "id": "1n5f5ei",
        "author": "thehealer2",
        "title": "Do you think Lynn and Exley had feelings for each other by the end of the movie L.A. Confidential from 1997.",
        "content": "When I watched L.A. Confidential movie, I couldn't help but feel that Lynn and Exley had this incredible chemistry than what she had with Bud. The way they looked at each other throughout the film made it seem like there were real feelings brewing between them. I’ve never seen her gaze at Bud like that; it was something else entirely when her eyes met Exley’s at the end during their goodbye.\n\nDo you think by the end of the movie, Lynn had developed some feelings for Exley? And maybe he felt something for her too, especially after that night they spent together.\n\nWhat do you think would have happened if Lynn had met Ed before Bud on Christmas Eve? Do you think she would have fallen for him? And what if Exley had been in Bud's shoes during their first encounter? \n\nWere the things Lynn said to Ed while trying to charm him actually true?\n\nWho do you all ship? I can’t help but imagine that after she gets to Arizona and finds out she’s pregnant, it could be Exley’s baby. Just a thought, haha!\n\nI’d love to hear your thoughts and opinions on all of this!",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/k5atftrrchmf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n5f5ei/do_you_think_lynn_and_exley_had_feelings_for_each/"
    },
    {
        "id": "1n5783l",
        "author": "Exhibit6",
        "title": "Does anybody know a fix for this? I restarted my console, changed HDMI cables, deleted and redownloaded the app. I’m at a loss. The menus work perfectly fine but once I start playing the videos it turns into this.",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rht40bj8ffmf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n5783l/does_anybody_know_a_fix_for_this_i_restarted_my/"
    },
    {
        "id": "1n545rr",
        "author": "Superderevo",
        "title": "What do you think of The Four Seasons?",
        "content": "I just finished the last episode. I picked it up from a random recommendation and knew pretty much nothing about it, but it ended up being unexpectedly fun. What do you think?",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n545rr/what_do_you_think_of_the_four_seasons/"
    },
    {
        "id": "1n568bc",
        "author": "Sudden_Pop_2279",
        "title": "KPop Demon Hunters tops Netflix’s all-time movie ranking, on track to surpass Squid Game - KED Global",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n568bc/kpop_demon_hunters_tops_netflixs_alltime_movie/"
    },
    {
        "id": "1n5dbkr",
        "author": "Chillburt_LaRouche",
        "title": "Craziest \"glitch\" ever?",
        "content": "So, I have 2 Nvidia Shields running Netflix in separate rooms of the house. Suddenly today, the main profile cannot select any title from the \"home\" menu, on either device. The craziest part is I can still select titles directly from the other menus (Shows or Movies etc.). Only the primary profile is affected, every other profile works just fine. There's no PIN, rating content is set properly. I signed out of all devices through the website etc. Basically, I tried everything. It's just super weird and I wonder if it's happened to anyone else. It was fine yesterday. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n5dbkr/craziest_glitch_ever/"
    }
]