[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oq6qz5",
        "author": "Significant-Fun-4235",
        "title": "'Monster' Season 4: Sarah Paulson to Play Aileen Wuornos (EXCLUSIVE)",
        "content": "",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oq6qz5/monster_season_4_sarah_paulson_to_play_aileen/"
    },
    {
        "id": "1oq3bpq",
        "author": "Goooooogol",
        "title": "What does everybody think of netflixes UI?",
        "content": "What i mean by this is the rows of shows you see on the homescreen.\n\nI personally hate how my List just moves seemingly at random when it should stay in a findable place, because it is difficult to remember what shows i wanted to watch if my list keeps moving locations. I know there is a button for it, but its easy to forget it’s there.\n\nI do think the Continue Watching and Watch List rows should stay at the top of the screen, and i have no idea why netflix makes finding them difficult from time to time.",
        "upvotes": 16,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1oq3bpq/what_does_everybody_think_of_netflixes_ui/"
    },
    {
        "id": "1oqflkd",
        "author": "OpeningFull6575",
        "title": "Are there any good anime live action adaptations?",
        "content": "So my mum hates anime, she thinks its weird and claims it is all pornagraphic. However she quite enjoys the Avatar Netflix live action show and we have bonded over Alice in borderland. Because of that I'm thinking of watching some live action anime addiptations with her. My current plans are:\n\n1. The zom 100 movie\n2. The one piece liveaction show (I've never watched the anime so I wouldnt have the issue to comparing them)\n3. Maybe one of the kakegurui liveactions. I adore the anime so I'm scared of how bad they'll be, but I don't wanna write them off\n\nI have most streaming services, though I don't have crunchyroll.",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1oqflkd/are_there_any_good_anime_live_action_adaptations/"
    },
    {
        "id": "1oqb4ea",
        "author": "Zehealingman",
        "title": "What did Inside Job do wrong?",
        "content": "I‘m being serious and hoping to gain external input to balance out my own perception and biases.\n\nIt feels like in a vacuum, Inside Job had everything it needed to at least finish the story it tried to tell.\n\nIt had a, in my opinion, highly differentiated setting that was directly connected to the current cultural zeitgeist with its focus on conspiracy theories and media manipulation. \n\nThrough that setting, it had touchpoints with „older“ generations (Moon landing conspiracies, JFK), younger generations (Social Media and media in general) and everything in between with stuff like the Illuminati. \n\nIt had two main characters that had tangible growth and a supporting cast that had its moments.\n\nIt had personal storytelling which included parenthood and trauma.\n\nIt feels like all of the above could be attributed to shows like Hazbin or Southpark which are going strong. \n\nI know media is more complex than being a checklist. But what happened? Did Netflix calculate KPIs that were too unrealistic? Did it not resonate?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oqb4ea/what_did_inside_job_do_wrong/"
    },
    {
        "id": "1opwhdu",
        "author": "Immediate_Strike7720",
        "title": "Alice in Borderland 3",
        "content": "Has anyone watched this and felt like this season was a massive letdown? I feel like if they had stopped at 2 seasons it could’ve been great, personally I feel season 3 was all over the place ",
        "upvotes": 22,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1opwhdu/alice_in_borderland_3/"
    },
    {
        "id": "1opx9wa",
        "author": "Sufficient-Curve2951",
        "title": "Lena Heady and Gillian Anderson in a Western drama!!???",
        "content": "As a Gillian Anderson fan, I am so excited to see her in The Abandons. Two brilliant actresses butting heads on-screen and finally a Western with two strong female characters. WOWW The cast also looks stacked!!",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1opx9wa/lena_heady_and_gillian_anderson_in_a_western_drama/"
    },
    {
        "id": "1opyw3e",
        "author": "sonofanadultfilmstar",
        "title": "The Blacklist",
        "content": "This came  up on my “things you may like” section. It looks like a show I would definitely enjoy. And love James Spader.\n\nI wanted to ask though - is this a show that’s like CSI or Law and Order where each episode is different or is it like Breaking Bad/Prison Break where the episodes do go together throughout each season? ",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1opyw3e/the_blacklist/"
    },
    {
        "id": "1op5qxs",
        "author": "EchoNarwhal812",
        "title": "Which actor completely carried a Netflix show",
        "content": "For me it has to be Rami Malek in Mr. Robot. Even though it originally aired elsewhere, watching it on Netflix now just hits different. The way he plays Elliot awkward, brilliant, paranoid, and somehow still relatable makes the whole show work. Without him, it wouldn’t be half as powerful.\n\nYeah I know it might not be a real \"Netflix\" show but it is on Netflix. What really stuck with me wasn’t just the story, but how real the underlying themes felt. The hacking, the data breaches, the constant sense that someone’s always watching it all got under my skin. I ended up going down a massive rabbit hole learning about cybersecurity, privacy tools, and how vulnerable most people really are online.\n\nNow I actually use different VPNs depending on what I’m doing, run privacy tools to wipe old data, and even started monitoring data leaks with cloaked just to see how often our information ends up exposed. It’s wild how a show meant for entertainment can completely change how you see technology and the world around you.",
        "upvotes": 249,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1op5qxs/which_actor_completely_carried_a_netflix_show/"
    },
    {
        "id": "1oqb8xd",
        "author": "Puzzleheaded-Wear381",
        "title": "The Witcher S4",
        "content": "How much did it affect you to see another actor in the role?\n\nAlthough I must say that Liam Hemsworth often made me confuse him with Henry, I'm left wondering if he was trying so hard to be the witcher or to be Henry's witcher...",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqb8xd/the_witcher_s4/"
    },
    {
        "id": "1oqakj5",
        "author": "Unusual_Oil_9106",
        "title": "Why can't I watch lord of war in Canada?",
        "content": "I searched Lord of War in google and the description says it isn't available in my country but when I click on it it says it isn't available because of licensing restrictions on a non-ad free plan. Which is it? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oqakj5/why_cant_i_watch_lord_of_war_in_canada/"
    },
    {
        "id": "1ope43t",
        "author": "BrideofBazza",
        "title": "Cancel for elderly parents",
        "content": "My parents have moved into assisted living and are no longer using their Netflix account.  Their tv is gone so do t have access. I have no idea what email/phone they used to set it up. \nThey are being charged $24.99/month and I have no idea how to stop it. Any suggestions? \n\n",
        "upvotes": 72,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1ope43t/cancel_for_elderly_parents/"
    },
    {
        "id": "1oq2skp",
        "author": "LandscapeNarrow5352",
        "title": "Stranger Things: Tales From ‘85 | Official Announcement | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oq2skp/stranger_things_tales_from_85_official/"
    },
    {
        "id": "1oq7l69",
        "author": "AdPrestigious7952",
        "title": "Apple TV Netflix “Not Part of Household”",
        "content": "I’ve been having ongoing issues with Netflix showing the message: “This device isn’t part of your household.”\nMy household and I are the only ones using our devices, but this message keeps coming up. I have several Apple TVs, and some are on different internet providers (for example, at a cabin or secondary location). On Apple TV, it doesn’t even give me the option to send a code — it only lets me “switch households” or “update the household,” depending on the language.\nHas anyone else run into this or found a fix? I’m starting to think something’s messed up with how Netflix is detecting my devices. Any troubleshooting tips or settings I can try before I give up and cancel would be appreciated.\n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oq7l69/apple_tv_netflix_not_part_of_household/"
    },
    {
        "id": "1oq7egh",
        "author": "Transitionals",
        "title": "RANT: Synchronization across devices",
        "content": "The synchronization across devices has been really crappy.\n\n1. When I stop in middle of episode on ipad, it doesn’t reflect on TV\n\n2. If I start on season 2 episode 3 and have watched season 1 episode 5 one year ago on TV, the series starts at s1 e6 on TV\n\n3. If I click too early on “Next episode” button. it assumes that I have not watched that episode. So if I do it on 5th episode, and say I am on 8th later. Everytime I open the app, it takes me back to 5th episode.\n\nI cant believe for an ultra premium service and platform, this feature has been so full of bugs!!\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oq7egh/rant_synchronization_across_devices/"
    },
    {
        "id": "1oq34vh",
        "author": "odlynuff",
        "title": "Soulmates",
        "content": "Im just curious what do you guys/lady's think about this show I know its cheesy but does anyone think that theres some reality behind it like if we actually have Chemical soulmates or not",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oq34vh/soulmates/"
    },
    {
        "id": "1oqenp6",
        "author": "Ok_Repeat_1758",
        "title": "Ayúdame con internet y netflix",
        "content": "Hola que tal, verás que tengo una cuenta de netflix y estoy pensando en cambiarme de compañía de internet que me incluye en su plan internet + netflix, mi pregunta es ¿si tengo ese plan, podría ver netflix en otra casa con mi celular o tablet? Es decir si me quedo a dormir en la casa de un primo aun puedo ver netflix o necesito conectarme a la red de compañía que contrate en mi casa",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oqenp6/ayúdame_con_internet_y_netflix/"
    },
    {
        "id": "1opcoii",
        "author": "LandscapeNarrow5352",
        "title": "'KPop Demon Hunters 2' Aims for 2029 Release",
        "content": "",
        "upvotes": 36,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1opcoii/kpop_demon_hunters_2_aims_for_2029_release/"
    },
    {
        "id": "1opzoiv",
        "author": "Hackedbytotalripoff",
        "title": "Best show to watch after enjoying the Sinner season one show",
        "content": "The Sinner season 1 was a blast.  Season 2 is okay, considering the heightened expectations after the quality of Season 1.  \n\nWhat show would you suggest watching after enjoying   \"The Sinner season 1\"?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1opzoiv/best_show_to_watch_after_enjoying_the_sinner/"
    },
    {
        "id": "1opy3xe",
        "author": "simsirisic",
        "title": "What ‘The Diplomat’ gets right (and wrong)",
        "content": "Just read this list of what *The Diplomat* gets right and where it misses the mark when it comes to portraying real-world diplomacy. Some scenes felt surprisingly authentic. Others… not so much (let’s just say, not every ambassador has that much dramatic flair or unilateral power).\n\nCurious to hear your take: What felt accurate to you, and what seemed off-base? Especially from those with firsthand experience or deep interest in international relations.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1opy3xe/what_the_diplomat_gets_right_and_wrong/"
    },
    {
        "id": "1opy2rm",
        "author": "I_AmBetterThanY0u",
        "title": "Unable to play GTA SA due to \"Profile not having access to games with this maturity level\", when there are no viewing restrictions on my profile whatsoever, but works perfectly fine on other profiles with the same exact settings, how to fix?",
        "content": "Unable to play GTA : San Andreas due to \"Profile not having access to games with this maturity level\", when there are no viewing restrictions on my profile whatsoever, but works perfectly fine on other profiles with the same exact settings, looking for a fix.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1opy2rm/unable_to_play_gta_sa_due_to_profile_not_having/"
    },
    {
        "id": "1oowdtv",
        "author": "chashows",
        "title": "'Nobody Wants This' Renewed for Season 3 at Netflix",
        "content": "",
        "upvotes": 197,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1oowdtv/nobody_wants_this_renewed_for_season_3_at_netflix/"
    },
    {
        "id": "1opwu18",
        "author": "soravp",
        "title": "Witcher S4 Geralt end name confusion?",
        "content": "Spoilers for S4.\n\n\n\nSo when Geralt gets knighted at the end he is dubbed Geralt of Rivia, by the queen of Rivia (who only knew his name was Geralt), however he already went by this title? And Jaskier even makes a song with that name...\n\nAm I misunderstanding something? \n\nIs it just a massive convenience? Is the show trying to retcon something? Is this also what happens in the books? Very confused.\n\n\nEDIT: Question answered. Thank you for your responses. ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1opwu18/witcher_s4_geralt_end_name_confusion/"
    },
    {
        "id": "1opmkvl",
        "author": "Unlucky-Carpenter9",
        "title": "Boot Camp, Brothers in Arms &amp; a Secret Self—Why Boots is a Must-Watch",
        "content": "Hey all! Just finished watching *Boots* on Netflix and had to jump into r/netflix to share—and I highly recommend it if you haven’t seen it yet.\n\nFirst off: the brotherhood. The camaraderie between recruits under pressure, the friction, the breakdowns, the reunions—every bit of it felt *real*. You’ll find yourself rooting for them when they clash, and cheering when they pull together.\n\nNext: the character work is super nuanced. None of the characters are just “soldiers in training”—each has layers, vulnerabilities, secrets. That makes them all worth your time.\n\nAnd yes—it *does* explore hidden identities. Sgt. Sullivan (played by Max Parker) is this tough-as-nails, by-the-book drill instructor, but beneath the bark there’s a closeted truth, a personal weight. Parker nails it. \n\nWhile the first season sets things up brilliantly, there are still threads left open—so yes, I’m all in for Season 2!!!\n\nIf you’re into shows that blend **military grit + growth + brotherhood + queer undercurrent**, this is your kind of watch.\n\nSo… who else has seen it? Which character struck you the most? And what do you hope to see in Season 2?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1opmkvl/boot_camp_brothers_in_arms_a_secret_selfwhy_boots/"
    },
    {
        "id": "1opclr7",
        "author": "the_trend_memo",
        "title": "Netflix Reveals Massive Scale of Ad Business: 190 Million Monthly Active Viewers",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1opclr7/netflix_reveals_massive_scale_of_ad_business_190/"
    },
    {
        "id": "1oq0vnb",
        "author": "JCraig96",
        "title": "Why is my video quality so bad?",
        "content": "I have Netflix on my pc, I have the standard version with ads. Now, it says that the video and sound quality is good, with the resolution being 1080p (full HD). So tell me why when I actually watch shows and movies, the quality is terrible, borderline unwatchable! When it first comes on, the quality is good, but then, before long, the resolution just gets worse and worse as time goes on. \n\nWhat's happening?! I even went to the playback settings and clicked on high data usage, where it's supposed to show the best video quality for my plan. But still, the poor quality doesn't change, it's still horrible regardless. So idk what's going on. \n\nDoes it have something to do with it being on pc? Or the type of plan that I have? Has anyone eles experienced the same thing? Does anyone know what to do?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oq0vnb/why_is_my_video_quality_so_bad/"
    },
    {
        "id": "1opsanm",
        "author": "Specialist-Change-86",
        "title": "I have a theory regarding one of Ginny &amp; Georgia Season 4 cast additions",
        "content": "Sunny Mabrey is playing Daisy, but we don't have a character description for her. Considering Daisy is also Georgia's mother's name, are we getting Ginny's maternal grandmother? What is your theory? Source link:\n\n[https://www.soapcentral.com/shows/ginny-georgia-season-4-added-three-new-members-cast-find](https://www.soapcentral.com/shows/ginny-georgia-season-4-added-three-new-members-cast-find)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1opsanm/i_have_a_theory_regarding_one_of_ginny_georgia/"
    },
    {
        "id": "1opjhly",
        "author": "Upstairs-Film-3400",
        "title": "How to stop automatic trailers after show but keep previews on main menu?",
        "content": "Is it possible? I tried un checking the box that says to automatically play previews but it also affects the automatic previews while you're browsing the maine menu. I WANT to see a little preview of each show to give me an idea of it. I do NOT want Netflix to play five billion trailers in a row after my movie is over and I'm either digesting what I just saw or falling asleep or whatever lol. \n\nPlease, is there a way to just change one of these things? Why in the world can't they be separate things in settings? They're definitely two very different things?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1opjhly/how_to_stop_automatic_trailers_after_show_but/"
    },
    {
        "id": "1opn6jx",
        "author": "baguetteworld",
        "title": "Why does Uncle Joe keep speaking English in Rabo de Peixe (Turn of the tide)?",
        "content": "Not sure what the best sub is for posting this question, but Rabo de Peixe is a show about an Azores island in the Atlantic but uses all Portuguese mainland actors. However one of the characters, Uncle Joe, is also the narrator and his character spent a bit of time in the US but now lives back in the same island he was born in. However in the show he keeps speaking English to all the Portuguese characters (I mean he’s also Portuguese himself), and they respond in PT and everyone just chugs along. It just strikes me as very weird when both the actor and the character are supposed to be Portuguese first and foremost. Any idea why?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1opn6jx/why_does_uncle_joe_keep_speaking_english_in_rabo/"
    }
]