[
    {
        "id": "1gwj4n3",
        "author": "ThePianoLessonAMA",
        "title": "Hi, /r/movies! I am Malcolm Washington, director and co-writer of 'THE PIANO LESSON', starring Samuel L. Jackson, John David Washington &amp; Danielle Deadwyler. It will be released on Netflix tomorrow— Ask me anything!",
        "content": "",
        "upvotes": 167,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ggeqp7uu5a2e1.jpeg?auto=webp&amp;s=9268aa985f3b12b6467a944b05f5a56dd9daca98"
        },
        "permalink": "/r/movies/comments/1gwj4n3/hi_rmovies_i_am_malcolm_washington_director_and/"
    },
    {
        "id": "1gwxy96",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Gladiator II / Wicked: Part I)",
        "content": "[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/?)\n\n[Wicked: Part I](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/?)",
        "upvotes": 121,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1gwxy96/official_discussion_megathread_gladiator_ii/"
    },
    {
        "id": "1gz4cl8",
        "author": "MarvelsGrantMan136",
        "title": "Official IMAX Poster for 'Nosferatu'",
        "content": "",
        "upvotes": 605,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x6tn5dojlx2e1.jpeg?auto=webp&amp;s=c8b53b807b9dca797be35bcfd9fdf23382433e30"
        },
        "permalink": "/r/movies/comments/1gz4cl8/official_imax_poster_for_nosferatu/"
    },
    {
        "id": "1gz18he",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for the 4K Restoration of ‘Black Christmas’ (In Theaters Dec 7-22)",
        "content": "",
        "upvotes": 593,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fn0ayc58xw2e1.jpeg?auto=webp&amp;s=c830de54d0ba7d40cebff9f9742f6de5fd005546"
        },
        "permalink": "/r/movies/comments/1gz18he/official_poster_for_the_4k_restoration_of_black/"
    },
    {
        "id": "1gyz3k6",
        "author": "ClaraReed",
        "title": "Watching The Village made me laugh at a Simpson joke 20 years later. ",
        "content": "Mild spoilers for The Village. \n\nSo in one Treehouse of Horror episode, everyone dies in Springfield except Homer because he's testing out a bomb shelter. After enjoying the empty town a while, he discovers that not everyone died, but some were transformed into hideous mutants. His first response is \"Where did you get those cloaks?!\" I thought this was a lame/lazy joke and didn't snicker at all. \n\nWhen I watched The Village and the monster is chasing Bryce Dallas Howard, my reaction while it was stalking her through the forest was, \"How can a monster die fabric such a bright red?!\" That bothered me more then the fact it had a cloak at all. I can suspend disbelief to think it threw on a tattered robe or something, but a well-made vivid red cloak had me scoffing. Suddenly the Simpsons joke clicked and was humorous to me. \n\nThat's all. ",
        "upvotes": 622,
        "comments": 120,
        "media": null,
        "permalink": "/r/movies/comments/1gyz3k6/watching_the_village_made_me_laugh_at_a_simpson/"
    },
    {
        "id": "1gyvb8q",
        "author": "sparklight07",
        "title": "The secret life of walter mitty ",
        "content": "I just watched this film recently and i hoping this is the right sub for this but i love it i love how the protagonist is gentle and realistic and for me atleast quite a bit relatable (i tend to daydream a lot than take action) . The landscapes were so beautiful and it just gave a whole whimsical feel to the movie. I also loved how they ended the movie on a hopeful tone and i loved the the growth of walter and the acting was just phenomenal the characters weren’t overly loud but kept me hooked the whole time. \nThe movie definitely deserves more adoration than it has",
        "upvotes": 773,
        "comments": 240,
        "media": null,
        "permalink": "/r/movies/comments/1gyvb8q/the_secret_life_of_walter_mitty/"
    },
    {
        "id": "1gyyqi1",
        "author": "MarvelsGrantMan136",
        "title": "Michael Villella Dies: ‘The Slumber Party Massacre’ Star Was 84",
        "content": "",
        "upvotes": 411,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yP9gUkiqEbFqtw98n-8H35vxLSUyR29TvRxTOVruz3g.jpg?auto=webp&amp;s=bcb92c14db4407f579fe622f9191b04200b46b5c"
        },
        "permalink": "/r/movies/comments/1gyyqi1/michael_villella_dies_the_slumber_party_massacre/"
    },
    {
        "id": "1gywiy7",
        "author": "BunyipPouch",
        "title": "Maria Bakalova ('Borat Subsequent Moviefilm') &amp; Peter Mullan ('Trainspotting') To Star In ‘No Way Off’' - A single-location thriller about a young mother trapped on a bus with her baby after being abducted by its sinister driver.",
        "content": "",
        "upvotes": 448,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pRm_iZMPxZn0qdcjVMADBpw6wzbrC7UFbcaVG6KS4bw.jpg?auto=webp&amp;s=e601392630fc610667a7fbe728107148246c8be6"
        },
        "permalink": "/r/movies/comments/1gywiy7/maria_bakalova_borat_subsequent_moviefilm_peter/"
    },
    {
        "id": "1gz13n9",
        "author": "Snickerdoodlepop",
        "title": "What are your \"No Shame\" movies?",
        "content": "People may judge you for it. But you will die on the hill that it is a good movie that you loved watching.\n\nI'll start. Many come to mind (pretty thick skinned) so will give you three- \nWolverine origins (I loved wolverine right from xmen animated series, and although was surprised they got Hugh for it, I loved it. I still like origins with all its plotholes).\n\nJohn Carter- wtf? I still cant believe this didnt do well.\n\nHook- There is no.chance. that someone will tell me this is a bad movie. ROBIN WILLIAMS &lt;3\n\nEdit: There are so many great movies. I am surprised manybif them are rated badly. I wonder if there is a way to see the amount of upvotes on each of the comments ",
        "upvotes": 205,
        "comments": 914,
        "media": null,
        "permalink": "/r/movies/comments/1gz13n9/what_are_your_no_shame_movies/"
    },
    {
        "id": "1gz1w71",
        "author": "markorokusaki",
        "title": "The Mask of Zorro (1998) is such an amazing movie",
        "content": "I can't believe I have skipped on seeing it. I was 10yrs old when it came out. I remember I could rent it on vhs but somehow never came to doing it. And I stumble on it somewhere on the net and I was like let's see it. My god what a wonderful movie. It has the same beautiful energy like an Indiana Jones movie. Acrobatics, action, good energy, practical effects. I will watch it again with pleasure. ",
        "upvotes": 116,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1gz1w71/the_mask_of_zorro_1998_is_such_an_amazing_movie/"
    },
    {
        "id": "1gytanm",
        "author": "beyphy",
        "title": "Win, Lose, or Drama: A Woman Under the Influence at 50",
        "content": "",
        "upvotes": 142,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6rlgYf6ttNYM0tk_M5IVOVi8GG1N9etb-T-uOYFPry8.jpg?auto=webp&amp;s=a00cf787cf5f5b8ca3d129ef2fb1c08715d126c8"
        },
        "permalink": "/r/movies/comments/1gytanm/win_lose_or_drama_a_woman_under_the_influence_at/"
    },
    {
        "id": "1gye700",
        "author": "BunyipPouch",
        "title": "First Poster for Irish Folk-Horror 'The Fetch' - Following the death of his only son, a grieving father is haunted by a terrifying demon known in Irish folklore as the Fetch.",
        "content": "",
        "upvotes": 2201,
        "comments": 154,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4c1fjas8uq2e1.jpeg?auto=webp&amp;s=f5f328097d4ea63ce17f6cf9d05ed6d4dfbe4cf1"
        },
        "permalink": "/r/movies/comments/1gye700/first_poster_for_irish_folkhorror_the_fetch/"
    },
    {
        "id": "1gy8j0o",
        "author": "KillerCroc1234567",
        "title": "Jon Watts Explains Demise Of George Clooney &amp; Brad Pitt ‘Wolfs’ Sequel After Streaming Pivot",
        "content": "",
        "upvotes": 5059,
        "comments": 565,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bt1WW0e48G1WP96_OqXjyUaZBIZAgGTsN03DatHjVRY.jpg?auto=webp&amp;s=31f4a39e95284b47141bcfd4f523573eff18337b"
        },
        "permalink": "/r/movies/comments/1gy8j0o/jon_watts_explains_demise_of_george_clooney_brad/"
    },
    {
        "id": "1gym0e1",
        "author": "mxm2004",
        "title": "Has any actor hit the First Responder trifecta?",
        "content": "My roommate is watching The Frozen Ground in which Nicholas Cage is playing a police detective. Then we were talking about he movies and I mentioned Bringing out the Dead where he plays a paramedic. That got me thinking of this question. Cop films are a dime a dozen, but the other two are fairly rare. Can anyone think of any actor who hit this trifecta?",
        "upvotes": 494,
        "comments": 277,
        "media": null,
        "permalink": "/r/movies/comments/1gym0e1/has_any_actor_hit_the_first_responder_trifecta/"
    },
    {
        "id": "1gyceny",
        "author": "MovieMike007",
        "title": "The 2024 Box-Office Top Ten Are All Sequels.",
        "content": "",
        "upvotes": 1289,
        "comments": 304,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nWoC2rz-DoOhFVSJ3GVRWLuw9lbJB_5E6s4djLGY80o.jpg?auto=webp&amp;s=b460908620960ffea814b3960f67a1fe2c9a78a5"
        },
        "permalink": "/r/movies/comments/1gyceny/the_2024_boxoffice_top_ten_are_all_sequels/"
    },
    {
        "id": "1gz1yd3",
        "author": "FelineFiendz",
        "title": "How ‘The Piano Lesson’ Builds on Denzel and Pauletta Washington’s Family Legacy With Malcolm, John David and Katia Washington Taking the Lead",
        "content": "",
        "upvotes": 20,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sm8EBp7r7dThUIIS8RA1-JH90iyHo6zffhu0HNaAHcU.jpg?auto=webp&amp;s=2169c3532150df7a9426e887258377b17f9281d4"
        },
        "permalink": "/r/movies/comments/1gz1yd3/how_the_piano_lesson_builds_on_denzel_and/"
    },
    {
        "id": "1gyl86o",
        "author": "Intelligent_Mix716",
        "title": "Just re-watched Rocky Horror Picture Show. What modern actor do you think could play Dr. Frank-N-Furter as well as Curry?",
        "content": "I love Tim Curry's performance, he just has so much fun with that role and it shows. In my opinion, it's one of the best performances ever. It's a character you have to put all of your energy into. I was thinking John Leguizamo but, maybe it was his role as Chi-Chi in To Wong Foo, Thanks for Everything! Julie Newmar. I don't think this movie should really get a remake or anything, I'm just curious who could pull it off as fantastically as Curry did almost 50 years ago. ",
        "upvotes": 243,
        "comments": 626,
        "media": null,
        "permalink": "/r/movies/comments/1gyl86o/just_rewatched_rocky_horror_picture_show_what/"
    },
    {
        "id": "1gyej4i",
        "author": "ArgoverseComics",
        "title": "Plot twists so cliche it would have been more of a twist to have no twist?",
        "content": "Spoilers for the movies Prometheus and Reindeer Games (apologies to all those people who are still holding out for that epic Reindeer Games twist)\n\nWhen I went to watch Prometheus when it released, I just kinda knew that Vickers was Weyland’s daughter. When she actually says it at the end and the music plays it like it’s a twist, I was like “wait, this wasn’t just a given? I thought this was crystal clear from the beginning?” \n\nThere’s a few movie twists like that where the director clearly thought it was a twist and you’re just like… really? THAT is a twist? It would have been a bigger twist for that NOT to be the case. \n\nThe other one for me was Charlize Theron being a bad guy in Reindeer Games. The whole time I was watching it I just kept waiting for the moment she’d do something psychotic. And she does. \n\nBy the way what doesn’t count is if everyone kinda new going into a big franchise movie what would happen. Like a lot of people went into Infinity War 99% sure a lot of people were going to die. That doesn’t really count. I’m talking movies that at least pretended like you were supposed to be surprised by a twist. ",
        "upvotes": 661,
        "comments": 866,
        "media": null,
        "permalink": "/r/movies/comments/1gyej4i/plot_twists_so_cliche_it_would_have_been_more_of/"
    },
    {
        "id": "1gytgyi",
        "author": "BunyipPouch",
        "title": "‘Los Frikis,' From Producers Phil Lord and Chris Miller and 'Peanut Butter Falcon' Directors, Lands U.S. Distribution and Christmas Day Release - Starring Adria Arjona ('Hit Man'), it's the true story of 1990s Cuban punk rockers who deliberately injected HIV in search of freedom.",
        "content": "",
        "upvotes": 41,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fJb24PIXXLr9rH3L8QehdZxdMMzLMFwGwvDTJ7tyHxc.jpg?auto=webp&amp;s=45c5efe1f5cc2d98e789e5e6884dbc75126131a1"
        },
        "permalink": "/r/movies/comments/1gytgyi/los_frikis_from_producers_phil_lord_and_chris/"
    },
    {
        "id": "1gyw5hq",
        "author": "Latter_Possession786",
        "title": "Before Sunrise (1995)",
        "content": "There are not so many movies which show you little things of life, revolving around doing common things but yet leave you with admiration and feeling incomplete. \n\nAdmiration because this movie was literally a visual depiction of eccentric love.   \nIncomplete because seeing them goodbye and not reuniting was depressing. I know they ended up for good but a little 10sec clip of 1 year later, He standing on the same location with flowers and she runs up to him with tears running down her cheeks and they just kissed and THE END, It would’ve been a perfect enclosure for the story. ",
        "upvotes": 27,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1gyw5hq/before_sunrise_1995/"
    },
    {
        "id": "1gytug9",
        "author": "Musicferret",
        "title": "My experience with Conclave.  What was yours?",
        "content": "I had the night without kids or wife and, being socially inept, decided to go to a movie alone rather than anywhere I’d have to socialize.   \n\nI quickly checked rotten tomatoes and chose Conclave, rejecting Smile 2.     I didn’t watch trailers and incorrectly assumed Conclave was a horror movie, which would be my type of thing.  \n\nI was not prepared for what I watched.   \nThe best word I could come up with:       \n\nGRIPPING.      \n\nThe theatre was 1/3 full at best, but I swear that not a single person left to use the washroom or gets refreshments in the first hour of the film.    The characters, the process, the intrigue pulled you in to such an extent that  there wasn’t a moment to quickly step out that you might find in other movies.    \n\nThe movie challenged social and religious conventions.   It managed to have you suspect virtually every major character of skullduggery at some point in the film.        \n\nThe church and its warts were on display, from treatment of women to racism, regionalism, and modernity.        \n\nIt was the weaving of so many individual stories, the unknowns of a dead man’s thoughts and intentions, the political intrigue….. all together drawing you in like so many strands of spider silk making it impossible to look away.         \n\nSo there it is.   My first post to this sub, all because I absolutely loved a movie I had no preconceived notions about.   \n\n10/10, would conclave again.    ",
        "upvotes": 36,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1gytug9/my_experience_with_conclave_what_was_yours/"
    },
    {
        "id": "1gys00i",
        "author": "Bezbozny",
        "title": "Top ten first movies you have or would share with your kids as they grow up?",
        "content": "I sometimes think about which movies had a deep effect and meaning to me as a kid and wonder what I might share with my own kids some day. A lot of them continue to effect me to this day into my adulthood, so I take seriously that whatever I choose would also leave a permanent mark on them. There is crossover, but it's also significantly different than my plain old \"Top ten movies\" list.\n\nI think my list would be, in no particular order:\n\n1. Homeward Bound (DOGS)\n\n2. Angels in the Outfield (Best most heartfelt kids sports movie)\n\n3. Back to the Future (It will be hilarious to show them a movie about the far off future of 2015)\n\n4. Just blanket all the Disney movies from the 90s (I miss 2d)\n\n5.  Independence Day (Gotta teach them how to be patriotic and not go quietly into the night)\n\n6. Die hard (They need to grow some hair on their chest too, a little action is a must)\n\n7. Star wars, original trilogy (Yeah its basic, but its also important to me)\n\n8. Singing in the Rain (Every kid loves \"Make 'em laugh\", no exceptions)\n\n9. Galaxy quest (the best Star trek movie lol)\n\n10. Iron Giant (\"I go. You stay. No following.\" tell me you didnt just tear up right now)\n\nWhat about yours?",
        "upvotes": 36,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1gys00i/top_ten_first_movies_you_have_or_would_share_with/"
    },
    {
        "id": "1gz6y4d",
        "author": "PrettyYak444",
        "title": "Limitless (2011)",
        "content": "A couple of months ago, I got high and watched Limitless (2011), and it was an incredible experience. Now, I’m planning to do the same and want to watch a similar movie. I’m looking for films that explore themes like enhanced intelligence, altered states of mind, or thought-provoking concepts with engaging visuals and gripping narratives. Any recommendations?",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1gz6y4d/limitless_2011/"
    },
    {
        "id": "1gys6xi",
        "author": "Beneficial_Air4714",
        "title": "Movies like Juno/Perks Of Being A Wallflower? ",
        "content": "I recently watched both Juno and Perks Of Being A Wallflower for the first time, and they both just hit me in a way I didn’t expect. They’re the first movies that felt like they touched my heart and soul in a while (if that makes sense). Are there any other movies out there similar to these two? I’ll take any recommendations, I’d love to find more gems like these 2. ",
        "upvotes": 24,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1gys6xi/movies_like_junoperks_of_being_a_wallflower/"
    },
    {
        "id": "1gyjyaz",
        "author": "80severything",
        "title": "Cocoon is a fantastic film from the 80s ",
        "content": "This film was an academy winner and a huge box office draw and did extremely well in rentals, but in the past 20 some years it's become more famous for how widely unavailable it is in the states.  It's a really heart warming sci fi drama with touches of comedy.  It was previously released on DVD and blu ray but they are both long out of print and have never been given another release, it's not even available for streaming.\n\nSome people believe it may have something to do with music clearance rights with the soundtrack but there is no definite answer as to why Disney and 20th Century Fox haven't given this gem a new release.  ",
        "upvotes": 133,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1gyjyaz/cocoon_is_a_fantastic_film_from_the_80s/"
    },
    {
        "id": "1gy2ucc",
        "author": "BunyipPouch",
        "title": "‘The Wild Robot’: Production Designer Raymond Zibach Discusses How They Added A \"Hand-Painted\" Effect To The Animated Style - Concept Art Released",
        "content": "",
        "upvotes": 1368,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bX7dkPAQKVKydpb5R9sxfjJKg3twTi0rypFbO8n2PAQ.jpg?auto=webp&amp;s=2be9769c20b604ce522ed43af616686a3c321860"
        },
        "permalink": "/r/movies/comments/1gy2ucc/the_wild_robot_production_designer_raymond_zibach/"
    },
    {
        "id": "1gz6o9l",
        "author": "PuzzleheadedTell8871",
        "title": " Question: \"Rebel Ridge\" ending. ",
        "content": "Question: \"Rebel Ridge\" ending.   \nSpoilers ahead!  \nWere the police in the cars at the end that was pursing them, the same ones that they were at the station and in a fire fight with them? That seems the case, then why did they all suddenly switch sides and arrest their chef instead?\n\nThere is a stupid rule that the post neeeeeeeds 300  characters, so the rest of this writtttting is just a filler.  \n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1gz6o9l/question_rebel_ridge_ending/"
    },
    {
        "id": "1gykxfq",
        "author": "Quinn_Maeve",
        "title": "Violent Night",
        "content": "I was looking for a great Christmas movie to watch and since I’ve always loved Christmas movies for how they make me feel good, I decided to give this one a try. Honestly, I wasn’t expecting much because a lot of new releases nowadays feel kind of corny. But this one completely surprised me. It made me laugh, and I didn’t expect it to be this good! I was hooked from start to finish, especially with how the plot took unexpected twists that kept me on the edge of my seat. The way the real Santa Claus stepped up in the story gave me chills, it was like watching a Christmas John Wick.\n\nI’m here to appreciate a fun movie, not a film class analysis but I’d give it a solid 7 because I loved Santa Claus in this movie! Sure, it’s violent (the title says it all), but it was so good and it made me laugh, so I had to write about it here. If you still haven’t watched it, go check it out. I wish Santa was real and honestly, that version of Santa was super cool!",
        "upvotes": 70,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1gykxfq/violent_night/"
    },
    {
        "id": "1gy2rob",
        "author": "trampaboline",
        "title": "“Tick, Tick… Boom!”, “Inside Llewyn Davis”, and art as identity. ",
        "content": "A quick read on the “tortured artist” trope in two very different movies. ",
        "upvotes": 927,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/E5mitX_AZuuyoV8TNLA85ZqEH3amjoTV4CZzfgg-JhQ.jpg?auto=webp&amp;s=61f7c6d76f1e714c3228150b11a26d1db297c4f2"
        },
        "permalink": "/r/movies/comments/1gy2rob/tick_tick_boom_inside_llewyn_davis_and_art_as/"
    },
    {
        "id": "1gymajm",
        "author": "Whore_Choir",
        "title": "Revisited Mulholland Drive",
        "content": "I haven’t seen this movie since 2005 but just rewatched it and it blew my mind. Incredible performances, balanced surrealism, and insanely ahead of its time in my opinion. The “silencio” performance scene stands out to me. The emotions in this movie, the dream like states, the conspiratorial scenes; it all comes together in such a cohesive way. I’m reminded of when they intro Betty, and she’s overacting positivity to the degree of a 1940s American film, almost certainly deliberately. And then the cut to her grandparents smiling maniacally as they take a cab. David Lynch is almost like the Ween of movies, his films capture all genres. Like in Mulholland Drive, there’s horror, drama, comedy, romance, suspense, mystery, and more. This film is an insane achievement for David Lynch in my opinion. ",
        "upvotes": 26,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1gymajm/revisited_mulholland_drive/"
    },
    {
        "id": "1gyw3kk",
        "author": "pennybones",
        "title": "Lost Media: Marmaduke Christmas movie.",
        "content": "Hey guys, I was hoping to get your help finding a childhood favourite Christmas movie I can't even seem to find any info about online.\n\nEvery year around the start of December my siblings and I would watch a movie we had called \"Marmaduke's Big Dog Christmas\". We had it on VHS and we absolutely loved it. \n\nIn particular there was a song in the movie called \"Barking up the Wrong Christmas Tree\". We would constantly sing this song, driving our parents crazy. \n\nSometime after we all moved out and became adults we lost this tradition and the VHS seems to have disappeared, probably thrown out with other old stuff by our parents when cleaning. \n\nI can't find a single reference to this movie online, I even looked for some kind of Marmaduke Christmas movie in case I had the name wrong but nothing seems to exist.\n\nDoes anyone remember this movie or have any info? I KNOW it was real but somehow got lost to time. Any info is appreciated.",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1gyw3kk/lost_media_marmaduke_christmas_movie/"
    },
    {
        "id": "1gz7j8a",
        "author": "XpuddleglumX",
        "title": "Looking for name of type of comedy movie ",
        "content": "I'm pretty sure the genre started with Police Academy, but this brand of comedy where a band of specialized misfits is assembled to form a super group is among my absolute favorite. What is it called? Other movies I can think of in similarity: Major League, the Replacements, Down Periscope... there has to be many I'm not thinking of. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1gz7j8a/looking_for_name_of_type_of_comedy_movie/"
    }
]