[
    {
        "id": "1n6hto7",
        "author": "ObsessionAMA",
        "title": "Hey /r/movies! I'm filmmaker Curry Barker (MILK &amp; SERIAL). My new film, OBSESSION, is premiering this Friday 9/5 at the Toronto International Film Festival as a Midnight Madness selection. Ask me anything!",
        "content": "Hey reddit, I'm filmmaker Curry Barker, and my new film, OBSESSION, is heading to TIFF this week! You might know my directorial feature debut, MILK &amp; SERIAL (2024). \n\nOBSESSION will have its World Premiere at the Toronto International Film Festival this Friday, September 5, as part of the Midnight Madness program. The film stars Michael Johnston, Inde Navarrette, Cooper Tomlinson, and Megan Lawless.\n\nAsk me anything!\n\n**Synopsis:** \n\nObsession plunges into a fever dream of longing, delusion, and the chilling cost of getting exactly what you desire. Bear, a hopeless romantic, gets pulled into a spiral where passion and terror become inseparable.\n\nFrom Curry Barker (Milk &amp; Serial), this visceral, atmospheric thriller fuses psychological horror with a haunting supernatural edge. Starring Inde Navarrette (Superman &amp; Lois), Michael Johnston (Teen Wolf), Cooper Tomlinson (Milk &amp; Serial), and Megan Lawless (The Death That Awaits), Obsession is a twistedlove story that dares to ask: How far would you go to be loved back?\n\n\\-----------------------------------------------------------------------------------------\n\n**TIFF's write-up of the film:**\n\nWoe is Bear (Michael Johnston), who has long carried a torch for his childhood friend Nikki (Inde Navarrette). When another attempted profession of love fizzles, Bear wistfully wishes for romantic reciprocation, unfortunately doing so while in possession of a trinket with supernatural properties of The Monkey’s Paw variety.\n\nSuddenly, Nikki is all over Bear, and he is quick to indulge in this long-desired turnabout while ignoring the ramifications of her intensifying fixation. Before long, Bear’s fantasy turns to nightmare as Nikki’s personality begins to twitch with a disturbing dysphoria that sinisterly suggests her autonomy has been usurped by a malignant entity that wants them both, body and soul.\n\n“Be careful what you wish for” may be a staple in the horror genre, but writer-director Curry Barker enlivens this well-worn premise by lacing its inherent irony with a wickedly wry tone and an anxious tension that’ll plummet the stomach of even hardened Midnighters. Having honed high-concept absurdism and creeping dread from his online productions, Barker deftly demonstrates a savvy command of tone and terror reminiscent of fellow sketch comedian Zach Cregger’s Barbarian.\n\nAs with that auspicious debut, Barker’s first feature preserves an uncomfortable relatability in its hyperbolic scenario. Though literally featuring a customer service call from (and possibly to) Hell, Obsession cuts to the quick as it lays bare the innate violence in romantic objectification with an unforgiving candidness. That's made all the more disarming, thanks to exceptionally nuanced performances, particularly from Navarrette whose “Freaky Nikki” oscillates between doe-eyed desire and devastating torment that will chill you to the bone.\n\n\\----------------------------------------------------------------------------------------------------\n\n**My bio:**\n\nCurry Barker is a writer-director with a bold, visceral style. His work blends raw emotion with psychological horror and dark comedy. He co-created That’s a Bad Idea, his sketch comedy channel, and directed Milk and Serial, both known for their brutal honesty and striking, cinematic visuals.\n\nAsk me anything! Back at 5 PM ET today (Tuesday 9/2) to answer any questions.",
        "upvotes": 36,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qcio23ghiqmf1.png?auto=webp&amp;s=9c6f7be58a60078897704b6190383d562023ba1b"
        },
        "permalink": "/r/movies/comments/1n6hto7/hey_rmovies_im_filmmaker_curry_barker_milk_serial/"
    },
    {
        "id": "1n6it91",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Wake Up Dead Man: A Knives Out Mystery'",
        "content": "",
        "upvotes": 14297,
        "comments": 729,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tc6byqsy1rmf1.jpeg?auto=webp&amp;s=1c5483d0b00452f1b01a72a42d2c177d7b909146"
        },
        "permalink": "/r/movies/comments/1n6it91/official_poster_for_wake_up_dead_man_a_knives_out/"
    },
    {
        "id": "1n6i0m0",
        "author": "MarvelsGrantMan136",
        "title": "First Images from,'28 Years Later: The Bone Temple'",
        "content": "",
        "upvotes": 2664,
        "comments": 640,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/71ynspkevqmf1.jpeg?auto=webp&amp;s=6f07486d57c2bb30c822fb7ed8df410240de5baa"
        },
        "permalink": "/r/movies/comments/1n6i0m0/first_images_from28_years_later_the_bone_temple/"
    },
    {
        "id": "1n624uu",
        "author": "MarvelsGrantMan136",
        "title": "Graham Greene Dies: Oscar-Nominated ‘Dances With Wolves’ Actor Was 73",
        "content": "",
        "upvotes": 19628,
        "comments": 749,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g8cYASp5XTcIQZtBY8nc84vHVVDs5UiDn3XXMAytUTw.jpeg?auto=webp&amp;s=da843a510bb240a5f13297fc653db68339376348"
        },
        "permalink": "/r/movies/comments/1n624uu/graham_greene_dies_oscarnominated_dances_with/"
    },
    {
        "id": "1n6hjrj",
        "author": "MarvelsGrantMan136",
        "title": "Official IMAX Poster for 'HIM'",
        "content": "",
        "upvotes": 671,
        "comments": 168,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6rh1b3oarqmf1.jpeg?auto=webp&amp;s=2c63c9146927726daec7be8e0eb76d22fb9a11fa"
        },
        "permalink": "/r/movies/comments/1n6hjrj/official_imax_poster_for_him/"
    },
    {
        "id": "1n6n286",
        "author": "ChiefLeef22",
        "title": "'The Long Walk' - Review Thread",
        "content": "*Teens participate in a grueling high-stakes contest where they must continuously walk or be shot by a member of their military escort.*\n\nDirector: Francis Lawrence (The Hunger Games: Catching Fire, Mockingjay - Pts. 1 &amp; 2 , and The Ballad of Songbirds &amp; Snakes)\n\nCast: Cooper Hoffman, Ben Wang, Mark Hamill, David Jonsson, Garrett Wareing, Tut Nyuot, Charlie Plummer\n\n**Rotten Tomatoes:** [100%](https://www.rottentomatoes.com/m/the_long_walk_2025)\n\n**Metacritic:** [81/100](https://www.metacritic.com/movie/the-long-walk-2025/)\n\nSome Reviews:\n\n[Total Film - Lauren Milici](https://www.gamesradar.com/entertainment/horror-movies/the-long-walk-review/)\n\n&gt;The Long Walk is not for the faint of heart, but it is one of the best Stephen King adaptations ever made, and one of the best dystopian sci-fi movies to hit the big screen in a really long time.\n\n[Next Best Picture](https://www.rottentomatoes.com/critics/source/3046) \\- [Giovanni Lago](https://www.rottentomatoes.com/critics/giovanni-lago) \\- 7 / 10\n\n&gt;It can exhilarating as Frances Lawrence and JT Mollner bring a bit of edge to this beloved Stephen King adaptation. Cooper Hoffman and David Jonsson are both excellent, delivering riveting performances that emotionally reel in the audience. It can also feel repetitious at times, trying to replicate the highs of some of the more exciting set pieces, building towards an expected ending.\n\n[Slashfilm - BJ Colangelo](https://www.slashfilm.com/1953442/the-long-walk-review/) \\- 9 / 10\n\n&gt;\"The Long Walk\" is an emotionally obliterating all-time great Stephen King adaptation, and undoubtedly one of the best films of 2025. The camaraderie shown by the group is not unlike the foxhole friendships developed between soldiers during wartime, but given the hopelessness of their situation, it starts to feel like we're watching the American version of \"All Quiet on the Western Front.\" Wang provides a majority of the much-needed levity with his sharp tongue and fearless delivery, while Baker's warm, gentle optimism represents the best of humanity.",
        "upvotes": 258,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GFdHr3rQgXTOQkgn45q5bCIZoGDOn6HCUqHRbJssKHE.jpeg?auto=webp&amp;s=924d574f5b21e1fadcc6b32e7cb88b6d19d7f2aa"
        },
        "permalink": "/r/movies/comments/1n6n286/the_long_walk_review_thread/"
    },
    {
        "id": "1n6cjmy",
        "author": "tiddertnuocca519",
        "title": "Watching ‘The Mighty Ducks’ (1992) in 2025 makes me long for a different decade",
        "content": "It’s 2AM, I can’t sleep and I need some fodder on the screen to put me to bed. Picking ‘The Mighty Ducks’ was the wrong movie but in watching it, it has really made me realize how much the world has changed since 1992.\n\nGranted, it’s a work of exaggerated fiction. Even in 1992, no law firm is giving a pee wee hockey team $15k to buy equipment, there weren’t publicly broadcast televised pee wee tournaments with commentators, analysts and a full stadium audience, coaches aren’t telling 10 year olds that if they don’t make the game winning shot, not only are they letting their coach down but they are letting their team and their dead dad down and finally, the dialogue is way too clever and quippy for a bunch of 10 year old kids.\n\nGreat, we got that out of the way. But the movie unintentionally captures a vibe in the 90s that has since disappeared. They shot it earnestly and now it’s a time capsule for that time. The kids are out hanging out with each other, the cities are lively, people communicate in the wild. The kids have this sense of adventure that I recall in my childhood but don’t see in kids today. They are generally just out in the world without parental supervision, and that’s *okay*. Shit, the notion of a grown man trying to teach kids hockey didn’t come with the default assumption of grooming and pedophilia. \n\nIt’s just wild how different things are today. I was a teenager in the 90s and again, yes the film exaggerates but the details they showcase in how we freely communicated back then and how people didn’t jump to the worst conclusions of each other, is just wildly different.\n\nFinally, this is a little off topic, but this movie was rated PG yet it gets away with so much stuff and definitely isn’t just a kids movie, as we know them today. The kids are looking at dirty magazines, they make light hearted race jokes like calling the 2 black kids and one white kid “Oreos”, Gordon Bombay verbally rips the kids apart and straight up tells them they “suck”. I just can’t imagine a PG movie today having any of these vibes.\n\nI really encourage giving the film a shot. I haven’t seen it since I was probably 10 years old myself. No it is not high art and it won’t blow your socks off. But if you recognize that the days we live in today are just…so…bland, I think you’ll have a good time with this unintentional time capsule of a film.",
        "upvotes": 864,
        "comments": 205,
        "media": null,
        "permalink": "/r/movies/comments/1n6cjmy/watching_the_mighty_ducks_1992_in_2025_makes_me/"
    },
    {
        "id": "1n6itzb",
        "author": "KillerCroc1234567",
        "title": "‘Wake Up Dead Man: A Knives Out Mystery’ Sets Two-Week Theatrical Release (Nov 26) Before Netflix Rollout (Dec 12)",
        "content": "",
        "upvotes": 219,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VUL7nNZImqQX_h-0GthyuJA7t6u2i0AVoAB88vkJQ38.jpeg?auto=webp&amp;s=772c99d37153dbe66d158a5b96be1a675b434b11"
        },
        "permalink": "/r/movies/comments/1n6itzb/wake_up_dead_man_a_knives_out_mystery_sets/"
    },
    {
        "id": "1n6mthn",
        "author": "bjkman",
        "title": "David Keighley, Imax Chief Quality Officer, Dies at 77",
        "content": "",
        "upvotes": 104,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EvJgqln7l7JI4LvjQAvT8QF_MSSV22PCvziG7en6TWA.jpeg?auto=webp&amp;s=018a5ce7be0bf89c8088ed6bd4611dddefdafd33"
        },
        "permalink": "/r/movies/comments/1n6mthn/david_keighley_imax_chief_quality_officer_dies_at/"
    },
    {
        "id": "1n6iybx",
        "author": "LurkerBigBangFan",
        "title": "Which movie was written off at release but actually aged really well?",
        "content": "One that comes to mind for me is Last Action Hero. When it came out, people wanted a straight Arnold action flick and wrote it off. I also loved it and enjoyed it for what it was trying to do. But rewatching it recently really makes it feel like a movie out of time. It was doing the whole meta, self-aware thing long before it caught on. Movies like Cabin in the Woods, Tropic Thunder and Deadpool later got praised for that same kind of storytelling, but Last Action Hero was already playing with those ideas in the early 90s.\n\nIt’s fun to revisit it now and see how much it holds up, especially knowing how common that style has become.\n\nCurious what other movies people think were misunderstood at release but actually aged really well.",
        "upvotes": 156,
        "comments": 197,
        "media": null,
        "permalink": "/r/movies/comments/1n6iybx/which_movie_was_written_off_at_release_but/"
    },
    {
        "id": "1n67yv6",
        "author": "stormborn3",
        "title": "When you hear the name “Patrick Swayze” what is the first movie that comes to mind?",
        "content": "*question* Was he actually in Trailer Park Boys or just a mention? I keep trying to look it up and I only see him be mentioned, I’m so confused lmao.\n\nMe and my boyfriend are having a passionate disagreement and need to know what movie honestly comes to your mind first when you hear the  name Patrick Swayze. We have asked our friends and family and the answers are pretty balanced between his option and mine so I need an internet tiebreaker with the help of the kind Reddit movie community.\n\nEDIT: \n1. I had no idea he was in Donnie Darko.\n2. I am definitely going to start a list and start watching a lot of these because I can honestly say I haven’t seen most of the ones mentioned.\n3. I suspected it may be a woman vs man thing because I have seen a couple people mention their gender when answering which is kind of what I expected.",
        "upvotes": 525,
        "comments": 1616,
        "media": null,
        "permalink": "/r/movies/comments/1n67yv6/when_you_hear_the_name_patrick_swayze_what_is_the/"
    },
    {
        "id": "1n5u723",
        "author": "ChiefLeef22",
        "title": "Benny Safdie's 'The Smashing Machine' - Review Thread",
        "content": "*MMA fighter Mark Kerr reaches the peak of his career but faces personal hardships.*\n\nCast: Dwayne Johnson, Emily Blunt\n\n**Rotten Tomatoes:** [94%](https://www.rottentomatoes.com/m/the_smashing_machine_2025)\n\n**Metacritic:** [79/100](https://www.metacritic.com/movie/the-smashing-machine/)\n\nSome Reviews:\n\n[The Independent - Geoffrey Macnab](https://www.the-independent.com/arts-entertainment/films/reviews/the-smashing-machine-review-dwayne-johnson-b2817883.html) \\- 4 / 5\n\n&gt;This, though, is a story in which winning finally begins to seem very hollow. The real way Safdie puts a chokehold on his audience is by examining Mark and Dawn’s physical and emotional weaknesses in such forensic detail. The Smashing Machine may not provide the pay-offs that audiences expect from more conventional sports movies, but this is the most raw and vulnerable that Johnson has ever been on screen. Once you’ve seen him this exposed, you won’t watch his typical action movie stunts in quite the same way ever again.\n\n[Daily Telegraph - Robbie Collin](https://www.telegraph.co.uk/films/0/the-smashing-machine-review-dwayne-johnson/) \\- 4 / 5\n\n&gt;It’s a classical fight movie that innovates subtly. Maceo Bishop’s nimble photography has the sweat and grit of a vintage muscle flick from the Pumping Iron era, but the score by the experimental jazz composer Nala Sinephro is all swirling harps and breathy saxophones; arguably no piece of music has ever sounded less like a punch in the face. Yet as an accompaniment to Kerr’s battles in and out of the ring, it’s oddly perfect, giving this tough story an unexpectedly sweet and even spiritual edge. Smashing stuff has rarely been such smashing stuff.\n\n[Next Best Picture - Cody Dericks](https://nextbestpicture.com/the-smashing-machine/) \\- 7 / 10\n\n&gt;Dwayne Johnson delivers the best performance of his career as the amiable but troubled UFC champion Mark Kerr. Emily Blunt and Ryan Bader are also excellent in their roles. The screenplay is repetitive and frustrating. Blunt's character is so unlikeable and written with such vitriol that it becomes exhausting to watch her, although Blunt's performance is as good as it could possibly be.\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/the-smashing-machine-review-dwayne-johnson-benny-safdie-1236503546/)\n\n&gt;Johnson, shifting his whole aspect (he seems like a new actor), invests that silent, moody, hidden side of Mark with a quality of mystery. He gives an extraordinary performance, playing Mark Kerr as a gentle giant with demons that will not speak their name, yet the audience can feel them there; we want to see those demons healed. You might think the key word in the movie’s title is “smashing,” but it’s actually “machine.” Mark is a man who reins in his violence by having constructed his entire self — body and personality — as a controlled engine of demolition. The movie is about how this man-machine becomes a human being.\n\n[The Hollywood Reporter - Jordan Mintzer](https://www.hollywoodreporter.com/movies/movie-reviews/the-smashing-machine-review-dwayne-johnson-delivers-the-blows-as-a-tormented-fighter-in-benny-safdies-gritty-and-downbeat-mma-flick-1236358361/)\n\n&gt;Johnson has rarely played a loser, but he’s always been likable, displaying a massive grin to match his massive pecs in action vehicles that never allowed him to showcase much range. He manages to go deep here without overdoing it, killing the audience with kindness as a benign warrior who suffers from one scene to the next, triumphing briefly in the ring before succumbing to addiction and/or romantic grief. Like Mickey Rourke in *The Wrestler* — a film from which Safdie seems to take a few cues — the actor delivers an intoxicating mix of blood, sweat, tears, protein and total helplessness.\n\n[IndieWire - Ryan Lattanzio](https://www.indiewire.com/criticism/movies/the-smashing-machine-review-1235148509/) \\- 'B+'\n\n&gt;Johnson’s performance is out-and-out wonderful, a beady-eyed fusion of body and spirit that osmoses Safdie’s sensibility to deliver what can’t be disputed as the most layered work of the actor’s career. A vividly contradictory Blunt, funny and sad especially in articulating Dawn’s conflicted response to Mark’s post-rehab emotional about-face during a tense argument, is equally sensational.\n\n[Deadline](https://www.rottentomatoes.com/critics/source/2256) \\- [Damon Wise](https://www.rottentomatoes.com/critics/damon-wise)\n\n&gt;Dwayne Johnson owns the whole thing with his truly remarkable work as fighter Mark Kerr, disappearing so fully underneath Kazu Hiru’s astonishing prosthetics that the opening of the film, presented as contemporary footage from an event in Sao Paulo 1997, looks genuinely like the real thing. It’s that rare beast, a biopic that’s light on the bio and resistant to being a pic. It’s a film about a human being, and its effect is strangely haunting, since Dwayne Johnson seems to do everything while doing nothing.",
        "upvotes": 2746,
        "comments": 559,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_2G9Mo5PGGZ4M7fVlcULtL0yIfl1gYAWNSiGlMJrscg.jpeg?auto=webp&amp;s=8edb4c0c0a6c7172d8a434837786bc09e5434eb8"
        },
        "permalink": "/r/movies/comments/1n5u723/benny_safdies_the_smashing_machine_review_thread/"
    },
    {
        "id": "1n67hwi",
        "author": "ShouldBeWorking2nite",
        "title": "What line or scene did you not realize was a reference to another movie till much later?",
        "content": "For me it’s in the movie Super Troopers when the teens in the beginning of the film are in the back of the squad car. And the one who was super high is licking the window and says “The Snozberries taste like Snozberries”. I just thought it was a silly made up fruit that someone high would think is real. But 24 years later and many rewatching’s, it was today I happened past Willy Wonka and the Chocolate Factory from 1971 and the scene with the flavored wallpaper comes up. And what do I hear “The Snozberries taste like Snozberries”. Are you kidding me it’s been a while since I’ve watch Willy Wonka but how did that never click until today.",
        "upvotes": 487,
        "comments": 272,
        "media": null,
        "permalink": "/r/movies/comments/1n67hwi/what_line_or_scene_did_you_not_realize_was_a/"
    },
    {
        "id": "1n5tazq",
        "author": "tylerthe-theatre",
        "title": "Paul Walter Hauser backed out of Rob Ford role to avoid playing 'every chubby idiot ne'er-do-well' from history",
        "content": "",
        "upvotes": 2582,
        "comments": 237,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/paucecElLuA3JsCh9We8pEis2uYkoe-5nBrNgDvpHIM.jpeg?auto=webp&amp;s=5142e516ef6d33b77f00fb65a329c95f883fd56e"
        },
        "permalink": "/r/movies/comments/1n5tazq/paul_walter_hauser_backed_out_of_rob_ford_role_to/"
    },
    {
        "id": "1n66kcr",
        "author": "Magical_critic",
        "title": "Actors who often play characters that are way older than their actual age?",
        "content": "There's a Korean actress named Lee Jung-eun who international viewers probably best know her as the housekeeper from Parasite. I just realized that she seems to be stuck playing characters where the character is way older than her actual age (55), with the most recent example being My Daughter is a Zombie, where she plays a Grandma even though there's only an 11 year age gap between her and the actor who plays her son. Are there any other actors who are known to be stuck playing characters that are way older than their actual age? ",
        "upvotes": 430,
        "comments": 181,
        "media": null,
        "permalink": "/r/movies/comments/1n66kcr/actors_who_often_play_characters_that_are_way/"
    },
    {
        "id": "1n5n4ur",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Bob Odenkirk in ‘Normal’ - Ulysses is appointed substitute sheriff in the tiny Minnesota town of Normal. When the local bank is sacked, Ulysses unknowingly uncovers something far more explosive than a simple bank robbery.",
        "content": "",
        "upvotes": 5021,
        "comments": 238,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2doefuzepjmf1.jpeg?auto=webp&amp;s=e4ba1001a0421fad6a3b1ae37cca917157acf68e"
        },
        "permalink": "/r/movies/comments/1n5n4ur/new_image_of_bob_odenkirk_in_normal_ulysses_is/"
    },
    {
        "id": "1n6naqd",
        "author": "Task_Force-191",
        "title": "MEGADOC | Official Trailer | Utopia",
        "content": "",
        "upvotes": 25,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3-ynUF_NNoR2uWl1TmIkHMZgoEPOB9MwA1RW3Gbvnwg.jpeg?auto=webp&amp;s=8956a6e99eec89da754f2e3790877ecab86922c2"
        },
        "permalink": "/r/movies/comments/1n6naqd/megadoc_official_trailer_utopia/"
    },
    {
        "id": "1n6lunj",
        "author": "MarvelsGrantMan136",
        "title": "Paramount &amp; Activision Team For ‘Call Of Duty’ Movie",
        "content": "",
        "upvotes": 28,
        "comments": 150,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aznvAIKAzdVjgGJcnZZv6PmoecrYFgWsZbbRznO2hGk.jpeg?auto=webp&amp;s=03b1248af378e96958a9c8e655ad6377aebb74e2"
        },
        "permalink": "/r/movies/comments/1n6lunj/paramount_activision_team_for_call_of_duty_movie/"
    },
    {
        "id": "1n5z7mq",
        "author": "MarvelsGrantMan136",
        "title": "‘Evil Dead 2’ Writer, ‘Intruder’ Director Scott Spiegel Has Passed Away at 67",
        "content": "",
        "upvotes": 892,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YS57sPaeMi7KMDoYW0-KceM4llaZ_KzcAv7hqLmGMr4.jpeg?auto=webp&amp;s=3899d975e9af48786ff90114427eaabb1d1c49b1"
        },
        "permalink": "/r/movies/comments/1n5z7mq/evil_dead_2_writer_intruder_director_scott/"
    },
    {
        "id": "1n6l3zo",
        "author": "Sliberty",
        "title": "When was the last time you actually sat down and watched The Wizard of Oz (original film)?",
        "content": "\n\nI liked it as a kid. My mom was obsessed with it, which was one of her cute personality quirks, but the rest of us just kind of passively enjoyed it. The fact that I liked it as a kid at all when the movie was already about 50 or 60 years old says something, but I just thought of it as a good classic film, and felt modern movies were better.\n\nThen, I didn't watch it again for decades.\n\nI watched it last year (age 41) with my own kids and was blown away at the quality of it.\n\nThis was all done way before digital effects were invented and even conceived of, when even colorized film was a new invention.\n\nEvery effect is practical and built by hand. Every magical moment was real, done with clever editing, set building, storyboarding, and makeup.\n\nThe twister scene is genuinely harrowing. The tornado in the sky looks stunning, the wind is real, the screen door being ripped off the house and flying away looks totally believable.\n\nThe Witch appears in a 30-foot column of fire!\n\nIt looks real because IT IS REAL. The only way to make that effect was to create a real 30-foot column of fire, so they did. The actor was injured in the filming of this.\n\nThe performances were also amazing. Judy Garland's facial acting and singing is so affecting. The movie is iconic because of her performance. She's heartbreakingly beautiful and naive in it.\n\nHer scene with Professor Marvel (the fortune teller played by the same character as the Wizard) is really subtle and has aspects I did not appreciate as a kid, with him using cold reading techniques to convince her to return home. He does this in a way that seems sweet and genuine, and not sketchy or manipulative.\n\nThe performances from the other actors are also top notch, especially Ray Bolger's singing and dancing as the Scarecrow.\n\nTo think that a movie of this scale and quality came out in 1939 really staggered me. It comes as absolutely no surprise that it stunned and amazed audiences at the time, during the golden age of cinema, where these early films became iconic because of their craft and spectacle. Of course it's an enduring classic.",
        "upvotes": 21,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1n6l3zo/when_was_the_last_time_you_actually_sat_down_and/"
    },
    {
        "id": "1n6mf61",
        "author": "TheCutAMA",
        "title": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. It premiered at TIFF 2024. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!",
        "content": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!\n\nThe film had its World Premiere at the Toronto International Film Festival last year. Here to answer your questions.\n\nRepublic Pictures will release THE CUT In Select Theaters September 5th!\n\nCheck out the Trailer: [https://paramnt.us/TheCutTrailer](https://paramnt.us/TheCutTrailer)\n\nSYNOPSIS: After a career-ending defeat, a former champion trains for redemption – but as obsession takes hold and reality unravels, he may be spiraling into something far more terrifying.\n\nHere are all of my credits:\n\n[https://www.imdb.com/name/nm1193346/](https://www.imdb.com/name/nm1193346/)\n\nAsk me anything! I'll be back at 11:00 AM ET tomorrow (Wednesday 9/3) to answer your questions!",
        "upvotes": 17,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wdz0f96wqrmf1.jpeg?auto=webp&amp;s=d5685cf32f3353080b4a130229ceb6f076d98877"
        },
        "permalink": "/r/movies/comments/1n6mf61/hey_reddit_im_sean_ellis_director_of_the_cut/"
    },
    {
        "id": "1n6md61",
        "author": "NoCulture3505",
        "title": "Channing Tatum’s ‘Roofman’ Reinvention: Why He Wanted to Play a Real-Life Criminal for Derek Cianfrance’s Surprising Film and How He’s Reviving Gambit for ‘Avengers: Doomsday’",
        "content": "",
        "upvotes": 13,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9zHUqh2nVyDDeeeu6cZ9NIhW0weJdtzuPdm6qGM5Aos.jpeg?auto=webp&amp;s=2ed86b55d31effb20a46e96a8d081511f615f182"
        },
        "permalink": "/r/movies/comments/1n6md61/channing_tatums_roofman_reinvention_why_he_wanted/"
    },
    {
        "id": "1n68fj6",
        "author": "HereComeTheFlutePart",
        "title": "The Nice Guys",
        "content": "Just rewatched this gem again.  Best buddy cop movie of the last 30 years.  Excellent writing with Crowe and Gosling juxtaposing straight edge hard ass with bumbling buffoon perfectly.\nTrying to identify the car Ryan Gosling takes from the Valet when he’s told his daughter is in the Limo that just left the party.  Red car, looked like a firebird or corvette.  Google GPT saying the scene didn’t happen.\nLove to hear other opinions on it and possible ID on the whip.\n",
        "upvotes": 129,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1n68fj6/the_nice_guys/"
    },
    {
        "id": "1n5khoe",
        "author": "RejectingBoredom",
        "title": "Best example of “I can’t believe these two movies were made by the same director” pairings?",
        "content": "Example:\n\nIn 1998, Martin Campbell delivered what, at that time, was one of the all time great swashbuckling adventure movies in Mask of Zorro. Complete character revival and revitalisation, one of the best comic book movies of the decade.\n\n8 years later he makes one of the all time great spy movies and all time great Bond movies in Casino Royale. \n\nTwo absolute masterpieces of their respective genres, right?\n\nThen in 2011 he directs fucking Green Lantern, one of the worst comic book movies of all time and basically put GL on ice for over a decade. Even the animation stuff cooled off on GL. \n\nSo Campbell is clearly a very talented director but he goes from a couple of all time greats to an almost universally hated movie.\n\nOther examples?",
        "upvotes": 3088,
        "comments": 1299,
        "media": null,
        "permalink": "/r/movies/comments/1n5khoe/best_example_of_i_cant_believe_these_two_movies/"
    },
    {
        "id": "1n66j1x",
        "author": "bluesundust",
        "title": "Movies that changed you as a child. For me this was 'The Last Unicorn'.",
        "content": "The Last Unicorn, this movie is magical. In combination with his soundrack from America - wow.\n\nIt had a deep emotional impact on me as child. I had never seen a 'kids movie' like this before. It introduced me to a new emotion — melancholy.\n\nSure, Pixar also makes good movies about dealing with emotions. But this film hits you differently as a child.\n\nWhich movie broadened your emotional horizons as a child?",
        "upvotes": 163,
        "comments": 96,
        "media": null,
        "permalink": "/r/movies/comments/1n66j1x/movies_that_changed_you_as_a_child_for_me_this/"
    },
    {
        "id": "1n6oa3w",
        "author": "ChiefLeef22",
        "title": "Christopher Nolan's 'TENET' Turns 5: How Nolan's Most Divisive Film has also Garnered a Dedicated Fanbase Preaching its Gospel",
        "content": "",
        "upvotes": 8,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K61-nXFySYXxSzdqAtTi_niinj_kUvkZ531ytaXkNSU.jpeg?auto=webp&amp;s=f9c9ce2b1573e0fe322f052c9de8888505b772d5"
        },
        "permalink": "/r/movies/comments/1n6oa3w/christopher_nolans_tenet_turns_5_how_nolans_most/"
    },
    {
        "id": "1n5uxbi",
        "author": "indiewire",
        "title": "Jesse Plemons' Role in 'Bugonia' Is the Talk of Telluride (Interview)",
        "content": "",
        "upvotes": 552,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/t1tlfzcEusAgq-fOnzZbswqxzDAZY0XVubeSuzfFoVc.jpeg?auto=webp&amp;s=fe0bc71b81af489aa46c470dd2694d8a12de2679"
        },
        "permalink": "/r/movies/comments/1n5uxbi/jesse_plemons_role_in_bugonia_is_the_talk_of/"
    },
    {
        "id": "1n67ls9",
        "author": "fungobat",
        "title": "Dave (1993) Official Trailer - Kevin Kline, Sigourney Weaver Comedy HD",
        "content": "",
        "upvotes": 105,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hgp4rhKkUbys3lJjCEwdDrfXR6J9CVDQX_mSI4A8aDE.jpeg?auto=webp&amp;s=183bd795a1e14ea37a649fc78be6e37d1d0e73cd"
        },
        "permalink": "/r/movies/comments/1n67ls9/dave_1993_official_trailer_kevin_kline_sigourney/"
    },
    {
        "id": "1n5guls",
        "author": "megamindwriter",
        "title": "The birth of James T. Kirk and the death of his father in Star Trek (2009)",
        "content": "",
        "upvotes": 3972,
        "comments": 554,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zazvxt5tthmf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n5guls/the_birth_of_james_t_kirk_and_the_death_of_his/"
    },
    {
        "id": "1n6mdt9",
        "author": "OkNobody8896",
        "title": "Movies that are ‘culturally’ more appreciated today that when they were released?",
        "content": "It’s interesting to see movies from the 80s (for example) being viewed through a contemporary cultural lens and being deemed markedly less acceptable and more insulting to by modern audiences. \n\nExamples would be Sixteen Candles, Revenge of the Nerds, Weird Science. \n\nAre there examples of the reverse - films that were maybe condemned at the time of release, but are now seen more favorably?",
        "upvotes": 8,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1n6mdt9/movies_that_are_culturally_more_appreciated_today/"
    },
    {
        "id": "1n5plod",
        "author": "jesepy",
        "title": "Local theater is doing a 'forgotten films' marathon: what's a movie you always recommend but nobody's heard of?",
        "content": "My local theater is doing a 'forgotten films' marathon and I want to suggest some truly underrated movies from the late 90s to early 2000s. Looking for films that deserved way more attention but got overshadowed by blockbusters. I'm thinking quality dramas or thrillers that critics loved but audiences missed. What's a movie you always recommend but nobody's heard of?",
        "upvotes": 704,
        "comments": 1800,
        "media": null,
        "permalink": "/r/movies/comments/1n5plod/local_theater_is_doing_a_forgotten_films_marathon/"
    }
]