[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oy8xt1",
        "author": "nettspendfannn",
        "title": "This household update is terrible",
        "content": "I can't use Netflix anymore because my sister went to college and has Netflix set up there. So now its giving me this bs about not being part of the house hold. FIX THIS NETFLIX",
        "upvotes": 71,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1oy8xt1/this_household_update_is_terrible/"
    },
    {
        "id": "1oybrum",
        "author": "Overall-Path-4686",
        "title": "Claire Danes’ Lip Quiver in The Beast In Me",
        "content": "Pretty good show, and Claire Danes is great in it but her lower lip quivers in every single emotionally intense scene and it’s so distracting. \n\nWould have loved if she picked a single other way to communicate emotion in her face besides a lip quiver.\n\nDid anyone else notice this?",
        "upvotes": 17,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1oybrum/claire_danes_lip_quiver_in_the_beast_in_me/"
    },
    {
        "id": "1oyd7tp",
        "author": "Not_Serial_Murdering",
        "title": "What is a movie/show on Netflix that most people haven’t seen, but you’d insist they should watch?",
        "content": "Just like the title says, what movies and shows did you love that most people probably haven’t seen? Sometimes it feels like I’ve seen everything that’s worth watching on Netflix. So what would you guys recommend that most people probably haven’t watched? ",
        "upvotes": 13,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1oyd7tp/what_is_a_movieshow_on_netflix_that_most_people/"
    },
    {
        "id": "1oyfyts",
        "author": "cheeseymom",
        "title": "Is anyone else who really enjoyed stranger things just completely lose interest with how long they took?",
        "content": "I don't even know if I'll bother to watch the 5th season. I remember liking and enjoying all the others but it's been so long I forgot most of it and now I just don't even care. It's a shame they couldn't have just ended it in a timely manner.",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oyfyts/is_anyone_else_who_really_enjoyed_stranger_things/"
    },
    {
        "id": "1oy8ryq",
        "author": "baggagefree2day",
        "title": "Beast in Me",
        "content": "SPOILERS)What does everybody think about this? I’m on the second or third episode and seriously there are so many inconsistencies. Niles has the most top notch security system in the world on his mansion, but an FBI agent can sneak in through a window that doesn’t trigger any alarms?. He has no cameras in his office?. He’s not notified when somebody tries to access his files?\nAnd I didn’t even think it was possible for anybody to just knock out a Belgian malinois. And what makes them not even consider the fact that the bodyguard is tapping her phone.",
        "upvotes": 19,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1oy8ryq/beast_in_me/"
    },
    {
        "id": "1oyboo6",
        "author": "DavidinCincinnati",
        "title": "Netflix Removed the ability to cast",
        "content": "They have REMOVED the cast icon and feature, I did a chat with their help and they confirmed, now I can no longer cast to my Chromecast to watch on the TV, I threatened to cancel if they don't restore.",
        "upvotes": 6,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1oyboo6/netflix_removed_the_ability_to_cast/"
    },
    {
        "id": "1oxr666",
        "author": "Kendikay1966",
        "title": "Dept. Q",
        "content": "Anyone else watching??  The first episode I was ready to call in the chips.  Then the second…getting warmer.   I’m into the 7th episode…WOW!  It’s got me hooked!   The acting’s excellent and the story line keeps you guessing.   So good.   Highly recommend.   ",
        "upvotes": 58,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1oxr666/dept_q/"
    },
    {
        "id": "1oy9qdc",
        "author": "TheBrokeBroker",
        "title": "Fake IMDB reviews for Netflix shows",
        "content": "I’ve noticed over the years that many Netflix shows get review-bombed on their premiere day. The latest example is the Japanese series *Last Samurai Standing*. On the day it premiered, it suddenly had around 2,000 six-star reviews on IMDb, and almost none of them included any kind of in-depth written review.\n\nAt the same time, the show sits at 100% and 95% on Rotten Tomatoes.\n\nIMDb is owned by Amazon, which is a direct competitor to Netflix through Prime Video. I can’t help but wonder whether Amazon benefits when new Netflix titles are flooded with early low ratings, especially since user scores are one of the first things people check before deciding what to watch. What are your thoughts about this?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oy9qdc/fake_imdb_reviews_for_netflix_shows/"
    },
    {
        "id": "1oyd3n8",
        "author": "Mountain_Meringue_80",
        "title": "Newly Rich, Newly poor",
        "content": "Has any one seen the series newly rich , newly poor, andres ferriera is so freaking hot, and it has over 120 eps , I'm addicted to the show, The show is very cheesy, and hooks us to watch it, just for light hearted entertainment, but it has more than 120 eps, im excited to how they could have possible stretched thoese many eps lol,",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyd3n8/newly_rich_newly_poor/"
    },
    {
        "id": "1oyfpga",
        "author": "lillie_connolly",
        "title": "Frog - some questions",
        "content": "I just watched the show Frog, it's pretty good with a great vibe and an interesting story, it's just that character behaviors are absurd. Can someone explain the following:\n\n1. Why can't the protagonist report her to the cops over what she is doing to him (ignoring the kid)? \nI genuinely don't understand why the fact that he cleaned up after her makes him her hostage. She doesn't want the cops to know that she killed the kid, ok. But what does she actually have on him at all, there is no clear proof that he knew she did it when he cleaned up, and nothing stopping him from just reporting her now for harassment and trespassing - what will she do, say \"btw I also killed a kid last year and he might have realized it but didn't report me?\" There's really nothing keeping him from reporting her over what she is doing then. \n\n2. Why does he act like he can't report her for killing the kid due to lack of evidence? If he was going to report her for killing the kid, he wouldn't even need all that, since presumably the child and her personal life can be investigated and people would have noticed her child missing in real life. I do understand why he doesn't want to report it at first, I just think that acting like later he can't do it because she stole a recorded confession and a video of her leaving alone doesn't really make much difference if he wanted to talk about it\n\n\n3. Why does everyone in the show act like its impossible to arrest a person for anything unless I guess you catch them in the act? On one hand this guy thinks he will get in trouble for simply not reporting a murder no one can even prove he really knew of, and yet this woman literally slams into his car in front of the police station, walks around like a maniac , ultimately assaults (to the point where its an attempted murder) that guy and the protagonist's daughter, and yet she walks because the case isn't solid enough? I mean what more do you need aside from the two victims saying she did it to them. It's just ridiculous that on one hand you can stab and attack people but the cops can't do anything , but a guy will live like a hostage over fear of what an allegation (from the murderer) about him covering up a crime would do to him?\n\n4. Why wouldn't the father of the child report his son missing? Again, if he was in her custody and disappeared, you don't exactly need to have a footage of her killing the kid to build a case.\n\n5. Why doesn't the protagonist consult anyone, ever? Even if he was so scared of the cops, it makes no sense not to warn his daughter about the psycho who is harassing him and threatening her life. He has friends, connections, but just stays silent as if her throwing an allegation on him for supposed cover up (which can only harm her) is a figurative gun pointed at his head. Why would most people who know him even care or believe her? \n\n6. Why does the protagonist at no point change the locks?\n\nI almost burst out laughing when the genius cop (who literally did nothing to solve the case and seems to share the view raised in my point 3.) told him that he acted like any person would in his situation.\n\nFinally, this is just something I noticed in several Korean crime shows I recently watched (I still really like them), there seems to be a trend of functioning adults being ridiculously gullible and just taking everyone for their word even when it's totally absurd. Like if you just make a convoluted and dumb threat or if a totally untrustworthy person makes a promise, characters treat it like the most solid logic they can't possibly argue against.\n\n\nOverall the concept was good and I love this type of a thriller, I just think more solid rationale should have been given behind some actions. \n\nFinal comment - the psycho woman was so convincingly grating, I rarely genuinely detested a character so much, even though the protagonist himself was frustrating in his choices. I'm not even talking about the fact that she is clearly a maniac, but even her gestures, laughter, mannerisms, all made me feel this unusual aggression. I wanted to see her get punched, and it seems the show was very self aware that she'd evoke this reaction because she does get punched a lot and it's always really satisfying.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyfpga/frog_some_questions/"
    },
    {
        "id": "1oxirji",
        "author": "Short_Pin_6243",
        "title": "The Beast and Me is one of the best drama shows Netflix has put out in awhile *no spoilers*",
        "content": "*****The Beast In Me******* is the title\n\nNot going to get into specifics because it’s brand new and don’t want to ruin it for anyone else. \n\nBut there was a time when Netflix put out pretty good tv dramas yearly. That time has been replaced as of recent by some pretty big misses.\n\nEven the shows I can think of from this year like Untamed, Wayward, Waterfront, Hunting Wives, Black Rabbit etc are all lacking a lot. It feels like the only shows Netflix sometimes hit on are British dramas. \n\nSo if you are reluctant to check it out, don’t be. (In my opinion of course) ",
        "upvotes": 90,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1oxirji/the_beast_and_me_is_one_of_the_best_drama_shows/"
    },
    {
        "id": "1oy3ff6",
        "author": "frostybookworm",
        "title": "Shows like Squid Games and Alice in Borderland?",
        "content": "Looking for similar shows to watch. Or if you enjoyed these shows, what other shows would you recommend? I like survival games and win or die kind of shows. The hunger games is also a favourite of mine. Any ideas? Thanks ",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oy3ff6/shows_like_squid_games_and_alice_in_borderland/"
    },
    {
        "id": "1oycsir",
        "author": "Green-Profile-8400",
        "title": "Everything i watch on Netflix is Grainy",
        "content": "I have a S95C, and use a amazon ultra firestick. I have original match frame rate on. I have the auto picture quality on as well. Yet when I play movies or TV shows on Netflix I can see a graininess on the picture. How do I fix this?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oycsir/everything_i_watch_on_netflix_is_grainy/"
    },
    {
        "id": "1oybf24",
        "author": "Mountain-Bid4317",
        "title": "How much Netflix do you watch per day?",
        "content": "I know Netflix is massively popular, but how much time per day do you spend on the platform? Me personally, I subscribe to several cheaper services that are discounted, but looks like Netflix has a lot of variety. I tried posting this on r/tv, but deleted it...not sure that sub's big on Netflix lol. ",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1oybf24/how_much_netflix_do_you_watch_per_day/"
    },
    {
        "id": "1oy69kg",
        "author": "AcanthocephalaOk8931",
        "title": "Please tell me some shows to watch?",
        "content": "I just finished money heist and that was PEAK it was so addictive that show I need something like that to watch. I tried watching peaky blinders but to be honest it isn’t that good.",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1oy69kg/please_tell_me_some_shows_to_watch/"
    },
    {
        "id": "1oxyx1x",
        "author": "rdv100",
        "title": "Physical Asia is one of my favorite shows now",
        "content": "The show is about six people representing six countries (I think there are six countries):\n\n* Australia\n* Korea\n* Japan\n* Australia\n* Mongolia\n* Thailand\n* Turkey\n\nThey fight with each other to show which country has the strongest people.\n\nIn this show, although it starts slow, there are so many neck-and-neck matches between different teams representing different countries in Asia. It's absolutely fascinating and amazing, and there were some that were truly mind-blowing to see the intensity and also some of the games where these underdogs beat these obvious leaders or at least who look like obvious leaders. \n\n  \nAnyway, I'm personally enjoying it. I encourage you to also check it out. Definitely, I think episodes 2 and 3 onwards it becomes very intense, so if things feel a little slow in the first episode, don't give up. I highly recommend it. \n\n",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oxyx1x/physical_asia_is_one_of_my_favorite_shows_now/"
    },
    {
        "id": "1oxz7p2",
        "author": "dcthegeek",
        "title": "The new TV interface is horrible",
        "content": "Can the updated interface on the Android/TV app be fixed...it is horrible.  I get the idea of conforming to most other streaming apps, but displaying all content in a single line to scroll through just doesn't work.  Some of us have many titles in our watchlists, and scrolling through them on a single line is annoying.  It would be much more usable to display them in a grid to make finding the wanted title faster and simpler.  Also, PLEASE add an option to sort the list (by title, date added, etc.).  This also makes the interface more user friendly.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oxz7p2/the_new_tv_interface_is_horrible/"
    },
    {
        "id": "1oxo1j0",
        "author": "TakesOneToKnowOne1",
        "title": "The Beast in Me — final scene",
        "content": "What is the final scene in the last ep of The Beast in Me meant to indicate? The one with Nina and the baby? Are we saying the baby is like Nile? Find that ridiculous because it’s literally just a baby.",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oxo1j0/the_beast_in_me_final_scene/"
    },
    {
        "id": "1oyc5y3",
        "author": "elcr8tv",
        "title": "Help me ID this Extra",
        "content": "Was watching Karate Kid Legends and one of the scenes had this guy in it. I recognize him but he’s not listed as a cameo. He looks so familiar but I can’t figure out who is is and it’s driving me nuts 🤣. Who is this?\n\n\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyc5y3/help_me_id_this_extra/"
    },
    {
        "id": "1oxok9s",
        "author": "lil-g4565",
        "title": "Strange glitch?",
        "content": "I'm not sure what's happening but anytime I click on a movie or TV show it's just instantly playing it. It won't take me to the \"home screen\" of said show or movie that shows the trailers seaons etc it just starts playing. I've tried searching instead to see if it's just the home screen part of netflix doing that but nope. Nothing's working I'm not sure how to fix it. ",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oxok9s/strange_glitch/"
    },
    {
        "id": "1oxscjt",
        "author": "redditgatorx",
        "title": "Hevelius Ferry Tragedy: How Bad Was the Storm Really?",
        "content": "https://youtu.be/_KhrXyMTll4?si=8Mp1XjedIt2cIkDz\n\nShort video about the newest Netflix's series about Hevelius from the perspective of a data scientist",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxscjt/hevelius_ferry_tragedy_how_bad_was_the_storm/"
    },
    {
        "id": "1oxwuwr",
        "author": "abhilash512",
        "title": "WWE 2K25 Netflix Edition Pre-Register &amp; Release Date Exclusive Update",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxwuwr/wwe_2k25_netflix_edition_preregister_release_date/"
    },
    {
        "id": "1oxx9q6",
        "author": "Ok_Hippo6727",
        "title": "Careful Buying Clothing on the Netflix Shop",
        "content": "Not sure if this is the right spot, but I recently bought and then returned a Kpop demon hunter shirt from the netflix shop. I order \"small\" size shirt and received something big enough to fit on my 6'2 friend. I used the pre-paid return label provided, but they charged shipping. \n\nBasically a word of caution, the products are not well made and you could just end up out the cost of shipping. ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1oxx9q6/careful_buying_clothing_on_the_netflix_shop/"
    },
    {
        "id": "1oxf4xp",
        "author": "phredo_71",
        "title": "No translations for sign language in Orphan Black: Echoes",
        "content": "Anybody else having an issue where sign language is not translated to text, even with subtitles turned on? It happens in episode 1 of Orphan Black: Echoes but I’m sure it’s happening elsewhere. ",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1oxf4xp/no_translations_for_sign_language_in_orphan_black/"
    },
    {
        "id": "1oxoa4d",
        "author": "TomDucq",
        "title": "Downloads not accesible?",
        "content": "I’m about to board a 11h flight and downloaded some shows and movies yesterday. When I tried to access them on my first flight i got an error that I was offline. \nI’m now connected to the internet and my downloads list is empty. \nWhen I go to the show itself it says the episode is downloaded but still the list is empty. \nI only get the message to activate smart download?\n\nAnyone else who experienced this issue?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oxoa4d/downloads_not_accesible/"
    },
    {
        "id": "1oxex7o",
        "author": "harpreetthind",
        "title": "Just wondering, what shows everybody recommends watching on Netflix",
        "content": "I’m watching Brooklyn Nine-Nine already watched superstore and I’m watching Wednesday. What other shows do people recommend? Let me know in the comments since I’m currently in the looking for other shows or movies\nThanks ",
        "upvotes": 9,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1oxex7o/just_wondering_what_shows_everybody_recommends/"
    },
    {
        "id": "1ox8qwr",
        "author": "yoggsmu",
        "title": "College football coach John Beam from ‘Last Chance U’ has died after being shot, Oakland police say",
        "content": "This is awful news… sounds like he was targeted, too. I enjoyed watching him on Last Chance U and thought he was a well-meaning coach who really cared about his kids. ",
        "upvotes": 19,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ox8qwr/college_football_coach_john_beam_from_last_chance/"
    },
    {
        "id": "1oxr3mf",
        "author": "Successful_Ask_2380",
        "title": "Has anyone had issues signing into Netflix with sky?",
        "content": "I had an account under my daughters email\nUsing my own email Netflix keeps trying to charge me to sign up even though the price is included in my my sky broadband subscription \n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oxr3mf/has_anyone_had_issues_signing_into_netflix_with/"
    }
]