[
    {
        "id": "1faddvh",
        "author": "AutoModerator",
        "title": "Free-Talk Friday - 06/09/2024",
        "content": "We hope you are all having a great Friday and hope you have a great week ahead!\n\nThis thread is for **casual discussion** only.",
        "upvotes": 11,
        "comments": 23,
        "media": null,
        "permalink": "/r/islam/comments/1faddvh/freetalk_friday_06092024/"
    },
    {
        "id": "1gmgva5",
        "author": "AutoModerator",
        "title": "Free-Talk Friday - 08/11/2024",
        "content": "We hope you are all having a great Friday and hope you have a great week ahead!\n\nThis thread is for **casual discussion** only.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/islam/comments/1gmgva5/freetalk_friday_08112024/"
    },
    {
        "id": "1gpk8gr",
        "author": "Internal_Trust9066",
        "title": "How to pray with a baby",
        "content": "",
        "upvotes": 426,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3zdkk0gjyg0e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/islam/comments/1gpk8gr/how_to_pray_with_a_baby/"
    },
    {
        "id": "1gpmfaa",
        "author": "Mammonsdiscordkitten",
        "title": "How do i deal with sexual trauma and mental health in Islam?",
        "content": "I’m a young woman who has been through COCSA (child on child sexual assault) by my older sister, who herself has been sexually assaulted by my grandfather as a child. In my early teens, i was molested as well, which made worsened my mental state. I feel really guilty and ashamed because I’ve had many immoral and lustful thoughts since childhood because of that. I’ve had suicidal thoughts as a child and attempted a few times back then, even as a teen, last time attempting being last year. I’m doing my best to not get consumed by my thoughts and I’ve started self harming instead. My parents aren’t aware of any of this (SA, attempts and self harm) but i told them about my suicidal thoughts, which my mom got upset at me for, saying that God would be disappointed in me, etc,  they won’t let me get therapy either because they believe religion will help (which i agree with) but I’ve lost motivation to even practice Islam; praying. It’s the only thing currently stopping me from doing bad stuff, i am afraid of Allah and of going to hell. Even when i try really hard, i lose motivation not even a week later. I still have a strong faith but i have an extremely hard time praying. I have other reasons to be mentally unstable that i won’t dwell on here, but i assume that the major reason is my sexual trauma. (COCSA happening when i was less than ten, maybe around 8 my memory is very blurry, i don’t have a good memory to begin with, and i was molested at 13).\n\nI feel guilt on a daily basis and im scared that God will forsake me and never forgive me because I’ve been having really bad thoughts (homicidal urges, surges of anger, etc) which are turning me into a bad person, i don’t want God to be disappointed in me. My parents don’t take my mental health seriously, i am unable to keep practicing even when i want to. I don’t wanna justify everything i do or did  but i just need an opinion from other Muslims. \n\nSorry for the long post, it was also kind of a vent. ",
        "upvotes": 89,
        "comments": 17,
        "media": null,
        "permalink": "/r/islam/comments/1gpmfaa/how_do_i_deal_with_sexual_trauma_and_mental/"
    },
    {
        "id": "1gpo2q9",
        "author": "Soft_Double_7618",
        "title": "What made you realize Allah SWT's love for you?",
        "content": "Title. ",
        "upvotes": 62,
        "comments": 30,
        "media": null,
        "permalink": "/r/islam/comments/1gpo2q9/what_made_you_realize_allah_swts_love_for_you/"
    },
    {
        "id": "1gpp0fb",
        "author": "wopkidopz",
        "title": "It will be said on the Day of Resurrection to those who consumed usury: Take your weapon for war! (Ibn Abbas رضي الله عنه)",
        "content": "",
        "upvotes": 53,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tpo0h5ye1i0e1.png?auto=webp&amp;s=ed857bb1cfe4b261c852dfaaa8958ec79ae13f7a"
        },
        "permalink": "/r/islam/comments/1gpp0fb/it_will_be_said_on_the_day_of_resurrection_to/"
    },
    {
        "id": "1gpmcdn",
        "author": "heoeoeinzb78",
        "title": "The reality of weak hadiths... [Explained]",
        "content": "",
        "upvotes": 50,
        "comments": 6,
        "media": null,
        "permalink": "/r/islam/comments/1gpmcdn/the_reality_of_weak_hadiths_explained/"
    },
    {
        "id": "1gpm11g",
        "author": "AbuW467",
        "title": "Good Manners &amp; Fairness - Shaykh ‘Abdur Razzāq al Badr",
        "content": "",
        "upvotes": 37,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0jaztedceh0e1.jpeg?auto=webp&amp;s=9ab650fb99a1f6b4b9b01355217bfdbc2cb44dd6"
        },
        "permalink": "/r/islam/comments/1gpm11g/good_manners_fairness_shaykh_abdur_razzāq_al_badr/"
    },
    {
        "id": "1gpgrlw",
        "author": "Eurasian_Guy97",
        "title": "Does Allah will me to become a Muslim?",
        "content": "If I don't believe in Allah even as I try to believe, is it because He doesn't will it?\n\nIf I happen to sense that spiritually, I'm led to another religion, it's because Allah allowed it, even as He may not want me to?",
        "upvotes": 64,
        "comments": 19,
        "media": null,
        "permalink": "/r/islam/comments/1gpgrlw/does_allah_will_me_to_become_a_muslim/"
    },
    {
        "id": "1gpm4x8",
        "author": "ignoreNoverride",
        "title": "Source of every evil",
        "content": "",
        "upvotes": 24,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/segarAK8meUEjQyizWqn8L5jgN-mkCJFDoTCuLbb0Xk.jpg?auto=webp&amp;s=343183d878af565cda236a7fa6fe212c7c1df1f1"
        },
        "permalink": "/r/islam/comments/1gpm4x8/source_of_every_evil/"
    },
    {
        "id": "1gp7r5d",
        "author": "XF35",
        "title": "How can you not love God after this?",
        "content": "",
        "upvotes": 300,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y26hw8vl6d0e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/islam/comments/1gp7r5d/how_can_you_not_love_god_after_this/"
    },
    {
        "id": "1gpgvjj",
        "author": "Wasab1Lover",
        "title": "Is this a sign from Allah?",
        "content": "\nIs this a sign from Allah?\n\nHello, been going back and forward when studying Islam (I’m not Muslim) I have been using online tutors and educational YouTube videos when it coming to learn about Islam. But then I have suddenly stopped but every time I have stopped learning about Islam. My curiosity and desire to know more have been growing stronger and stronger. It is little difficult to explain but it’s like I can’t stop thinking about it and it makes a strange feeling in the chest? \n\nIn either way I wonder if it can be that it’s Allah who is giving me sign? I’m sorry if this is an inappropriate question. But I can’t get this question from my head. \n\nHave a wonderful day everyone ❤️",
        "upvotes": 44,
        "comments": 10,
        "media": null,
        "permalink": "/r/islam/comments/1gpgvjj/is_this_a_sign_from_allah/"
    },
    {
        "id": "1gpfr8u",
        "author": "Pysco_Teen_1516",
        "title": "'Allah is closer to jugular vein' what does this verse actually points to?",
        "content": "I understand the basic concept behind this verse I.e. Allah the Greatest is all knowing and is very close to us. But why is jugular vein' being pointed? I am not criticizing it (May Allah save us from such evil) but I don't understand Why jugular vein? Is there something that I am missing?\n\nThanks : ) ",
        "upvotes": 59,
        "comments": 20,
        "media": null,
        "permalink": "/r/islam/comments/1gpfr8u/allah_is_closer_to_jugular_vein_what_does_this/"
    },
    {
        "id": "1gpl9wx",
        "author": "Ok_Engineer_4814",
        "title": "how to deal with a tumultuous relationship with Allah?",
        "content": "Salam everyone, i hope this message finds you all well. \n\nrecently ive been doing alot of retrospective thinking and i realised im not practising ie religious for the sake of allah. i became closer to allah at the beginning of last year when i had the most horrible time of my life and i had a national exam that year and basically had no friends and had to endure bullying at school as well which made me skip school often and i turned to religion as a way to cope. \n\n\nnow that its 2024 im not currently studying as i did badly for my national exams and im here pondering why does everything keep going bad for me. i alao have very abusive parents that beat me till i bleed (for context im 17 and a girl and they beat me once bc i bought a body scrub without telling them) and i have to deal with bullies and as a result suffered alot and has ruined my mental helath to the point i genuinely want to die and prayed to die even. because suicide is haram. i feel so trapped and i became even more religious earlier this year because i believed it was because allah hated me and was punishing me with a difficult life whereby everything goes bad and my non practising muslim friends succeed by going on to very good schools and have a good social life and good grades and im here suffering with bad grades and family despite trying my absolute hardest with my eroded mental health.\n\n\nnow i know that some people have it worse everyone has their own set of problems. i do istighfar and salat tawbah and salat duha everyday and life is still not getting any better (in an attempt to seek forgiveness even tho i did not do any of the bad big sins) so im really confused. im contemplating on taking a break from the deen and slowly learn to love it again because i love the peace it once brought me and want to feel it again but dont know how.  sometimes i feel disillusioned with the deen after seeing so much hypocrisy and im starting to feel like whatever this person said in the picture",
        "upvotes": 15,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8y38gg0z7h0e1.jpeg?auto=webp&amp;s=becf772a5f5f7cb5211df331dafb5f612fdd30b1"
        },
        "permalink": "/r/islam/comments/1gpl9wx/how_to_deal_with_a_tumultuous_relationship_with/"
    },
    {
        "id": "1gp0f44",
        "author": "Atlas40802",
        "title": "I am deaf and I Love Allah",
        "content": "I am deaf mute and use british sign language. I live in United Kingdom. \n\nI am a muslim brother, MashAllah. I follow Allah swt and Prophet Muhammad pbuh, Alhamdulillah. I Love Allah swt and Prophet Muhammad pbuh so much, SubhanAllah. \n\nAllah swt Loves me and my family so much and Allah swt always cares me and my family, Allahu Akbar.\n\nHopefully, may Allah swt will take my soul to go to wonderful Jannah. Allah swt will happy meet me and Allah swt will lovely biggest hug me in highest level of Jannah. Allah will give me hearing and speaking and Allah will gift me anything I want after second world, In Sha Allah. \n\nAllahu Akbar, SubhanAllah, Alhamdulillah, MashAllah, In Sha Allah 🇸🇦🕋🤲☝️📖🛐☪️🕌📿🌁",
        "upvotes": 707,
        "comments": 18,
        "media": null,
        "permalink": "/r/islam/comments/1gp0f44/i_am_deaf_and_i_love_allah/"
    },
    {
        "id": "1gpres1",
        "author": "Winter_Doctor1859",
        "title": "I finished the entire Quran as a non-Muslim!",
        "content": "I finished the Quran, it took roughly a month but I did it! It was a lot different than what I thought it would be. I thought it would be similar to the Bible and how many stories and history is in it. It is kind of just to the point of God telling you how to live a Godly life to ensure you enter paradise. I actually want to read it again and study it this time. But should I move onto the Hadiths before I reread it? Anything I should now that I have read it?",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/islam/comments/1gpres1/i_finished_the_entire_quran_as_a_nonmuslim/"
    },
    {
        "id": "1gp6gb8",
        "author": "PsychologicalHost492",
        "title": "I think my last five years of Ramadan are void and I don't know what to do",
        "content": "Hello. This is so embarrassing to admit, but I have no clue where else to turn to and I need advice.\n\nSo, I have a m*sturbation problem. I have tried many times to stop and am getting better, and I believe very soon I will stop forever. Brief backstory is that I was exposed to a lot of sexual content at a young age (which I would say is in part due to a lack of sex education, which led to trying to find answers on the internet), and now here we are.\n\nThe issue is that I had no clue that you had to perform ghusl after doing it until very recently, so not only are my fasts invalid, probably most of my prayers in the past five years are too.\n\nNow, I did the maths, and if I were to pay the meals for every day of those five months, that would be around $30K I believe. I have no clue how I would even start paying that, and I can’t lie I’m terrified.\n\nNow of course, I can make up the fasts. That would be five months of fasting which I will do because obviously I put myself in this position, but I just want to check if that would be valid? \n\nPlease don’t judge. I swear I’m trying to be better, and I feel so, so, so much regret. Thankyou.",
        "upvotes": 157,
        "comments": 30,
        "media": null,
        "permalink": "/r/islam/comments/1gp6gb8/i_think_my_last_five_years_of_ramadan_are_void/"
    },
    {
        "id": "1gozm1u",
        "author": "fluffy_plume0",
        "title": "Details of Pertevniyal Valide Sultan mosque in İstanbul Turkey 🇹🇷 ",
        "content": "",
        "upvotes": 340,
        "comments": 8,
        "media": null,
        "permalink": "/r/islam/comments/1gozm1u/details_of_pertevniyal_valide_sultan_mosque_in/"
    },
    {
        "id": "1gprblj",
        "author": "my_lovely_garden",
        "title": "Today I prayed for the first time and it’s been one of the worst days",
        "content": "Hello everyone,\nI’m for the first time today did Fajr and Asr. I have never prayed before and started following Islam recently due to friends. They told me general information and I started researching later on my own. I’ve been reading books and watching podcast every evening ever since and felt so good. I learnt a lot and started appreciating everything that Allah SWT was giving me and how I was taken care of all this time. I started recognizing that I’m one of the creation as everything here in this and next lifes.\nBut today after I did my first 2 prayers I have been crying all evening. I’m not sure why but I remembered every bad thing that has happened to me, so I called my mom and she told me that my dad started drinking again (he is not Muslim). I feel like it’s my fault and I should pay a price of protecting my mom since my dad has anger issues when drunk and has physically abused her before.\nI really feel like I should stop praying and following Islam until I would solve the problem with my dad since it’s really selfish to focus on personal beliefs at this moment. I’m just so confused why this problem occurred at the moment when I wanted to feel closer to our creator and pay all my attention to that. Is it possible that this is a guidance that timing is not right and I should focus on other things first? ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/islam/comments/1gprblj/today_i_prayed_for_the_first_time_and_its_been/"
    },
    {
        "id": "1gpnkrb",
        "author": "Craloen",
        "title": "Convert Atheist",
        "content": "\n\nI'm in a really complicated phase (I don't have any issues, but I'm in deep reflection).\n\nI would have liked if some people who had no connection to religions at all managed to find some truth in Islam.\n\nI'm lost, I've read a lot, but I always find things to criticize about any religion.\n\nWhat helped you to convert?\n",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/islam/comments/1gpnkrb/convert_atheist/"
    },
    {
        "id": "1gpop15",
        "author": "zahora_1112",
        "title": "I ate out of forgetfulness while \"catching up\" on a day of Ramadan fasting",
        "content": "is my fast accepted? or is it only during ramadan?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/islam/comments/1gpop15/i_ate_out_of_forgetfulness_while_catching_up_on_a/"
    },
    {
        "id": "1gpsqew",
        "author": "Za_enthusiast",
        "title": "I'm A Young African American looking to get into Islam and Convert.",
        "content": "Could anybody in a similar position or was, message me with a good starting point. Like reading the Quran, some of the translations have just been a bit confusing ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/islam/comments/1gpsqew/im_a_young_african_american_looking_to_get_into/"
    }
]