[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 26,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1ktjofi",
        "author": "brutale800",
        "title": "Compleanni torinesi a pagamento",
        "content": "Ciao, per chi non lo sapesse perché è di fuori, a Torino e immagino in Piemonte in generale, quando vi invitano a cena/pranzo per un compleanno dovete pagarvi da mangiare e da bere oltre a fare il regalo. Dico ciò perché molti arrivano impreparati a situazioni simili aspettandosi che se ti invitano è implicito che ti offrono e tu fai solo il regalo. Qua non è così. Le eccezioni avvengono solo (e sempre a carattere eccezionale) in contesti familiari. Tutto ciò che invece riguarda colleghi, amici, conoscenti etc, se ti invitano al compleanno devi pagarti la cena. \nCosa ne pensate?",
        "upvotes": 18,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1ktjofi/compleanni_torinesi_a_pagamento/"
    },
    {
        "id": "1kt7uwp",
        "author": "333sjm333",
        "title": "Trasferimento a Torino: quali quartieri consigliate?",
        "content": "Ciao gente!  \nSono una ragazza che ha vissuto in Emilia Romagna (Cesena), poi mi sono trasferita in Argentina, ma adesso vorrei tornare in Italia… più precisamente a Torino! L’idea è andare a vivere da sola.. essere indipendente e ricominciare lì.  \nVolevo chiedervi una mano: che quartieri mi consigliate per vivere? Cerco una zona tranquilla, non pericolosa e dove gli affitti non siano esagerati. Se è ben collegata, ancora meglio! E se c’è qualcunə dell’Argentina che vive già a Torino, mi farebbe super piacere parlarne e magari fare amicizia!  \nSe vi piace Zelda, i videogiochi o il rock/metal… potremmo andare d’accordissimo!  \nSaluti! e grazie per leggere",
        "upvotes": 16,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1kt7uwp/trasferimento_a_torino_quali_quartieri_consigliate/"
    },
    {
        "id": "1ktgn02",
        "author": "BroqueviNEGAR",
        "title": "Need Advice with my Application to Unito",
        "content": "I recently received an update from the Univers ity of Turin regarding my application for the Economics, Finance and Data Science program. Unfortunately, due to a high number of applications and limited quota seats, my admission couldn't be processed further. \n\nI'm feeling a bit stuck and would really appreciate your advice.\n\nls it possible for me to apply now for the Business &amp; Management program instead? Or would it be wiser to wait for the July intake and try again for my original choice?\n\n If anyone has faced a similar situation or has insight into how flexible the university is with switching programs (or general advice on navigating this), please share your thoughts.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ktgn02/need_advice_with_my_application_to_unito/"
    },
    {
        "id": "1ksja45",
        "author": "minoriso",
        "title": "Franchino Er Criminale a Torino: delusione totale",
        "content": "Ragazzi, ormai è chiaro: da quando Franchino Er Criminale è \"salito al nord\", qualcosa si è rotto.\n\nOgni volta che ha consigliato un posto a Torino, ci sono andato con aspettative alte e ne sono sempre uscito deluso. Locali mediocri, esperienze banali, posti che definire “criminali” è un insulto al suo stesso personaggio. Ma il problema non è solo la qualità delle scelte, è il modo in cui racconta Torino: una città vista con gli occhi del fuorisede con soldi, non del lavoratore vero.\n\nFranchino si riempie la bocca di proletariato, ma è il primo a comportarsi da classista: basta vedere come tratta le zone più popolari o periferiche, cioè quelle non gentrificate o frequentate da studenti universitari. Ci ha messo piede giusto per dire \"vabbè, ci sono stato\", giusto per far numero. Pochi posti citati, video tirati via, tono annoiato. E magari proprio lì c’era qualcosa di più autentico da raccontare.\n\nContribuisce a una visione distorta di Torino, fatta solo di spritz, panini gourmet e street food fighetto nei quartieri universitari. Ma questa città è anche (soprattutto) fatica, precarietà, disoccupazione. Non lo dico io: Draghi stesso disse che Torino ha i numeri occupazionali di una città del Sud. Eppure questa realtà non traspare mai dai suoi video.\n\nE come se non bastasse, il \"proletario\" decide di aprire una \"osteria\" non in periferia o in un quartiere popolare, ma nel Quadrilatero Romano, una delle zone più gentrificate, turistiche e care della città. Un’area già satura di locali simili, dove l’ennesimo posto da 15 euro a piatto non cambia nulla, anzi, contribuisce alla bolla. Ma va bene così, purché faccia scena su Instagram.\n\nIl problema è che non gli si può nemmeno fare una critica costruttiva, perché lui – e alcuni suoi colleghi – si comportano come i padri eterni del cibo: intoccabili, infallibili, oltre il bene e il male. Ma la verità è che mangiare bene non basta per raccontare una città.\n\n\n📝 Postilla alla Franchino:\nQuesta è un'opinione personale, dettata dalla mia esperienza e sensibilità. Non sto parlando in modo oggettivo e non voglio insegnare nulla a nessuno. Se a qualcuno piace, buon per lui.",
        "upvotes": 292,
        "comments": 142,
        "media": null,
        "permalink": "/r/torino/comments/1ksja45/franchino_er_criminale_a_torino_delusione_totale/"
    },
    {
        "id": "1ktgtgt",
        "author": "BoogieStopShuffle",
        "title": "Inspirational places in the field of child pedagogy?",
        "content": "Buongiorno, Torinese! \n\nI'm visiting Turin for a full week and have some time on my hands. I work in child pedagogy and I'm looking for inspiration during my trip. What are some good places to visit?\n\nI'm particularly interested in schools, museums, playgrounds, youth centers—anything related to children between the ages of 2.5 and 12, both in formal education and leisure activities. \n\nI am also looking for activities I can enjoy with my one year old. \n\nGrazie mille per il vostro aiuto!\n \n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ktgtgt/inspirational_places_in_the_field_of_child/"
    },
    {
        "id": "1kt9n6c",
        "author": "MatteVat25",
        "title": "Info quartiere",
        "content": "Qualcuno che abita in quartiere borgo Filadelfia o lingotto nella zona vicino al cavalcavia di corso Bramante? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kt9n6c/info_quartiere/"
    },
    {
        "id": "1ktebnm",
        "author": "SafeZookeepergame573",
        "title": "Napoli Cagliari?",
        "content": "Non tifo napoli ma essendo vissuto lì per 7 anni ed avendo vissuto la magia dello scudetto 2023 sto in fase nostalgia . Anyway in questo caso sto facendo il tifo per il napoli , mi chiedevo se c'erano posti in cui facevano vedere la partita. Un club napoli boh\n\nOh anche una diretta gol così vediamo anche l'Inter.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ktebnm/napoli_cagliari/"
    },
    {
        "id": "1ktdu43",
        "author": "micro_machines",
        "title": "Dove guardare la F1?",
        "content": "Hola Torino, sarò qui questo fine settimana e volevo vedere la F1, le qualifiche e la gara a Monaco. I torinesi hanno un bar o un posto preferito dove guardarlo? Grazie!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ktdu43/dove_guardare_la_f1/"
    },
    {
        "id": "1ksrmx7",
        "author": "Defiant-Resist-2615",
        "title": "Perché il 68 è sempre in ritardo?",
        "content": "Mi chiedevo perché il 68 è costantemente in ritardo, proprio ora lo sto aspettando da 30 minuti alla fermata, mentre tutti le altre linee che passano in questa fermata sono già passate , come al solito il 68 non è ancora passato.\nIn oltre ho visto 4 pullman 68 andare nella direzione opposta alla fermata, non essendo neanche lontano dal capolinea di sassi non riesco a spiegarmi come sia possibile che questi 68 \"spariscano\"per così dire  non riesco a darmi una spiegazione , proprio mentre scrivevo questo post è passato il quinto di fila dall'altra direzione .\n\nDopo 40 minuti persi  alla fermata ho rinunciato e sono andato via.",
        "upvotes": 22,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1ksrmx7/perché_il_68_è_sempre_in_ritardo/"
    },
    {
        "id": "1kss5e5",
        "author": "nicco_lo",
        "title": "Sono quello che cercava in Corso Brescia all’incrocio con Corso Giulio Cesare",
        "content": "Alla fine ho trovato casa in Crocetta, Corso Rosselli. È buona vero? Per favore ditemi di si.",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1kss5e5/sono_quello_che_cercava_in_corso_brescia/"
    },
    {
        "id": "1kst3bm",
        "author": "met91",
        "title": "Iniziativa GTT x DOTT",
        "content": "Ho appena ricevuto una mail dall'app dei monopattini Dott per una iniziativa interessante con GTT: con ogni abbonamento si ricevono corse gratuite di 30min.\n\nHo pensato di condividerlo anche qui per info di chi può essere interessato 😁🛴🚋",
        "upvotes": 10,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n60n4wrumc2f1.jpeg?auto=webp&amp;s=687ffa595ab715de8080a4d0688f416bb9f57a55"
        },
        "permalink": "/r/torino/comments/1kst3bm/iniziativa_gtt_x_dott/"
    },
    {
        "id": "1kssgu8",
        "author": "dinoscullyy",
        "title": "ritiro tessera elettorale",
        "content": "ciao! Ho provato a scrivere all'ufficio elettorale ma non mi rispondono, quindi provo a chiedere qui:\nqualcuno sa come funziona il ritiro della tessera elettorale? So che la mia è in giacenza in corso Valdocco, devo prendere appuntamento in qualche modo o semplicemente mi presento lì, prendo il numerino, aspetto il mio turno e la ritiro? \nGrazie! \n",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kssgu8/ritiro_tessera_elettorale/"
    },
    {
        "id": "1kt1w0y",
        "author": "Silly_Feeling1182",
        "title": "IED Torino",
        "content": "Ciao a tutti!\nSto valutando di iscrivermi al triennio di Fotografia allo IED di Torino e volevo chiedere se c’è qualcuno qui che l’ha frequentato o ne sa qualcosa.\n\nCom’è l’ambiente? Vale la pena?\nMi interessa soprattutto il lato pratico: si fanno davvero tanti progetti? I prof sono validi?\nE in generale: quanto ti prepara al mondo del lavoro reale?\nSo che è una scuola privata e costa parecchio, quindi vorrei essere sicuro prima di buttarmi.\n\nMi piacerebbe sentire opinioni sincere, anche critiche.\nOgni consiglio è ben accetto – anche se avete fatto un altro indirizzo allo IED di Torino!\n\nGrazie in anticipo 🙏",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kt1w0y/ied_torino/"
    },
    {
        "id": "1kt0qlg",
        "author": "Acrobatic_Cup_8867",
        "title": "Dove posso trovare l’henne da usare sulla pelle a Torino?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kt0qlg/dove_posso_trovare_lhenne_da_usare_sulla_pelle_a/"
    },
    {
        "id": "1ksox67",
        "author": "realag",
        "title": "Techno in Turin during the week",
        "content": "Hello all,\n\nI will be in Turin next week for work and I try to hit up the techno/house scene in every city I visit. Are there any places in Turin that serve good techno/house music during week days? I'd love to check them out. \n\nThank you,\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ksox67/techno_in_turin_during_the_week/"
    },
    {
        "id": "1kss5iz",
        "author": "H4ttori_H4nzo",
        "title": "Olon Settimo Torinese",
        "content": "Qualcuno lavora in Olon a Settimo Torinese come operaio?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kss5iz/olon_settimo_torinese/"
    },
    {
        "id": "1ks9wfi",
        "author": "riofat",
        "title": "Been living in torino italy for 4 yrs and still I can't speak good italian",
        "content": "Does anyone know a language school that can teach you language because I've been in ASAI SCHOOL before and I didn't finish it because I have work and im embarrassed to comeback. Pls if y'all know language school for immigrants share it to me:) thanks",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ks9wfi/been_living_in_torino_italy_for_4_yrs_and_still_i/"
    },
    {
        "id": "1krvhwd",
        "author": "Responsible_Cow_6025",
        "title": "furto sul 45",
        "content": "a chiunque mi abbia rubato il portachiavi con le bombe di Zelda, sappi che era un regalo dalla mia ragazza e ci tenevo tanto, a chiunque tu sia ti auguro il peggo",
        "upvotes": 26,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oyl2nyg4f42f1.jpeg?auto=webp&amp;s=1f74d781b445f8a6d2eb6266ca7e69481e520f05"
        },
        "permalink": "/r/torino/comments/1krvhwd/furto_sul_45/"
    },
    {
        "id": "1ksatmi",
        "author": "Unlucky_Winner_1187",
        "title": "Is mirafiori nord safe at night?",
        "content": "Around piazza omero to be exact. I am planning to move to that area but i dont know if its a good choice",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ksatmi/is_mirafiori_nord_safe_at_night/"
    },
    {
        "id": "1ks1i53",
        "author": "Serious-Sentence4592",
        "title": "Qualcuno che studia matematica a UniTO?",
        "content": "Devo chiedere info / consigli",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ks1i53/qualcuno_che_studia_matematica_a_unito/"
    },
    {
        "id": "1ks4366",
        "author": "shadowbalance_",
        "title": "Cercasi ciclisti amatoriali",
        "content": "Salve a tutti! Ormai qualche mese fa ho comprato una bici gravel che causa esami e maltempo non ho mai usato. Ora che sta arrivando l'estate volevo andare a fare qualche giro in gravel. Qualcuno sarebbe interessato a venire? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ks4366/cercasi_ciclisti_amatoriali/"
    },
    {
        "id": "1ks0i8l",
        "author": "FeistyDistribution20",
        "title": "Activties? What do you do for fun?",
        "content": "How do you make friends and find things to do here?   \n  \nWill be in Turino for a little bit (Till august) and wanted to get everyone's thoughts on activities, solo or with a partner. It can be in Turin or a day trip etc.  \n\n\nBackground:  \nBasically live here due to circumstances many many times (overall 1.5yrs cumulative yrs been here?) been never made friends with the locals enough since I'm always gone half the year. \n\nWhat I did already:  \nBeen to the flower festival, asapargus festival, check torusim sights (the official one) here but want to hear whatever there is to do to make friends (meetup checked)   \nBeen to the automotive festival and all the museums - or majority. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ks0i8l/activties_what_do_you_do_for_fun/"
    },
    {
        "id": "1krts26",
        "author": "3dgarAllanHo3_",
        "title": "Bar/pub economici san salvario",
        "content": "Ciao!! Mi sono appena trasferita in San salvario, droppatemi il nome del vostro bar/pub preferito in zona! Meglio ancora se non troppo caro :)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1krts26/barpub_economici_san_salvario/"
    },
    {
        "id": "1kr39e2",
        "author": "_tatabox",
        "title": "Ho trovato questo vecchio biglietto della tranvia Sassi Superga",
        "content": "Forse è del 2000-2002 ma non ne sono sicura ",
        "upvotes": 85,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4pjugfq2hx1f1.jpeg?auto=webp&amp;s=01922da50f2e4e3c5c94f48a28447b41a074e8ff"
        },
        "permalink": "/r/torino/comments/1kr39e2/ho_trovato_questo_vecchio_biglietto_della_tranvia/"
    },
    {
        "id": "1krrzae",
        "author": "AdShort2912",
        "title": "qualcuno che insegna italiano?",
        "content": "Sono un ragazzo che è in torino per contratto di lavoro e vorrei qualcuno che può insegnare italiano o gruppi dove imparare altre lingue o se qualcuno vuole imparare lo spagnolo.\nsorry...",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1krrzae/qualcuno_che_insegna_italiano/"
    },
    {
        "id": "1krdrq0",
        "author": "dean_ax",
        "title": "Cercasi gelateria buona zona parella",
        "content": "Buonasera a tutti. Mi sono trasferita con il mio tipo in una nuova zona di Torino. Prima a borgo san Paolo eravamo clienti fissi della gelateria Mosa (se non la conoscete provatela che merita davvero). Io non ho un palato raffinato ma il mio ragazzo si.\n\nSiccome Mosa è molto scomoda da raggiungere da casa nostra coi mezzi, avete consigli su gelaterie in zona parella a parte Gelateria d'Antan? Le sue pippe mentali sulle gelaterie buone riguardano: gelato non a vista ma dentro ai pozzetti, gusti classici e magari qualche variante.\n\nHelp",
        "upvotes": 9,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1krdrq0/cercasi_gelateria_buona_zona_parella/"
    },
    {
        "id": "1krp073",
        "author": "RaveGirl9696",
        "title": "Ciao tutti! Kappa Festival ?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1krp073/ciao_tutti_kappa_festival/"
    },
    {
        "id": "1krdx2j",
        "author": "HeftyHistorian3174",
        "title": "Cerco compagnia per ristorante Condividere giovedì 19 giugno",
        "content": "Ciao, qui M32 super appassionato di alta cucina che oggi dando un'occhiata si è imbattuto in una rarissima disponibilità! Menù Gran Festival senza il minimo dubbio e magari una bottiglia di vino da condividere. Qualche interessat\\* ? ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1krdx2j/cerco_compagnia_per_ristorante_condividere/"
    },
    {
        "id": "1kr30gx",
        "author": "Enea_616",
        "title": "Scusate l'ignoranza. Questa zona è sicura di notte? (Via Assietta - Corso Stati Uniti). So che Crocetta è sicura ma la strada è anche attaccata a Porta Nuova",
        "content": "",
        "upvotes": 20,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ggu4eo1iex1f1.jpeg?auto=webp&amp;s=3dcce3b91e65d069e43f6e2052829b135d52e109"
        },
        "permalink": "/r/torino/comments/1kr30gx/scusate_lignoranza_questa_zona_è_sicura_di_notte/"
    },
    {
        "id": "1kqnk1r",
        "author": "Medium_Woodpecker887",
        "title": "Aggredito da dei maranza egiziani ,questa città è pericolosa.",
        "content": "Vicino alla stazione,io camminavo tranquillamente quando passo vicino a un ragazzo che mi chiede ''vuoi fumo?'' io dico no e continuo a camminare,poi noto che il ragazzo e un altro comunque mi seguono,e al lato sinistro della strada arriva uno più alto che mi guarda e fa ''oh vieni'' ma i suoi amici gli fanno ''no no lascialo perdere '' poi si mettono a ridere della mia reazione e noto che era proprio un bel gruppo,persone grandi, classico outfit da maranza,sicuro tutti egiziani,solo che erano divisi ai lati per strada , uno mi tocca il braccio e fa ''no vai via'',mi stava per partire il pugno in faccia ma mi stavo bloccando,poi anche questo ,continuava a scherzare e non me lo tira davvero ma fa il gesto di tirarmi un pugno/schiaffo o qualcosa del genere,la cosa peggiore è che stava facendo finta di mettersi a sedere nelle panchine e mi ha messo le mani da dietro,sicuro sto pezzente voleva rubare qualcosa,poi le ha levate subito poco dopo ridendo ,tutto questo vado avanti e semplicemente continuano a ridere.",
        "upvotes": 85,
        "comments": 94,
        "media": null,
        "permalink": "/r/torino/comments/1kqnk1r/aggredito_da_dei_maranza_egiziani_questa_città_è/"
    }
]