[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1j39xnh",
        "author": "SteamPaz",
        "title": "Sinagoga, Luna, Venere",
        "content": "",
        "upvotes": 17,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mce9k9x65ome1.png?auto=webp&amp;s=d4419fe8822d94cc0928093293cadf8bb98e488f"
        },
        "permalink": "/r/torino/comments/1j39xnh/sinagoga_luna_venere/"
    },
    {
        "id": "1j37669",
        "author": "DBonny101",
        "title": "Festival dell'Oriente",
        "content": "Ciao, sono qua per sapere le vostre opinioni. Ne vale la pena andarci? Sono attratto delle arti orientali, vorrei capire se è solo un evento commerciale fine a se stesso o meno.\nGrazie per le risposte ",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1j37669/festival_delloriente/"
    },
    {
        "id": "1j3alxm",
        "author": "xclajre",
        "title": "biciclettaro zona San Donato/Porta Susa",
        "content": "ciao! come da titolo, sto cercando un'officina a prezzi accessibili per dare una controllatina alla mia bici e sostituire i freni per non rischiare di morire nuovamente ❤️ \nconoscete qualcuno di affidabile in quelle zone? grazie!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j3alxm/biciclettaro_zona_san_donatoporta_susa/"
    },
    {
        "id": "1j37v0v",
        "author": "CollapseOverflow",
        "title": "Raccolta di Buone Indirizzi a Torino: Consigli per Mangiare, Bere, Divertirsi, Ascoltare Musica e Ballare",
        "content": "Ciao a tutti!\n\nSono alla ricerca delle migliori **buone indirizzi** a Torino e vorrei il vostro aiuto. Quali sono i vostri luoghi preferiti per:\n\n* Mangiare\n* Bere un bicchiere\n* Divertirsi\n* Ascoltare musica\n* Ballare\n\nL'idea è di fare un bel riepilogo con tutte le vostre risposte, in modo da avere una guida completa delle migliori destinazioni della città. Grazie mille in anticipo per i vostri consigli",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j37v0v/raccolta_di_buone_indirizzi_a_torino_consigli_per/"
    },
    {
        "id": "1j3eksn",
        "author": "CowEnvironmental3401",
        "title": "Concerto GY!BE OGR",
        "content": "Per chi va a vedere sabato i GY!BE ci becchiamo il pomeriggio e ci beviamo quelle sette/otto birrette nel frattempo?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j3eksn/concerto_gybe_ogr/"
    },
    {
        "id": "1j37qh6",
        "author": "Kruznica-Groznica",
        "title": "Prezzo per servizi di pulizia domestica a Torino: è normale o troppo alto?",
        "content": "Ciao, sono uno studente qui a Torino e sto cercando i servizi di un'agenzia di pulizie per aiutarmi a pulire un po' l’appartamento. L’appartamento è di 80 metri quadrati e comprende una camera da letto spaziosa, un soggiorno, una cucina, un bagno e un corridoio ampio. Mi servirebbero principalmente servizi come la pulizia dei pavimenti, la rimozione della polvere dagli scaffali, la pulizia del bagno e la pulizia completa della cucina (compresi gli interni dei mobili della cucina, il frigorifero, ecc.). Non ho bisogno di una pulizia profonda dei mobili o simili.\n\nHo contattato alcune agenzie che ho trovato su Google, ma nessuno parlava inglese, quindi ho dovuto comunicare con il mio italiano un po’ limitato. Mi hanno chiesto di registrare un video dell’appartamento e di inviarlo tramite WhatsApp per potermi fornire un preventivo.\n\nL’ho fatto e sono rimasto sorpreso dai prezzi, quindi vorrei capire se si tratta di prezzi normali o se mi stanno facendo pagare di più perché sono straniero.\n\nUn'agenzia mi ha offerto il servizio a 300 EUR, mentre un'altra ha chiesto 400 EUR.\n\nPrima vivevo a Londra e persino lì i servizi di pulizia erano più economici rispetto a Torino.\n\nCosa ne pensate di questi prezzi?",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1j37qh6/prezzo_per_servizi_di_pulizia_domestica_a_torino/"
    },
    {
        "id": "1j3asoh",
        "author": "HAldo0",
        "title": "Bar/Biblioteche/Aule studio zona Stazione Porta Susa",
        "content": "Ciao a tutti! Ho un cambio Treno-Flixbus di alcune ore a Torino in zona Stazione Porta Susa. Ci sono bar tranquilli o biblioteche, o aule studio, in cui riposare in zona? Grazie",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j3asoh/barbibliotecheaule_studio_zona_stazione_porta_susa/"
    },
    {
        "id": "1j2jxth",
        "author": "lollopollo18",
        "title": "Scam assurdo da \"Museo Impossibile\"",
        "content": "Oggi, 3/03/25 sono andato a questa \"mostra\" se così vogliamo chiamarla poiché non era organizzata... costava 13 euro a persona (una rapina), niente aria RESPIRABILE, attrazioni per BAMBINI max 3 anni immagini attaccate alle pareti che dovrebbero essere \"illusioni\" dovrebbero fare 5 euro a bambino e adulto GRATIS.... qualità delle strutture scadente come da foto...\nNON CI ANDATE!!!",
        "upvotes": 55,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8bcvatwhjhme1.jpeg?auto=webp&amp;s=5b30a999c2b417a05af613efd2300828e30ec1a8"
        },
        "permalink": "/r/torino/comments/1j2jxth/scam_assurdo_da_museo_impossibile/"
    },
    {
        "id": "1j380hp",
        "author": "Remarkable-Foot-7919",
        "title": "Medici sportivi a Torino",
        "content": "Ciao! Qualcuno sa suggerirmi uno o più medici sportivi a prezzi ragionevoli su Torino (eventualmente anche prima cintura)? Grazie mille! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j380hp/medici_sportivi_a_torino/"
    },
    {
        "id": "1j2l2w5",
        "author": "silviuzX2",
        "title": "Zaini su tram/bus",
        "content": "Ma é veramente un concetto così complicato mettervi lo zaino tra le gambe o tenerlo almeno di fronte a voi ? Perché ingombra lo spazio di altre due persone e muoversi é molto più difficile, oggi ero sul 10 (ma capita ovunque) e ovviamente non è la prima volta che capita ma volevo sfogarmi, c’era una ragazza che aveva più che uno zaino sembrava una valigia con gli spallacci, per non parlare delle altre decine di persone facendo lo stesso….non vi capirò mai",
        "upvotes": 23,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1j2l2w5/zaini_su_trambus/"
    },
    {
        "id": "1j2ue2s",
        "author": "Academic-Wave-2596",
        "title": "con 1500usd a Torino?",
        "content": "Hey guys, I was wondering the possibility of living a Torino with a dignity life with 1500usd.\n\nI'm talking about eat healthy, make one or two food outside a month, 1 quick trip a month let's say.\n\nWhat you think?",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1j2ue2s/con_1500usd_a_torino/"
    },
    {
        "id": "1j2lmce",
        "author": "notrimbaud",
        "title": "volontariato a torino?",
        "content": "ciao :) mi sono trasferita a Torino a settembre x università. \nCerco posti per fare volontariato (preferibilmente a che fare con sanità/medicina e animali/matura/ambiente) o gruppi/collettivi creativi e ambientalisti etc… anche altra toba che ha a che fare con arte e biblioteche varie mi interesserebbe!  \nvorrei trovare ambienti con persone gentili e non giudicanti :•) \n\ngrazie in anticipo! ♡ \n\n(conosco già un po’ di posti carini però faccio un po’ di fatica ad andarci da sola perché sono un po’ ansiosa… mi piacerebbe riuscire a trovare un posto dove stare bene) ",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j2lmce/volontariato_a_torino/"
    },
    {
        "id": "1j2zsd3",
        "author": "Diecast_5682",
        "title": "Ci sono appassionati di bourbon a Torino?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wn7wve0uxkme1.jpeg?auto=webp&amp;s=ab0a2556d1a4fb46361938c4e2cdf6fb97567f37"
        },
        "permalink": "/r/torino/comments/1j2zsd3/ci_sono_appassionati_di_bourbon_a_torino/"
    },
    {
        "id": "1j2prv8",
        "author": "One-Tour9392",
        "title": "Com'è vivere a Falchera?",
        "content": "È una zona che non ho mai visitato. Dal punto di vista geografico mi sembra una posizione comoda per muovermi, vicino a ferrovia, autostrada, 4. \n\nInoltre, le case hanno prezzi accessibili, anche troppo a volte...per cui, com'è viverci? A livello sociale che situazione c'è? ",
        "upvotes": 2,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1j2prv8/comè_vivere_a_falchera/"
    },
    {
        "id": "1j2lxxz",
        "author": "Forward_Gur8889",
        "title": "Locali aperti tutta la notte o quasi?",
        "content": "Ciao, sabato andrò a un concerto alle OGR e, visto che dovrò aspettare il primo treno del mattino per tornare a casa, volevo sapere se c'erano locali (magari \"alternativi\" insomma non la discoteca dove vanno i ragazzini ecco, con tutto il rispetto) che sono aperti tutta la notte, il concerto credo che finirà alle 23 30 non dopo. Altrimenti mi tocca spendere più per l'ostello che per il biglietto dell'evento stesso. Mi era venuto perfino in mente di portarmi un libro e leggerlo ma dubito ci siano posti dove poter leggere un libro di notte come se niente fosse.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1j2lxxz/locali_aperti_tutta_la_notte_o_quasi/"
    },
    {
        "id": "1j2qym9",
        "author": "Altruistic_Leg7460",
        "title": "sito web per trovare lavoro e affitto",
        "content": "Ciao!\n\nVorrei sapere da qualsiasi sito web per trovare lavoro e affitto!\n\nGrazie :)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j2qym9/sito_web_per_trovare_lavoro_e_affitto/"
    },
    {
        "id": "1j2h28g",
        "author": "ddddxsxs",
        "title": "Auto a Torino",
        "content": "Ciao,\n\nProbabilmente nel prossimo futuro verrò a Torino con la mia ragazza. Io lavorerò all'ospedale San Lazzaro, lei invece studierà al Politecnico (sede di Corso duca degli abruzzi). Dal momento che sto valutando l'acquisto di un auto (una berlina) in sostituzione della mia utilitaria, mi chiedevo come fosse la situazione auto/parcheggi a Torino.\n\nIpotizzando di prendere una casa in zona ospedale/zona politecnico pensate che sarà semplice trovare parcheggio in queste zone?\n\nRitenete che l'auto a Torino sia utile oppure i mezzi sono efficienti e frequenti e quindi rendono un po' inutile l'uso dell'auto? Mi è stato raccontato da conoscenti che a Torino i mezzi si rompono a metà corsa, saltano corse, fanno scioperi a profusione e in generale non ci si può fare molto affidamento. Confermate?\n\nMi piacerebbe avere l'opinione di chi ci vive ",
        "upvotes": 2,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1j2h28g/auto_a_torino/"
    },
    {
        "id": "1j2op6l",
        "author": "Ligarchy",
        "title": "Tatuatori cybersigilism",
        "content": "Conoscete dei bravi tatuatori dj cybersigilism a Torino i dintorni?\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j2op6l/tatuatori_cybersigilism/"
    },
    {
        "id": "1j1qlwl",
        "author": "sbrodolino_21",
        "title": "Oggi tutti in piazza Carignano alle 17 per supportare l'Ucraina!",
        "content": "",
        "upvotes": 73,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4wwdv8b11ame1.jpeg?auto=webp&amp;s=3591b3b9d0125bcab624e3cd27eba3ee5a377792"
        },
        "permalink": "/r/torino/comments/1j1qlwl/oggi_tutti_in_piazza_carignano_alle_17_per/"
    },
    {
        "id": "1j1nzsi",
        "author": "maldinoia",
        "title": "Vi consiglio una mostra",
        "content": "Se nella giornata di oggi non sapete cosa fare, vi consiglio una bella mostra sull'impatto dei cambiamenti climatici del fotografo Mitch Epstein.\nOggi è l'ultimo giorno, se ci siete stati o ci andrete fatemi sapere i vostri pareri",
        "upvotes": 20,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j1nzsi/vi_consiglio_una_mostra/"
    },
    {
        "id": "1j1zeax",
        "author": "cag_an0",
        "title": "Looking for friends",
        "content": "I am a 21 yo male international student. I don't speak Italian. If anybody would like to hang out to have a beer or coffee sometime, DM me.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j1zeax/looking_for_friends/"
    },
    {
        "id": "1j20zmz",
        "author": "Repulsive-Yak-126",
        "title": "PC clubs in torino",
        "content": "Hi everyone, is there any good PC clubs in Torino, and are they working at night?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j20zmz/pc_clubs_in_torino/"
    },
    {
        "id": "1j1ua8b",
        "author": "NamelessNiner",
        "title": "Gruista, ne vale la pena?",
        "content": "Ciao a tutti! Avevo già fatto un post simile, che ho poi eliminato, su [r/ItaliaCareerAdvice](https://www.reddit.com/r/ItaliaCareerAdvice/) qualche giorno fa.\n\nM29, Al momento lavoro come receptionist in un albergo ma voglio cambiare, principalmente per la questione dei turni che raramente lasciano due giorni liberi di fila, meno che mai al fine settimana.\n\nSto valutando, come dissi nel post precedente, di prendermi un patentino per la gru a torre.\n\nVorrei sapere se c'è qui qualche gruista che può condividere qualche esperienza del suo lavoro, mansioni, orari ecc, per poter fare una scelta informata.\n\nGrazie a chi risponderà!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1j1ua8b/gruista_ne_vale_la_pena/"
    },
    {
        "id": "1j21zjz",
        "author": "what-was-I-supposed",
        "title": "Deviazione Linea 4 sapete quando la ripristinano?",
        "content": "Spero che qualcuno abbia info precise, mi rimetto totalmente a voi.\nDa Corso Unione Sovietica il 4 è stato deviato come sapete, ma quando lo ripristinano per il collegamento fino al centro? Avete info varie? Ho cercato un po' online ma non mi sono raccapezzata. Grazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j21zjz/deviazione_linea_4_sapete_quando_la_ripristinano/"
    },
    {
        "id": "1j1o13q",
        "author": "EdgarTheComputer",
        "title": "Appassionati retrogaming?",
        "content": "C'è un gruppo di appassionati con ritrovi e appuntamenti su TO per condividere la passione del retrogaming?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j1o13q/appassionati_retrogaming/"
    },
    {
        "id": "1j1ql67",
        "author": "Federal-Jackfruit685",
        "title": "Barbiere &lt;15€ Torino centro?",
        "content": "Ciao mi sono trasferito da poco,\nHo casa vicino la mole e cercavo un barbiere economico.\nGrazie",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1j1ql67/barbiere_15_torino_centro/"
    },
    {
        "id": "1j1xe1l",
        "author": "guigbd",
        "title": "Psichiatra a Torino ADHD",
        "content": "Ho visto poco fa una persona che chiedeva la stessa cosa, qualcuno avrebbe un contatto di uno psichiatra bravo che sappia cosa sia lADHD e che soprattutto abbia voglia di prescrivere i medicamenti necessari? \n\nPurtroppo sono già stato da due psichiatri a Torino e sarà che erano vecchi o che non vogliono prendersi la responsabilità ma si sono rifiutati tutti di aiutarmi con i medicamenti nonostante abbiano appurato che questa cosa impatti non poco nella mia vita. \n\nOvviamente si sono fatti pagare fior di quattrini in entrambi i casi. \n\n\nGrazie ! ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1j1xe1l/psichiatra_a_torino_adhd/"
    },
    {
        "id": "1j1pdi2",
        "author": "TheAnt89",
        "title": "5/7 a-side football in Turin",
        "content": "Hiya, \n\nI am looking for people who would like to play 5/7 a-side football once or twice a week. \n\nThere’s no minimum skills level as long as you want to have a good time and play some sports with likeminded people. \n\nMy aim is to bring people together and play football. All nationalities welcome. \n\nIf you are interested, drop me a DM and we will take it from there. \n\nThanks \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j1pdi2/57_aside_football_in_turin/"
    },
    {
        "id": "1j1zr3a",
        "author": "Segretariodelpartito",
        "title": "Voglio provare a creare un nuovo partito",
        "content": "Buongiorno a tutti, mi presento.\nSono un giovane che ha da sempre avuto interesse verso la politica e sognava di fondare il suo partito. Ormai in TV vedo solo vecchi decrepiti ed esaltati che fanno promesse senza rispettarle, condendo ogni dibattito o conversazione di robe inutili che non servono agli italiani. Il mio sogno è cambiare tutto ciò. Voglio cambiare tutto ciò. Da solo non credo che ci riuscirò mai, ma se qualcuno,anche con un po' più di esperienza mi vorrà aiutare, ne sarò grato. Vi chiedo quindi di aiutarmi nel progetto.\nPer chi volesse seguirmi ecco quali sono i punti di partenza:\nil partito non ha ancora un nome\nil partito non si schiererà con nessuna ideologia politica (destra, sinistra, 3 polo) ma punta ad essere indipendente e di aiuto all' Italia.\nLa sede iniziale sarà Milano, se mai un giorno questo progetto si realizzerà.\nSo che non è facile e non è di certo un gioco, quindi chiedo a qualcuno con maggiore esperienza.\nGrazie mille \nInoltre è aperto anche il nostro sub reddit r/partitodacreare\ngrazie per coloro che ci supporteranno ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1j1zr3a/voglio_provare_a_creare_un_nuovo_partito/"
    },
    {
        "id": "1j1panu",
        "author": "TheAnt89",
        "title": "Vuoi giocare a calcio a 5/7?",
        "content": "Ciao a tutti, \n\nVorrei creare un gruppo per giocare a calcio a 5/7 una o due volte a settimana.\n\nSto cercando persone che vogliano giocare per divertirsi e fare attività insieme ad altra gente. Non c’è livello minimo l’importante è essere sportivi e non pensare di essere CR7 o Messi e passare la palla 😄.\n\nSe vi piace l’idea scrivetemi in privato e faccio un gruppo su whatsapp o telegram così ci organizziamo meglio su zona campo e orari. \n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1j1panu/vuoi_giocare_a_calcio_a_57/"
    }
]