[
    {
        "id": "1k9rtun",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 5,
        "comments": 201,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9rtun/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1k9wj9r",
        "author": "MoreanSwordsman",
        "title": "A compilation of Arda being ignored in Barcelona's penalty area.",
        "content": "I think this is one of the keys factors which lead Real Madrid's defeat against Barcelona.",
        "upvotes": 472,
        "comments": 94,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ktg2u67r2lxe1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k9wj9r/a_compilation_of_arda_being_ignored_in_barcelonas/"
    },
    {
        "id": "1k9w2gb",
        "author": "martino732",
        "title": "This is how Rudiger played the Clasico, and Perez is still undecided about signing a CB",
        "content": "",
        "upvotes": 439,
        "comments": 65,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/89nja2utykxe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k9w2gb/this_is_how_rudiger_played_the_clasico_and_perez/"
    },
    {
        "id": "1k9ypkz",
        "author": "dark4403",
        "title": "Wished we had 10 Bellinghams on the field at times.",
        "content": "",
        "upvotes": 146,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4r2b6879jlxe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k9ypkz/wished_we_had_10_bellinghams_on_the_field_at_times/"
    },
    {
        "id": "1k9rzxg",
        "author": "LeakyCauldronChef",
        "title": "As much as we criticize them. Seeing a player in our shirt like this hurts. We will be back.",
        "content": "",
        "upvotes": 270,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ifgG6jA-lgvMKOx4oDhfY3H66xQWLYdCqSmoR-nyHfw.jpg?auto=webp&amp;s=ab221c96dea903c55e0c39d34464736766c78c9c"
        },
        "permalink": "/r/realmadrid/comments/1k9rzxg/as_much_as_we_criticize_them_seeing_a_player_in/"
    },
    {
        "id": "1k9ryc9",
        "author": "Professional_Mode440",
        "title": "Now i wish luka had retired with kroos",
        "content": "",
        "upvotes": 247,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ku2rnltovjxe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k9ryc9/now_i_wish_luka_had_retired_with_kroos/"
    },
    {
        "id": "1k9s1l6",
        "author": "TrueSentence8338",
        "title": "Fun fact: Rodrygo never outscored Ramos 19/20 in the league",
        "content": "But but…Ramos took the penalties 🤧 Okay, 16/17 Ramos had more league goals than our Starboy. Another Fun fact: Mbappe is 10 goals away from matching his La Liga Goal Tally but pleeeease don‘t forget about the ,,R“.\n ,,But he‘s not playing in his natural position“ THIS GUY HAD 3 YEARS TO ADAPT WHAT ARE WE DOING HERE. We need to judge him as a rw, not what he could be as a LW.\n\nIt‘s time for uncomfortable conversations, that bench is calling I fear",
        "upvotes": 160,
        "comments": 61,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9s1l6/fun_fact_rodrygo_never_outscored_ramos_1920_in/"
    },
    {
        "id": "1k9sdvd",
        "author": "Pebbledthoughts",
        "title": "Los Blancos' Finest : Arda Güler, Jude Bellingham and Aurélien Tchouaméni make the Copa Del Rey Team of the season",
        "content": "",
        "upvotes": 91,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gfpc4v1s0kxe1.jpeg?auto=webp&amp;s=b6aaeeac7a29448870f9cf43420e69bdd5be10f9"
        },
        "permalink": "/r/realmadrid/comments/1k9sdvd/los_blancos_finest_arda_güler_jude_bellingham_and/"
    },
    {
        "id": "1k9ophc",
        "author": "Ready_Ad_1353",
        "title": "The title run in, who will win La Liga?",
        "content": "",
        "upvotes": 174,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/10s6x243pixe1.jpeg?auto=webp&amp;s=54743bc921309ba5ab006d3c8510a2ad5e784d65"
        },
        "permalink": "/r/realmadrid/comments/1k9ophc/the_title_run_in_who_will_win_la_liga/"
    },
    {
        "id": "1k9t3pb",
        "author": "AhmedYasha",
        "title": "If we're getting a new LB this summer, which of these options would you prefer?",
        "content": "",
        "upvotes": 65,
        "comments": 114,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i8r5ew8d8kxe1.png?auto=webp&amp;s=cc2f1d5ac740c28e2526e3392008cb8cad566b60"
        },
        "permalink": "/r/realmadrid/comments/1k9t3pb/if_were_getting_a_new_lb_this_summer_which_of/"
    },
    {
        "id": "1k9f0ez",
        "author": "ConspicuousMango",
        "title": "[Madrid Universal] Real Madrid rejected Ancelotti’s request to hire more tactical analysts — Barcelona had a team of seven analysts equipped with multiple laptops and a video camera, while Real Madrid had only two analysts yesterday",
        "content": "",
        "upvotes": 795,
        "comments": 119,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3Ma9pnH-UsHjFfbla89gmfdBiCeR6-Lm50jqinWIPZI.jpg?auto=webp&amp;s=8bb49fb02f6b0948c2df2c2b4f5fc4e4c360a22c"
        },
        "permalink": "/r/realmadrid/comments/1k9f0ez/madrid_universal_real_madrid_rejected_ancelottis/"
    },
    {
        "id": "1k97rh5",
        "author": "Affectionate_lab02",
        "title": "POV: Modric's \"mistake\"",
        "content": "Credits: Kevin Vallejo vía Tik Tok",
        "upvotes": 1683,
        "comments": 93,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vna3stolkexe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k97rh5/pov_modrics_mistake/"
    },
    {
        "id": "1k9ycwf",
        "author": "o6ohunter",
        "title": "We’re going to start having some uncomfortable conversations about Rodrygo soon",
        "content": "The man is just too inconsistent. He sells us dreams and hopes of his ability for a couple of weeks every season then just goes ghost. \n\nI don’t know if it’s because of how he’s had to adopt a more defensive role thanks to Lucas Vazquez or if it’s some confidence/mental thing, but so many times I just find myself forgetting he’s even on the pitch.\n\nThe difference between him and Vini is that Vini, even on his worst games, he still fights. He still makes things happen. Whether it’s beating a defender and sending a cross in, shots on target, hell, even a G/A. He makes things happen and his presence is always felt.\n\nTo put things in perspective, Mbappé, in his DEBUT season, is only 10 goals away from equaling Rodrygo’s total LaLiga goal count. That is just crazy to me. I’d like to know everyone’s thoughts here. Am I rushing to conclusions and being reactionary? Or is this truly a player that is just not at the level of a  Real Madrid starter?",
        "upvotes": 19,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9ycwf/were_going_to_start_having_some_uncomfortable/"
    },
    {
        "id": "1k9p8zr",
        "author": "im7an",
        "title": "This is why i hate when some fans md at Vini for being selfish!",
        "content": "There’s so many times this situation happened this season and i think Vini himself lose his confidence when in this situation.\n\nWhat i think he should do if he was at peaked confidence and truly at his best form, he should just cut inside and no matter no angle or not, he should just shoot to the goal himself!\n\nThat is how Big Players should be!",
        "upvotes": 83,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vkeiztdwvixe1.jpeg?auto=webp&amp;s=d8be575f3098ff7667633a2bf587b8e432439fe6"
        },
        "permalink": "/r/realmadrid/comments/1k9p8zr/this_is_why_i_hate_when_some_fans_md_at_vini_for/"
    },
    {
        "id": "1k9qtsn",
        "author": "anthrgk",
        "title": "Lot of fans are way too emotional and change their mind way too often. I'm glad they don't make the decisions.",
        "content": "This isn't a post defending Rodrygo. I'm just bringing up his case as a perfect example of how lot of fans dramatically change their mind within the span of few weeks, sometimes just one week.\n\nRight after we lost the against Arsenal in El Bernabeu, Marca asked people to  \nvote which players should leave this summer. I'll paste here the most relevant part and I'll provide the link for those who want to read it:\n\n\\&gt;The question was simple, but forceful (Which players should leave in the summer?)... and the answer couldn't have been more direct  \n\\[.......\\]  \n**&gt;Jesús Vallejo** received 12% of the votes \\[...\\] He narrowly surpassed (11%) **Lucas Vázquez**, \\[...\\] The list of culprits is long and sharp. **Alaba followed closely (10%), then Ancelotti and Mendy (9%)... before surprisingly reaching Vinicius (63,000 votes).**  \n\\[.......\\]  \n**&gt;As things stand, Courtois gets the best grade of all (7.16) and Vallejo the worst (3.19). In total, 14 players passed (Courtois, Valverde, Asensio, Bellingham, Rüdiger, Brahim, Ceballos, Lunin, Modric, Mbappé, Carvajal, Endrick, Rodrygo, and Camavinga) and 10 failed (the rest of the squad and Ancelotti).**\n\n  \nLink: [https://www.marca.com/futbol/real-madrid/2025/04/18/aficion-mira-palco-exige-dos-fichajes-venderia-vinicius-verano.html](https://www.marca.com/futbol/real-madrid/2025/04/18/aficion-mira-palco-exige-dos-fichajes-venderia-vinicius-verano.html)\n\nThat was only 1 week ago. The votes were pretty much in line with what many people was saying on this sub after that game.\n\nThose with good memory should remember how for most part of the season how many people used to name Tchouameni as a player who should be sold, and Vinicius (best of the world last season according to most fans) was very often mentioned as a player an attacker that should be sold.\n\nRodrygo or Mbappe were barely mentioned if someone asked if any of our attackers should leave.\n\nFast forward two weeks and nobody thinks Tchouameni should leave, almost nobody mentions Viniciuys should leave but lot of people think Rodrygo should.\n\nNow some will claim that they never asked for Vinicius to be sold but they always asked Rodrygo to be sold. Well, maybe you in particular didn't but the facts are there. If are one of those who claims this or the other certified great player should be sold then I don't believe you, and if you think Rodrygo isn't a great player (despite his performance this season) then I'm sorry but I gotta laugh at how little you understand this team sport.",
        "upvotes": 39,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MvABGJOw1RhOKMEr1hDhTQ6dmv946d2Luju6ZFaF8Yc.jpg?auto=webp&amp;s=41f917829a95b9d18a06b798ba9cdf0d6f0d5dee"
        },
        "permalink": "/r/realmadrid/comments/1k9qtsn/lot_of_fans_are_way_too_emotional_and_change/"
    },
    {
        "id": "1k929rx",
        "author": "heylo07",
        "title": "Aurelien Tchouameni on Instagram: \"They celebrate our losses like we ain’t gon win again. We will be back🤝🏾\"",
        "content": "",
        "upvotes": 1747,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lmi7knoq9dxe1.png?auto=webp&amp;s=72378ce4f94d635666fbcc7c7cd9a2388ecf478d"
        },
        "permalink": "/r/realmadrid/comments/1k929rx/aurelien_tchouameni_on_instagram_they_celebrate/"
    },
    {
        "id": "1k9c0l3",
        "author": "Messmers",
        "title": "[The Athletic] Carlo Ancelotti set to leave Real Madrid and join Brazil in June",
        "content": "",
        "upvotes": 383,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/c6ijoqzIagrH8GSLuDUUtwu-sIslvAA-wYK7g34ppvc.jpg?auto=webp&amp;s=dfbb976515a5afb6cf040ae7a89db2848c301020"
        },
        "permalink": "/r/realmadrid/comments/1k9c0l3/the_athletic_carlo_ancelotti_set_to_leave_real/"
    },
    {
        "id": "1k9z8hd",
        "author": "Mindless_Life_3585",
        "title": "Do we really need midfielder? and who?",
        "content": "After a rough 2024/25 season, it’s easy to look for problems everywhere. But midfield isn’t the issue for Madrid. With Bellingham, Camavinga, Valverde, Arda  and Tchouaméni, the talent is already there. Injuries and bad form hurt the team, not a lack of quality. A new midfielder isn’t the answer this year — fixing other areas is.\n\nit's not bad if we sign new midfield but it's not necessary like CB, LB and RB. \n\neven if we decided to sign it should be cheaper player. \n\nif your opinion is other way around, why? and which midfielder is in your mind?\n",
        "upvotes": 8,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9z8hd/do_we_really_need_midfielder_and_who/"
    },
    {
        "id": "1k95jdm",
        "author": "Kalpesh_K",
        "title": "Fede Valverde on IG.",
        "content": "🤍 Fede Valverde: \"It happened again. And it will surely happen again many more times, because it is the road we are building and it is normal that one falls after so many miles.\n\nIt makes me sad, it makes me angry, impotent. I feel like I failed you.\n\nIt's been a difficult year, physically and mentally very tough, but one day I was clear: 'until my legs don't give up anymore'. This club doesn't deserve less.\n\nWe'll be back, we'll continue and there I'll be leaving everything for the respect Madrid deserves, its people and everything that involves playing in the most winning team in history.\n\nThank you.\"",
        "upvotes": 697,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/t0ecxjyj3exe1.jpeg?auto=webp&amp;s=c795477a4c35571cbb6469eff604cf56e33747af"
        },
        "permalink": "/r/realmadrid/comments/1k95jdm/fede_valverde_on_ig/"
    },
    {
        "id": "1k90jrr",
        "author": "Kidu-Kidutz",
        "title": "Arda alone 3 times , still they don't pass to him",
        "content": "",
        "upvotes": 1516,
        "comments": 171,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k90jrr/arda_alone_3_times_still_they_dont_pass_to_him/"
    },
    {
        "id": "1k9ow37",
        "author": "Whatever_baka",
        "title": "This is just a phase guys, hopefully",
        "content": "I know everyone is angry right now and honestly, that’s the only right response. But we’ve been here before. A few years ago, we were losing 4-0 to Barcelona and getting knocked out by teams like Ajax. Yet even then, at our lowest, we found a way to rebuild and come back stronger. Even at our worst, we won trophies because we adapted and evolved.\n\nThere’s no point in commenting on other teams; what matters is that we, collectively, need to evolve again. Football has changed. Players today are so used to individual attention that they struggle to share the spotlight. But remember when we had Ronaldo, no one could have imagined anyone else from our team winning a Ballon d’Or. Yet we produced not just one, but two different Ballon d’Or winners after him. It’s not about individual awards they never mattered much to me it’s about what they represented: the strength of the team. Our trophy cabinet didn’t grow because of individual brilliance alone; it grew because we played for each other.\n\nFootball has evolved, and the people who need to understand that the most are the ones managing the club the board and the decision makers.\n\nThe part that hurts the most when I watch our matches today is this, the soul of the team I once supported feels lost. There’s no passion, no mentality just wannabe Instagram stars and crybabies. Players lose the ball and stay down waiting for a foul instead of fighting to win it back. That’s not the Real Madrid way.\n\nWe need leadership someone who can bring these kids back in line, or, frankly, some people need to leave.\n\nRegardless, I’ll always support the badge. But this? This is not the level, nor the spirit, of Real Madrid.\n\nWe will bounce back, that’s for sure. \n\nHala Madrid!! ",
        "upvotes": 33,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9ow37/this_is_just_a_phase_guys_hopefully/"
    },
    {
        "id": "1k9e7zk",
        "author": "iamhadi12",
        "title": "Excuse the shitty 'TikTok edit', but everyone barking at Carlo should watch this",
        "content": "",
        "upvotes": 193,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mwxkhs4dwfxe1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k9e7zk/excuse_the_shitty_tiktok_edit_but_everyone/"
    },
    {
        "id": "1k9t6m2",
        "author": "Leading_Inside3812",
        "title": "How would you rank our current squad for next season?",
        "content": "Hey Madridistas,\nIf you had to sort our current squad for next season how would you classify them into these categories?\n\t•\tUntouchables (players who must stay no matter what)\n\t•\tStarters (players who should be in the starting XI)\n\t•\tSquad players (important rotation or backup players)\n\t•\tListen to offers (players you’d be open to selling if a good offer comes)\n\t•\tSell (players who should definitely leave)\nYou don‘t need to rank all our current players tho\n",
        "upvotes": 7,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9t6m2/how_would_you_rank_our_current_squad_for_next/"
    },
    {
        "id": "1k9rasn",
        "author": "lukaszm_",
        "title": "Jersey legit check - Cambodia?",
        "content": "",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9rasn/jersey_legit_check_cambodia/"
    },
    {
        "id": "1k8zp16",
        "author": "Alkarmean",
        "title": "Barcelona first goal…",
        "content": "What the hell is Bellingham doing and why is Rodrygo running back as if it's minute 118",
        "upvotes": 875,
        "comments": 173,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1eodsp2afcxe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k8zp16/barcelona_first_goal/"
    },
    {
        "id": "1k91m63",
        "author": "DonuandDeca",
        "title": "Upcoming \"Militão's comeback is our signing\" 😭",
        "content": "",
        "upvotes": 547,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/am1x4tyv1dxe1.png?auto=webp&amp;s=17568a2adf74cbca55decffe56d7d0c6f23629c4"
        },
        "permalink": "/r/realmadrid/comments/1k91m63/upcoming_militãos_comeback_is_our_signing/"
    },
    {
        "id": "1k93ysp",
        "author": "Shelly_Beats23",
        "title": "Pedri’s First goal was totally preventable",
        "content": "Bruh look at Rodrygo and Bellingham ",
        "upvotes": 369,
        "comments": 72,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fehbq9vbqdxe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k93ysp/pedris_first_goal_was_totally_preventable/"
    },
    {
        "id": "1k985ds",
        "author": "Ready_Ad_1353",
        "title": "Ancelotti: We dominated the second half… and we did everything we could. I can’t criticize the team, we did our best“. “I’m hurt, it was so close. We were so close to winning“. Now we will focus on winning La Liga.",
        "content": "Ancelotti: We",
        "upvotes": 205,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rFTyS9fam7CO6_oOeTLEk88TctWMUjNteLZMH3-Z4zc.jpg?auto=webp&amp;s=6c7ecca67a96d22870dedd98da9b67e4e58b8609"
        },
        "permalink": "/r/realmadrid/comments/1k985ds/ancelotti_we_dominated_the_second_half_and_we_did/"
    },
    {
        "id": "1k9biht",
        "author": "RM-PM-Surveys",
        "title": "[Post Match Survey Results] Real Madrid 2-3 Barcelona",
        "content": "",
        "upvotes": 104,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9biht/post_match_survey_results_real_madrid_23_barcelona/"
    },
    {
        "id": "1k8xyph",
        "author": "Alex6683",
        "title": "Mbappe, if every Real Madrid match is a final",
        "content": "Appreciation post",
        "upvotes": 727,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jf0cmq7btbxe1.png?auto=webp&amp;s=13ce6596e6e313aef3f4139044945a2525942d7a"
        },
        "permalink": "/r/realmadrid/comments/1k8xyph/mbappe_if_every_real_madrid_match_is_a_final/"
    },
    {
        "id": "1k989ip",
        "author": "123kallem",
        "title": "According to MARCA, Carlo Ancelotti could leave Real Madrid in a matter of hours, pending a meeting between him and Florentino Pérez",
        "content": "",
        "upvotes": 120,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sXahX0XJfs4HGw0WzTsZ_CLFxqpUF2MNmU5fkJQsKyw.jpg?auto=webp&amp;s=179bbc9d6f9c14bab92362458cb389ffe0e94b6e"
        },
        "permalink": "/r/realmadrid/comments/1k989ip/according_to_marca_carlo_ancelotti_could_leave/"
    }
]