[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oxh2pj",
        "author": "therealkingwilly",
        "title": "After 7 years as loyal Netflix customers, our account was permanently cancelled with no right of appeal.",
        "content": "\nMy family has been Netflix members since 2018. We live internationally, where I work in education. Like many expat families, we travel frequently - we’ve lived across multiple countries in Asia, Europe, Africa, and Oceania.\n\nLast week, my wife traveled overseas to care for her sick mother. Meanwhile, our children and I stayed home for school. We continued using Netflix on our various devices as we always have.\n\nNetflix’s automated system flagged this as “unusual activity” and permanently cancelled our account. When I contacted customer service, I was told:\n\n❌ There is no appeals process\n❌ There is no formal complaint procedure  \n❌ The decision cannot be reversed\n❌ Seven years of customer history means nothing\n\nThe representative literally said: “Once the system detected the issue, then there’s no option to recover it.”\n\nSo Netflix’s algorithm is judge, jury, and executioner. No human review. No consideration of our account history. No recognition that international families exist. No way to appeal an automated decision.\n\nThis isn’t fraud prevention - it’s punishing legitimate customers for living globally.\n\n@Netflix - Is this really how you treat long-term international subscribers? Where’s the humanity in your customer service?",
        "upvotes": 89,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1oxh2pj/after_7_years_as_loyal_netflix_customers_our/"
    },
    {
        "id": "1oxirji",
        "author": "Short_Pin_6243",
        "title": "The Beast and Me is one of the best drama shows Netflix has put out in awhile *no spoilers*",
        "content": "*****The Beast In Me******* is the title\n\nNot going to get into specifics because it’s brand new and don’t want to ruin it for anyone else. \n\nBut there was a time when Netflix put out pretty good tv dramas yearly. That time has been replaced as of recent by some pretty big misses.\n\nEven the shows I can think of from this year like Untamed, Wayward, Waterfront, Hunting Wives, Black Rabbit etc are all lacking a lot. It feels like the only shows Netflix sometimes hit on are British dramas. \n\nSo if you are reluctant to check it out, don’t be. (In my opinion of course) ",
        "upvotes": 18,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oxirji/the_beast_and_me_is_one_of_the_best_drama_shows/"
    },
    {
        "id": "1ox3cn4",
        "author": "florionpeni",
        "title": "Netflix just suspended my 8-year old account out of the blue with no communication whatsoever",
        "content": "So this is honestly blowing my mind. My Netflix account was suddenly suspended out of nowhere no email, no warning, nothing. I called customer service and the rep literally told me: “The system removed your account. There’s nothing we can do.” That’s all she said. No reason, no confirmation email, no explanation of what “the system” even means. Just… goodbye, I guess? They also refused a refund for the remaining time on my subscription. Is this normal? Has this happened to anyone else? I’m genuinely baffled. It felt like talking to some automated authoritarian Big Brother thing “the system decided you’re out”. Like… what??",
        "upvotes": 50,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1ox3cn4/netflix_just_suspended_my_8year_old_account_out/"
    },
    {
        "id": "1ox8qwr",
        "author": "yoggsmu",
        "title": "College football coach John Beam from ‘Last Chance U’ has died after being shot, Oakland police say",
        "content": "This is awful news… sounds like he was targeted, too. I enjoyed watching him on Last Chance U and thought he was a well-meaning coach who really cared about his kids. ",
        "upvotes": 18,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ox8qwr/college_football_coach_john_beam_from_last_chance/"
    },
    {
        "id": "1oxex7o",
        "author": "harpreetthind",
        "title": "Just wondering, what shows everybody recommends watching on Netflix",
        "content": "I’m watching Brooklyn Nine-Nine already watched superstore and I’m watching Wednesday. What other shows do people recommend? Let me know in the comments since I’m currently in the looking for other shows or movies\nThanks ",
        "upvotes": 8,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1oxex7o/just_wondering_what_shows_everybody_recommends/"
    },
    {
        "id": "1oxf4xp",
        "author": "phredo_71",
        "title": "No translations for sign language in Orphan Black: Echoes",
        "content": "Anybody else having an issue where sign language is not translated to text, even with subtitles turned on? It happens in episode 1 of Orphan Black: Echoes but I’m sure it’s happening elsewhere. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oxf4xp/no_translations_for_sign_language_in_orphan_black/"
    },
    {
        "id": "1oxk8mh",
        "author": "Comfortable-Ice-5584",
        "title": "Ikusagami - Last Samurai Standing",
        "content": "Hey Folks. \nI just finished the last samurai standing in one binge and except a few minor details I really enjoyed the series.\nAs I am unpaciant as one can be I would love to read the novel from shogo imamura.\nUnfortunately all I can find is the manga adaption. Does anyone know if there is an English version of the novel for purchase and where to get it ? \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxk8mh/ikusagami_last_samurai_standing/"
    },
    {
        "id": "1owzj6u",
        "author": "the_oncoming_doctor",
        "title": "One of the worst UI updates ever",
        "content": "I just got the latest UI update and they just seems to have butchered the UI. Clicking on a title now starts playing it instead of showing the earlier menu. This is bad because if I have to look at the episodes list or add or remove an item from my list I have to start playing which also bring it to my continue watching.\n\nSometimes my wife just watches something from my profile forgetting to switch to hers and now when I go to watch it starts from the middle. What’s more infuriating is that I don’t see a start over button anymore. So I have to rewind it and make sure I don’t see the clips when rewinding.\n\nThe previous menu list was good enough they did they have to update it to this shit.",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1owzj6u/one_of_the_worst_ui_updates_ever/"
    },
    {
        "id": "1oxf7nq",
        "author": "thelastparad3",
        "title": "Did Netflix just remove a ton of anime?",
        "content": "I’m in Singapore and we used to have stuff like Demon Slayer, SpyxFamily, Frieren, Rurouni Kenshin, HunterxHunter etc but all of it seems to be gone now. Is this Netflix wide or just SG…?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oxf7nq/did_netflix_just_remove_a_ton_of_anime/"
    },
    {
        "id": "1ox53jo",
        "author": "badgalriri1097",
        "title": "Animal kingdom",
        "content": "Just finished watching the show I know it’s been out for a while but had heard it was a good show and had good amount of seasons which is what I like..\n\nAnyways so what did you think about the ending?\n\nI really hated J’s revenge I felt for the kid at first but he didn’t come into the family wanting revenge at first his grandmother took him in after his mothers passing and him knowing everything the Cody’s had put his mother through.. he had the chance to give them up to the cops and didn’t instead he decided to stay and Smurf tought him how to become one of them\n\nSmurf died and baz died as well which I feel like were the ones that truly hurt Julia pope he had a soft spot for her but he clearly was mentally ill not excusing that but Smurf had him completely manipulated..\n\nDeran and Craig had no reason to be a part of J’s revenge they had no fault in any of what Smurf put his mom through they were young and well at the end of the day they were all bad even J he had become a criminal and murderer just like them so why not just give everyone their fair share in the money and move on they wouldn’t have bothered him at all I truly started disliking J towards the end I think they all should have died or atleast they would have just lived their own seperate lives as they had all planned with all the fortune.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ox53jo/animal_kingdom/"
    },
    {
        "id": "1ox7xfm",
        "author": "Timely_Gain_6225",
        "title": "No Sound",
        "content": "My Netflix has no sound. All the rest of the Apps are working fine. It can’t be a wire issue or a tv issue, it has to be the App itself. I have already uninstalled and reinstalled. The screen is fine everything is playing just silently. And my tv isn’t on mute lol.\nThe bill is up to date.\nIs anyone else having sound issues and how did you fix it??",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ox7xfm/no_sound/"
    },
    {
        "id": "1owezk6",
        "author": "Impossible-Air-2843",
        "title": "What's the best show currently on Netflix?",
        "content": "Looking for a new show to watch , any recommendations?\n\nHey guys so I'm looking for a new show to watch , I can't tell you specifically the genre I like because it really depends but I'll tell you what I've watched recently that I really liked so you can get an idea , turn of the tide , Dep q , the feud , mobland, Tulsa king , son of a donkey , so yea it's a mix , any recommendations of some good attention catching series ? Thank you ",
        "upvotes": 108,
        "comments": 252,
        "media": null,
        "permalink": "/r/netflix/comments/1owezk6/whats_the_best_show_currently_on_netflix/"
    },
    {
        "id": "1oxbfwf",
        "author": "EnvironmentDue8188",
        "title": "Ads",
        "content": "Considering rebooting my membership but I can’t justify $17.99 a month. Are the ads super annoying? I have Hulu with ads and it can be really annoying/repetitive and I don’t think I can handle 2 streaming services with ads. Please let me know ",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1oxbfwf/ads/"
    },
    {
        "id": "1owwjnd",
        "author": "fugaainfinit",
        "title": "Is the service down?",
        "content": "Just got \"kicked\" from tv, and it seems on all devices the same. On web it says \"membership canceled\" while membership is paid and active as usual. Chat is not aviabile, phone is not avaiabile. Looks like a technical glitch? Anyone else experiencing it?",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1owwjnd/is_the_service_down/"
    },
    {
        "id": "1oxe59l",
        "author": "haydenclaireheroes",
        "title": "Exploring Guillermo Del Toro's Frankenstein From the Mind of a Theater Nerd",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxe59l/exploring_guillermo_del_toros_frankenstein_from/"
    },
    {
        "id": "1oxl0dj",
        "author": "Lopsided_Attempt8922",
        "title": "Lawyer here | Should Netflix make a documentary on “How to Protect Yourself from Fake Rape Cases – 101”?",
        "content": "I’ve noticed a growing rise in discussions around malicious prosecution, defamation, and misuse of criminal provisions—especially in cases where individuals (mostly men, but not only men) get trapped in false rape allegations.\n\nThis isn’t about undermining genuine survivors. It’s about addressing the *other* reality that no one talks about: people whose lives, careers, families, and reputations get destroyed overnight due to fabricated accusations.\n\nImagine a Netflix-style documentary series that:\n\n* Breaks down **how false cases are usually set up**\n* Shares **real stories** of those acquitted after years of battle\n* Explains **legal rights**, what to do *immediately* after being accused, and how to secure evidence\n* Covers **digital safety**, consensual relationship proof, chats, call logs, and how they’re interpreted in court\n* Includes **lawyers, psychologists, cops, cyber forensics**, and even social commentators\n* Talks about **reform**, misuse, and the balance between protecting victims *and* preventing the weaponisation of criminal law\n\nThis could genuinely help people understand both sides of the system instead of the one-sided narrative we usually get.\n\nWould you watch such a documentary? And what topics do you think it should cover?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxl0dj/lawyer_here_should_netflix_make_a_documentary_on/"
    },
    {
        "id": "1oxj39b",
        "author": "YouDaBeshBro",
        "title": "If ‘28 years later’ was shot on iPhone 15, doesn’t that make the iPhone 15 a Netflix approved camera? 🤣",
        "content": "I was fascinated to find out that Danny Boyle’s movie ‘28 years later’ was shot majorly on the iPhone 15. And since it’s being streamed on Netflix, doesn’t that make the iPhone 15 a Netflix approved camera?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oxj39b/if_28_years_later_was_shot_on_iphone_15_doesnt/"
    },
    {
        "id": "1ox4i4q",
        "author": "AJLister89",
        "title": "Just finished the first episode of Untamed",
        "content": "When we find out about his son.... Omg I started crying right then and there. I am a father of three boys and I couldn't imagine losing them. That part was so heartbreaking... ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ox4i4q/just_finished_the_first_episode_of_untamed/"
    },
    {
        "id": "1owv9sr",
        "author": "intelerks",
        "title": "Rockstar surprises fans with Red Dead Redemption’s jump to mobile and modern consoles",
        "content": "",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1owv9sr/rockstar_surprises_fans_with_red_dead_redemptions/"
    },
    {
        "id": "1owhx3w",
        "author": "Officialbrandonly",
        "title": "Netflix auto-starting episodes instead of showing episode lists",
        "content": "I’m just frustrated that companies can just update their services and make them worse. I watch Netflix on a Roku stick and ever since the update instead of being able to see the description and take a peek at some of the episodes it just automatically starts the fucking episode.\n\nI don’t see any way to fix it in the settings just so annoyed because it’s probably updated like this just to make people watch more Netflix. It’s so predatory and annoying.",
        "upvotes": 26,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1owhx3w/netflix_autostarting_episodes_instead_of_showing/"
    },
    {
        "id": "1ox28s4",
        "author": "stxvnq",
        "title": "Why do netflix asked me to pay for the bill even when the bill is due next month.",
        "content": "Hi, I wanted to asked if anyone is currently have the same problem as me. my bill is due next month which is 14 December but suddenly it says “We couldn't process your last payment” even though I did pay my last month bill. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ox28s4/why_do_netflix_asked_me_to_pay_for_the_bill_even/"
    },
    {
        "id": "1ox1e1k",
        "author": "igneousigneous",
        "title": "Older Series About Local Politics",
        "content": "I \\*think\\* it was a Netflix show. Easily 8 years ago. It was about a fictional local/governor campaign and the race leading up to an election. It was filmed like The Office - with reality camera work and talking-head interviews. I remember it was funny and touching, and pretty gripping. Anyone have a clue? Am I crazy?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ox1e1k/older_series_about_local_politics/"
    },
    {
        "id": "1oxcx8u",
        "author": "NurseIlluminate",
        "title": "Barney The Dinosaur",
        "content": "Why did they make the new Barney the same voice as Ed Gein? I can’t get over it and I really wanted my kids to watch Barney like I did growing up but it just gives me the creeps as I’m puttering around the house listening to Ed Gein entertain my babies ugh ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oxcx8u/barney_the_dinosaur/"
    },
    {
        "id": "1ovwaue",
        "author": "dini_93",
        "title": "Why do I feel like I've been wrong about my understanding of Vietnam after watching Turning Point: The Vietnam War?",
        "content": "Context: I fell if love with Vietnam  as I travelled across the country last year. Till date, it is one the best experience in visiting a foreign country I've had. Food, Culture, Nature and the People are all fabulous. \n\nDuring my visit to Cu Chi Tunnels, I befriended my tour guide who was super informative. We spoke a lot about the culture and history of Vietnam with more focus on the war. He was from the North and his family were part of the communist party. But he was neutral and explained the whole scenario. One thing I was clear, that there's no good guy or bad guy here. Both the sides had committed war crimes. But then I visited the War Memorial, I felt the US did horrific attrocitices. They equally killed civilians as did the communists. So all in all, I had a belief that all 3 parties, The communists of North, South Vietnamese and The US were all equally guilty of inflicting so much pain to common people and created so much disruption that no one could live happlity during that period in time. \n\nBut after watching this series, I feel the South Vietnamese were the neutral guys who got stuck between the North and the US. Is this a right way of understanding the whole scenario?",
        "upvotes": 293,
        "comments": 356,
        "media": null,
        "permalink": "/r/netflix/comments/1ovwaue/why_do_i_feel_like_ive_been_wrong_about_my/"
    },
    {
        "id": "1owluo8",
        "author": "Fickle_Notice2822",
        "title": "Psychological thriller recommendations",
        "content": "What’s the best psychological thriller movie or show that you recommend. I love movies or shows with crazy and unexpected plot twists that really get you thinking. I’ve already watched behind her eyes which I know is one that everyone recommends and I really enjoyed it.",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1owluo8/psychological_thriller_recommendations/"
    },
    {
        "id": "1owcp30",
        "author": "RiskAndReason",
        "title": "What are we watching today? 🍿",
        "content": "What’s on your watchlist tonight, and would you recommend it?  \n  \nI’m looking for something to unwind with this evening... could be a movie, doc, or a new series drop",
        "upvotes": 23,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1owcp30/what_are_we_watching_today/"
    },
    {
        "id": "1oxalkp",
        "author": "patrichinho22",
        "title": "It's 2025 (almost 2026) and we still don't have a Netflix Mac App",
        "content": "How is that possible? I feel like it's one of the biggest feature requests people make towards Netflix. I want to be able to download and watch movies on a flight or train ride. There is an iPad app available. With the M1 chip Apple even enabled that you can compile iPad apps for MacOS without any issue.\n\n  \nWhat do you think is Netflix reasoning against a MacOS app? Even freakin WINDOWS got one.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1oxalkp/its_2025_almost_2026_and_we_still_dont_have_a/"
    },
    {
        "id": "1ox2sj7",
        "author": "barret232hxc",
        "title": "Sign the petition to get back the more info/details page ( no more auto starting shows/movies )",
        "content": "Netflix did something that is so frustrating. They made it so that you can no longer see the more info/details page anymore. you click on a show or movie and it starts playing automatically. There is no way to turn this off. I even contacted support and they said it's to make things more engaging, no longer do you need to sit and decide the content will play and you can decide for yourself so Netflix gets more minutes/hours of streaming time by just automatically loading the show.\n\nplease help me get the first 5 signatures\n\n[https://c.org/wRhWBRrcmt](https://c.org/wRhWBRrcmt)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ox2sj7/sign_the_petition_to_get_back_the_more/"
    }
]