[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1jhc1lr",
        "author": "MartemisFowl14",
        "title": "siamo famosi",
        "content": "",
        "upvotes": 177,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ejhkOTl5Z3MyMnFlMWTjRjEgDm5wVXNihZ176xYZoy313qYTHkyuBxOuBzZP.png?auto=webp&amp;s=79a969581d3d2a31db6e836864a3b8e57e285109"
        },
        "permalink": "/r/torino/comments/1jhc1lr/siamo_famosi/"
    },
    {
        "id": "1jhyilp",
        "author": "Jaded_Loan_3369",
        "title": "MY FIRST TIME COMING TO TURIN",
        "content": "Hello, we are going to Turin with my friend tomorrow, so I have some questions I want to ask, I would be happy if you answer them.\n\n1-)We are coming to Turin for 5 days. What can we do to use the city metro? Do we need to register somewhere?\n\n\n2-)best places to visit\n\n\n3-)My little brother wants funko, one piece tcg and yeezy shoes from me. Is there any store where I can find them?\n\n4-)Can you recommend a shopping mall with all the brand in it?\n\n5-)Is there a restaurant that you think you should definitely go to?\n\n6-)Are taxis too expensive? Will they try to scam me if they see that I'm a tourist?\n\n7-)And is there anything you think you should definitely know before you go?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jhyilp/my_first_time_coming_to_turin/"
    },
    {
        "id": "1jhxi0r",
        "author": "OldSlopFJennings",
        "title": "Visiting Torino for the weekend – hoping to meet a local up for showing me around",
        "content": "Hey everyone – I’m visiting Paris for work right now and I've got next weekend free so I thought I would head to Turin next weekend, just on a quick solo side trip, and I’d love to connect with a local who might be up for showing me around for a few hours or tagging along on a low-key adventure.  \n  \nTo be clear: *this isn't a romantic or dating thing.* I’m just hoping to meet someone friendly who enjoys their city and wouldn’t mind pointing me toward the good stuff (maybe over coffee, a walk, or a glass of wine).   \n  \nI’m Canadian, 39, easygoing, and interested in history, design, food, and good conversation. Totally open to hanging out with anyone 18+ - any gender, any background - who's got a bit of time and curiosity. Oh, and my Italian is absolutely awful... So hopefully you're up for practicing your English! (sorry)  \n  \nHappy to cover drinks and/or dinner, and I’ll even bring a small treat from Paris as a thank-you.  \n  \nIf you’re around Saturday (March 29th) and feel like showing off your city a bit, shoot me a message!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jhxi0r/visiting_torino_for_the_weekend_hoping_to_meet_a/"
    },
    {
        "id": "1jhxpfv",
        "author": "Babele_20",
        "title": "Ottico per studenti",
        "content": "Ciao a tutti! Recentemente i miei occhiali hanno iniziato a “spellarsi” della protezione alla luce blu che hanno, mi hanno detto che devo cambiare le lenti e mi chiedevo se esistesse un ottico che magari fa un prezzo conveniente per studenti.\nIdee?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jhxpfv/ottico_per_studenti/"
    },
    {
        "id": "1jhxlpn",
        "author": "SafeZookeepergame573",
        "title": "Flowers festival, mobilità",
        "content": "Ciao a tutti, com'è organizzato il flower festival per quanto riguarda mezzi di trasporto? Chi non è motorizzato come fa? (Troppo poveri per un taxi, troppo pigri per 40min di bici )",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jhxlpn/flowers_festival_mobilità/"
    },
    {
        "id": "1jhxdc0",
        "author": "Carlossss11",
        "title": "Fare amicizie a Torino nel 2025",
        "content": "Ho letto un po’ di Reddit di anni fa di gente che non riesce effettivamente a fare amicizie facilmente qua a Torino. Io ho fatto l’università qua ma, la maggior parte dei miei amici sono andati via o sono spariti con le proprie e fidanzate/mogli facendosi vivi 1 volta ogni due  mesi se va bene. Mi piacerebbe tanto allargare le mie amicizie e conoscere gente nuova. Ho 30 anni e vivo in zona Vanchiglietta. Sapete consigliarmi come trovare facilmente nuove amicizie o offrirmi un’uscita con i vostri gruppi? \nCome ho letto su alcuni post, purtroppo avvicinarsi a nuovi gruppi è tanto difficile. La gente è tendenzialmente chiusa. \nGrazie mille 🙏🏻",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jhxdc0/fare_amicizie_a_torino_nel_2025/"
    },
    {
        "id": "1jhe4x2",
        "author": "EveningConference604",
        "title": "Due giorni a Torino: quali sono le cose da non perdere?",
        "content": "Ciao! A settembre passerò due giorni a Torino, non ci sono mai stato. Avete dei posti da consigliare? Attività o ristoranti? Mi piace molto il formaggio, magari dei bar dove si può gustare del buon formaggio?",
        "upvotes": 9,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1jhe4x2/due_giorni_a_torino_quali_sono_le_cose_da_non/"
    },
    {
        "id": "1jhjpfj",
        "author": "IlKayMosca",
        "title": "DentalPro",
        "content": "Ciao a tutti, mi sono trasferito da poco e devo fare una pulizia dei denti. Cercando un po' in giro, ho trovato DentalPro che fornisce una pulizia a bassissimo costo (rispetto alla media). Qualcuno di voi è un loro paziente? E se si, come vi trovate?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jhjpfj/dentalpro/"
    },
    {
        "id": "1jhgcxe",
        "author": "-Zeltis-",
        "title": "Ragazzo di Torino (23) corso di inglese",
        "content": "Corsi di inglese online validi e con costi sostenibili?\n\n\n\n\n\nSalve, sono un ragazzo di 23 e avrei bisogno di un corso affidabile di inglese, preferibilmente online in quanto mi sposto molto e con difficoltà non avendo un mezzo personale. L'opzione migliore sarebbe un insegnante privato per un percorso totalmente personalizzato ma avendo preso lezioni private per molto tempo sono consapevole sia un dispendio economico elevatissimo che non posso intraprendere.\n\nConosco il British Council ma online e anche nella vita di tutti i giorni incontro soltanto pareri molto negativi. \n\nIo ho bisogno di un percorso strutturato, che fornisca una preparazione molto solida e stabile per il raggiungimento di un livello alto.  Purtroppo invece le lezioni private spesso hanno strutture molto labili o inesistenti. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jhgcxe/ragazzo_di_torino_23_corso_di_inglese/"
    },
    {
        "id": "1jhho42",
        "author": "mutantgenes",
        "title": "Vaccination",
        "content": "Hello, i am a student in Torino, where can i get Gardasil vaccine here ? I dont have tessera sanitaria",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jhho42/vaccination/"
    },
    {
        "id": "1jhc0fm",
        "author": "Curious-Fisherman-46",
        "title": "Unito economia ad accesso libero o programmato?",
        "content": "Salve, pensavo di iscrivermi a economia all' università di Torino,  ho controllato sul sito dell'ateneo e ho letto che la triennale in economia è ad accesso libero mentre quella in economia aziendale ad accesso programmato, mi sapreste dire le differenze tra le due? E se non sia un bug del sito, perché io pensavo esistesse unicamente la triennale in economia aziendale ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jhc0fm/unito_economia_ad_accesso_libero_o_programmato/"
    },
    {
        "id": "1jgd9fc",
        "author": "wolfapaca",
        "title": "San Salvario Safety",
        "content": "Hi all! My girlfriend is moving to Torino soon. She will stay around this red area. Is it safe? Should i be worried? \n\nThank you beforehand for your help and advice",
        "upvotes": 26,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hxza3qibn0qe1.jpeg?auto=webp&amp;s=59163817f94fbe70c44d5f02df73ab00df51eceb"
        },
        "permalink": "/r/torino/comments/1jgd9fc/san_salvario_safety/"
    },
    {
        "id": "1jgasa0",
        "author": "aranor01",
        "title": "Calendario pedalate Easy Riders",
        "content": "Info: https://bikepride.net",
        "upvotes": 21,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jgasa0/calendario_pedalate_easy_riders/"
    },
    {
        "id": "1jgp01j",
        "author": "Draken161",
        "title": "Negozi d'abbigliamento Vintage a Torino?",
        "content": "Ho da poco iniziato a vestirmi vintage, e mi chiedevo se a torino o dintorni ci fossero negozi che vendessero abbigliamento relativo da uomo, ringrazio in anticipo.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jgp01j/negozi_dabbigliamento_vintage_a_torino/"
    },
    {
        "id": "1jgnxfh",
        "author": "Complex_Lynx_8546",
        "title": "ENTI PER 730",
        "content": "Ciao a tutti, \n\nMi chiedevo se qualcuno conoscesse qualche ente che si occupava di fare 730 e documentazioni varie, perché me lo sono fatto sempre da solo, ma non vorrei appoggiarmi ad un sindacato dove devo pagare la quota di iscrizione annuale e in più devo pagare il 730.\nGrazie a chi mi sarà d’aiuto",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jgnxfh/enti_per_730/"
    },
    {
        "id": "1jgmqi2",
        "author": "daxius212",
        "title": "Alla ricerca di un giocattolo",
        "content": "Salve a tutti, sto cercando un giocattolo, il nerf longstrike. Qualcuno ne ha uno?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jgmqi2/alla_ricerca_di_un_giocattolo/"
    },
    {
        "id": "1jgjepp",
        "author": "lucabrbr",
        "title": "Cercare casa info sui quartieri?",
        "content": "Ragazzi stavo cercando casa per trasferirmi a torino e non conosco bene le zone, al momento gli affitti più comodi di prezzo gli ho trovati vicino a corso lecce dal lato della pellerina, com'è come zona? altrimenti a bugdet non elevatissimo dove dovrei guardare per un discorso di sicurezza?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jgjepp/cercare_casa_info_sui_quartieri/"
    },
    {
        "id": "1jgeaj6",
        "author": "IllustriousRock3844",
        "title": "DEEJAY TEN - Domenica",
        "content": "Ciao!\n\nM28, pensavo di fare la Deejay Ten da 5km domenica, ma andrei da solo…Se c’è qualcun outsider come me senza gruppo, ci si accoda volentieri 😄\n\nZero spirito competitivo, giusto farsi due passi e godersi l’aria dell’evento.\n\nLet's go!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jgeaj6/deejay_ten_domenica/"
    },
    {
        "id": "1jgik00",
        "author": "_lostinthisworld_",
        "title": "Permesso di soggiorno",
        "content": "Ciao a tutti. I have a question about the permesso di soggiorno for students. I am waiting for my PDS to be processed, but in the meantime, I changed my address. Should I inform them about my new address, and what is the procedure? Thank you in advance. \n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jgik00/permesso_di_soggiorno/"
    },
    {
        "id": "1jgawch",
        "author": "DPPenjoyer18",
        "title": "Possibile trasferimento a Torino per lavoro, consigli sulla città?",
        "content": "Salve a tutti. Sono un quasi 30enne che probabilmente dovrà trasferirsi dal sud a Torino per iniziare un nuovo lavoro e volevo chiedere qualche consiglio sulla città, le zone più tranquille in cui vivere, dove poter trovare case in affitto ma in generale qualsiasi consiglio per un lavoratore alla sua prima esperienza in un’altra città.\n\nGrazie a tutti",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1jgawch/possibile_trasferimento_a_torino_per_lavoro/"
    },
    {
        "id": "1jgdnji",
        "author": "dkroods",
        "title": "Take It Easy Torino IOS?",
        "content": "Ciao tutti! Al momento il nostro team sta lavorando alla versione iOS della nostra app, concentrandosi sulle prestazioni e sulla risoluzione dei problemi. Voi cosa ne pensate? Vi farebbe piacere vederla anche su iOS? Fateci sapere la vostra opinione!\nSe non avete ancora provato l'app ecco il link per la versione Android\n[Take It Easy TO](https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app&amp;hl=it)\n\nGrazie per il vostro supporto!",
        "upvotes": 3,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nnQwOdFPDhG66upzOUX8tpygSBrrCbAym8Jn9SOS4gI.jpg?auto=webp&amp;s=44e52737a24a4ce0d5f7adb7f20f5ea1e5f986e6"
        },
        "permalink": "/r/torino/comments/1jgdnji/take_it_easy_torino_ios/"
    },
    {
        "id": "1jgcxht",
        "author": "ZayaBt-",
        "title": "Copisteria per stampa della tesi?",
        "content": "Ciao! Potete consigliarmi delle copisterie con prezzi non esagerati? (inclusa copertina)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jgcxht/copisteria_per_stampa_della_tesi/"
    },
    {
        "id": "1jgcur8",
        "author": "RtR380",
        "title": "Parcheggi gratuiti",
        "content": "Buongiorno a tutti, qualcuno saprebbe dirmi dove trovare, se esitono, dei parcheggi gratuiti in zona Politecnico?\n\nOggi 21 marzo c'è sciopero e stare 10 ore significa pagare praticamente 20€ di parcheggio.\n\nAlmeno la prossima volta arriverò preparato.\n\nConosco già il parcheggio di via Nino Bixio, ma spesso e volentieri si riempie prestissimo.\n\nGrazie 🤙",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jgcur8/parcheggi_gratuiti/"
    },
    {
        "id": "1jgcpy3",
        "author": "barbax-7",
        "title": "Pedaggi Telepass sulla Torino - Milano",
        "content": "Per chi utilizza telepass per pagare i pedaggi sull'autostrada torino-milano, sapete quando spuntano i movimenti sull'app telepass? Il servizio clienti mi ha detto che devo aspettare che il gestore comunichi a telepass l'addebito, e non si sanno i giorni. Magari qualcuno che fa spesso la tratta sa dirmi quanti giorni ci vogliano, grazie! ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jgcpy3/pedaggi_telepass_sulla_torino_milano/"
    },
    {
        "id": "1jg18w7",
        "author": "Geralt_of_Bals",
        "title": "First time visiting Torino, question about approaching bars, bakeries and restaurants",
        "content": "Hi Torino, me and my gf will be visiting this beautiful city soon and surely I researched the places to visit and where to eat at. However, I am uncertain on how to approach bars and bakeries in Italy, do you wait to be seated, do you order at the bar and than take it to a table? Please help.\n\n",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jg18w7/first_time_visiting_torino_question_about/"
    },
    {
        "id": "1jfxxhe",
        "author": "Extra_Fly3851",
        "title": "Negozio percussioni",
        "content": "Ciaoo a tutti !\nSapete indicarmi un negozio che venda percussioni ( in particolare mi servirebbe un tamburo da marcia ) su Torino e vicinanze che sia onesto e magari che vende anche usato ? Grazie !!",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jfxxhe/negozio_percussioni/"
    },
    {
        "id": "1jfz2te",
        "author": "Impressive_Lynx_7938",
        "title": "Non so che fare questo weekend",
        "content": "Avevo già pianificato tutto, ma purtroppo questo weekend piove … qualcuno ha qualche suggerimento su attività, eventi o esperienze da fare ?",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1jfz2te/non_so_che_fare_questo_weekend/"
    },
    {
        "id": "1jfnbs2",
        "author": "Begghi16",
        "title": "AAA OTTICO CERCASI",
        "content": "Sono stato abbandonato (si fa per dire) dal mio ottico storico che è andato in pensione. Chi mi consiglia un buon ottico diciamo tra piazza statuto e inizio Grugliasco?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jfnbs2/aaa_ottico_cercasi/"
    },
    {
        "id": "1jfnblc",
        "author": "ClassicGift6771",
        "title": "How long to get PDS card after fingerprinting appointment?",
        "content": "Hi\n\nSo I'm a international student here in Torino and I just had my Questura appointment for my permesso di soggiorno. How long after the appointment is it currently taking to go pick up the actual card? I read around other sub reddits and it varies a lot. Some cities are a few weeks others are over a year.\n\nPeople that recently received their first PDS how long did you wait after the Questura appointment to get your permesso di soggiorno?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jfnblc/how_long_to_get_pds_card_after_fingerprinting/"
    },
    {
        "id": "1jfj0ap",
        "author": "nessunoste",
        "title": "Pareri scuola elementare Convitto Umberto I",
        "content": "Ciao a tutti. \nL'hanno prossimo dovrò scegliere la scuola elementare a cui iscrivere mio figlio.\nPer motivi geografici ci sarebbe abbastanza comodo il Convitto Umberto I (quello che affaccia su via Garibaldi).\nHo raccolto pareri contrastanti in merito.\nQualcuno ha una esperienza diretta?\nGrazie!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jfj0ap/pareri_scuola_elementare_convitto_umberto_i/"
    }
]