[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1myzz62",
        "author": "Murky_Giraffe8700",
        "title": "Vuelta 2025 a Torino, rubata davanti all'hotel la bici da 15.000 euro del manager Shimano",
        "content": "",
        "upvotes": 40,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_U5eZVS9CN-nl1smg_2zSI1G1IJwFab5Qq4qvl7UUrA.jpeg?auto=webp&amp;s=b4c460874b031097a72da19219cb881a3af65385"
        },
        "permalink": "/r/torino/comments/1myzz62/vuelta_2025_a_torino_rubata_davanti_allhotel_la/"
    },
    {
        "id": "1mz60bq",
        "author": "Nunzz66",
        "title": "Buone agenzie per comprare casa?",
        "content": "Ciao a tutti, ho letto diversi post di agenzie da evitare per comprare casa a Torino, ma invece consigliate qualche agenzia in base alle vostre esperienze?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mz60bq/buone_agenzie_per_comprare_casa/"
    },
    {
        "id": "1myr1jb",
        "author": "Murky_Giraffe8700",
        "title": "Sentirmi a casa a Torino… ma mai del tutto accettato?",
        "content": "Ciao a tutti,\n\nvolevo condividere qualcosa di personale come expat che vive qui a Torino.\n\nAnche se sono Italiano ma non sono “nato italiano”, sento un legame profondo con questo posto. Mio nonno viveva ad Alessandria e tutta la mia famiglia ha sempre mantenuto le stesse tradizioni che si trovano qui in Piemonte. In un certo senso, quindi, mi sono sempre sentito italiano dentro. \n\nOra che vivo a Torino da 5 anni mi sento davvero a casa: pago le tasse, rispetto le regole, faccio il mio dovere e cerco di contribuire alla vita della città. Eppure… a volte ho la sensazione che non sarò mai davvero accettato.  A volte leggo addirittura persone che ci trattano come “i sudamericani”, come se fossimo dei parassiti venuti qui solo per approfittare e poi andarcene. È surreale pensarlo, considerando che dal paese da cui provengo furono persino date terre a chi veniva dall’Italia per costruirsi un futuro.\n\nCome se, per il solo fatto di non essere nato qui, qualcuno mi vedesse come un parassito. È doloroso, perché io questa città l’ho scelta, ci voglio costruire la mia vita e sto persino pensando di comprare casa.\n\nLa mia domanda è: *questa sensazione prima o poi passa?* Con il tempo le persone accettano i “nuovi torinesi” o è qualcosa con cui devo semplicemente imparare a convivere?\n\nGrazie per aver letto e per questa community, è una delle cose che mi fa sentire meno solo con questi pensieri",
        "upvotes": 7,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1myr1jb/sentirmi_a_casa_a_torino_ma_mai_del_tutto/"
    },
    {
        "id": "1mz3dut",
        "author": "QuickPersonality9090",
        "title": "Quale gestore telefonico?",
        "content": "Salve, mi trasferirò a Torino (precisamente in zona Vanchiglia/Vanchiglietta) il mese prossimo e vorrei approfittarne per cambiare gestore telefonico. Considerando che non abbiamo WiFi e dunque ho bisogno che la linea si prenda bene, quale mi consigliate?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mz3dut/quale_gestore_telefonico/"
    },
    {
        "id": "1myqpz5",
        "author": "East_Context_2472",
        "title": "Ciao a tutti! Ho trovato una casa all’inizio di Via San Donato, vicino a Piazza Statuto, e sto valutando di trasferirmi… ma non conosco bene la zona!",
        "content": "In pratica, sarei al confine tra Quadrilatero e San Donato, e non essendo del tutto interna alla città, non so bene com’è vivere lì.\nPer tornare la sera, dovrei prendere i mezzi dalla fermata Industria in Corso Regina Margherita. Qualcuno che abita o conosce la zona può darmi qualche consiglio?\nHo sentito parlare un po’ male dell’inizio di Corso Principe Oddone, che sarebbe vicino alla mia futura casa… è davvero così problematico?",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1myqpz5/ciao_a_tutti_ho_trovato_una_casa_allinizio_di_via/"
    },
    {
        "id": "1myslez",
        "author": "CDive20",
        "title": "Opinioni su corso Regina Margherita",
        "content": "Ciao a tutti, stavo valutando di trasferirmi in una casa su corso Regina Margherita, nella zona più vicino a corso Alessandro Tassoni. Ho sempre vissuto in zona bernini e li ci sono passato poche volte, di giorno e per poco tempo.\nCom’è come zona? È sicura ? Avete dei consigli ?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1myslez/opinioni_su_corso_regina_margherita/"
    },
    {
        "id": "1my8lxc",
        "author": "AdShort2912",
        "title": "imparare l'italiano",
        "content": "Sono un ragazzo di 31 anni che vive a Torino. qualcuno che insegna italiano o vuole migliorare il proprio spagnolo per condividere le lingue. Grazie.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1my8lxc/imparare_litaliano/"
    },
    {
        "id": "1my9hli",
        "author": "Unusual-Cut-3759",
        "title": "Is it possible to spend night at Torino airport?",
        "content": "I read many posts that it is possible to sleep at Torino airport if you arrive before last flight. After that airport is closed till morning flight, but people who are already in the airport area are allowed to stay? Is it true? Whats the actual real situation - is airport closed at night at all?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1my9hli/is_it_possible_to_spend_night_at_torino_airport/"
    },
    {
        "id": "1my0ld7",
        "author": "DoubleParfait9774",
        "title": "Uscite Torino – Giochi &amp; Cinema 🎱🎲🎬”",
        "content": "Ciao a tutti! Io e il mio compagno abbiamo appena creato un gruppo telegram per fare nuove amicizie con persone che abbiano voglia di organizzare serate \"normali\": cinema, bowling, biliardo, ping pong, sala giochi, escape room, cene 🎯🍿🎳🍕. \nLascio qui il link per chiunque fosse interessato, il range di età è 23/40",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fYoGCjnNuI7UN25LRgbj23mk_5XqaB3801-4Bv2PQeI.jpeg?auto=webp&amp;s=d90e705e732a9f9261e1557ecbceaadcb2752c45"
        },
        "permalink": "/r/torino/comments/1my0ld7/uscite_torino_giochi_cinema/"
    },
    {
        "id": "1my1mbb",
        "author": "DingoCommon8982",
        "title": "Stasera a Torino – cerco compagnia per andare in un club",
        "content": "Ciao a tutti!\nSono a Torino solo per questo weekend e vorrei uscire stasera in un club/discoteca. Non voglio andare da solo 😊\nParlo tedesco, russo e inglese (l’italiano solo un po’). Qualcuno ha voglia di fare serata insieme? 🍸💃🕺",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1my1mbb/stasera_a_torino_cerco_compagnia_per_andare_in_un/"
    },
    {
        "id": "1myad8e",
        "author": "Son_of_Fjords",
        "title": "Qualcuno dalla Valsusa?",
        "content": "Così tanto per. Io sono di Condove",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1myad8e/qualcuno_dalla_valsusa/"
    },
    {
        "id": "1my5s1u",
        "author": "Any-Confidence-8988",
        "title": "Casa Borgo Vittoria",
        "content": "Ciao, siamo due studenti del poli e stiamo cercando casa. Abbiamo trovato un bell'appartamento in zona borgo vittoria in via corso della salute e vorremmo sapere dei pareri sulla zona da qualcuno di torino. \nGrazie tanto se ci aiuterete!",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1my5s1u/casa_borgo_vittoria/"
    },
    {
        "id": "1my31hq",
        "author": "yotama9",
        "title": "Dove posso comprare mobili second band con la spedizione",
        "content": "Sono nuovo a Torino (e in Italia) e ho bisogno degli mobili. Ho trovato gli site come 24 casa. Ma pensavo se forse posso trovare le cose che ho bisogno in second band. Ma, non ho la machina, quindi ho bisogno della spedizione (shipment). Conosci un negozio dove posso andare? O forse uno produttore locale ch'è economico? ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1my31hq/dove_posso_comprare_mobili_second_band_con_la/"
    },
    {
        "id": "1mxxbai",
        "author": "Visual_Sail_5311",
        "title": "Regio Parco o Lingotto?",
        "content": "Ciao a tutti,\nsto cercando una camera e sono indeciso tra due opzioni abbastanza diverse:\n\t•\tRegioparco → costa circa 150€ in più rispetto all’altra, ma avrei il bagno privato e, da quello che ho capito, parcheggiare non è un problema. La macchina mi serve per lavoro 7–8 giorni al mese, quindi questo sarebbe un bel vantaggio. Quello che però non capisco è se la zona sia “morta”, cioè se senza auto diventa scomoda per vivere/spostarsi, e in generale che tipo di quartiere sia. Se sia pericoloso tornare a casa a piedi da solo di notte, o se sia semplicemente un po’ vuoto. \n\t•\tLingotto → più economica, ben collegata con la metro, ma mi preoccupa la questione parcheggi e la sensazione che anche qui “non ci sia niente” nei dintorni. La casa è più bruttina e buia, anche se il prezzo è competitivo. \n\nVi lascio gli screen delle zone per dare un’idea! \nSecondo voi, per una vita quotidiana da studente/lavoratore, quale quartiere è più vivibile e pratico?",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1mxxbai/regio_parco_o_lingotto/"
    },
    {
        "id": "1my6m03",
        "author": "Cilindro_958",
        "title": "Palestra Solid Base",
        "content": "Qualcuno ha frequentato/conosce qualcuno che lo ha fatto, questa palestra? Mi piacerebbe avere feedback in particolar modo sul range di prezzo ed in caso sull'esperienza generale. \n\nGrazie in anticipo a chi risponderà.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1my6m03/palestra_solid_base/"
    },
    {
        "id": "1my0cjv",
        "author": "ivlia-x",
        "title": "Quali pomodori, disponibili a Torino, mi consigliate per fare un paio di barattoli di passata?",
        "content": "Mi immagino che i san marzano non li trovo qua (oppure?). Mi potete consigliare qualcosa? Ho un mercato rionale vicino ma volevo chiedere agli altri prima di comprare una cassa ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1my0cjv/quali_pomodori_disponibili_a_torino_mi/"
    },
    {
        "id": "1mxyc13",
        "author": "Intelligent-Tart-287",
        "title": "Money Transfer",
        "content": "Hey guys, I’ve been wondering what is the most cost effective way of transferring money to Italy from overseas? Swift bank transfers usually have high fees which could sum up to great amounts. I’d like to hear your ideas.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mxyc13/money_transfer/"
    },
    {
        "id": "1mxbci2",
        "author": "Potential_Sea4918",
        "title": "\"Vedere dei monitor\"",
        "content": "Ok, sarà una richiesta che fa ridere. Ma ecco qua: \n\nIo abito poco distante da Torino, in realtà non sono \"della città\" cioè ci sono nato e vissuto un paio di decenni da piccolo ma non ne so molto.   \nVoglio comprare un nuovo monitor ultrawide e, avrei voluto vedere , dal vivo. una serie di modelli (i modelli più famosi insomma).  Giusto per vedere anche \"dal vivo\" come si vedono.  \nCosì sono andato da mediaworld alle Gru.. perché era l'unico che mi veniva in mente. Ma purtroppo ho constatato che non hanno proprio nulla. La desolazione. Solo monitor di sottomarche improbabili.  \nQuindi rigiro la domanda a voi: Esiste ancora, nel 2025,  un centro commerciale realmente fornito dove si possono vedere i monitor moderni accesi ed esposti?",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1mxbci2/vedere_dei_monitor/"
    },
    {
        "id": "1mxmxud",
        "author": "sp00kygh0sty",
        "title": "Recommendations please!",
        "content": "Hello, I’ll be visiting Turin for one week in October with my partner. We are coming from Canada and neither have been to Italy before.\n\nI’m looking for the following recommendations:\n\n1. Food. The VERY BEST places to get pizza. Pasta. Gelato. Coffee. Pastries. Etc.\n\n2. Shopping. Small home goods. Gifts. Grocery stores!!! Fashion (affordable). Souvenirs. What souvenirs should I get and from where?\n\n3. Things to do. Museums. Historical sites. Parks. Activities. Classes/workshops. Nearby towns. \n\n4. Any comments. What to avoid. What to remember. What to pack and not pack. \n\nThank you!!!!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mxmxud/recommendations_please/"
    },
    {
        "id": "1mxcl30",
        "author": "Lopes1977soc",
        "title": "Una birra a Torino",
        "content": "Il 31 sarò al Torino Fiorentina. Rimarrò per qualche giorno. Qualcuno che possa preparare delle birre e conoscere qualcosa della città? (Ho 49 tacos)",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mxcl30/una_birra_a_torino/"
    },
    {
        "id": "1mxk0mr",
        "author": "Lopes1977soc",
        "title": "Raccomandazioni",
        "content": "Ciao, sono un po' audace (troppe domande). \n1/un caffè di charme a Torino \n2un caffè con la storia? \n3/libreria preferita? \n4/una bella spa dove trascorrere mezza giornata?\n5/bar affascinante per la cena\nGrazie mille!!! Spero che possiate aiutarmi!😛🙏🏻",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mxk0mr/raccomandazioni/"
    },
    {
        "id": "1mxnj63",
        "author": "Tony_zer0five",
        "title": "Reddit di chieri",
        "content": "Ciao ho creato un gruppo reddit per Chieri dove vorrei parlare di Chieri.\nPercaso c'è qualcuno di Chieri che si vuole aggiungere? Perché non c'è ancora nessuno",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mxnj63/reddit_di_chieri/"
    },
    {
        "id": "1mx7kui",
        "author": "Canjul93",
        "title": "ToPlay 2025 - Torino, Parco Dora - 13-14/09/2025",
        "content": "Ciao a tutti! \n\nSe siete amanti dei giochi di ruolo/giochi da tavolo, il 13 e il 14 Settembre a Torino c'è un occasione da non perdere! \n\nCome ogni anno, si tiene il ToPlay, il festival del gioco di ruolo. \n\nAvrete la possibilità di provare tantissimi giochi e di conoscere persone con le vostre stesse passioni. \n\nPotete prenotare una partita al gioco che preferite sulla web-app a questo link:\n\nhttps://app.toplaytorino.it/\n\nCi sarò anche io tra i master, ai tavoli dove giocheremo Daggerheart (sabato tutto il giorno e domenica mattina). \n\nSpero di vedervi li 😁\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mx7kui/toplay_2025_torino_parco_dora_1314092025/"
    },
    {
        "id": "1mx5tin",
        "author": "ohhisofia",
        "title": "Refilling BBQ gas tank?",
        "content": "Hi! I am new to Torino and we have a BBQ with a gas tank that has run out. Does anyone know how we can get it refilled or replaced ? \n\nIts also SUPER heavy. So if theres some home option thats also good too we have no car 😅",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mx5tin/refilling_bbq_gas_tank/"
    },
    {
        "id": "1mwf33s",
        "author": "Equal-Cauliflower813",
        "title": "Qualche ragazzo che si vuole conoscere dal vivo?",
        "content": "F24 Domani vado a pinerolo non conosco nessuno li si prospetta una noia mortale qualcuno che ha voglia di uscire nei prossimi giorni cosi tanto per se non avete nulla da fare????\n\nA torino proprio città non sono mai stata avete qualche direzioni da darmi per andare da qualche parte per non morire da sola nelle campagne vuote di pinerolo? Sto solo una settimana ",
        "upvotes": 24,
        "comments": 52,
        "media": null,
        "permalink": "/r/torino/comments/1mwf33s/qualche_ragazzo_che_si_vuole_conoscere_dal_vivo/"
    },
    {
        "id": "1mwzlb2",
        "author": "IdayeP",
        "title": "By bus Torino rebaudengo fossata - Airport",
        "content": "Hello, a quick question is the bus stop from Torino rebaudengo fossata to Airport Torino easily findable?\nThe trenitalia app suggested me to go by bus instead of a train but when I search for it I only see train options",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mwzlb2/by_bus_torino_rebaudengo_fossata_airport/"
    },
    {
        "id": "1mwppxs",
        "author": "Charliephoenix85",
        "title": "Dove uscire venerdì 22 agosto?",
        "content": "Ciao a tutti, mi sono ritrovato a torino solo e volevo comunque approfittarne per uscire. Mi dite quali posti sono i migliori per bere e ballare e conoscere gente? Grazie",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mwppxs/dove_uscire_venerdì_22_agosto/"
    },
    {
        "id": "1mwl0l8",
        "author": "Lucasemartinez",
        "title": "Scambiare Banconote 500 euro",
        "content": "Devo cambiare una banconota da 500 € in tagli più piccoli. \n\nIn Italia sembra quasi impossibile: ogni volta che provo a pagare con un 500, la gente si spaventa o mi dice che non hanno resto. Solo ho conto Revolut e non permette depositi. Non è che voglio pagare cose da 10 euro, voglio pagare acquisti al supermercato di circa 300 euro. Non ho mai avuto problemi né in Portogallo né in Spagna. Qualcuno ha qualche consiglio su come farlo qui?.\n\nGrazie\n\n",
        "upvotes": 6,
        "comments": 55,
        "media": null,
        "permalink": "/r/torino/comments/1mwl0l8/scambiare_banconote_500_euro/"
    },
    {
        "id": "1mwcfdh",
        "author": "Complex_Lynx_8546",
        "title": "SUSHI?!?!🍣",
        "content": "Ciao ragazzi,\n\nCerco qualche anima per andare a mangiare sushi domani sera o sabato sera perché non avrei voglia di stare a casa… Io mi sono trasferito da qualche mese a Torino, proponete voi il locale..",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mwcfdh/sushi/"
    },
    {
        "id": "1mwhqh4",
        "author": "Ancient_Tourist_4268",
        "title": "Biliardo in compagnia",
        "content": "Ciao da un po' di tempo mi andava di giocare a biliardo, ma nessuno dei miei amici ha interesse a farlo, chi ha piacere di farsi una partita ogni tanto io ci sono.\n\nSono comodo a Torino Sud/Centro ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mwhqh4/biliardo_in_compagnia/"
    }
]