[
    {
        "id": "1jkaor7",
        "author": "ThePenguinLessonsAMA",
        "title": "Hi /r/movies I’m Peter Cattaneo, director of The Penguin Lessons, starring Steve Coogan. Inspired by a true story, a teacher &amp; his students are enlightened by an unusual guest. Sony Pictures Classics is releasing it in theaters nationwide this weekend. I also directed The Full Monty. Ask me anything",
        "content": "",
        "upvotes": 111,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lw904q9n21re1.png?auto=webp&amp;s=620f9e5a6283b229b1755905ff273dc935bc33f6"
        },
        "permalink": "/r/movies/comments/1jkaor7/hi_rmovies_im_peter_cattaneo_director_of_the/"
    },
    {
        "id": "1jke7x0",
        "author": "SecretMallApartment",
        "title": "Hi /r/movies! We are Jeremy Workman (director) &amp; Michael Townsend (subject) from SECRET MALL APARTMENT. Part heist movie &amp; part rallying cry against corporate overlords, it tells the wild story of Michael &amp; 7 others creating an apartment inside a busy mall. It's out now in theaters. Ask Us Anything!",
        "content": "",
        "upvotes": 22,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jlx1pwtnv1re1.png?auto=webp&amp;s=61c492952b3cbcac032d533d47900c712aec5585"
        },
        "permalink": "/r/movies/comments/1jke7x0/hi_rmovies_we_are_jeremy_workman_director_michael/"
    },
    {
        "id": "1jk6r5z",
        "author": "DJDoena",
        "title": "How did 70s/80s spoof movies get this density of gags?",
        "content": "I grew up with Airplane and Spaceballs and Hot Shots! and the amount of both visual gags and puns is still astounding. Some you only get as an adult, some you'll never get because you're missing a frame of reference (for example \"he never drinks a second cup at home\").\n\nCurrently there is a news headline going around where people suggest that Brazil should introduce a O2 fee for the upkeep of the Amazon rainforest and immediately people jumped in with pics from Spaceballs and President Scrooge taking a nose from the [Perri-Air can](https://atomicjunkshop.com/wp-content/uploads/2023/11/Perri-air.jpg).\n\nAnd I just began to wonder how you can create a Star Wars spoof movie and then just throw in a [Perrier sparkling water](https://m.media-amazon.com/images/I/71WIYnduw0L._SX522_.jpg) reference. How many rewrites and add-ons go these scripts through and how many people throw in a few more puns during writing and filming.",
        "upvotes": 1366,
        "comments": 369,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WC2Pha_jJcwafDWCTF_zTu8SY3qC6IPCtWDeLlNfrrQ.jpg?auto=webp&amp;s=2aec78bdf9602ea1642c658c3952d0f01ca01140"
        },
        "permalink": "/r/movies/comments/1jk6r5z/how_did_70s80s_spoof_movies_get_this_density_of/"
    },
    {
        "id": "1jkcg8d",
        "author": "NoCulture3505",
        "title": "Barry Jenkins Teams With A24 For Zendaya Starrer ‘Be My Baby’ About Music Legend Ronnie Spector",
        "content": "",
        "upvotes": 241,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lrYFZH_1eD5EEslFvVotpyJl-8wYhBwSkh4X5ROyfIg.jpg?auto=webp&amp;s=f5b3556bd46e862a4616a676155f4ee3c2e464a7"
        },
        "permalink": "/r/movies/comments/1jkcg8d/barry_jenkins_teams_with_a24_for_zendaya_starrer/"
    },
    {
        "id": "1jkdb2h",
        "author": "ChiefLeef22",
        "title": "Rust | Official Trailer | Alec Baldwin, Josh Hopkins, Patrick Scott McDermott",
        "content": "",
        "upvotes": 184,
        "comments": 228,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7SvmVMqjzZK_vn4-J3r8otlQM5WYpdautkAU9_zZWOk.jpg?auto=webp&amp;s=ee803a8ed7359cff4a376aca2b86ce93c4034cfd"
        },
        "permalink": "/r/movies/comments/1jkdb2h/rust_official_trailer_alec_baldwin_josh_hopkins/"
    },
    {
        "id": "1jk5lwp",
        "author": "CrispyHoneyBeef",
        "title": "Movies that maintain a consistent air of dread or tension throughout the entire runtime?",
        "content": "Hello, \n\nI am searching for intense movies that feel really difficult to watch and really make a person feel tense or anxious while watching. Like the anticipation of a roller coaster climbing, waiting for the drop. \n\nWind River is one that comes to mind, but there was a bit of levity in it with how good the chemistry between Olsen and Renner was. I prefer something that really doesn’t let up and wants you to feel as miserable and scared as the characters do. \n\nBasically the same atmosphere of the basement scene in Zodiac, but for 90 minutes straight. Anything that can scratch that itch?\n\nThanks!",
        "upvotes": 425,
        "comments": 1362,
        "media": null,
        "permalink": "/r/movies/comments/1jk5lwp/movies_that_maintain_a_consistent_air_of_dread_or/"
    },
    {
        "id": "1jjiv9q",
        "author": "MarvelsGrantMan136",
        "title": "‘No Other Land’ Co-Director Hamdan Ballal Has Been Freed, Yuval Abraham Says",
        "content": "",
        "upvotes": 8794,
        "comments": 225,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dkLYyR9YRbbbwkyd1F0oX95hgcfFXFuXI6FVJtTQzUc.jpg?auto=webp&amp;s=1d02af4359b241c50534260f78361a8aadc384fb"
        },
        "permalink": "/r/movies/comments/1jjiv9q/no_other_land_codirector_hamdan_ballal_has_been/"
    },
    {
        "id": "1jk66xf",
        "author": "DarlingLuna",
        "title": "What movie that you previously thought was incredible didn’t hold up on second viewing?",
        "content": "For me, Avengers: Endgame is one of the best examples of this. On first viewing, I thought it was a stunning send off for this era of the MCU and cried tears during Stark’s death. On rewatch, I found the majority of the movie to be vapid, oddly paced fan service, and I hate how they watered the character of Thanos down to a generic, alternate version of himself. What movie did you have a similar experience with?",
        "upvotes": 240,
        "comments": 448,
        "media": null,
        "permalink": "/r/movies/comments/1jk66xf/what_movie_that_you_previously_thought_was/"
    },
    {
        "id": "1jjnxcb",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Accountant 2'",
        "content": "",
        "upvotes": 2960,
        "comments": 486,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/371poofj7vqe1.jpeg?auto=webp&amp;s=62c45bfe0f3939f7ce748f61075a926fdcf1cc83"
        },
        "permalink": "/r/movies/comments/1jjnxcb/new_poster_for_the_accountant_2/"
    },
    {
        "id": "1jjy32g",
        "author": "MichaeltheSpikester",
        "title": "Transformers One is such a damn good movie",
        "content": "And this is coming from someone who isn't even a Transformers fan. IMO one of the best recent animated films in years alongside The Wild Robot (Ironically both starring robots and releasing the same month).\n\nTrailer did this film such injustice that sadly I was amongst those that fell for its marketing costing me what would have been a great experience at the show.\n\nAfter having heard good things about this film. I decided to give it a shot watching it in the beginning of the new year and then decided on watching it again today and my opinion remains the same as it was first time viewing.\n\nSadly probably not gonna get a sequel since it underperformed but at the very least I hope this spawns a Paramount+ streaming series if not a series of sequels. \n\nOne way or another, assuming it never gets a continuation. One can always look at this as a prequel to any Transformers continuity. Still the post credits has me craving for more and where this could potentially go.\n\nBy no means a flawless movie imo. Bumblebee was amongst them, felt the movie had good enough levity as it was. Felt there was no need for a comic relief. \n\nBut overall I'd give the film 4 out of 5 stars.\n\nBy the way, this might sound harsh but whoever done the marketing and trailer deserves to be fired. Whoever you were, you ended up dooming this amazing movie to fail.\n\nP.S.: I didn't think Brian Tyrian Lee of all people could have pulled off a great Megatron.",
        "upvotes": 651,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1jjy32g/transformers_one_is_such_a_damn_good_movie/"
    },
    {
        "id": "1jk0tr6",
        "author": "joesen_one",
        "title": "‘The Roses’ Starring Benedict Cumberbatch and Olivia Colman Sets August Release From Searchlight Pictures",
        "content": "",
        "upvotes": 384,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AQLjuntqAHIlTYuilVfi_BeIEAtXi9trG-HIytDek2k.jpg?auto=webp&amp;s=620c236b1aabbb3d94102831b98daed21b263d70"
        },
        "permalink": "/r/movies/comments/1jk0tr6/the_roses_starring_benedict_cumberbatch_and/"
    },
    {
        "id": "1jjop4p",
        "author": "indiewire",
        "title": "‘Tommy Boy’ Could’ve Been a Disaster — It’s Now a Cult Classic Available on 4K",
        "content": "",
        "upvotes": 1891,
        "comments": 167,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0u8CODbnAUmlA07xYzKHxtueyoBfhwhCwVSpuuplRes.jpg?auto=webp&amp;s=9ce6a325db3904edbe3a5c93a30fd194e5ac1799"
        },
        "permalink": "/r/movies/comments/1jjop4p/tommy_boy_couldve_been_a_disaster_its_now_a_cult/"
    },
    {
        "id": "1jkc9q2",
        "author": "DirtParking4216",
        "title": "Good-ish Werewolf Movies",
        "content": "There are a few newer werewolf movies, but I haven't seen anything I really like yet. Was not impressed with The Beast Within or Out Come the Wolves from last year. \n\nI love Dog Soldiers, Underworld, and Wolf with Jack Nicholson to name a few. \n\nWhat's your favorite good, bad, cheesy, or classic go-to werewolf movies? \n\nOn my list of recent movies to watch next are:\n1. Operation Blood Hunt 2024\n2. Wolf Man 2025\n3. Werewolves 2025\n\n\n",
        "upvotes": 41,
        "comments": 234,
        "media": null,
        "permalink": "/r/movies/comments/1jkc9q2/goodish_werewolf_movies/"
    },
    {
        "id": "1jkd08q",
        "author": "RetroSwamp",
        "title": "[Discussion] What's One Movie Series That Should Have Stayed 1 and Done?",
        "content": "Hey folks!  \n  \nI bring this debate to you all because it has been something my group has been discussing for a few days now.  \n  \nWhat is a movie series that should have stayed only 1 movie and not had a sequel? I know there are a few good ones out there, like Joker and The Hangover (my choices, that is), but I would love to get everyone's input on this to share with them!",
        "upvotes": 34,
        "comments": 477,
        "media": null,
        "permalink": "/r/movies/comments/1jkd08q/discussion_whats_one_movie_series_that_should/"
    },
    {
        "id": "1jjlynn",
        "author": "[deleted]",
        "title": "Which Movie Did You Expect to Be Mid but Ended Up Loving?",
        "content": "Sometimes, a movie surprises you in the best way possible. You go in expecting it to be forgettable, but by the end, you’re sitting there like, “Wait… was that actually amazing?”\n\nFor me, it was *Edge of Tomorrow*. I thought it was just another action-packed Tom Cruise flick, but it turned out to be one of the most clever and well-paced sci-fi movies I’ve seen in years.\n\nWhat’s a movie you had low expectations for but ended up loving?",
        "upvotes": 1988,
        "comments": 2323,
        "media": null,
        "permalink": "/r/movies/comments/1jjlynn/which_movie_did_you_expect_to_be_mid_but_ended_up/"
    },
    {
        "id": "1jjhsrj",
        "author": "Muffin_Most",
        "title": "Is Robert Patrick the only actor who gets killed by all three Planet Hollywood icons?",
        "content": "Robert Patrick plays thee characters who get killed by the Planet Hollywood stars in only seven years time.\n\nIn Die Hard 2 his character is fatally shot by Bruce Willis’s John McClane.\n\nIn T2: Judgment Day his T-1000 is terminated by Arnold Schwarzenegger.\n\nIn Cop Land Sheriff Sylvester Stallone uses his shotgun to end his life.\n\nDo you know other actors who met their untimely death by the hand of all three stars that backed the Planet Hollywood restaurants?\n\nUPDATE!\n\nPlanet Hollywood was initially backed by Schwarzenegger, Stallone, Willis AND Demi Moore in 1991.\n\nTurns out Robert Patrick also gets whacked by Demi Moore’s Madison in Charlie’s Angels: Full Throttle on top of Griffith Observatory.\n\nThat’s four out of four!\n\nShoutout to u/DEATHMTN for pointing this out.\n\nSECOND UPDATE!\n\nLinks to the four death scenes:\n\nDie Hard 2 (1990)\nhttps://youtu.be/g-P53rME1xE?si=oH-ozdKCLijIplD6\n\nTerminator 2: Judgment Day (1991)\nhttps://youtu.be/yiBHj8Xs4sg?si=FDrSN59EDk22d4ip\n\nCop Land (1997)\nhttps://youtu.be/emeGfvVJaBY?si=IE0AcPTsbm6BlXNJ\n\nCharlie’s Angels: Full Throttle (2003)\nhttps://youtu.be/7uP-CjEtSyM?si=4wOWFHX0V5nV_oOl",
        "upvotes": 3749,
        "comments": 366,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M96bo6bLYb0g57foqaRtxKLVSQedlHgjAQGw_W6rpmw.jpg?auto=webp&amp;s=70233b963dfbeb83dff7804c03b67872a25198e7"
        },
        "permalink": "/r/movies/comments/1jjhsrj/is_robert_patrick_the_only_actor_who_gets_killed/"
    },
    {
        "id": "1jjlehl",
        "author": "MarvelsGrantMan136",
        "title": "Final Destination Bloodlines | Official Trailer",
        "content": "",
        "upvotes": 1830,
        "comments": 369,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U41WzISFP8xZYh6zTcP2orHnlntgSbOae3F4ZyhWMIA.jpg?auto=webp&amp;s=9936c4420e3cfcaf3d5feeeb175bc4d58a749269"
        },
        "permalink": "/r/movies/comments/1jjlehl/final_destination_bloodlines_official_trailer/"
    },
    {
        "id": "1jkg0rx",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Fight or Flight' Starring Josh Hartnett - A mercenary takes on the job of tracking down a target on a plane but must protect her when they're surrounded by people trying to kill both of them.",
        "content": "",
        "upvotes": 16,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hpqcg8kz92re1.jpeg?auto=webp&amp;s=96f8b64d32d5af579c0a7b114c87d17f4feb8e2b"
        },
        "permalink": "/r/movies/comments/1jkg0rx/new_poster_for_fight_or_flight_starring_josh/"
    },
    {
        "id": "1jjicbn",
        "author": "Sisiwakanamaru",
        "title": "In Warning Sign for Hollywood, Younger Consumers Are Choosing Creator Content Over Premium TV and Movies",
        "content": "",
        "upvotes": 1923,
        "comments": 553,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IBIm0yqsQNepqN5TXDHgYVa6e2bzJ8MN8ZLvv7X5WGo.jpg?auto=webp&amp;s=0feb263a7d1e57ee7360026c2e7be2ab46dd8030"
        },
        "permalink": "/r/movies/comments/1jjicbn/in_warning_sign_for_hollywood_younger_consumers/"
    },
    {
        "id": "1jke8el",
        "author": "Davis_Crawfish",
        "title": "Ennio Morricone's music for films are emotional, sad and sometimes heartbreaking. Which film scores from the master have moved you to tears (Mine: The Legend of 1900)?",
        "content": "",
        "upvotes": 10,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ui8c-9ULVLtCBcGIWKoHpACuskObOBrcfx_0nHntlfE.jpg?auto=webp&amp;s=5cdb024c03b4d30f29cdc293b9dce6a692b89593"
        },
        "permalink": "/r/movies/comments/1jke8el/ennio_morricones_music_for_films_are_emotional/"
    },
    {
        "id": "1jkfptq",
        "author": "Both_Sherbert3394",
        "title": "'The Assessment' was really good and it's a shame no one is seeing it",
        "content": "So this just came out last weekend, I had never even heard of it until the week before when I saw a trailer in the theater and thought it looked intriguing, come to find out it made all of $152K this weekend from less than 300 theaters. I'm kind of baffled as to why; this has a really strong visual presentation, three recognizable actors giving very good performances, and a really compelling hook. The only reason I could imagine it not clicking with a bigger audience is because it gets darker than I expected, but I'm shocked that this seemingly just slipped completely under the radar, especially because it seems like the kind of movie this sub will inevitably come across as a 'hidden gem' in the next few years.\n\nThere's definitely an obvious comparison to be made to *Ex Machina* just in the fact that they're both seven day sci-fi experiments set in a futuristic location starring Alicia Vikander, but these are very, very different films beneath the surface. There's a LOT more going on in this film than I expected, and one thing I really have to say is that it feels like the kind of premise that in the hands of another filmmaker could've very easily become one-note or repetitive, but I never felt as though this did. I was really surprised how much depth they managed to give to all three main characters, and how many themes they managed to explore in ways that actually felt meaningful.\n\nThere's definitely some visual elements and ideas that feel as though they were inspired by other films (namely one room in the house that feels very reminiscent of *Blade Runner 2049*), but there's still something really fresh about this that feels like it's coming from a new voice.\n\nIf you have a chance, I'd definitely recommend checking it out. I'm trying to avoid giving anything away because I do feel as though it's best experienced mostly cold, but I also expect it'll only be in theaters for another few days. ",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1jkfptq/the_assessment_was_really_good_and_its_a_shame_no/"
    },
    {
        "id": "1jjs3jj",
        "author": "danielthetemp",
        "title": "Official IMAX 70MM poster for 'SINNERS'",
        "content": "",
        "upvotes": 351,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/emyx511n1wqe1.jpeg?auto=webp&amp;s=dc07b87d1dcd67c1319094a5af364debdcb20531"
        },
        "permalink": "/r/movies/comments/1jjs3jj/official_imax_70mm_poster_for_sinners/"
    },
    {
        "id": "1jjoiic",
        "author": "LinkSwitch23",
        "title": "Amy Pascal and David Heyman to Produce Next James Bond Film for Amazon MGM Studios",
        "content": "",
        "upvotes": 411,
        "comments": 241,
        "media": null,
        "permalink": "/r/movies/comments/1jjoiic/amy_pascal_and_david_heyman_to_produce_next_james/"
    },
    {
        "id": "1jkd4qz",
        "author": "delugetheory",
        "title": "'Myth of Man' (2025) is the most beautiful, original, and touching film that I have seen in quite a while.",
        "content": "[Trailer](https://www.youtube.com/watch?v=_MnOG-sHz4U)\n\nHow do I describe this film?  Okay, imagine if, rather than an animated film about animals, *Flow* (2024) was a live-action film about androids.  Now imagine that it was co-directed by Michel Gondry and Darren Aronofsky and give it a steampunk aesthetic.  That's *Myth of Man*.  But this description does not do this beautiful film justice.  I believe that Jamin Winans' *Myth of Man* represents the reason that human beings still make movies -- the hope and possibility that we might still capture a truly unique and mesmerizing vision on film.  And *Myth of Man* is *truly* mesmerizing.  Try to see this film.",
        "upvotes": 10,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CDxVg8rRPQk93z-O5DOgzw6SuNwItO_vZNiFLWdnY0w.jpg?auto=webp&amp;s=29531f7d10b84cc26b00b1793d9856e3d455fc56"
        },
        "permalink": "/r/movies/comments/1jkd4qz/myth_of_man_2025_is_the_most_beautiful_original/"
    },
    {
        "id": "1jjqw53",
        "author": "mayukhdas1999",
        "title": "Official Poster for Athina Rachel Tsangari's 'HARVEST' - Over seven surreal days, a nameless village, in an undefined time and place, disappears. Former townsman turned farmer Walter and his confused friend, lord of the manor Charles, confront an impending invasion by modernity",
        "content": "",
        "upvotes": 264,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2lviimcjsvqe1.jpeg?auto=webp&amp;s=66f7a4a9bdc9c7fcf1d8afad46beb7b1e119b12d"
        },
        "permalink": "/r/movies/comments/1jjqw53/official_poster_for_athina_rachel_tsangaris/"
    },
    {
        "id": "1jjszah",
        "author": "Crowcin",
        "title": "What’s a movie you watched with friends/family, that you recommended but regretted mid way through",
        "content": "It could be a movie you watched before and thought they might also like or it could be a movie you were watching along with them for the first time that you recommended.\n\n I was super hyped about the movie Rubber (2010) after watching the trailer cause it just looked so unhinged and fun. It was basically a movie about a tyre that went around killing people. The fact no one else around me enjoyed the trailer as much as me should’ve been the first and only sign not to include others in that fever dream. \n I still enjoyed the movie tho.",
        "upvotes": 162,
        "comments": 332,
        "media": null,
        "permalink": "/r/movies/comments/1jjszah/whats_a_movie_you_watched_with_friendsfamily_that/"
    },
    {
        "id": "1jjiuww",
        "author": "AporiaParadox",
        "title": "Marketing/trailers that tried to trick audiences",
        "content": "A recent strange phenomenon is how Hollywood goes out of its way to hide the fact that musicals are musicals in the marketing. The trailers won't show any of the characters singing and will make it look like it's a normal movie. The reason for this seems to be that marketing teams know that some people don't like musicals, so they think they can get them to buy a ticket by tricking them into thinking a musical is not a musical and I guess hope that they won't bother doing any research beforehand. Wonka and Mean Girls are some recent examples of this.\n\nBut Hollywood does this kind of deceitful marketing all the time. Most infamously, the movie [Kangaroo Jack](https://www.youtube.com/watch?v=SuyLeUjuT_k)'s marketing made it look like a fun family movie with a talking kangaroo that raps, but in reality it's a comedic crime movie for adults and the kangaroo barely appears and only talks in one scene where a character is hallucinating. In fact, the movie was originally R-Rated and was going to be called Down and Under, but then was retitled and edited to a PG rating by producers because the kangaroo scene was the only think test audiences liked.\n\nSo what other movie marketing campaigns tried to basically trick audiences into thinking that the movie was going to be about something else or even of a different genre?",
        "upvotes": 583,
        "comments": 403,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gSef-ocNnHWodm-VaE71AV8rlQI55F5N3K6z8W6XD1g.jpg?auto=webp&amp;s=d8ee8d5472f1e427bdb0655cb1e9a697333d39ba"
        },
        "permalink": "/r/movies/comments/1jjiuww/marketingtrailers_that_tried_to_trick_audiences/"
    },
    {
        "id": "1jk0ek6",
        "author": "Man_Bites_Shark",
        "title": "Legacy sequels that were actually good",
        "content": "We’ve had quite a few in the past several years, some better than others. It’s always fun to see returning cast members, but doesn’t seem like they always know how to use them in an organic way that serves the story. A legacy sequel is one that is a soft reboot of an older series that features at least one cast member from the original, so something like Twisters doesn’t really count in my book. \n\nMy groupings:\n\nGood:\n\n- Scream 5\n\n- Axel F\n\n- Blade Runner 2049\n\n- Top Gun: Maverick \n\nMid:\n\n- Force Awakens\n\n- Ghostbusters: Afterlife \n\n- Bill &amp; Ted Face the Music\n\n- Beetlejuice Beetlejuice \n\nHorrible:\n\n- Coming 2 America\n\n- The Matrix Resurrections\n\n- Jurassic World: Dominion (technically a sequel to a reboot but since it featured the original cast, I’m including it)\n\n\n\n\n",
        "upvotes": 55,
        "comments": 234,
        "media": null,
        "permalink": "/r/movies/comments/1jk0ek6/legacy_sequels_that_were_actually_good/"
    },
    {
        "id": "1jke78r",
        "author": "corsair965",
        "title": "How do we get Neil Marshall to make the sequel to Dog Soldiers that he wanted to do?",
        "content": "Dog Soldiers popped up on another thread and it made me think of this. When Hollywood is almost exclusively only green-lighting movies based on existing properties surely this would fly?? \n\nApparently it was supposed to be the idea of werewolf super soldiers.\n\nThat's my post but this has to be 300 char",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1jke78r/how_do_we_get_neil_marshall_to_make_the_sequel_to/"
    },
    {
        "id": "1jk3qie",
        "author": "jawanda",
        "title": "Mowgli: Legend of the Jungle (2018) - I can't believe how good this movie is and also how poorly it was received",
        "content": "Ok I know I'm 7 years late, but I finally just watched Mowgli: Legend of the Jungle. I was absolutely blown away by the visuals as well as the acting by the main character Rohan Chand (at just 14 years old).  I was shocked to find out it was made in 2018, I feel like the visuals are above and beyond much of what I see from movies made today in 2025. And while the main character is a very young actor, he stays in character amazingly well and his facial expressions and delivery of his (sparing) lines is a above and beyond what I'd ever normally expect from an actor that age. \n\nOf course there was massive departure from the \"original\" story, but that didn't bother me at all, it's its own story and adaptation and I felt they pulled it off masterfully. \n\nThe only thing I can assume from reading the prevalence of bad reviews is that people are pissed that it didn't do justice to their nostalgia for the \"original(s)\". \n\nThe few reviewers who mentioned uncanny valley also baffle me.  I'm as adverse as the next guy to poorly animated humans and other creatures who speak, but I felt none of that in Mowgli. The animals with speech were remarkably believable and relatable. \n\nI searched and read threads on reddit from just after it came out, and most seemed to share the same criticisms as the critics, but I'm curious if that is still the consensus?\n\nThose who loved, and loathed, this wonderful movie, I'm looking forward to hearing your opinions. ",
        "upvotes": 20,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1jk3qie/mowgli_legend_of_the_jungle_2018_i_cant_believe/"
    },
    {
        "id": "1jkg6zt",
        "author": "baadass9",
        "title": "BFI confirms African Odysseys strand on pause",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fbELga6xgxBmUHzdG7YzBopyK-YFYNg_BKqLtJlSEzU.jpg?auto=webp&amp;s=3cc8756d6ebb1a71e8089c09515afc9965c2806e"
        },
        "permalink": "/r/movies/comments/1jkg6zt/bfi_confirms_african_odysseys_strand_on_pause/"
    },
    {
        "id": "1jkbnpr",
        "author": "Educational-Yak1992",
        "title": "Greenland 2",
        "content": "Hello!\n\nDoes anyone know when greenland migration will release. It looks like a great movie. Imdb says March 28th of this year but so far there is no trailer or anything. I can not wait for this movie and Butlers acting. The post apocalyptic scene will be interesting to see and how they pulled it off",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1jkbnpr/greenland_2/"
    }
]