[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jdaoaw",
        "author": "Afraid_Shape_1924",
        "title": "With Love, Meghan proves that no matter what you do people will find reasons to hate.",
        "content": "I would like to preface this by saying I’m no fan of Meghan (Sussex is it?). I did find her escapades during her stint with the royal family and after trying. \nBut the vitriol directed towards her in this show is excessive, inaccurate and unfair. \nThe show itself is charming. For those who say it’s “un-relatable” she never claimed to try to be. She’s doing her, and surprise, surprise she’s rich. Shocker. I don’t know how people are so offended by her choice of cookware, the fact that she has a large garden, time on her hands to harvest berries, and elaborate utensils when that’s literally her life. If you can’t relate have you considered that you’re not the target audience? I think it would be worlds more offensive if she tried showing people how to bargain hunt or use coupons to seem relatable when clearly that’s not her life. \n\nMeghan comes off as warm and genuine and you can tell the people in her life who she invites on genuinely care about her. The show is used to discuss their friendships and their lives and I don’t think it’s scripted to hype her up. The conversation goes both ways and it’s a show about connecting with people. \n\nShe clearly knows her food. It might not be to everyone’s taste but you can tell she derives genuine enjoyment out of food and preparing it. \nFolks mad that her recipes are not groundbreaking, guess what? None are. Even Pinterest regurgitates recipes that have been around for eons. She is just sharing what she likes. \n\nI think in the first episode she mentions that the kitchen she’s in is not hers, but there’s another main kitchen she cooks from for the majority of the show and that’s in her house, no? \n\nAnyway as much as I’ve never really liked the lady, the amount of vitriol she’s receiving for this show is unwarranted and unnecessary. ",
        "upvotes": 421,
        "comments": 436,
        "media": null,
        "permalink": "/r/netflix/comments/1jdaoaw/with_love_meghan_proves_that_no_matter_what_you/"
    },
    {
        "id": "1jdh87u",
        "author": "yahooentertainment",
        "title": "The Terrifying Truth Behind Netflix’s ‘Adolescence’",
        "content": "**From The Wrap:**\n\nThe four-part Netflix series [“Adolescence”](https://thewrap.com/tag/adolescence/) is already making waves after its debut on Friday, with many wondering if the tale of a teen who has been accused of killing a female classmate is based on a true story.\n\nThe young boy, played by Owen Cooper, is quickly revealed to be guilty of the crime in the first episode, and the series begins a larger, steeper dive into incel culture and gender violence that has been promoted by influencers such as Andrew and Tristan Tate.\n\n“In the U.K., there’s a real problem with knife crime, certainly in the younger generation. There have been a series of of young boys who were killing young girls with knives, and it was really upsetting,” director Philip Barantini [told TheWrap](https://www.thewrap.com/adolescence-netflix-cast-creators-behind-the-scenes/) this month. “That was the seed that we wanted to explore, and send a bit of a message and maybe spark a bit of a conversation.”",
        "upvotes": 163,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1jdh87u/the_terrifying_truth_behind_netflixs_adolescence/"
    },
    {
        "id": "1jdv0b6",
        "author": "gobsmacked247",
        "title": "I am only 20 minutes into Adolescence, episode one, and I already can’t breathe!!!!",
        "content": "This series is already breaking all the rules.  The acting and camera work is insane.  The story is making me want to scream.  I’m on the edge of my seat and I don’t even know why!!!",
        "upvotes": 27,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jdv0b6/i_am_only_20_minutes_into_adolescence_episode_one/"
    },
    {
        "id": "1jdca5v",
        "author": "Robemilak",
        "title": "Joe Russo Says They Used AI for Voice Modulation in ‘The Electric State’: “[It’s] something any 10-year-old could do after watching a TikTok video.\" Thoughts?",
        "content": "",
        "upvotes": 117,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1jdca5v/joe_russo_says_they_used_ai_for_voice_modulation/"
    },
    {
        "id": "1jdhfz5",
        "author": "Plane-Cloud-5837",
        "title": "Owen Cooper reveals which Adolescence moment was improvised",
        "content": "",
        "upvotes": 50,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jdhfz5/owen_cooper_reveals_which_adolescence_moment_was/"
    },
    {
        "id": "1jdcsgr",
        "author": "KnowNow101",
        "title": "Adolescence",
        "content": "I am completely blown away by the new addition to Netflix, Adolescence, the acting, the camera work, directing, the writing, everything was 10/10.  Its not very often i get emotional over a TV show but this is one of the best series I've seen. Now if only Netflix would fix their new horrible interface then i'd be happy.\n\n# ",
        "upvotes": 87,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1jdcsgr/adolescence/"
    },
    {
        "id": "1jdllt3",
        "author": "blameitonbegoniaz",
        "title": "Adolescence",
        "content": "Owen Cooper might be the best actor I’ve ever seen. As a parent, this show has me completely and utterly fucked up. What a wild ride. I am blown away by the acting and can’t believe this is Owen’s first role. ",
        "upvotes": 24,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1jdllt3/adolescence/"
    },
    {
        "id": "1jdy1cl",
        "author": "Netflixers",
        "title": "Do Netflix films disappear deep into the catalog a week after their release, never to be watched again?",
        "content": "Hi guys, I took a look at 2 years of Netflix data to see how much \"old\" Netflix Original films are still watched years after their release. Hope you find it interesting!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdy1cl/do_netflix_films_disappear_deep_into_the_catalog/"
    },
    {
        "id": "1jdxwqt",
        "author": "pielcomolamiel",
        "title": "Adolescence",
        "content": "Steven Graham, Ashley Walters, Erin Doherty omg and the greatest performance I have seen from a child in a VERY LONG TIME, Owen Cooper.GIVE THEM THE OSCAR NOW. GIVE THEM THE FUCKING ACADEMY AWARD OMFG\n\nEACH EPISODE WAS RECORDED IN ONE SINGLE TAKE. And it is magical like, I am in awe.\n\nIf you like dramas, crime TV shows, and are into Psychology, This is an ABSOLUTE MUST WATCH. It's amazing especially considering how impressionable adolescents truly are, and how the influence of the internet and toxic masculinity continues to do so much damage to our kids, even when we try our best.\n\nIf you have watched already, what did you think? I want to discuss!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdxwqt/adolescence/"
    },
    {
        "id": "1jda2cd",
        "author": "Sweaty-Toe-6211",
        "title": "Jenna Ortega says ‘WEDNESDAY’ Season 2 is filled with more horror references &amp; unique visuals: “There's a whole episode based off of slashers, and we make a lot of horror references”",
        "content": "",
        "upvotes": 63,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1jda2cd/jenna_ortega_says_wednesday_season_2_is_filled/"
    },
    {
        "id": "1jdkqwc",
        "author": "cruser555",
        "title": "Zero Day",
        "content": "I just finished this series and I loved it! I don’t understand why it got some really bad reviews. It has everything you want in a political thriller - a storyline that keeps you guessing, a fast pace, and very good acting by some big stars ",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jdkqwc/zero_day/"
    },
    {
        "id": "1jdxiu3",
        "author": "RZNNNN",
        "title": "Netflix drastically reduces quality between episodes from 1:00 to 4:00 AM",
        "content": "I’m convinced that the engineers at Netflix are trying to be clever by automatically reducing quality when they think that I’m sleeping.  If I exit playback and resume the quality returns to normal.  Has anyone else experienced this?  It’s a nightly occurrence for me.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jdxiu3/netflix_drastically_reduces_quality_between/"
    },
    {
        "id": "1je07ux",
        "author": "rajdeepguha0937",
        "title": "Streaming quality on Android.",
        "content": "I cannot find a single way to increase the streaming quality of videos on Netflix when I am on my android. The only thing i can change is the download quality which I may add doesn't seem to work, as I've already set it to high and the downloaded vids are still in sh#t quality. I've tried setting the data usage to both wifi only and maximum data. Nothing seems to work. \n\nHelp me out pls? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1je07ux/streaming_quality_on_android/"
    },
    {
        "id": "1jdlv2r",
        "author": "angiesblog",
        "title": "tv series recommendation",
        "content": "hey there! I need a good show to watch ASAP. I'll give you some indications:\n- I would prefer if it's a bit family friendly (doesn't have to be too much but not sex education level)\n- not too tragic and not a medical show (mom doesn't like them)\n- no animes\n- available on netflix ofc!!\n- entrataining!!\n- some shows I really loved are suits, the rookie and detective monk (looking for something similar)\n- I also like the good place, superstore, the big bang theorand anne with an e (i just now started it) but I'm looking for something more engaging \n\ncan someone help me?? \nTHANK YOU!!",
        "upvotes": 8,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1jdlv2r/tv_series_recommendation/"
    },
    {
        "id": "1jdfaq6",
        "author": "OverSyncopatedBeats",
        "title": "For Owen Cooper’s second ever role after he smashed it in Adolescence, he’s going to be in Emerald Fennell’s Wuthering Heights!",
        "content": "Playing a young Jacob Elordi. Big things coming for him and he really deserves it ",
        "upvotes": 19,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdfaq6/for_owen_coopers_second_ever_role_after_he/"
    },
    {
        "id": "1jdspo3",
        "author": "Standard_Tea_2516",
        "title": "How to enable games section on Samsung Frame TV 2020",
        "content": "We have a Samsung Frame TV 43” 2020 model and aren’t able to get the games section to work. I’ve tried uninstalling the Netflix app on the device and installing it again, rebooting the TV, and checking for updates on the TV. We have the highest tier Netflix membership as well. Netflix chat said to contact Samsung about this issue. Netflix website also says that games are compatible with Samsung Smart TV’s. Had anyone had this issue or have any insight on how to get this to work. I was just going to get an Amazon Fire stick so my son can play the Netflix games, but thought I’d check here for help first. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jdspo3/how_to_enable_games_section_on_samsung_frame_tv/"
    },
    {
        "id": "1jdx8qo",
        "author": "xSparza",
        "title": "Naruto language",
        "content": "ok so can someone plz help me, I was watching Naruto with my girl in Spanish, but for some reason now it’s in English and doesn’t give me an option for Spanish, when before I didn’t even have the option for English, can someone help plz 🥺",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdx8qo/naruto_language/"
    },
    {
        "id": "1jdx7so",
        "author": "TheGame81677",
        "title": "I keep getting error code tvq-pb-101 when trying to watch Monday Night Raw",
        "content": "I was watching John Cena on Monday night raw, then I started getting this error code. First it was cutting in and out, now it will not even play for more than two seconds. What is this code and how do you fix it? I am watching on a Samsung TV if that makes any difference. Anyone else deal with this? It’s wanting me to unplug my tv, but I don’t want to do that.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jdx7so/i_keep_getting_error_code_tvqpb101_when_trying_to/"
    },
    {
        "id": "1jdplzw",
        "author": "Comfortable-Cash-262",
        "title": "\"Asura\". This Japanese drama is just impressive. Unlike many fast-paced shows, it unfolds with a slow yet deliberate rhythm. The acting is great, the cinematography breathtaking, pure quality in every detail. I came across it thanks to this article in The Guardian.",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdplzw/asura_this_japanese_drama_is_just_impressive/"
    },
    {
        "id": "1jdtyxa",
        "author": "myhamartia",
        "title": "subtitle line?",
        "content": "does anyone know the purpose of the line that is found in netflix's audio and subtitle menu???  \nlike i dont understand why some languages are above/below the line. i dont see any pattern (past choice, geograpghical location, etc) and dependant on the show they swap position above/below the line\n\nhttps://preview.redd.it/leqx5j1xrcpe1.png?width=1114&amp;format=png&amp;auto=webp&amp;s=b2c3a2a8815f0a9b476fd24f029495e174cf06b7\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdtyxa/subtitle_line/"
    },
    {
        "id": "1jdty11",
        "author": "willowww003",
        "title": "Can I watch my downloaded titles after my traveller's code runs out?",
        "content": "Currently using a traveller's code in our house since a family member out of town pays for it. I downloaded 2 seasons of Breaking Bad to binge when I go on vacation in a few days, but according to Google, my traveller's code access will run out before I leave. \n\n  \nIf I have things downloaded and open Netflix without an internet connection, even after my code has run out, will I still be able to watch my downloads?\n\n  \nSorry if this seems stupid.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jdty11/can_i_watch_my_downloaded_titles_after_my/"
    },
    {
        "id": "1jdzer1",
        "author": "SelfAmbitious",
        "title": "FACE TO HEEL!!!! Wwe Raw Review (18/3/25)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdzer1/face_to_heel_wwe_raw_review_18325/"
    },
    {
        "id": "1jd4edy",
        "author": "Few_Position7650",
        "title": "Adolescence",
        "content": "I can understand why people might feel the way they feel about the ending of the show buttttt episode three might be the best hour of television I have ever in my 38 years of watching tv seen. The tension and the acting and camera work were top tier tv. The little boy is definitely going to be on all of our screens for years to come. ",
        "upvotes": 48,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1jd4edy/adolescence/"
    },
    {
        "id": "1jdmv2d",
        "author": "BopDoBop",
        "title": "Netflix household watchdog is too eager on pestering users",
        "content": "I was subscriber to highest tier during last 7 years.\n\nWe are family of four and only four of us are using it within limits of our home, or occasionally on our mobile devices when we are away during vacation.\n\nYes, we use many devices: 4 phones, three tablets, three tvs, on computers, or on laptops, or in Quest VR. Its not our fault that we have many devices\n\nToday I cancelled my subscription for good because they keep pestering us to update our household devices non stop.\n\nDuring last three months they keep removing our devices and constantly nagging about update our household. I also removed all devices for more than three times in order to reset their \"watchdog\"\n\nDespite the facts that they are not offering full library in our country since start, that they recently upped the price a lot, they lowered the amount of quality content, I kept my subscription.\n\n**But I will not tolerate treating me like this and constantly interrupting enjoying the service. This weekend they logged out all of our devices and that was the last straw.**\n\n**Farewell Netflix!**\n\nPS: Sorry for venting. I wrote this in frustration and hope that maybe someone from Netflix will see this and ease on their watchdog policy for sake of others.",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jdmv2d/netflix_household_watchdog_is_too_eager_on/"
    },
    {
        "id": "1jdrvwq",
        "author": "Jazzydiva615",
        "title": "Show Ideas- Where to Pitch",
        "content": "Where can you pitch show ideas to Netflix??\n\nHere's one- Help a Hoarder! Neighbors can report suspected Hoarders. Netflix sets up surveillance and then set up an intervention with the Neighbors and suspected Hoarder. Netflix brings in a Mental Health Professional, Cleaning Crew and a Professional Organizer.\n\nMore ideas! Call me Netflix! I can come on as a Casting Coordinator!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdrvwq/show_ideas_where_to_pitch/"
    },
    {
        "id": "1jdrqhw",
        "author": "MannerMountain1117",
        "title": "The Leopard: Angelica, Tancredi and Concetta love triangle",
        "content": "Okay so is it safe to assume that deep down all along Tancredi has always truly loved Concetta and only realized it once it was kinda too late and he had already F’d things up by marrying the wrong person? Concetta actually said I love you and he never does and I can’t tell if he’s being half honest or still trying to have his cake and eat it too. Like staying married to Angelica but still pining for Concetta. Did people even divorce back in those days? Have not read the book! I wonder if there will be a season 2 or if this is as far as it can go ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdrqhw/the_leopard_angelica_tancredi_and_concetta_love/"
    },
    {
        "id": "1jdrjbd",
        "author": "sadiebaby23",
        "title": "Adolescent",
        "content": "Excellent show.   But fucking terrifying as well for a mum of a 13 year old boy with a co-parent who is teaching masculinity and alpha male.  I am in tears.   \n\nWeirdest thing is that I listened to a podcast today about Incels.  Had never heard of it till today…. Then this.  Fuuuuk.  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdrjbd/adolescent/"
    },
    {
        "id": "1jdfeaf",
        "author": "Gil_Pogozelich",
        "title": "Big fan of The Blacklist – looking for similar shows",
        "content": "Hey everyone  \nI'm a huge fan of *The Blacklist*   \nloved the mix of crime, mystery, and drama and that constant feeling of who’s playing who? It kept me hooked for all seasons\n\nNow that I’ve finished it, I’m on the hunt for something in a similar vibe. Any recommendations for shows with strong characters, twists, secret agendas or that FBI/criminal mastermind tension?\n\n  \n",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jdfeaf/big_fan_of_the_blacklist_looking_for_similar_shows/"
    },
    {
        "id": "1jd1ndt",
        "author": "ZackaryAsAlways",
        "title": "Movies like Electric State is the reason Netflix Originals have a bad reputation",
        "content": "Electric State imo incapsulates everything wrong with MOST Netflix Originals. By this I mean a bland by the numbers project with a couple cool things here and there ",
        "upvotes": 34,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1jd1ndt/movies_like_electric_state_is_the_reason_netflix/"
    },
    {
        "id": "1jds1lg",
        "author": "Long-Rabbit-2213",
        "title": "Cassandra 3D model made by me. I just need a face and hands, then I'm done. Pls rate it so far.",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jds1lg/cassandra_3d_model_made_by_me_i_just_need_a_face/"
    }
]