[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ic3ytb",
        "author": "AcceptableResort2524",
        "title": "I wish everyone would cancel their plans for a year to protest the price hikes.",
        "content": "Exactly as the title says. We don't need to cancel forever, but if a sizeable enough amount of people canceled for a meaningful amount of time they might get the picture. Got the email about a \"Price update\" to 17.99, avoiding the term \"increase\" and completely not putting the old price in the email and then had to dig into my payment history to find it. So fed up with subscriptions. Immediately canceled.",
        "upvotes": 32,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1ic3ytb/i_wish_everyone_would_cancel_their_plans_for_a/"
    },
    {
        "id": "1ic4h53",
        "author": "StarKCaitlin",
        "title": "Jeremy Allen White to Star in 'Enigma Variations' Series at Netflix",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ic4h53/jeremy_allen_white_to_star_in_enigma_variations/"
    },
    {
        "id": "1ib9728",
        "author": "Whobitmyname",
        "title": "Carey Mulligan ‘Just Started’ Filming ‘Beef’ Season 2 and Says ‘Almost Everything’ Is Different",
        "content": "",
        "upvotes": 429,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1ib9728/carey_mulligan_just_started_filming_beef_season_2/"
    },
    {
        "id": "1ibjioi",
        "author": "Intrepid-Discount976",
        "title": "The Night Agent trying to become the new Jack Ryan is going to be its downfall",
        "content": "Jack Reacher, Jack Ryan, James Bond, Jason Bourne, whatever. The trope of the hyper competent spy action thriller that's geared specifically towards the male demographic. There are so many of these already, and apparently we needed another one?\n\nIMO what set the first season of The Night Agent apart was the male/female duo dynamic which tapped into both demographics and a wider audience. And while the writing occasionally went on the corny side, I appreciated the realistic aspect of physical limitations, i.e. the fighting was often clumsy, Rose was the computer wiz and not suddenly defeating men twice her size in hand-to-hand combat, and Peter wasn't this unrealistic prodigy agent who was somehow equally talented at technology and combat - they both needed the other in a believable partnership.\n\nSeason 2 felt like they were diverging away from the formula in order to turn it into another long-running spy thriller franchise, which the show runners pretty much confirmed in an interview. Also, the decision to make her suffer from PTSD and anxiety, and be in therapy twice a week felt entirely out of place considering Peter is somehow completely mentally unaffected? And how has no government organization recruited Rose yet to be a cyber intelligence officer? Instead this season wrapped up with her effectively becoming his Bond girl, with the writers saying it's undecided if Rose will even be back next season. Peter being willing to trade his whole life to save her and Rose in turn being like \"this gives me anxiety, I just wanna go back to Silicon Valley and be a normal girl :(\"\n\nAll of this made complete sense btw when I found out S1 is based on a book, and S2 was the show runners writing without any source material. For me the season was a letdown, and I'm honestly just uninterested in the direction they're taking this show",
        "upvotes": 34,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1ibjioi/the_night_agent_trying_to_become_the_new_jack/"
    },
    {
        "id": "1iby6zo",
        "author": "supercoolnamehere08",
        "title": "Netflix got rid of Breaking bad and Better call Saul from Slovakia",
        "content": "The new stupid 2 hour movie got rid of hours of these tv shows ",
        "upvotes": 3,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6acvq09ejpfe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iby6zo/netflix_got_rid_of_breaking_bad_and_better_call/"
    },
    {
        "id": "1ibzxq7",
        "author": "qna27",
        "title": "Continue play on same device",
        "content": "I understand they have a service to keep track of point of time I'm watching a movie or series. But at times it plays a previous time when i resume on same device. I guess it makes sense of i played on device 1 then resumed on device 2, then went back to device 1 and there was a sync error. \n\nBut I have noticed this even when I play back on same device. \n\nSuggestion:\n\nOn same device save time played till locally &amp; don't overwrite that with server time if not played on different device.\n\nAnyone else experience this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ibzxq7/continue_play_on_same_device/"
    },
    {
        "id": "1ibr6j0",
        "author": "notyourhistoryclass",
        "title": "The History Behind The Six Triple Eight.",
        "content": "In December of 2024, Tyler Perry came out with a movie called The Six Triple Eight, starring Kerry Washington. I love history and after doing a deep dive on the story, I found out that, while dramatized and a handful of fictional characters sprinkled in for the sake of good storytelling, it was in fact very accurate. I really love Kerry Washington's portrayal of Major Charity Adams, especially the scene where she tells Dean Norris, \"over my dead body, sir!\" Especially since this scene actually happened in real life. She was a woman, being sick of mistreated for so long, that she wasn't going to let anyone stand in her way of what she wanted. ",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ibr6j0/the_history_behind_the_six_triple_eight/"
    },
    {
        "id": "1ib5hvi",
        "author": "S4v1r1enCh0r4k",
        "title": "Some rumors claim that season 5 will be split into two parts, premiering in October/November 2025",
        "content": "",
        "upvotes": 81,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1ib5hvi/some_rumors_claim_that_season_5_will_be_split/"
    },
    {
        "id": "1ibwt3p",
        "author": "AnwetLegEt",
        "title": "Move Netflix Account Abroad",
        "content": "I'm thinking about moving my Netflix account to another country for cost reasons. Specifically, from Switzerland to Turkey. As far as I know, I have to have a local credit card, which I have. \n\nI was also told that I can't use the account abroad for a month after the move. Is that true? That wouldn't be a problem for me.\n\nAs far as I know, it always shows the content that is valid in the country in question. Is that correct? Are there any restrictions if I always watch from abroad?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ibwt3p/move_netflix_account_abroad/"
    },
    {
        "id": "1ibvvx6",
        "author": "Human_Bed_6355",
        "title": "Menu sound but none for shows/movies",
        "content": "For last week I’ve tried getting on Netflix it a make the noise when you first load in. But ANY thing I tried to watch is silent. Have a gooogle tv so I can’t uninstall it. But I have uninstalled update and reinstalled still same issue, anyone have a fix or heard of this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ibvvx6/menu_sound_but_none_for_showsmovies/"
    },
    {
        "id": "1ib31p2",
        "author": "techfinpro",
        "title": "Finn Wolfhard Says ‘Stranger Things’ Couldn’t Have Ended Better After ‘Lord of the Rings’ Style Year-Long Shoot; Last Day on Set Was ‘Incredibly Emotional’",
        "content": "",
        "upvotes": 51,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ib31p2/finn_wolfhard_says_stranger_things_couldnt_have/"
    },
    {
        "id": "1ibt2hj",
        "author": "sreebsreeb",
        "title": "\"Your email address has been changed\" but not by me",
        "content": "Netflix web support just sends me around in circles telling me to contact customer support but circles around to web pages I have already been to.\n\nIs there a way to get chat or phone support?\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ibt2hj/your_email_address_has_been_changed_but_not_by_me/"
    },
    {
        "id": "1ibsy3n",
        "author": "Elegant-Page129",
        "title": "Recommendations?",
        "content": "What are some films like resident alien, the man who fell down to earth, etc.. like alien-y vibe or literally aliens who come down to earth. Or like just super powers without the cgi looking so fake ?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ibsy3n/recommendations/"
    },
    {
        "id": "1ibxeiu",
        "author": "ApprehensivePoetry34",
        "title": "How do I stop getting the same Home Screen ad?? PLS STOP COCOMELON",
        "content": "Every time I open Netflix on my computer AND TV, the same ad starts playing on my homepage above everything else. The default media at the top. No, it’s nothing interesting, but instead is the f-ing “Underwater Melon - Fruit Merge” game. I have shown NO interest in games at all, let alone kid-like media. \n\nEVERY TIME I open Netflix I see this Cocomelon inspired game. HOW DO I GET RID OF IT?\n\nI have downvoted it, but it still shows up first and starts playing audio…EVERY time I open Netflix. WTF?!?\n\nFor context, I have the ad-enabled subscription. This shouldn’t matter, right?! UGH I DONT LIKE COCOMELON",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ibxeiu/how_do_i_stop_getting_the_same_home_screen_ad_pls/"
    },
    {
        "id": "1ibre3e",
        "author": "Affectionate_Sea_161",
        "title": "Confused .. help please",
        "content": "Sorry if this has been asked .. I tried to search but didn’t find what I was looking for. I was sharing my account and finally got caught by Netflix. So I did the add member thing and profile transfer but now their account picture doesn’t show up as an option when I log in.. why?! If it’s all the same account why would that change and how do I get it back?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ibre3e/confused_help_please/"
    },
    {
        "id": "1iagsqk",
        "author": "cu_when_i_cu",
        "title": "Netflix will keep raising prices, they want you to downgrade because they make more money off ads.",
        "content": "Old DVD subscriber here, unsubscribed this weekend. Won't won't sign back up until there's a number of shows to watch, binge and then disconnect again.",
        "upvotes": 661,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1iagsqk/netflix_will_keep_raising_prices_they_want_you_to/"
    },
    {
        "id": "1ibr2ni",
        "author": "Ecstatic_Star_2047",
        "title": "Almost all my account history has disappeared?",
        "content": "Just logged into Netflix and saw that not only has my profile picture been changed, but almost all of the movies and shows in My List are gone, and it only shows 2 continued watching series?? Out of probably the hundreds of items I had saved, only 5 are listed anymore??   \nI logged into netflix just a few hours earlier and everything was normal, so is anyone else experiencing this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ibr2ni/almost_all_my_account_history_has_disappeared/"
    },
    {
        "id": "1ibql11",
        "author": "forevony_0904",
        "title": "Question",
        "content": "Hi all so I've got more shoes on my list to watch now I finished watching heartbreak high (I do know it has a season 3 coming out) and I think I'm gonna start Atypical next as I saw it is complete. But there are shows on my list that I'm not sure if they are complete such as\n\nOn my block\nTrinkets\nFakes\nEverything now \nMaid\n\nSo yea I just wanna know if those 5 shows I just mentioned above are they completed or do I have to wait for more seasons after I watch the show. Thanks in advanced all",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ibql11/question/"
    },
    {
        "id": "1ibekob",
        "author": "KlausMikaelsonsWife",
        "title": "No Chemistry Between Peter and Rose? (TheNightAgent)",
        "content": "Just as the title says, I binged s1 and 2 and I did not find an ounce of chemistry between Peter and Rose. Peter seemed too serious and I didn't see any love or (even lust) for Rose, all their kissing scenes felt abrupt and almost forced? I know the show is not meant to be centered around romance but I mean come on if your going to have it even as a sub genre I would hope the actors are somewhat romantically compatible. The only time I ever saw any affection was on the boat in s1 but otherwise nothing. I felt Rose did love Peter but it felt circumstantial and she was just so shitty in s2. I was quite literally shipping them with everyone else, I mean Peter had more chemistry with Noor and Alice then Rose atp and I think their relationship should’ve ended in s1. I watched interviews of Gabe and Luciane and the actors seem to have some chemistry but it just didn't translate on screen for some reason.\n\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ibekob/no_chemistry_between_peter_and_rose_thenightagent/"
    },
    {
        "id": "1ib4mhr",
        "author": "Mindless-Library-763",
        "title": "Stop hating on normal shows - the night agent season 2",
        "content": "Hey, \nso I recently read a post about how awful the night agent season 2 was and honestly it wasn't that bad. Of course it's not perfect, but some of us are loving the show and because of hate posts all series are getting cancelled. I understand that people don't see the logic behind some stuff or that a character ist annoying. But oh my god... do you really think that every human being isn't at some point in their life annonying? It's realistic that Rose can't decide if she wants to stay or to go. Every normal human would act like that. But for some reason you guys always want some perfect series with perfect plot and perfect people. It's just a show. Don't take it so serious. \nYou can criticize it, but come on, they didn't want an oscar for the night agent. \nIn the end of the day, I want to escape my real life, watch a show and forget about my problems. But because some people think they are smarter and better than everyone, my comfort shows are always getting cancelled.",
        "upvotes": 15,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1ib4mhr/stop_hating_on_normal_shows_the_night_agent/"
    },
    {
        "id": "1ibu9rx",
        "author": "Cold-Recognition25",
        "title": "Night agent 2 kinda slow....right?",
        "content": "I was so pumped to see the second season.  But it's been a kinda weird.  I don't think the plot makes that much sense.  As soon as something goes wrong he instantly suspects his boss.  What do you think?",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ibu9rx/night_agent_2_kinda_slowright/"
    },
    {
        "id": "1ibmsoz",
        "author": "Paleoworlde",
        "title": "Do you know the name of this bug show?",
        "content": "I remember in the mid to late 2010’s I watched this show on Netflix about this world of bug humanoids who had wars against each other, it was in a style like one of those traditional Japanese paintings and I haven’t been able to find anything about it online.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ibmsoz/do_you_know_the_name_of_this_bug_show/"
    },
    {
        "id": "1ia3wns",
        "author": "krazykatz911",
        "title": "Cancelling after 20 years",
        "content": "Price increase again.   $24.99 a month.  $300 a year.  Just plain ripoffs.  \n\nI’ve been a customer for 20 years.  Never again.  \n\nThe content is garbage.  \n\nA lot of the shows/movies are in different languages.  Which is fine but allow the user to select what languages they only want to see.  Not mix it all together and you have to start playing it to find out. \n\nA lot are old and available free on prime anyway.  \n\nThey keep raising the rates like it’s something people can’t live without. \n\nI got 4 streaming services for less than half of what Netflix wants a year. \n\nGoodbye greedy Netflix. ",
        "upvotes": 3409,
        "comments": 567,
        "media": null,
        "permalink": "/r/netflix/comments/1ia3wns/cancelling_after_20_years/"
    },
    {
        "id": "1iafu8x",
        "author": "johnppd",
        "title": "Netflix won the streaming wars, and we’re all about to pay for it",
        "content": "",
        "upvotes": 353,
        "comments": 150,
        "media": null,
        "permalink": "/r/netflix/comments/1iafu8x/netflix_won_the_streaming_wars_and_were_all_about/"
    },
    {
        "id": "1ibkgbk",
        "author": "9luckyluke9",
        "title": "Ferry The Series",
        "content": "Does anyone knows the nam of the song from season 2 episode 2 wich is playing durning the line up dance, it goes something like \"cry cry moving on, let you go\" or something like that. Shazam cant seem to find it. So i hope someone knows what im talking about 🙃",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ibkgbk/ferry_the_series/"
    },
    {
        "id": "1iav59m",
        "author": "darkdevilxy",
        "title": "Something like Dark and 1899.",
        "content": "Hi, can you guys please suggest me shows like Dark, 1899 and Three Body Problem. A big and mysterious event is slowly unraveled over the course of the series. Something with not more than 3 seasons.",
        "upvotes": 33,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1iav59m/something_like_dark_and_1899/"
    },
    {
        "id": "1ibhl61",
        "author": "Character-Soil-8900",
        "title": "block games on feed",
        "content": "I don't care for games on Netflix.  I don't ever intend to play any games on netflix. it gets in the way of the actual content I'm looking to consume. I DO NOT WANT TO SEE GAMES on netflix. I get on netflix for shows and movies, not mediocre, stupid games. how can I disable this stupid garbage from my feed?  fix this or I cancel subscription. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ibhl61/block_games_on_feed/"
    },
    {
        "id": "1ibpwma",
        "author": "Rxm308",
        "title": "Seems like content is really lacking in breadth and quality -",
        "content": "Can’t seem to get the shows or movies that used to be up through 2023, seems like in 2024 till now the content is mostly either old or crap \nOthers feel or noticed the same ?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ibpwma/seems_like_content_is_really_lacking_in_breadth/"
    },
    {
        "id": "1ibfekk",
        "author": "RightEconomist5754",
        "title": "how to add devices to household",
        "content": "so my phone apparently isnt a device i can use netflix on in my house i live with my parents and use there account i just have my own profile how does she add my phone to household devices",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ibfekk/how_to_add_devices_to_household/"
    },
    {
        "id": "1iblrnv",
        "author": "Southern-Brother5693",
        "title": "Share your stories. What are the most common Netflix glitches?",
        "content": "The most common glitch i have with my Netflix is that when I finish a title, I have to desperately guess where the right time it is to stop it (Usually when they give recommendations).\n\nNormally, the title should rewind to the beginning. But these days, it doesn't do that. I have to press \"Play from beginning\" for it to disappear from my \"Still Watching\" list.\n\nRefreshing the App doesn't help. Any common glitches you all face?   \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iblrnv/share_your_stories_what_are_the_most_common/"
    }
]