[
    {
        "id": "1i3qboh",
        "author": "BunyipPouch",
        "title": "Join us Friday 1/24 at 3 PM ET for a live AMA/Q&amp;A with Brady Corbet, director of A24's 'The Brutalist'. It stars Adrien Brody, Felicity Jones, and Guy Pearce. The 3h35 epic-drama was recently nominated for 7 Golden Globes and is releasing nationwide next week.",
        "content": "",
        "upvotes": 75,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zkllw8td9mde1.jpeg?auto=webp&amp;s=e2ff5e06beea46e0088a96cabed5015e2326a2cd"
        },
        "permalink": "/r/movies/comments/1i3qboh/join_us_friday_124_at_3_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1i36zgg",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Wolf Man / One of Them Days / The Last Showgirl / The Brutalist)",
        "content": "# New Theatrical Releases\n\n[Wolf Man](https://old.reddit.com/r/movies/comments/1i36wh1/official_discussion_wolf_man_spoilers/?)\n\n[One of Them Days](https://old.reddit.com/r/movies/comments/1i36wmw/official_discussion_one_of_them_days_spoilers/?)\n\n[The Last Showgirl](https://old.reddit.com/r/movies/comments/1i36wob/official_discussion_the_last_showgirl_spoilers/?)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n# Streaming Releases\n\n[Wallace &amp; Gromit: Vengeance Most Fowl](https://old.reddit.com/r/movies/comments/1hsvowt/official_discussion_wallace_gromit_vengeance_most/?)\n\n# Still in Theaters\n\n[Den of Thieves 2: Pantera](https://old.reddit.com/r/movies/comments/1hxuwnk/official_discussion_den_of_thieves_2_pantera/?)\n\n[Better Man](https://old.reddit.com/r/movies/comments/1hxuwpf/official_discussion_better_man_spoilers/?)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)",
        "upvotes": 34,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1i36zgg/official_discussion_megathread_wolf_man_one_of/"
    },
    {
        "id": "1i5gax3",
        "author": "ToranjaNuclear",
        "title": "What are the most dangerous documentaries ever made? As in, where the crew exposed themselves to dangers of all sorts to film it?",
        "content": "Somehow I thought this would be a very easy thing to find, I would look it up on google and find dozens of lists but...somehow I couldn't? I did find [one list](https://www.gamesradar.com/10-dangerous-documentaries/), but it seems to list documentaries about dangerous things rather than the filming itself being dangerous for the most part.\n\nI guess I wanted the equivalent of [Roar](https://en.wikipedia.org/wiki/Roar_(film)) or [Aguirre](https://en.wikipedia.org/wiki/Aguirre,_the_Wrath_of_God), but as a documentary. Something like [The Act of Killing](https://en.wikipedia.org/wiki/The_Act_of_Killing), or a youtube documentary I saw years ago of a guy that went to live among the cartel.",
        "upvotes": 3425,
        "comments": 924,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P7XDJ9yrtW94yx8TfWYZbJkdjTJWUgbWOdqQ602lzoA.jpg?auto=webp&amp;s=dbe22dcf8e127421ae0ee835015254b8e2045060"
        },
        "permalink": "/r/movies/comments/1i5gax3/what_are_the_most_dangerous_documentaries_ever/"
    },
    {
        "id": "1i5o6g3",
        "author": "johnydarko",
        "title": "What movies can you think of that use the Picard Priciple - the characters do everything they can to the best of their ability, make all the right moves... but still end up losing?",
        "content": "I think this is such a great concept for a bleak film,  but I just can't think of many that take advantage of it. I'm sure there are a bunch of horror films, but I really struggle to think of any other films that play this completely straight -  usually if it ends with the protagonist losing then they made a mistake somewhere along the line.\n\nI'd exclude biopics and movies in series from this as they are part of a larger story (eg: Empire Strikes Back ends with Han being frozen and Luke losing to Vader, but you know it's only the middle of the story) \n\nI'm sure I'm missing obvious ones but one of the only examples I can think of is actually Don't Look Up, where the main characters are correct, try to warn everyone, do it as well as they can... but it doesn't make any difference.",
        "upvotes": 288,
        "comments": 239,
        "media": null,
        "permalink": "/r/movies/comments/1i5o6g3/what_movies_can_you_think_of_that_use_the_picard/"
    },
    {
        "id": "1i5h7vr",
        "author": "CalSwete",
        "title": "Movies to make 11 year old cry ",
        "content": "Hello,\n\nMy daughter (11f) and her friend (11f) are having a sleepover. They want to watch a movie to make them cry. So far we have tried A walk to Remember, Bridge to Terebithia, Titantic, the notebook, Marley and Me. No tears or anything. Just laughter. I think these girls have no souls. Any suggestions? We have to keep it pg-13 and below. Thanks! \nEdit for movies I forgot she watched at a different time:\n\n\nForgot they have seen most Disney movies prior- not Fox and the hound so will tell them that. \n\nHave also watched My girl with no tears \n\n\nSecond update: they have decided on Old Yeller. I will let you know. Also I made a mistake and my daughter’s friend cried at the end of A wall to Remember- so it’s just my daughter who has problems. \n\nThird update: they tried old Yeller but couldn’t get into it. Her friend hasn’t seen My girl and my daughter saw it a while ago so they are giving that a shot. \n\nWe watched the preview to Stepmom on Amazon and it wasn’t a real trailer so I couldn’t sell it. \n\nShe also got mad at me because I rounded her up to 11 and she is actually 10.8 years old and wants accurate recommendations based on her correct age. \n\n4th update. They finished my girl. Her friend cried. My daughter said she just couldn’t cry  she wanted to share this picture for all the my girl fans [https://imgur.com/a/dwobAmV](https://imgur.com/a/dwobAmV). Her friend is still crying from it and started crying when she read the speech. So there is hope for her. \n\nI just want to say my daughter has a dark sense of humor and loves to laugh but she is the sweetest kid. She is the first to offer help. Shes very kind and sweet. She helps her teacher during lunch. She also has a strong moral compass and compassion to animals and people. She stands up for her friends and her beliefs and is just a generally a great kid. I’m sure in a few years so will be a crier like me. Thank you all for your suggestions. We will make our way through a lot of these. \n\nI think tomorrow we will do a Schindler’s list family movie night. My husband is thrilled..\n\nI think we will have to do grave of the fireflies tomorrow as well. Lots of suggestions. I haven’t heard of it. ",
        "upvotes": 1032,
        "comments": 2281,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/30ToaVLV-n7TsjRkXp4hd-voX7pbxrh9eJy6jM140x4.jpg?auto=webp&amp;s=37cf99d38bc6a3c9c4e454312a68ab1d2d472936"
        },
        "permalink": "/r/movies/comments/1i5h7vr/movies_to_make_11_year_old_cry/"
    },
    {
        "id": "1i5lj3l",
        "author": "UnderstandingFun8976",
        "title": "What is the hardest you’ve ever cried in a movie?",
        "content": "I’m a massive movie crier so I’ve cried during a LOT of movies. However, I’ll never forget the first time I watched Aftersun. As soon as the Under Pressure scene began and I realised what was implied, I felt like I’d been hit by a truck and cried for hours lol.\n\nIs there a movie that hit you so hard you’ll never forget the emotions you felt while watching it?\n\n***Edit:*** *Wow I didn't expect this amount of comments! Thanks for sharing your recommendations and stories - I love hearing about people's personal experiences with movies. What a beautiful artform &lt;3*",
        "upvotes": 345,
        "comments": 1360,
        "media": null,
        "permalink": "/r/movies/comments/1i5lj3l/what_is_the_hardest_youve_ever_cried_in_a_movie/"
    },
    {
        "id": "1i5t7eg",
        "author": "BunyipPouch",
        "title": "First Poster for House-Invasion Thriller 'Cold Wallet' - A team of Redditors lose everything after a cryptocurrency scam. This leads them to plot to kidnap the \"financial influencer\" who screwed them over.",
        "content": "",
        "upvotes": 84,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cnlw7w2q66ee1.jpeg?auto=webp&amp;s=997e7864e328c2f9991fbae734db324cc42d6f5f"
        },
        "permalink": "/r/movies/comments/1i5t7eg/first_poster_for_houseinvasion_thriller_cold/"
    },
    {
        "id": "1i5q9bj",
        "author": "Paxtnn",
        "title": "The Blair Witch Project - Extended Sight Cut (3hrs long extended cut)",
        "content": "",
        "upvotes": 110,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/62cJTZPozehObNE2zAGJ1iqNz5IjnmSqf6RqHdWnnXc.jpg?auto=webp&amp;s=fd6fd8ae12cf894685c68f1959c7ca8b0793ac5c"
        },
        "permalink": "/r/movies/comments/1i5q9bj/the_blair_witch_project_extended_sight_cut_3hrs/"
    },
    {
        "id": "1i523bl",
        "author": "MarvelsGrantMan136",
        "title": "‘Moana 2’ Passes $1 Billion Globally",
        "content": "",
        "upvotes": 4716,
        "comments": 786,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nqnzC5tMGea2KEcZQ8qqRPc-vfyFufSvcbAZeZhnOF0.jpg?auto=webp&amp;s=733db49829f67b2691a27cf0ea42c331cbf00ea0"
        },
        "permalink": "/r/movies/comments/1i523bl/moana_2_passes_1_billion_globally/"
    },
    {
        "id": "1i5mqx1",
        "author": "StarWeaver84",
        "title": "I wish the next \"Big Thing\" in American cinema would be sci fi movies",
        "content": "Like a lot of others I was a fan of Marvel since 2008's \"Iron Man\" and Captain America: Brave New World looks good but recently I have lost a bit of enthusiasm for Marvel.\n\nI wish something new would become the next \"Big Thing\" in American cinema and I would prefer it to be sci fi movies.\n\nI think it would be awesome if we were living in a world where movie goers were excited to see a movie based on James S.A. Corey's \"Leviathan Wakes\" or something like it which warned against having corporations and governments gaining too much power and were inspired to put humanity on a brighter path.\n\nThere is an excellent TV show that was on Syfy but cancelled and then saved by Amazon called \"The Expanse\" but a movie would probably reach a bigger and wider mainstream audience.\n\nI think it would be cool if we were living in a world where the Mass Effect trilogy was getting a series of good big screen adaptations and were blowing people away with the new sci fi universe, aliens, and spaceships and showed people that \"Space Opera\" isn't just Star Wars or Star Trek.\n\nI think it would be cool to have Iain M. Banks's vision of the future, \"The Culture\" realized on the big screen.\n\nHopefully the success of the new Dune movies make Hollywood seriously think about giving us new sci fi movies.",
        "upvotes": 120,
        "comments": 117,
        "media": null,
        "permalink": "/r/movies/comments/1i5mqx1/i_wish_the_next_big_thing_in_american_cinema/"
    },
    {
        "id": "1i4zal1",
        "author": "BunyipPouch",
        "title": "Poster for Amazon's 'This Is The Tom Green Documentary' - Directed by Tom Green - It follows Green’s early beginnings in Canada to Hollywood stardom and a full-circle return from L.A. to a rural farm in Canada.",
        "content": "",
        "upvotes": 2748,
        "comments": 361,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tf6nymsnkyde1.jpeg?auto=webp&amp;s=0fa43af55c8395934fedfb5e89ef160294383a49"
        },
        "permalink": "/r/movies/comments/1i4zal1/poster_for_amazons_this_is_the_tom_green/"
    },
    {
        "id": "1i5fjbe",
        "author": "Ofbatman",
        "title": "The Goonies at 40",
        "content": "Just walked out of a showing of The Goonies. It’s surprising how much it holds up. I’ve gotta say the pacing of the film is everything. No lulls just a story that moves forward with little to no exposition. So funny.\n\nThere’s something about the movies from this time that just grab your attention and don’t let go. Weird Science is the same.",
        "upvotes": 289,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1i5fjbe/the_goonies_at_40/"
    },
    {
        "id": "1i51czy",
        "author": "Ok-Competition-1814",
        "title": "Characters who are supposed to be athletes but are really bad at it\n",
        "content": "I'm thinking of Taron Egerton who is introduced in Carry-On as a former track star. Trouble is, he runs like it’s his first day with new legs. Unnatural arm swing, duck feet, it’s a mess. What are some other characters who fit this bill? I imagine the gold standard is still Tim Robbins pitching in Bull Durham. ",
        "upvotes": 1797,
        "comments": 1121,
        "media": null,
        "permalink": "/r/movies/comments/1i51czy/characters_who_are_supposed_to_be_athletes_but/"
    },
    {
        "id": "1i59a85",
        "author": "BunyipPouch",
        "title": "'This is the Tom Green Documentary' - Official Trailer",
        "content": "",
        "upvotes": 632,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e7EIFedqxzMjvmUG8Qbh7ToPcmL7RGSKbX8Y3PPNSIE.jpg?auto=webp&amp;s=71d53df44f7ea6d485ac715f57db151e7ea79609"
        },
        "permalink": "/r/movies/comments/1i59a85/this_is_the_tom_green_documentary_official_trailer/"
    },
    {
        "id": "1i5iegl",
        "author": "LollipopChainsawZz",
        "title": "How Greta Gerwig and IMAX Got Netflix to Flinch on ‘Narnia’ Release",
        "content": "",
        "upvotes": 142,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XlWyn-t8einw7RBEnbFzw2_Lv-f0reU4Dg9OSREnk14.jpg?auto=webp&amp;s=72c795e0eb519639f82c665fdefa470d7df70a2d"
        },
        "permalink": "/r/movies/comments/1i5iegl/how_greta_gerwig_and_imax_got_netflix_to_flinch/"
    },
    {
        "id": "1i5sut5",
        "author": "Puzzled-Tap8042",
        "title": "Lynne Taylor-Corbett Dies: Choreographer For Hollywood’s ‘Footloose’",
        "content": "",
        "upvotes": 18,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sxvAHrEPvygctb66E1DVicW_SXyp29kCCI_KVjNBvj4.jpg?auto=webp&amp;s=73bfa8cfb4a17fb0c2655df5b378557818039330"
        },
        "permalink": "/r/movies/comments/1i5sut5/lynne_taylorcorbett_dies_choreographer_for/"
    },
    {
        "id": "1i5lrxl",
        "author": "Trufflesniffers",
        "title": "What was in John Matrix sandwich in the film Commando? ",
        "content": "Jenny serves him a sandwich and he asks what's in it when she replies \"you don't want to know\"\n\nWas she pranking him? ",
        "upvotes": 50,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hBkY8Y5hj5p2xZH63GuS3ALrdjMRWDFqoitzWI8Gw60.jpg?auto=webp&amp;s=801050863fe2c22e1172d5d313b5743da3cd700e"
        },
        "permalink": "/r/movies/comments/1i5lrxl/what_was_in_john_matrix_sandwich_in_the_film/"
    },
    {
        "id": "1i5pttz",
        "author": "Foreign_Caregiver",
        "title": "What’s a movie you’ve watched that completely changed your perspective on life?",
        "content": "We all have that one movie that hits us on a deeper level and makes us rethink things. For me, it was Eternal Sunshine of the Spotless Mind. The way it explores love, memory, and the pain of loss left me thinking about my relationships in a different light.\n\nWhat’s a movie that had a similar impact on you? And why? I’m looking to expand my watchlist with films that resonate on a deeper level.",
        "upvotes": 20,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1i5pttz/whats_a_movie_youve_watched_that_completely/"
    },
    {
        "id": "1i55f94",
        "author": "MarcoG790",
        "title": "Something I noticed in after many rewatches of Once Upon a Time in Hollywood ",
        "content": "In Once Upon a Time in Hollywood, Steve McQueen talks about Roman Polanski and Sharon Tate’s marital situation and her history with Jay Sebring. McQueen says, “Jay loves Sharon. That's what's up. And he knows, as sure as God made little green apples, that one of these days that Polish prick's [Roman Polanski] gonna fuck things up and when he does, Jay's gonna be there.” \n\nI may be reading into this a little much (or maybe this was obvious) but I just realized that this quote may have more importance than I had initially thought. At the end of the movie, we know that Sharon Tate ultimately survives the Manson murders in contrast to what actually happened. Is it possible that this quote from Steve McQueen may have been Tarantino’s thoughts for how Polanski and Tate’s marriage would have worked out if she had survived? Especially since Polanski has turned out to be an extremely awful person, this may have been the thing that McQueen was pointing to when he said that Polanski’s going to fuck things up one day. \n\nLet me know your thoughts.",
        "upvotes": 564,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1i55f94/something_i_noticed_in_after_many_rewatches_of/"
    },
    {
        "id": "1i5re2o",
        "author": "joesen_one",
        "title": "THR Writers Roundtable 2025 - Halina Reijn, James Mangold, Jason Reitman, Jesse Eisenberg, Justin Kuritzkes and Payal Kapadia",
        "content": "",
        "upvotes": 8,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/i20YUOQFMZIHCsmxjdidNxjgT3yp2_DoEH0YirT4SrI.jpg?auto=webp&amp;s=3c03513782529512f5208649c18e3222d1992130"
        },
        "permalink": "/r/movies/comments/1i5re2o/thr_writers_roundtable_2025_halina_reijn_james/"
    },
    {
        "id": "1i5r6wk",
        "author": "maidenless_pigeon",
        "title": "Watching white boy rick",
        "content": "*Spoilers ahead*\n\nLike me you've probably seen clips of the beginning where rick jr and his dad buy those equation aks from that gun fair, so while I was looking through netflix I recognised the title and decided to watch it.\n\nIt's a good movie probably one of the better ones on netflix Australia, it's similar in a way to goodfellas both show the rise and fall of their main characters but in ricks case he wasn't a user just a dealer.\n\nThis movie is loosely based on the true story of Rick Wershe jr but the movie covers the main plot point. That rick got fucked by the federal government. \n\nIt's a decent movie with some powerful scenes such as when rick jr and his dad drag dawn (rick jr's sister) out of the crack house where she was residing and detoxing her in their house, the scene shows just how difficult it is to have a family member battle addiction and the uneasiness even after the addiction is broken an example would be rick sr looking out for dawn on his porch making she doesn't \"make a wrong turn\".\n\nI don't have the way of words many others have so I digress but I believe this is film is a must watch even with it's pacing issues or the low reviews. \n\n",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1i5r6wk/watching_white_boy_rick/"
    },
    {
        "id": "1i5toc5",
        "author": "Hermit0fAlbion",
        "title": "The Food of the Lord of the Rings (and its significance) by kaptainkristian",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r1NP3UvhYApTJweYFadGao09DwgMBTXT2j9CGiwdFdE.jpg?auto=webp&amp;s=c8e278a27a711c9516f1db4675868cd022b875e4"
        },
        "permalink": "/r/movies/comments/1i5toc5/the_food_of_the_lord_of_the_rings_and_its/"
    },
    {
        "id": "1i5u0vk",
        "author": "PrithvinathReddy",
        "title": "If you could recommend one lesser-known film that everyone should see, what would it be?",
        "content": "\"Sometimes the best stories are the ones that aren't told as loudly, but quietly linger in your heart long after the credits roll.\"\n. \nI'm curating a list on Letterboxd featuring lesser-known films that deserve more attention. These could be hidden gems from any genre, whether they're overlooked indie films, cult classics, or movies that simply flew under the radar. The goal is to uncover films that have a unique storytelling, strong performances, or interesting direction etc but didn't get the widespread acclaim they should have. ",
        "upvotes": 6,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1i5u0vk/if_you_could_recommend_one_lesserknown_film_that/"
    },
    {
        "id": "1i5selx",
        "author": "Existing-Salt7865",
        "title": "Which of the Skarsgård brothers do you like the most? ",
        "content": "My favorite is Bill. He shouldn't have taken the role in the unfortunate 'The Crow,' but he is a good actor. His interesting looks certainly help; he has something both dark and dangerous, and sweet, almost boyish about him. He used this very well in 'Barbarian'. He also has very distinct, expressive eyes. \n\nhttps://preview.redd.it/t20zpnpz06ee1.png?width=949&amp;format=png&amp;auto=webp&amp;s=8c77ee2485a60633bbac8bb855839bc975cfd531\n\n",
        "upvotes": 5,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1i5selx/which_of_the_skarsgård_brothers_do_you_like_the/"
    },
    {
        "id": "1i57yxx",
        "author": "No_Macaroon_7608",
        "title": "The Wailing(2016) is the scariest movie I have seen till now!!",
        "content": "I have watched many horror movies and very rarely I feel scared. But today, after watching The Wailing I am sure that this is the scariest movie I have ever seen. The plot of this movie is absolutely terrifying. Aside from how scary the movie is, the writing in this movie is one of the best ever. Also the acting by little child is simply phenomenal. 5/5 movie.",
        "upvotes": 184,
        "comments": 65,
        "media": null,
        "permalink": "/r/movies/comments/1i57yxx/the_wailing2016_is_the_scariest_movie_i_have_seen/"
    },
    {
        "id": "1i5h5z3",
        "author": "ReallyAsleep",
        "title": "Films to get lost in the atmosphere of?",
        "content": "I don’t exactly know what type of film this is, just that in these cases the story comes second and the vibes come first. Some atmospheric films like this I really enjoyed are tinker tailor soldier spy (2011), both Bladerunners, Prisoners, The Assassination of Jesse James by the Coward Robert Ford, and just about every David Fincher film.",
        "upvotes": 35,
        "comments": 119,
        "media": null,
        "permalink": "/r/movies/comments/1i5h5z3/films_to_get_lost_in_the_atmosphere_of/"
    },
    {
        "id": "1i5b9rd",
        "author": "Draxtonsmitz",
        "title": "What are some trilogies or series where the middle movies are better than the original?",
        "content": "Star Wars OT jumps out as I think the popular consensus is that Empire is better than New Hope. What are some other series where the second is better than the first?\n\nI’ve never seen The Godfather movies, it’s just never come up or happens, but I always hear the second is the best one. \n\nWhat are some other series where the second is better than the first?",
        "upvotes": 81,
        "comments": 474,
        "media": null,
        "permalink": "/r/movies/comments/1i5b9rd/what_are_some_trilogies_or_series_where_the/"
    },
    {
        "id": "1i5rz66",
        "author": "AgentDaxis",
        "title": "Copycat (1995)",
        "content": "[Copycat \\(1995\\)](https://preview.redd.it/jcplg7duu5ee1.jpg?width=1000&amp;format=pjpg&amp;auto=webp&amp;s=eb6ce8c7f88b9c142efff9c643e7f3eed7b5972f)\n\nSaw this movie recently &amp; had never heard of it before. Very interesting psychological crime thriller staring Sigourney Weaver as an agoraphobic criminal psychologist along with Holly Hunter &amp; Dermot Mulroney as 2 homicide detectives. They team up to investigate a serial killer who is terrorizing San Francisco by committing copycat murders using the same methods as past famous serial killers, down to the exact details.\n\nI found the movie very suspenseful &amp; engaging with several unexpected twists. There's definitely similarities to other crime thrillers from that time period, especially Silence of the Lambs, but it also has its own style &amp; aesthetic to it that makes it stand out to me. It's also a rare movie from this time period that has fully developed female characters in leading roles.\n\nSigourney Weaver in particular is great as the criminal psychologist who develops agoraphobia. She once said that she was most proud of this role but regretted that the movie is often overlooked.\n\nThis movie was released with quite a bit of critical praise but I feel like no one seems to talk about it or even remember it. Definitely worth watching if you're interested in psychological crime thrillers.",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1i5rz66/copycat_1995/"
    },
    {
        "id": "1i524jr",
        "author": "indiewire",
        "title": "‘The Straight Story’ May Lack David Lynch’s Signature Darkness, but It Led to His Eerie Masterworks",
        "content": "",
        "upvotes": 232,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8oSlGnaWfNHrx1juBn90GfdMzJs7YQ4FXAoD-Nn495o.jpg?auto=webp&amp;s=6b803b81804787d2c8b8119b3ba31934d3265af2"
        },
        "permalink": "/r/movies/comments/1i524jr/the_straight_story_may_lack_david_lynchs/"
    },
    {
        "id": "1i5qo19",
        "author": "JayDunzo",
        "title": "What are some movies where someone gets transported to another world or dimension at the beginning of the movie?",
        "content": "Magically or quasi-magically, and they spend the rest of the movie in that world, usually having an adventure and returning at the end. This was a very common premise in 80's and 90's movies. I'm trying to compile a decent sized list. Back To The Future is the big one that comes to mind. Also of course The Wizard Of Oz. But for 80's/90's I'm thinking of Blast From The Past, Stay Tuned, Hook, Super Mario Bros (1993), Black Knight, Cool World, The Matrix, Chronicles Of Narnia, Space Jam, Spirited Away. I'm trying to watch some of the campier ones. Please post as many as you can remember.",
        "upvotes": 4,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1i5qo19/what_are_some_movies_where_someone_gets/"
    },
    {
        "id": "1i58zx1",
        "author": "HotOne9364",
        "title": "Alice in Wonderland (1949)",
        "content": "It's more Tim Burton than the Tim Burton adaptation!",
        "upvotes": 65,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uJ-Ub2WoKPD2KxyxDCwMBT-Z0xJK-evRNMtv_OYZz-c.jpg?auto=webp&amp;s=cc9be7a4025100de86c041706d73b530d8105c91"
        },
        "permalink": "/r/movies/comments/1i58zx1/alice_in_wonderland_1949/"
    },
    {
        "id": "1i5kken",
        "author": "LieWalker",
        "title": "Tell me a scene where a character is expecting to be proposed to, but ends up being broken up with.",
        "content": "I need to find a scene like the one in Legally Blonde where Elle expects to be proposed to, but ends up being dumped. The older the better but anything would work at this point. The most important point being that a character is expecting a proposal, but ends up being broken up with.\nReference:\nhttps://youtu.be/sij4r12cVHo?si=RLX75ZxNWwaPAN64\n",
        "upvotes": 11,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sbuwAOFJ8r1Sf1rjwyoiVPp3QdM011UJYbGH5pnA8Sk.jpg?auto=webp&amp;s=6863160d1d47b5e638e076d69bd6b50dc33b7220"
        },
        "permalink": "/r/movies/comments/1i5kken/tell_me_a_scene_where_a_character_is_expecting_to/"
    }
]