[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 44,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1quhpzo",
        "author": "itsy_bitsy_seer",
        "title": "Is Bridgerton craze over?",
        "content": "First half of season 4 has dropped but I haven't seen the same fan fare or discussions surrounding it. \nIt hasn't peaked to No. 1 in my area (it's at Number 3).\nIs it the solely about them splitting the season up or a boring Cinderella-esque storyline or fans have moved on? What do you think is going on?\n\nEdited to add:\nI should probably clarify - I loved it, but I didn't find enough discussion related to it. It may just be my algorithm.",
        "upvotes": 111,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1quhpzo/is_bridgerton_craze_over/"
    },
    {
        "id": "1qufjve",
        "author": "The540Incident",
        "title": "Netflix no longer available on PS3 after March 2nd 2026.",
        "content": "quite a run it has been! surprised it lasted this long, it’s also one of the few ways to view Netflix in 4:3 natively. Since PS3 never had ads I suppose Netflix never liked that.",
        "upvotes": 102,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qufjve/netflix_no_longer_available_on_ps3_after_march/"
    },
    {
        "id": "1qumldy",
        "author": "projectoutliers",
        "title": "Peaky blinders is good but warrior is better",
        "content": "Exactly what the title says. Warrior easily deserves more seasons. Cancelling warrior is crime against good shows. Peaky blinders was solid but warrior is easily better. Sad peaky blinders gets full seasons plus a movie but warrior is canceled..really wish it got to finish the story ",
        "upvotes": 26,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1qumldy/peaky_blinders_is_good_but_warrior_is_better/"
    },
    {
        "id": "1quwyol",
        "author": "thickerthanabeer",
        "title": "Anybody else watch the K-drama action thriller \"Bloodhounds\", that's releasing a 2nd season in a couple months?",
        "content": "Bloodhounds was FANTASTIC!! K-drama action with phenomenal fight choreography (the fight/stunt cheographer did all of Squid Games!) &amp; all-around beautiful cinematography with a fun &amp; intriguing plot &amp; likeable characters. \n\nThere's even some behind-the-scenes tea that occurred during filming that didn't negatively affect the plot &amp; There's a season 2 coming out in a couple months!!\n\nNone of my mates watched it but I haven't seen anything else like it before. Everything in it was good. I've even got the music from it cemented in my head!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1quwyol/anybody_else_watch_the_kdrama_action_thriller/"
    },
    {
        "id": "1qucoje",
        "author": "MyViewOnThings",
        "title": "His and Hers",
        "content": "What in the “Hallmark made a mystery movie” is this nonsense?\n\nI’ve had a tough time recalling worse acting in a series, foreign language subtitles come to mind, and still make this look bad.  How in the Howie Mandel doing handstands on a handkerchief did this limited series trend at #1? I’m genuinely shocked at how bad this acting, writing, and over all production turned out to be. It’s so bad I stopped at the start of episode something or other to write this Reddit and I’m already having exceptionally more fun with my limited time on a work night. This series is like someone farted in a closed room with no ventilation after eating at Joes dinner sub 4:00 am. I believe watching the history of how man made Velcro shoes in the 1980s would have been a substantially more valid use of my evening. Who in the wide world of sports memorabilia watched this and gave it a thumbs up? Walking down 22nd street at 3:00 am hitchhiking a ride to New Port Richey would be a more productive use of thumbs or ups. I paused the TV with an “I’m not mad I’m just disappointed” expression and pondered my viewing choices or wondered if I should donate my TV to help educate underprivileged tribes in Papua New Guinea. I think the parents and entire community of people that raised the individuals responsible for making this “limited series” monstrosity should be forced to pay a tax and plead guilty to misdemeanor obstruction of justice. I’m beyond words for how incredibly underwhelmed I am at the thought of this dumpster fire to continue. When in the Men are from Mars women are from Venus did Netflix decide “let’s go with this one.”? I would rather go back to the recent Gasparilla parade wearing a thong while eating Icecream than watch this nonsense any longer. Please just say no to drugs and this series, it’s honestly that bad. I may delete my subscription to all streaming platforms and go pray in the Himalayan mountains for a solid year after this waste of hours, minutes and seconds with no purpose. The only redeeming quality is this is a “limited” series.\n\nSincerely,\n\nA concerned viewer",
        "upvotes": 37,
        "comments": 192,
        "media": null,
        "permalink": "/r/netflix/comments/1qucoje/his_and_hers/"
    },
    {
        "id": "1quslp0",
        "author": "lyncIE33",
        "title": "Why can't netlfix fix HDR subtitles?",
        "content": "This is not a new observation, so more of a rant than a question, but... why can't netflix make subtitles a sensible brightness in HDR?\n\nThey are set at much too high a brightness for any modern tv with good HDR capabilities. It makes some content basically unwatchable.\n\nYes, I've made them semi-transparent and tried different colours, but this is a sub-optimal fudge.\n\nWhat is stopping netflix configuring the brightness properly (or at least letting us do so)?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1quslp0/why_cant_netlfix_fix_hdr_subtitles/"
    },
    {
        "id": "1qugyyk",
        "author": "Pamsopinion",
        "title": "My Review of Secret Mall Aoartment",
        "content": "Like many documentaries it went too much into the weeds. I found the background material about Providence, building the mall etc. interesting. Also the artistic community emanating from Risdy. I was very interested in the tape art project + I was inspired by what art can do to heal and reach others. A central question the documentary raises, is the secret apartment art? I would say, No. It comes off more like a kids’ secret playhouse, a free place to live after the free spaces they lived in Eagle Rock were destroyed by builders. I would be interested in knowing more about the divorce between Michael and Adriana. Obviously, his obsession with the secret apartment is what drove them apart. I was going to recommend it to a friend who lives in Providence and my niece who went to Risdy, but changed my mind.",
        "upvotes": 8,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1qugyyk/my_review_of_secret_mall_aoartment/"
    },
    {
        "id": "1qumtn9",
        "author": "Hopeful_Historian115",
        "title": "WWE quality issue",
        "content": "Hello I have the xiaomi tv a pro 32 inch qled google tv it's a 720p tv . I have the 1080p pack of netflix. But for few days only latest WWE shows are playing at 540p . But any other movies, series,old wwe shows are playing at maximum quality which is 720p . ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qumtn9/wwe_quality_issue/"
    },
    {
        "id": "1qum2d7",
        "author": "fkdjgfkldjgodfigj",
        "title": "Is there any way to force it into picture in picture mode? Background play?",
        "content": "My phone has a \"pop up window mode\" but it doesn't show up as a media notification so that you can unpause it to play while the phone is locked. I also set it to unrestricted battery settings and am paying for the highest tier plan.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qum2d7/is_there_any_way_to_force_it_into_picture_in/"
    },
    {
        "id": "1qtkgut",
        "author": "MonsterZero0000",
        "title": "Netflix charging extra because I'm traveling",
        "content": "I'm in the military and traveling away from my family for a year but staying in the U.S. \n\nNetflix is asking me to add myself as a new member to my own account and pay more. I just wanted to say that I think this is a bad policy.\n\nThank you.",
        "upvotes": 157,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1qtkgut/netflix_charging_extra_because_im_traveling/"
    },
    {
        "id": "1qu31dw",
        "author": "anonmouseguy",
        "title": "Run Away - List of all the Plot Holes",
        "content": "Doing this for my own sanity. The series has left me speechless in the wrong way.\n\nWould like your thoughts on any or all of these plot holes. Or if there any that I'm missing.\n\n1. Rocco the super detective - enticing him with 50k made him find random information that somehow the police couldn't find\n\n2. Ingrid turning into Dexter - She is committing her first ever murder yet is perfectly fine doing it in such brutal way and being okay with cutting off fingers\n\n3. Ingrid the secret keeper - Why not tell her husband that the daughter he has been looking for and going crazy for is in rehab\n\n4. Ingrid the fake investigator - Why would ingrid want to go to the shady drug dealer having known what she knows\n\n5. Rehab not alerting the police - The two detectives even mentioned that they are spreading their search so the Rehab wouldve heard about it for sure\n\n6. Wannabe Bonny and Clyde - The killer couple being so nonchalant about killing just because they were physically punished as children (yes thats awful but how does that turn you into such insane serial killers)\n\n7. Dumb Dee Dee - Dee Dee not being able to provide any real explanation for why she loved a \"religion\" where the main figure was hiring a hitman to kill of his bastard sons who he abandoned\n\n8. Victoria informing the cult - Why would she inform The Shining Truth about finding her son (Henry Thorpe) when she literally had to escape the place herself?? Make it make sense\n\n9. Super(Old)Woman - The old woman randomly appearing on the 4th floor at the last second out of no where to push Dee Dee off. Firstly, how did she even find them? Secondly, was she running with them up the stairs the whole time? Ludicrous!\n\n10. Ingrid and her Son - Why didn't Ingrid ask Paige how she knew about the son?\n\n11. Gullible PI - Makes no sense that the PI would just buy the story of Alison wanting to meet somewhere far away and get in the car with Dee Dee.",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qu31dw/run_away_list_of_all_the_plot_holes/"
    },
    {
        "id": "1quinou",
        "author": "tgrsnpr",
        "title": "Members Only Palm Beach - Mar a lago",
        "content": "I know this show has been out for a bit but I just finished watching the last episode. The last episode on Taja's birthday, she wanted all the girls to just say everything out instead of behind each other backs, Gale and Hilary was talking about membership to Mar a lago. Just hearing that name, I know it has been mentioned in past episodes, but this time it really hit me on why it sounded so familiar then it hits, it was the place mentioned in the Epstein files. \n\nThen it got my thinking....hmm I wonder if any of these women are in the files. Does anyone think the same way as well?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1quinou/members_only_palm_beach_mar_a_lago/"
    },
    {
        "id": "1qu6r9k",
        "author": "AntiqueCheesecake260",
        "title": "Star Search",
        "content": "Is anyone watching this show? My thoughts:\n\nSomething feels.. off, idk\n\nWhy is Chrissy a judge on everything 😭 was no one else available?? I’m so confused on all of the judges tbh besides Jelly Roll bc he’s a singer. \n\nThe end of EP 2 was weird after Bear’s performance and I’m religious. It just felt weird in my spirit idk. The show just feels like a joke to me, something is so off I can’t put my finger on it. \n\nThe contestants look so confused when the host is speaking, can they not hear or something? At first I thought it was bc the little boy was a kid but it happened with everyone else after him.\n\nHow is AJ able to be on this show as well as Building the Band? Is it bc it’s both under Netflix? I’m not sure how that works forgive me.\n\nThe show also got no promo at all. I didn’t even know it was current until I finished watching all of my other shows. It didn’t come up on the banner or recommended or anything",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qu6r9k/star_search/"
    },
    {
        "id": "1qtwi2h",
        "author": "misterpopculture",
        "title": "Hawkins Gets a New Animated Mystery in Stranger Things: Tales From ’85",
        "content": "",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qtwi2h/hawkins_gets_a_new_animated_mystery_in_stranger/"
    },
    {
        "id": "1qu6tbn",
        "author": "TimeExpensive9251",
        "title": "Any good k-drama recommendations",
        "content": "Hi everyone. So I’ve watched the following: Its Okay to Not be Okay, Hometown Cha-Cha, The Glory, Extraordinary Attorney Woo, Celebrity, Marry my Husband and When Life Gives You Tangerines. \n\nI wanted to ask for some good k-drama recommendations on Netflix, I’m looking for a feel good, romance, slice of life with some drama. \n\nAny suggestions?",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qu6tbn/any_good_kdrama_recommendations/"
    },
    {
        "id": "1qufp8h",
        "author": "SafetyJust2448",
        "title": "Need a show to watch",
        "content": "I liked disenchantment, bojack horseman, how I met your mother, big mouth, and Human Resources. What show do you guys (and gals) recommend?\n(This chunk isn’t important just needed to fill the word limit)",
        "upvotes": 1,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1qufp8h/need_a_show_to_watch/"
    },
    {
        "id": "1qud597",
        "author": "Ok_Staff_4677",
        "title": "Video quality",
        "content": "So I have a basic plan which supports 720p and when I watch something in tv the quality is good no problem but in my phone it looks like 480p and the pixels are distorted.i have very good internet speed",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qud597/video_quality/"
    },
    {
        "id": "1qu0qqf",
        "author": "Jumpy_Wing_7884",
        "title": "Thoughts on Bridgerton season 4 representation: tokenistic or necessary?",
        "content": "Gay man here. I’m all for good LGBTQ+ rep, but that random Benedict/Louis kissing scene felt unnecessary and kind of tokenistic to me. Like it was just thrown in to tick a box.\n\nI’d rather see proper, well-written queer storylines than blink-and-you-miss-it moments.\n\nAnyone else feel this way, or just me?",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qu0qqf/thoughts_on_bridgerton_season_4_representation/"
    },
    {
        "id": "1qun9jx",
        "author": "godguided",
        "title": "STRANGER THINGS ATE",
        "content": "I still have left to see last two episodes but man till now i actually love it. It's so intense. It's bigger than ever.\n\nStories really lining up. Idk why i heard bad reviews but i am enjoying. I went with very low expectations because of the reviews online but i am mind blown till now. I guess it's the end then? I saw all all episodes when i was high as well. Idk if i was intense or the show. All in all good effing show till now. Hope it ends well as well ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qun9jx/stranger_things_ate/"
    },
    {
        "id": "1qu6x5c",
        "author": "RiskAndReason",
        "title": "Valentine’s Day watch ideas on Netflix?",
        "content": "With Feb 14 coming up, I’m looking for something romantic to watch on Netflix. Could be a movie or a series, light and feel-good or a bit emotional.\n\nWhat would you recommend for a cozy Valentine’s night? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qu6x5c/valentines_day_watch_ideas_on_netflix/"
    },
    {
        "id": "1qt1pww",
        "author": "MeanNothing3932",
        "title": "Best in Show Catherine O'Hara",
        "content": "For those of you who have or haven't seen it. It's a great movie and we love Catherine O'Hara as Cookie! It's a classic movie from the 90s. RIP Catherine we will miss your talent. ",
        "upvotes": 208,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1qt1pww/best_in_show_catherine_ohara/"
    },
    {
        "id": "1qu66ry",
        "author": "melissam17",
        "title": "Is Netflix using AI to create storylines all the new shows and movies?",
        "content": "I love to watch some of the limited shows that Netflix has, I’ve been working my way through a lot of them since I’ve enjoyed them and I also have watched movies that Netflix came out with. But once I start watching some of the newer shows and movies, they seem so fake and the plot never makes any sense. I feel like I’m going crazy watching all of these and finding them incredibly boring and confusing. ",
        "upvotes": 0,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1qu66ry/is_netflix_using_ai_to_create_storylines_all_the/"
    },
    {
        "id": "1qufb6f",
        "author": "Low-Sheepherder-3014",
        "title": "Just finished hate watching The Pulse",
        "content": "I really wanted to like this show, and there were some parts of it that were enjoyable but holy shit every man on this show was awful (at some point) and every woman was constantly just walked all over and punished. \n\nThe way the show handled sexual harassment, which underpinned the entire story line made me cringe the whole time. \n\nAnd don’t even get me started on the ending. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qufb6f/just_finished_hate_watching_the_pulse/"
    },
    {
        "id": "1qtwdo4",
        "author": "ArmyInteresting9700",
        "title": "Chromecast2 and Netflix.",
        "content": "It's supposed to work but I can't get it to go to my TV Help!! I dont seem to be able to contact anyone  to help me at netflix. Is there a way  to watch it on my TV. \nI spoke them. You have to pay for the second tier of subscription.  Added bonus *no ads*",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qtwdo4/chromecast2_and_netflix/"
    },
    {
        "id": "1qto9ij",
        "author": "godguided",
        "title": "Review of His &amp; Hers",
        "content": "I just saw His &amp; Hers Tv show and i have a mixed feelings about the show. If we talk about storyline and direction i think it lacks depth, urgency and tbh bit of logic. I get it it’s a small town so they wanted to show solving murder there is not easy but showing them straight up dumb is another thing. It was frustrating to see that even with so much attention and media coverage of high profile murder in town a detective is so easily ruining and manipulating the case with no question asked. I mean the concept and twist was tbh good, it got me and i didn’t see it coming. Last episode first half i was like this is so illogical and they built it all for this and then second half made sense of it all. If they chose better actors, and storyline and plot was played in bit different and more tension filling way it could have been great thriller mystery show but they relied it all on last 20-30 mins which made it frustrating. I am sure many people have different take on it and i would love to hear that. ",
        "upvotes": 6,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qto9ij/review_of_his_hers/"
    },
    {
        "id": "1qufjrj",
        "author": "frankoceanmusic1",
        "title": "his and hers discussion",
        "content": "spoiler if you haven’t watched yet \n\nshoot me if this is a stupid question \n\nwhen they found the nail clippings in lexys room, wouldn’t they have found alice’s dna under? as well as the knife? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qufjrj/his_and_hers_discussion/"
    },
    {
        "id": "1qu1qb7",
        "author": "Maggsymoo",
        "title": "bug casting episode 7 of anything....",
        "content": "has anyone else found this issue?\n\n  \ncasting from phone (android or apple) to chromecast, all works fine until you want to play episode 7 of whatever you are enjoying.\n\n  \nit starts to load as normal, but then errors 'we're having problems playing this title at the moment, please try againa later or select a different title'.\n\n  \nit will play on phone not casting,  but not when casting.\n\n  \nit has done it with Runaway ep7 and billionaires bunker ep7.  all other episodes before and after work fine ..\n\n  \nreported to nexflix they were no help, infact quite rude.\n\n  \nanyone else?\n\n  \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qu1qb7/bug_casting_episode_7_of_anything/"
    },
    {
        "id": "1qtzxrm",
        "author": "neom315",
        "title": "Who did the soundtrack for the new Take That documentary on Netflix",
        "content": "Does anyone know who did the background soundtrack for the new documentary on Netflix? \n\nspecifically, the song at the very beginning of the third episode, sort of 80's synth arpeggio.\n\naround the 0.49 second mark.\n\nThank you",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qtzxrm/who_did_the_soundtrack_for_the_new_take_that/"
    }
]