[
    {
        "id": "1lx8haf",
        "author": "InventionAMA",
        "title": "Hey r/movies! We're Courtney Stephens and Callie Hernandez, the filmmakers of the recent meta-fictional, experimental feature film INVENTION, that's now streaming on Mubi. You might also know Callie from La La Land, Alien: Covenant, Blair Witch, Under the Silver Lake, The Endless. Ask us anything!",
        "content": "Hey [r/movies](https://www.reddit.com/r/movies/)! We're Courtney Stephens and Callie Hernandez, the filmmakers of the recent meta-fictional feature INVENTION which riffs on real circumstances to explore the relationship between fantasy and grief -- both in personal life and how it reflects externally in America today. The film deals with weird medicine, losing dads and the emotional logic of conspiracy theory against the bucolic, literary backdrop of the Berkshires in the fall.\n\nSynopsis: In the aftermath of a conspiracy-minded father’s unexpected death, his daughter receives his patent for an experimental healing device. Featuring archive from actress Callie Hernandez's actual late father, INVENTION explores the process of grieving a complicated parent, and the filmmaking itself becomes a part of the process.\n\nTrailer: [https://www.youtube.com/watch?v=TFtolT9DE6M](https://www.youtube.com/watch?v=TFtolT9DE6M)\n\nWatch on MUBI: [https://mubi.com/en/us/films/invention-2024](https://mubi.com/en/us/films/invention-2024)\n\nAsk us anything! Back at 3 PM ET to answer questions.\n\nBios:\n\nCourtney Stephens is a writer/director of four features and numerous short films. Terra Femme, composed of amateur travel footage shot by women in the early 20th century, was a New York Times critic’s pick and has toured widely as a live performance. The American Sector (with Pacho Velez) follows slabs of the Berlin Wall installed around the US. John Lilly and the Earth Coincidence Control Office (with Michael Almereyda) explores the life of psychedelics pioneer John C. Lilly. Her films have been exhibited at MoMA, The National Gallery of Art, The Barbican, Walker Art Center, and film festivals including the Berlinale, Locarno, Rotterdam, Viennale, New Directors/New Films, Visions Du Réel, Thessaloniki, IDFA, BAFICI, True/False, Hong Kong, and the New York Film Festival. She is the recipient of a Guggenheim Fellowship, a Fulbright Scholarship, and grants from the Sloan Foundation and the Foundation for Contemporary Art.\n\nCallie Hernandez is an actress, writer and filmmaker. Her first film was Terrence Malick’s Song to Song followed by a decade of work as an actress. She is known for Ridley Scott's Alien: Covenant, Damien Chazelle's La La Land, A24’s Under the Silver Lake, HBO Max's The Flight Attendant, and Pete Ohs’ JETHICA. Upcoming work includes: Rachel Sennott’s Untitled Comedy Series, Albert Birney’s OBEX and James N. Kienitz Wilkins’ The Misconceived. In 2023, she founded an in-house film studio which yiel",
        "upvotes": 40,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i4102icaa9cf1.png?auto=webp&amp;s=8014786121eba690da8caeb2eac2d9c1bf0223b7"
        },
        "permalink": "/r/movies/comments/1lx8haf/hey_rmovies_were_courtney_stephens_and_callie/"
    },
    {
        "id": "1lwhf9p",
        "author": "FMarryKillAMA",
        "title": "Hi r/movies. Laura Murphy here. Director of the new comedy-thriller F*** MARRY KILL- which is now streaming everywhere and stars Lucy Hale &amp; Virginia Gardner. I've also directed GirlCode, Awkwafina is Nora From Queens, Cursed Friends. Ask me anything!",
        "content": "Hi reddit,\n\nI'm Laura Murphy, director of **F\\*\\*\\* Marry Kill**, now streaming everywhere (and recently released on Hulu). Here to answer your questions.\n\n*Here's the trailer:*\n\n[https://www.youtube.com/watch?v=9hxuNfoWNs0](https://www.youtube.com/watch?v=9hxuNfoWNs0)\n\n*Synopsis:*\n\nThrust into the dating app world by her best friends, true-crime junkie Eva Vaugh suddenly finds herself at the center of a real murder case. As new details come to light, she soon realizes that one of the three men she's dating could be the infamous Swipe Right Killer.\n\n*Cast:*\n\n* Lucy Hale\n* Virginia Gardner\n* Brooke Nevin\n\nAsk me anything! I'm back at 5 PM ET tomorrow (Friday 7/11) to answer your questions!",
        "upvotes": 32,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oy1e35fqr2cf1.png?auto=webp&amp;s=f07167761a185658e39e9db6666dd859fec93980"
        },
        "permalink": "/r/movies/comments/1lwhf9p/hi_rmovies_laura_murphy_here_director_of_the_new/"
    },
    {
        "id": "1lxxilb",
        "author": "MarvelsGrantMan136",
        "title": "Sean Astin To Run For SAG-AFTRA President",
        "content": "",
        "upvotes": 13299,
        "comments": 426,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YmrkcFw5TRizVeSRtdI1PBcPGtlKMR6LA5irFvxPW88.jpeg?auto=webp&amp;s=ddbf15755cb20d87cc88cc409a034fbd654fcb9e"
        },
        "permalink": "/r/movies/comments/1lxxilb/sean_astin_to_run_for_sagaftra_president/"
    },
    {
        "id": "1ly1lod",
        "author": "Scarcecrows",
        "title": "Watching Logan (2017)— has there ever been any other trilogy that started off awful and ended on such a high note?",
        "content": "X-Men: Origins had a different director than James Mangold granted, but hotdog water level writing and questionable FX made it borderline unwatchable. Then Mangold takes the reigns in The Wolverine, which while an improvement also suffers from a generic to downright bad third act that feels slapdash and rushed compared to the rest of the film (the director’s cut helps this somewhat). Then we get Logan, which IMO, is the best genre film aside from The Dark Knight (and Nolan’s trilogy had its own stumble with the enjoyable but flawed Rises). \n\nIs there any other trilogy that was so miles ahead of the first film? Or is Logan the only exception to this rule? \n\nEdit: I should preface, as rightly pointed out (thank you folks) that the trilogy could be defined loosely in this sense — but these were the three stand alone outings as Jackman’s Wolverine so, to that end, that was my metric for defining them as such and also because they do acknowledge events from the film. I believe they even tried to get Lieve back as Sabretooth and modeled X-24 after his look from Origins. So to that end, I don’t discount it. ",
        "upvotes": 416,
        "comments": 253,
        "media": null,
        "permalink": "/r/movies/comments/1ly1lod/watching_logan_2017_has_there_ever_been_any_other/"
    },
    {
        "id": "1lxx0p8",
        "author": "JonasKahnwald11",
        "title": "First images of Nicolas Cage, J. K. Simmons and Giancarlo Esposito from 'The Prince' - A politically-charged drama exploring the life of a troubled son within a powerful American dynasty.",
        "content": "",
        "upvotes": 786,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ule0u4kt4fcf1.jpeg?auto=webp&amp;s=5b1e46fdc8bc53f1c946905b0883b1b83506d909"
        },
        "permalink": "/r/movies/comments/1lxx0p8/first_images_of_nicolas_cage_j_k_simmons_and/"
    },
    {
        "id": "1lxk6jj",
        "author": "MarvelsGrantMan136",
        "title": "Bryan Cranston Addresses ‘Lone Wolf’ Troubles, Vows Not To Film Or Promote Movie Until Every Cast And Crew Member Is Paid Back In Full",
        "content": "",
        "upvotes": 7721,
        "comments": 221,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n9XgMhGqDDl7Fp6XSMyvs-OeHqwiYUAGhak_iZm92CI.jpeg?auto=webp&amp;s=a0fbc8223daa852206e06336e4cb5cfc7f37c4af"
        },
        "permalink": "/r/movies/comments/1lxk6jj/bryan_cranston_addresses_lone_wolf_troubles_vows/"
    },
    {
        "id": "1ly0uph",
        "author": "MaxRichter_Enjoyer",
        "title": "The SNL skit that got Beck Bennett the gig in the recent Superman movie.",
        "content": "",
        "upvotes": 377,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7Fh_9tg0BgugsN5U4D7E2l4x5nuf4v4qOKzsTIr3nAo.jpeg?auto=webp&amp;s=9c11ddeb2a2da3a15e12a0328ea1f0a1d9bcd45b"
        },
        "permalink": "/r/movies/comments/1ly0uph/the_snl_skit_that_got_beck_bennett_the_gig_in_the/"
    },
    {
        "id": "1lx94qe",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Naked Gun' Starring Liam Neeson",
        "content": "",
        "upvotes": 32884,
        "comments": 1189,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ucgxqrj4f9cf1.jpeg?auto=webp&amp;s=e70feeea4ff4c5da7daca9bc2fa77edadc14e29e"
        },
        "permalink": "/r/movies/comments/1lx94qe/new_poster_for_the_naked_gun_starring_liam_neeson/"
    },
    {
        "id": "1lxnwk9",
        "author": "ExistingMarzipan2422",
        "title": "What is the most “bro” movie of all time?",
        "content": "I am going on a bachelor party soon (something chill like cabin in the woods kind of vibe) and the group wants to have a movie night. Someone suggested ‘Gladiator’ stating “that’s just a bro movie”; this inspired me to ask the question….\n\nWhat is the most “bro” movie of all time? \n\nFor me, I was thinking maybe Saving Private Ryan but would love to hear what the community thinks.\n\nCheers!\n\n",
        "upvotes": 1017,
        "comments": 1952,
        "media": null,
        "permalink": "/r/movies/comments/1lxnwk9/what_is_the_most_bro_movie_of_all_time/"
    },
    {
        "id": "1lxxrjc",
        "author": "Bojanglez789",
        "title": "Marlon Brando in Apocalypse Now",
        "content": "I recently saw Hearts of Darkness: A filmmakers apocalypse, which was incredible (and also quite really crazy).\n\nFrom what is shown &amp; how I interpreted that, it seems like he was only there for a paycheck. He was paid $1 million per week, refused to accept shooting schedule changes, promised to be in shape and then clearly wasn't, didn't learn his lines, hadn't read Heart of Darkness (obviously not required but it seemed like he had no clue on set based on the footage). I've also read other things (not sure if they are true or not so won't bother sharing)\n\nI know this is a divisive topic and I still think Brando was very impressive in Apocalypse now. but why was he was so difficult to work with?!? I have seen lots of talk online but never an explanation for this",
        "upvotes": 168,
        "comments": 98,
        "media": null,
        "permalink": "/r/movies/comments/1lxxrjc/marlon_brando_in_apocalypse_now/"
    },
    {
        "id": "1ly12t6",
        "author": "keepfighting90",
        "title": "Before Sunset might be the most perfect sequel ever, and just an incredible movie overall",
        "content": "I decided to jump into Richard Linklater's well-regarded Before trilogy as I recently finished the Normal People series and have been in the mood for melancholy romantic stories. Before Sunrise was really, really good - charming, romantic and captured that exuberance of doe-eyed youthful passion so well.\n\nBut Before Sunset, man, it's just on another level. Maybe it's because I'm the same age as the characters now, in my 30s and married and with some life experience but it felt so resonant. Jesse and Celine have grown and changed over the past decade - they're more jaded and cynical, and not the hopeless romantics they used to be. But this growth is what lends so much more depth and complexity in both personalities and the current state of their relationship, and how much that one night steered the course of their lives in the ensuing years.\n\nAs with Sunrise, the dialogue is really the star here and it's even better than before. Whereas in Sunrise, Jesse and Celine's conversations leaned more towards more fun and youthful and often idealistic, sometimes pseudo-intellectual (makes sense given their age), here they're tinged with a melancholy and occasional bitterness that can only be brought on by experiencing more of life. In Vienna, Jesse and Celine talked about art and love and literature and all these grand, human-condition concepts. Here, they talk about global warming, crime and broken romances. It's actually crazy just how well the script captures just how I've myself been feeling in my 30s.\n\nEthan Hawke and Julie Delpy's chemistry is as amazing as ever, and really sell the whole concept and premise.\n\nAnd that ending? Absolutely perfect. Jesse knows he's going to stay. He's probably known it all along.\n\nCan't wait to finish off the trilogy with Midnight",
        "upvotes": 81,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1ly12t6/before_sunset_might_be_the_most_perfect_sequel/"
    },
    {
        "id": "1ly00mg",
        "author": "retired-tweeter",
        "title": "What dialogue in a movie that always bothered you?",
        "content": "I’m sure “don’t laugh, this ain’t reality TV” will get a lot of replies. That line is unintentionally hilarious. I may have laughed more if someone said that in real life.\n\nI am legend when Will Smith ask Anna if she knew who Bob Marley was and she said “Damian”? \n\nAlso that cheese wiz line in Endgame. Just kinda killed the entire vibe of the seriousness of that scene.",
        "upvotes": 76,
        "comments": 242,
        "media": null,
        "permalink": "/r/movies/comments/1ly00mg/what_dialogue_in_a_movie_that_always_bothered_you/"
    },
    {
        "id": "1lxcgsm",
        "author": "BunyipPouch",
        "title": "Leonardo DiCaprio’s ‘We Are Guardians’ Documentary Raises $1 Million for Rainforest Preservation Ahead of Theatrical Run - The films is touring nationally and spotlights efforts by Indigenous leaders to protect the Brazilian Amazon amid invasion and deforestation.",
        "content": "",
        "upvotes": 2158,
        "comments": 363,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ayrBSbiKAo7_yRufXmofGeeuTqzztYgt6GKdk1x1Xoc.jpeg?auto=webp&amp;s=e908adec79eae5992239dbba02c54759fb23ac55"
        },
        "permalink": "/r/movies/comments/1lxcgsm/leonardo_dicaprios_we_are_guardians_documentary/"
    },
    {
        "id": "1ly10io",
        "author": "Neo2199",
        "title": "50 Years Later, Fascist Satire ‘A Boy and His Dog’ Goes Great with Deep Panic — and Summer Malaise",
        "content": "",
        "upvotes": 46,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V8uAmu-xAA66JrPQVR9mScTjScq4cJ5eAlYtNvoEemE.jpeg?auto=webp&amp;s=4ba320663891689bb900b257ee46083de602c287"
        },
        "permalink": "/r/movies/comments/1ly10io/50_years_later_fascist_satire_a_boy_and_his_dog/"
    },
    {
        "id": "1lxk0aw",
        "author": "CresidentBob",
        "title": "What random joke in a movie makes you crack up every single time you watch it?",
        "content": "For me it’s this scene in Blazing Saddles\n\nhttps://youtu.be/SkKVLGO9Wjc?si=_GUTFCVsLZD8TwK3\n\nIt’s so damn funny. The whole town is getting destroyed and all this guy is worried about is his suit getting muddy. The more I think about it the funnier it is. Classic Mel Brooks joke but for some reason I laugh so hard every time. ",
        "upvotes": 620,
        "comments": 1343,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KyNJtRdufEHpXmwHUqzUmac2EyQOs2ax-qUn--8gptY.jpeg?auto=webp&amp;s=706f5944018a6923ab9a58d9ab595a8b9fe021cc"
        },
        "permalink": "/r/movies/comments/1lxk0aw/what_random_joke_in_a_movie_makes_you_crack_up/"
    },
    {
        "id": "1lxkdj5",
        "author": "MiserableSnow",
        "title": "California’s Expanded Tax Credit Now Covers Animation",
        "content": "",
        "upvotes": 441,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/puAm1GASoXbXAO1tHU6M43-VDwgTw1prLNOXwgegQao.jpeg?auto=webp&amp;s=19dc9195a23a38af31f65f25880d91f7fdee688f"
        },
        "permalink": "/r/movies/comments/1lxkdj5/californias_expanded_tax_credit_now_covers/"
    },
    {
        "id": "1lxhuin",
        "author": "MarvelsGrantMan136",
        "title": "Legendary Is Mulling Acquisition of Lionsgate Studios",
        "content": "",
        "upvotes": 587,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8fZoEDywEHURXmsEsEG8ngfqGijqtkolKQIC1Y4rP00.jpeg?auto=webp&amp;s=1cc82c4c60454c22dc813bcadb6d223cce0ff14d"
        },
        "permalink": "/r/movies/comments/1lxhuin/legendary_is_mulling_acquisition_of_lionsgate/"
    },
    {
        "id": "1ly306y",
        "author": "EvadingDoom",
        "title": "Trope: Boss asking if anyone else knows about the crooked cops or spies",
        "content": "A trope that I encountered the other night that I realized I really hate: Main character (spy or cop) discovers someone in their org is crooked. They meet discreetly with someone who's in charge (who they think is not crooked) and tell them what they found. And that person in charge says \"Does anyone else know about this?\"  It drives me nuts. It's a question that translates directly to \"Do I need to kill anyone besides you to keep this from getting out?\" Their motive is extremely obvious, especially if it's the first thing they ask. And the MC always says \"Nope! Just me!\" ",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1ly306y/trope_boss_asking_if_anyone_else_knows_about_the/"
    },
    {
        "id": "1lxvn6t",
        "author": "Entronico",
        "title": "How Many 80s Movie Have This Plot?",
        "content": "An  evil corporate boss is talking over the pizza place/arcade/car wash (wherever the kids hang out) and a ragtag bunch of kids rally to save the beloved hangout.\n\nThey do this in various ways. A breakdancing competition; bikini car wash, skateboarding demo, bake sale or throwing a party.\n\nFor some reason this was an extremely common plot line in the 80s.",
        "upvotes": 23,
        "comments": 105,
        "media": null,
        "permalink": "/r/movies/comments/1lxvn6t/how_many_80s_movie_have_this_plot/"
    },
    {
        "id": "1lx753c",
        "author": "Conscious-Quarter423",
        "title": "Mr. Landau shares some profound insights in this interview with The Actors Studio.",
        "content": "",
        "upvotes": 654,
        "comments": 43,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ifgorsx509cf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1lx753c/mr_landau_shares_some_profound_insights_in_this/"
    },
    {
        "id": "1lxeq89",
        "author": "dvorakoa",
        "title": "What are some films where you can tell everyone had fun on set?",
        "content": "Just watched Walk Hard: The Dewey Cox Story and I could tell everyone enjoyed themselves filming this movie. John C. Reilly even said he learned to play guitar and wrote many of the songs for the film out of pure desire to create. You don't get that kind of input if someone doesn't care and is just there for a paycheck.\n\nSo what are some other examples of movies where you can FEEL everyone from the crew to the actors *cared* and that passion is palpable on screen. Not just comedy/light hearted movies either. When watching the Revenant I was like 'you don't get up at 5am in freezing tempratures for months just for the hell of it. These guys must truly LOVE what they do'.",
        "upvotes": 231,
        "comments": 316,
        "media": null,
        "permalink": "/r/movies/comments/1lxeq89/what_are_some_films_where_you_can_tell_everyone/"
    },
    {
        "id": "1lxcbtg",
        "author": "NoCulture3505",
        "title": "Comic-Con 2025 Schedule: ‘Star Trek,’ the Toxic Avenger and George Lucas’ First-Ever Appearance",
        "content": "",
        "upvotes": 307,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wHxwMOo-9DXDagU-j7fTX_kwmV6r0cDUtE4er9_VtWY.png?auto=webp&amp;s=86c77c4615e023474a89cf42fa37f645beace4c2"
        },
        "permalink": "/r/movies/comments/1lxcbtg/comiccon_2025_schedule_star_trek_the_toxic/"
    },
    {
        "id": "1ly11g0",
        "author": "side0797",
        "title": "Movies with Extended versions",
        "content": "Can y'all please share movies with Extended versions\nbecause going through many films I've noticed that some films have directors cut or extended versions which are supposed to be better than the actual version \nFor example Apocalypse now.\n\nI am not sure if this is a question which is asked very frequently on this subreddit but since this is one of the most popular subreddits around thought I'd get a massive list and would really appreciate it\nCheers. \n",
        "upvotes": 5,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1ly11g0/movies_with_extended_versions/"
    },
    {
        "id": "1lx4e8d",
        "author": "Fun_Molasses5215",
        "title": "Drag Race stars reveal all their A Star Is Born scenes were originally completely cut before Lady Gaga personally intervened",
        "content": "",
        "upvotes": 716,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p7lMK2JB68JX8YBTKc0hHaupA71BrsfvAA0s0mYqlBQ.png?auto=webp&amp;s=93af44f7e52fe7fc52ee9c904b35757862d69d65"
        },
        "permalink": "/r/movies/comments/1lx4e8d/drag_race_stars_reveal_all_their_a_star_is_born/"
    },
    {
        "id": "1ly01yu",
        "author": "Okbruh88",
        "title": "Question for filmmakers and cinephiles: how important is resemblance in casting younger versions of a character?",
        "content": "Curious to hear folks’ thoughts on this. If a young actor is cast to play the earlier version of an older actor (say in a coming-of-age story) do you personally feel that they need to physically resemble each other for it to feel believable?\n\nOr are things like energy, voice, and performance enough for you to buy into the transition?",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1ly01yu/question_for_filmmakers_and_cinephiles_how/"
    },
    {
        "id": "1lxq70a",
        "author": "Galaga68",
        "title": "D.C. Cab (1983) ORIGINAL TRAILER",
        "content": "",
        "upvotes": 33,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B5CR7JX6JyUGswhIVNHYpw70lhT8s1KLNGSkJwq0orc.jpeg?auto=webp&amp;s=bc3254949a9922e98787ab24d8ce819039c924d6"
        },
        "permalink": "/r/movies/comments/1lxq70a/dc_cab_1983_original_trailer/"
    },
    {
        "id": "1lxxhif",
        "author": "InformalArrival9841",
        "title": "National Lampoon's Vacation!",
        "content": "WHO LOVES NATIONAL LAMPOON'S VACATION?? Ya  know, in the past, my favorite movie use to be \"HOLES,\" Where the kid named Stanley Yelnats gets sent to Camp Green Lake for stealing a pair of sneakers. THAT use to be my favorite movie! NOW It's \"National Lampoon's Vacation!!!\" It all started with my research on the old vibrating beds. As you know, in this movie, Clark puts a quarter into the coin box on the bed, and the bed goes rogue, vibrating like crazy, and Rusty and Audrey come into the room and they're like, \"We thought you were fighting.\" And it was the bed. \n\n  \n   Here's the thing. That's the whole entire reason I BOUGHT that movie last May, but I've fallen in love with the whole dang movie. I watch it EVERY SINGLE DAY!! Has anyone read the little story behind this movie? The story is called \"Vacation 58,\" and IT IS HILARIOUS!! If you read it as many times as I have, you'll get what I'm talking about!",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1lxxhif/national_lampoons_vacation/"
    },
    {
        "id": "1lwutny",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Superman (2025) [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/hs20GGGIZ6wg)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/hs20GGGIZ6wg)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n---\n\n**Summary**\nSuperman (David Corenswet) returns as a fully formed hero, dropping into an international crisis where his actions—like stopping a dangerous global conflict—spark both admiration and controversy. As he confronts Lex Luthor’s schemes and defends democratic values, Lois Lane (Rachel Brosnahan) investigates deeper political tensions. The film also features cameos from Guy Gardner (Nathan Fillion), Hawkgirl (Isabela Merced), Mister Terrific (Edi Gathegi), and Metamorpho (Anthony Carrigan), all leading up to a broader DC Universe introduction.\n\n**Director**\nJames Gunn\n\n**Writer**\nJames Gunn\n\n**Cast**\n\n* David Corenswet as Clark Kent / Superman\n* Rachel Brosnahan as Lois Lane\n* Nicholas Hoult as Lex Luthor\n* Nathan Fillion as Guy Gardner / Green Lantern\n* Isabela Merced as Kendra Saunders / Hawkgirl\n* Edi Gathegi as Michael Holt / Mister Terrific\n* Anthony Carrigan as Rex Mason / Metamorpho\n* Skyler Gisondo as Jimmy Olsen\n* Sara Sampaio as Eve Teschmacher\n* María Gabriela de Faría as Angela Spica / The Engineer\n* Wendell Pierce as Perry White\n* Alan Tudyk, Pruitt Taylor Vince, Neva Howell, and others in supporting roles\n\n**Rotten Tomatoes**: [83%](https://www.rottentomatoes.com/m/superman_2025)\n\n**Metacritic**: [68](https://www.metacritic.com/movie/superman-2025/)\n\n**VOD**\nIn theaters July 11, 2025\n\n**Trailer**\n[Watch here](https://www.youtube.com/watch?v=uhUht6vAsMY)\n\n---",
        "upvotes": 2952,
        "comments": 5660,
        "media": null,
        "permalink": "/r/movies/comments/1lwutny/official_discussion_superman_2025_spoilers/"
    },
    {
        "id": "1lxr7fx",
        "author": "Le_Homo_1999",
        "title": "Requiem for a Dream",
        "content": "I just watched this darn movie for the first time… My god is this depressing🥺. One storyline more dramatic than another. I thought Sara‘s storyline was the saddest by far. Imo this movie shows very well how the world (could) look like inside an addicted person. Utterly heartbraking if u have to imagine what those people have to go through 💔",
        "upvotes": 16,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1lxr7fx/requiem_for_a_dream/"
    },
    {
        "id": "1lxy1pl",
        "author": "Timely_Light_3588",
        "title": "70s College romps",
        "content": "I'm looking for 70s movies that are basically comedy/drama of high school college. Sleaze/nudity is fine. Not films like Cooley High or such, ones like the following:\n\nRockNRoll High school  \nSwinging Cheerleaders  \nSummer School Teachers  \nMalibu High  \nThe Teacher\n\nAlso, if applicable, not too high on the violence.",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1lxy1pl/70s_college_romps/"
    },
    {
        "id": "1lxu1q4",
        "author": "BuffaloBillaa",
        "title": "Give your favourites homes in movies",
        "content": "What are some of your favorite houses that you want to live in which are portrayed in movies?\n\nSome of my favorites are:\n\nBurrow in Harry Potter ( there is that cozy vibe in that house which makes you warm)\n\nCaleb’s house in Ex-Machina ( just the scenery on which the house is built is so gorgeous)\n\nBag End ( As living in Shire is my all time dream)\n\n\n",
        "upvotes": 8,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1lxu1q4/give_your_favourites_homes_in_movies/"
    },
    {
        "id": "1lwezvl",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Ethan Coen's 'Honey Don't' - The film follows a lesbian private detective who investigates a questionable church and its leader.",
        "content": "",
        "upvotes": 14651,
        "comments": 1005,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q46m3mrja2cf1.jpeg?auto=webp&amp;s=fcbaafdb1b6caabc30b3a6aef78e67d84e7a500e"
        },
        "permalink": "/r/movies/comments/1lwezvl/official_poster_for_ethan_coens_honey_dont_the/"
    }
]