[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 678,
        "comments": 5046,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1npazk0",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix is reportedly fast tracking their 'DEMON SLAYER' live-action adaptation after the massive success of the 'Demon Slayer: Infinity Castle' movie",
        "content": "",
        "upvotes": 68,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1npazk0/netflix_is_reportedly_fast_tracking_their_demon/"
    },
    {
        "id": "1noosxn",
        "author": "borderlineactivity",
        "title": "DARK",
        "content": "I can’t believe I slept in this absolute piece of art for SO long. Best show I have seen in a loooong time. If you haven’t watched it yet; you are definitely missing out! \n\n\n",
        "upvotes": 319,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1noosxn/dark/"
    },
    {
        "id": "1npece3",
        "author": "orionstarseed",
        "title": "What are some wild thriller series like Untamed, Fringe, Blacklist, Luther, True Detective and Hannibal?",
        "content": "Looking for some good suspenseful series like the ones I listed in the title. Grotesquerie was pretty good as well. I want too watch some more really dark thriller series with suspense, creative kills, fast paced and not slow burn, weird puzzles that the police have too folow in order too catch the killer.  Untamed, Fringe, Blacklist, Luther, True Detective and Hannibal all had perfect pilot episodes in my opinion that got me invested knto watching the shows fully. If the pilot, second or third episode doesn't hook me i'm out. Not going too waste my time waching a slow burn series with mostly talking and literally nothing happening for the whole episode(s)",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1npece3/what_are_some_wild_thriller_series_like_untamed/"
    },
    {
        "id": "1noqv2x",
        "author": "Sea-Procedure-7988",
        "title": "True crime psychological thriller",
        "content": "Hello, I’m looking for a tv series to get into, something that will hook me and keep me wanting more. I enjoy shows where it’s not obvious who committed the crime, etc. also please nothing tooo old or outdated :)\n\nHere’s a list of some of my favorite tv series: the sinner \nPresumed innocent \nUnbelievable \nAnimal kingdom \nOzark \nBlood lines \nHunting wives \nThe keeper \nKaren read trial \nMind hunter \nHeist \nThe program \nHe’ll camp \nMr robot \nUntamed \nBehind her eyes \nDexter \nBreaking bad \nYour honor \nSeven seconds \nThe infiltrator \nThe night of \nAmerican nightmare \nAccused \nWorst roommate ever \nLincoln lawyer \nYou \nMaid \nTell me lies \nPainkiller \nMaking a murder \nGinny &amp; Georgia \nSurviving black hawk down",
        "upvotes": 60,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1noqv2x/true_crime_psychological_thriller/"
    },
    {
        "id": "1npgqfd",
        "author": "Mary_Ellen_Katz",
        "title": "Netflix lowers movie/show quality while playing games in other monitor.",
        "content": "I have a PC with two PC's, and find when I'm playing a movie (netflix) on one monitor with a game on the other, Netflix will force the quality to downwards of 480p. I have a very good computer with fiber internet. It's not a bandwidth issue on my end, and suspect Netflix is giving me less quality because it recognizes I am not focused on it primarily. Other platforms do this as well.\n\nI want to know how to *force* Netflix to maintain its quality even while I am playing a game, tabbed onto a different tab, or even if I have the window minimized. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npgqfd/netflix_lowers_movieshow_quality_while_playing/"
    },
    {
        "id": "1npg779",
        "author": "Affectionate_Bee_1",
        "title": "Do you have recommendations for comedy shows that aren’t too silly/dumb?",
        "content": "Shows I loved:\n\t•\tModern Family\n\t•\tYoung Sheldon\n\t•\tSuperstore\n\t•\tResident Alien\n\t•\tGhosts\n\t•\tHaunted Hotel\n\nThese shows are light-hearted, about family, friends, and bonding in general, and they have a heartwarming story.\n\nShows I didn’t like:\n\t•\tShameless\n\t•\tBrooklyn 99\n\nThey were too bold, vulgar, and had a kind of trailer-park humor that I didn’t enjoy.\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1npg779/do_you_have_recommendations_for_comedy_shows_that/"
    },
    {
        "id": "1npel6j",
        "author": "South-Tone-1370",
        "title": "Uglies a Netflix movie",
        "content": "I want to talk about this movie because I have read the book many years ago and I rooted for its live action. But, I was sad about how they used characters that are already beautiful, they just made them haggard, because in the book they were very asymmetrical, and you can clearly imagine the difference between being ugly and pretty, in the movie they just gave the characters make up and wigs as an after surgery outcome. There was a highlight with the eyes being golden, but the book wasn't about that, the book emphasized the height, the symmetry, and how everybody(Pretties) looked the same. Also the plot twist Shay was her original best friend from the very beginning, not Peris. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1npel6j/uglies_a_netflix_movie/"
    },
    {
        "id": "1npebin",
        "author": "EquivalentCivilian",
        "title": "No HDR on Windows 11 App",
        "content": "I've downloaded the HEVC extension on microsoft store, and enabled HDR even if HDR is off in settings, but the videos still won't play in HDR. How do I fix this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npebin/no_hdr_on_windows_11_app/"
    },
    {
        "id": "1np0yk9",
        "author": "bruhwhatshappenin",
        "title": "Ed Gein",
        "content": "After watching the full trailer that was released I think this is going to be much harder to watch than the Dahmer series 😳 I watch a lot of true crime shows and can stomach a lot but Dahmer literally gave me anxiety and it took me WEEEKS to finish. With any other series I’m a binge watcher and finish it relatively quickly. Just the trailer alone was hard to get through. Anyone else feel that it will be “better” for lack of a better term than Dahmer? Trailer below for anyone who hasn’t seen yet \n\nhttps://m.youtube.com/watch?v=EDBmpfbnLGk&amp;pp=ygUPZWQgZ2VpbiBuZXRmbGl4",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1np0yk9/ed_gein/"
    },
    {
        "id": "1npdf0r",
        "author": "ElliotWilhelm",
        "title": "Help with these beer tap handles",
        "content": "I need some help, identifying which shows these beer handles belong to. They are all Netflix show, but some of them I can’t nail down. Specifically the 1st two handles. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1npdf0r/help_with_these_beer_tap_handles/"
    },
    {
        "id": "1npcu0x",
        "author": "RandomTurkey247",
        "title": "Jason Bateman in Black Rabbit",
        "content": "When he first comes on the screen, I was like \"OMG, he's the Duderino!\"\n\nRon Howard's voice: \"he would quickly learn Vince was, in fact, not the Duderino.\"",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1npcu0x/jason_bateman_in_black_rabbit/"
    },
    {
        "id": "1npcmdc",
        "author": "nowthatssuspish",
        "title": "Good time travel movies/shows?!",
        "content": "I was reading a post on here asking for recs for time travel movies, but most of the responses are over a decade old with so must watch shows that don't exist on Netflix anymore. \n\nJust finished the Lazarus project, and I want some other shows to watch in this genre on Netflix! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1npcmdc/good_time_travel_moviesshows/"
    },
    {
        "id": "1npca8x",
        "author": "nowthatssuspish",
        "title": "How can we as fans revive the Lazarus Project for season 3?",
        "content": "Not just the fans want it brought back, the actors do too. How do we as fans push for this and speak up about wanting a 3rd and final season? We as viewers hold the power, but how do we use it? \n\nEvery episode had me wanting more. \nWhat happened to Bryson when he arrived in 2024? What happened to kid Bryson? Which Bryson made it back to 2025? Are there three Bryson's now? What happened to wes? What happened to Becky(s)? Does she go find her dad that made it through the last episode as his 2012 version? Does she raise herself? Did Archie survive the crash and stay stuck in 2012 with her lover? What happened to 2012 shiv and ross? What happened to 2024 shiv? Did they stay with the Lazarus Project and wait for George to come back? Why was the only person there Sarah? Does George kill her then? There were cups of water on desks that insinuates the project is still running, with multiple agents running it. \n\nWe deserve to know. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1npca8x/how_can_we_as_fans_revive_the_lazarus_project_for/"
    },
    {
        "id": "1notdw9",
        "author": "SerialSeriesQueen",
        "title": "Black Rabbit and the restaurant business",
        "content": "Black Rabbit did a phenomenal job at portraying life in a big city restaurant, especially its seedy underbelly. I grew up in Philadelphia with a step dad who owned multiple successful restaurants in the city and Jake reminded me so much of him as he was in the early 2000s. Charming, charismatic, ambitious but underneath, stressed out, under pressure, and constantly worrying about money trying to keep up appearances. Even the staff brought back early memories of my life as a hostess/bartender at some of those restaurants/nightclubs. Very close, very tight knit, but riddled with drug use and drama, and overlooking major red flags. I really appreciated the effort they went through in giving the viewer a realistic representation of that world. ",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1notdw9/black_rabbit_and_the_restaurant_business/"
    },
    {
        "id": "1npaepi",
        "author": "startupgirl1234",
        "title": "Introverts of Reddit: what’s your comfort movie that you never got to talk about?",
        "content": "So, not sure how many ppl know abt this one but there is a movie on Netflix, it's called Three of Us, and i love the subtle storyline it has and how the songs play a part in it. I would love some more recommendations and pls do tell why you love it. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npaepi/introverts_of_reddit_whats_your_comfort_movie/"
    },
    {
        "id": "1npadt0",
        "author": "pokebabe2015",
        "title": "She's Gotta Have It",
        "content": "Okay so I watched these 2 recently and I just need to chat about them 😂  (this sub won't let me post about UnKN so)\n\n\n\nShe's Gotta Have It.\nSo I watched it all, but I found Nola (the main character) really unlikable. I don't have masses to discuss, but yeah, I read some reviews on IMDB afterwards and was pleased to see similar thoughts. \nShe seemed incredibly self absorbed and self righteous. And yeah, she was a lousy friend, lover and partner. I was 100% with Opal when they argued and split. I don't have children, I don't want them either, but there's no way in hell I'd take a child to get their ears pierced, against the parents wishes, and then not tell them. \nShe abused Mars' love for her and took advantage of him. She claimed she didn't want to be like anyone else but \"the struggling artist living in NYC\" is like most of the population there I assume, equally so overdone and cliche 😂\nI also think she was very privileged in comparison to what millions of other women go through. And she was taking advantage of her God mothers generosity. She was very fortunate, and still kept acting like a victim.\nThe actress herself is stunning though. What a beautiful women - her eyes are gorgeous.\nI don't know, I have very mixed feelings on the whole show. I wouldn't recommend it personally. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1npadt0/shes_gotta_have_it/"
    },
    {
        "id": "1np9su9",
        "author": "Content_Programmer34",
        "title": "Errors keep changing on smart TV",
        "content": "Has someone encountered this and how did you solve it? Netflix isn't working on my smart TV (working fine on my phone) Here's what happens:\n1. The circular loading icon keeps showing for a long while \n2. Then it shows an error which goes: \"Netflix has encountered an error. Retrying in 56 seconds. Code: NW-2-5\"\n3. Then when it retries the code changes to another one. So far I've had NW-8-18 and TVQ-ST-145\"\n\nI've tried every fix on the internet:\n- restarted router (with a good rest in between)\n- restarted TV \n- tried hotspot internet \n- removed netflix cache\n- uninstalled and reinstalled the app (it wasn't letting me uninstall so I uninstalled and reinstalled the updates)\n- removed netflix data\n- signed out to sign in again but it gave me an error mid sign out \n\nI'm now going to give it a long rest and come back tomorrow to see whether it's any different because I've tried everything short of factory resetting my TV at this point.\n\nPlease if anyone has any idea on how to solve this, do share. The rest of the internet seems to be clueless \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1np9su9/errors_keep_changing_on_smart_tv/"
    },
    {
        "id": "1np8tnn",
        "author": "CuriousIndianMe",
        "title": "No Of views on OTT",
        "content": "How to know number of views of a show or movie on any OTT platform, especially netflix? Netflix released the views only once. They publicly announced they would do it every year, but never released after that.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1np8tnn/no_of_views_on_ott/"
    },
    {
        "id": "1np7sss",
        "author": "Caolan114",
        "title": "FEATURE REQUEST: Playlists",
        "content": "You know how YouTube has a \"Watch Later\" or playlists where you add videos and they play automatically\n\nThe thing that bothers me with Netflix Is watching the same thing all night and If I want a change I have to scroll and find something\n\nImagine having your own little TV channel where you get your phone and say \"3 episodes of iCarly followed by RAW vault then the addams family movie and wednesday\"\n\nand you could set It with your phone just like youtube to give yourself some variety without scrolling",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1np7sss/feature_request_playlists/"
    },
    {
        "id": "1noe0i1",
        "author": "GalacticGazelle49",
        "title": "Coded Bias on Netflix made me rethink how much we can really trust AI with anything",
        "content": "Watched Coded Bias recently and it raised some serious concerns. The documentary dives into how facial recognition and AI systems aren’t actually neutral at all. Because they’re trained on flawed datasets, they end up making mistakes that disproportionately affect women and people of color.\n\nThe unsettling part is how widely this technology is already being deployed in policing, workplaces, schools, even housing, often without the public really knowing or having much of a say. If these systems are already showing bias, what happens when they become a permanent part of everyday life? AI is often framed as being smarter and more objective than humans, but if it’s just reinforcing the same prejudices at scale, is it really progress? At what point do we step back and question whether some decisions, especially around law enforcement and surveillance, should even be left to algorithms at all, how do you trust it with your data? I personally don't let my info surface and try and remove it online, mainly using cloaked for overall security and temp mails and phone numbers. After watching the movie I even read that AI chats have a warning to not feed it real data (idk if that's true? so that's what sparked the use of those).\n\nFor  anyone who’s seen it or works with AI, do you think these are just early flaws that can be fixed with better design and regulation, or are we headed toward a future where algorithms quietly shape more of our lives than we realize?",
        "upvotes": 61,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1noe0i1/coded_bias_on_netflix_made_me_rethink_how_much_we/"
    },
    {
        "id": "1npcu3i",
        "author": "Powerful-Space-4704",
        "title": "How to hide what you watch on Netflix",
        "content": "I use a profile on a family account. Lately I've been wanted to watch a show that would be emabarrassing if my other family members saw it on my profile. How do I make it stay hidden from my history? I watch on mobile (Android) btw. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1npcu3i/how_to_hide_what_you_watch_on_netflix/"
    },
    {
        "id": "1np98wh",
        "author": "ahjummar",
        "title": "Netflix 4k Looks Bad Than HD in my 4K Smart TV",
        "content": "So I subscribed to Netflix's highest tier, which includes 4K. I did this so that I can test my new 4K TV.\n\nHowever, I noticed that all shows that have 4K in them are really worse than those that are just available in HD.\n\nWhat's going on?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1np98wh/netflix_4k_looks_bad_than_hd_in_my_4k_smart_tv/"
    },
    {
        "id": "1notcp3",
        "author": "RockStars007",
        "title": "Jude Law...Jake and Rory",
        "content": "  \nHe brilliantly plays roles that start like a normal dude, slightly off but not completely damaged beyond imagination and you can't put your finger on it exactly. And then he disintegrates into an empty shell with zero substance.\n\nJake reminded me of Rory in The Nest. Rory is able to get people to think it will work out, and as an observer, you think there is no way this is going to work out.\n\nReally great acting.",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1notcp3/jude_lawjake_and_rory/"
    },
    {
        "id": "1np4kjt",
        "author": "Ok-Stranger-1316",
        "title": "True crime doc",
        "content": "Could you recommend a true crime documentary that isn’t very well-known and doesn’t often appear in the usual selections? Maybe serial killers or something like that. Thank you.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1np4kjt/true_crime_doc/"
    },
    {
        "id": "1np7w9l",
        "author": "GreenIntroduction486",
        "title": "Jakieś animacje komputerowe lub w stylu anime z gatunku Horror/Sf?",
        "content": "Witam po obejrzeniu ostatnio mojego odkrycia jakim jest seria na Netflixie - \"Miłość,śmierć i roboty\", szukam czegoś w podobnym stylu jakiś \"chorych\" seriali w postaci takich animacji lub też animacji komputerowej. Potrzebuję czegoś o zombi, obcych czy innych potworach lub zjawach. Może ktoś siedzi w temacie i jest w stanie coś polecić choćby z napisami. Nie musi być na Netflix.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1np7w9l/jakieś_animacje_komputerowe_lub_w_stylu_anime_z/"
    },
    {
        "id": "1np3bpn",
        "author": "Old_Wheel_6669",
        "title": "My First Time Watching Kingdom in 2025… Cheering for Ashin Like Crazy",
        "content": "I just watched the movie—probably late, but wow, that was fantastic. I went ballistic, rooting for complete genocide, and cheered like a maniac for Ashin all throughout her revenge.\n\nFYI: Those people weren’t innocent. Some of the men had been raping her since she was young, while others completely turned a blind eye to what was happening.\n\nSeeing her kneel and beg them to avenge her family, only to discover that they were the very ones who caused her family’s massacre, was brutal. And learning that her father had been tortured for years, with his limbs cut off, was even more heartbreaking.\n\nWhy is the life of Joseon’s people considered more important than her village? They were loyal to Joseon, yet their loyalty was repaid with betrayal. The injustice of it all made my blood boil.\n\nI completely understand why she did what she did. Honestly, I would lose my mind too if it had happened to me.\n\nI’m not usually a fan of series, but I ended up binge-watching Kingdom Season 1 and 2 because of this. The story, the suspense, the raw emotion—it’s all too gripping to ignore.\n\nAnyway, I’m still waiting for her to kill that bastard of a commander.\n\nSo… where is Season 3? I need answers!\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1np3bpn/my_first_time_watching_kingdom_in_2025_cheering/"
    },
    {
        "id": "1norp5o",
        "author": "moon-1992",
        "title": "Similar shows to Haunted hotel?",
        "content": "Out of work tiredness  I started haunted hotel today because I just needed something to relax and I just can’t stop watching it. Oh my god I love it, especially Abbadon is my favorite. Never watched Rick and Morty, does it have the same vibe or is it weirder? Do you know similar show with similar humor? It doesn’t matter if it’s animated or not.  ",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1norp5o/similar_shows_to_haunted_hotel/"
    },
    {
        "id": "1np65j1",
        "author": "SmartStar65",
        "title": "Netflix Adds Three Stars to 'Bad Day' - Is This the Comedy We've Been Waiting For?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1np65j1/netflix_adds_three_stars_to_bad_day_is_this_the/"
    },
    {
        "id": "1np1vlz",
        "author": "BeeCandid5899",
        "title": "Question About The Residence Ending (SPOILERS!)",
        "content": "When Cupp testifies they say in exchange for her coming to the closed meeting she has secured immunity for one individual. Am I remembering it incorrectly or did they not name the individual or why they'd need immunity? Someone pls help. Thx!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1np1vlz/question_about_the_residence_ending_spoilers/"
    },
    {
        "id": "1noinq8",
        "author": "Infinite_Pool_4918",
        "title": "Black rabbit",
        "content": "This show kinda fucked me up lol. It was a great one but ending is giving me so much melancholy. Jack and Vince’s relationship reminds me of the one between my ex and I. And I’m jack.",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1noinq8/black_rabbit/"
    }
]