[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pclmvl",
        "author": "BurgerNugget12",
        "title": "‘Stranger Things 5’ Opens With 59.6 Million Views, Netflix’s Biggest English-Language TV Debut Ever",
        "content": "",
        "upvotes": 171,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pclmvl/stranger_things_5_opens_with_596_million_views/"
    },
    {
        "id": "1pcdorr",
        "author": "SaberNoble47",
        "title": "The Matt Rife Xmas auto-play trailer ruins Santa in its immediate first second of dialog (US) upon entering the Netflix menu",
        "content": "Look I get it, there’s custom settings, you can turn off the auto-play trailers, you can mute, you can have kid friendly user accounts that won’t play more mature content but for the most part I don’t give a sh*t about that, my little kids don’t care and aren’t paying attention. Yes this one is ultimately on me, but I feel like  you turn Netflix on and IMMEDIATELY the auto trailer is that comedian sitting in a chair and he blurts out “it was hard when you find out your parents are Santa clause” and it’s loud and crisp and you’re just in the opening menu without navigating anywhere I think it’s a jerkoff move. Also that guy sucks. ",
        "upvotes": 146,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pcdorr/the_matt_rife_xmas_autoplay_trailer_ruins_santa/"
    },
    {
        "id": "1pcakae",
        "author": "businessinsider",
        "title": "Netflix show developer to stand trial for $11 million spending spree, including 5 Rolls-Royces, $638,000 in mattresses",
        "content": "",
        "upvotes": 141,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1pcakae/netflix_show_developer_to_stand_trial_for_11/"
    },
    {
        "id": "1pcfjd3",
        "author": "DizzyBeyBlade",
        "title": "Ozarks is top 10",
        "content": "I'm on my 4th rewatch of this show and I'm willing to argue that it is an absolute masterpiece. I take into account everyone has their own taste in media and the fact that what resonates with me might not work for others, but the storytelling, character development, and emotional depth here are unmatched in my eyes. The only contenders I have to this show are THE BODYGUARD &amp; HOUSE OF CARDS (prior to the bullshxt)",
        "upvotes": 15,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfjd3/ozarks_is_top_10/"
    },
    {
        "id": "1pcbv4a",
        "author": "Anxious_Maize_1823",
        "title": "Red Dead Redemption now available to download on App Store",
        "content": "Version 1.50.60293175 is now available to download and the size is 3.08 GB before any in-app downloads. The requirements however is iOS or iPadOS 18.0 or later.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pcbv4a/red_dead_redemption_now_available_to_download_on/"
    },
    {
        "id": "1pci36w",
        "author": "cataniluel",
        "title": "Can you play Netflix Games in a long flight that goes over 10 hours?",
        "content": "Last time I tried with my boy, his data was gone as soon as we landed and got online but it was 1-2 years ago. \n\nI guess it depends on the games but has anyone tried it recently? \n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pci36w/can_you_play_netflix_games_in_a_long_flight_that/"
    },
    {
        "id": "1pcqwjg",
        "author": "Shetland95",
        "title": "Freezing frames",
        "content": "\n\nWhat could be the reason for netflix freezing on frames for a couple of seconds ( but the sound keeps going)  and  doing this every few minutes ?\n\nGalaxy tab A8\n\nNB : it doesnt do it with any other streaming apps. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcqwjg/freezing_frames/"
    },
    {
        "id": "1pbnpt4",
        "author": "RiskAndReason",
        "title": "What do you think is the most overrated thing on Netflix?",
        "content": "Curious what everyone’s pick is for the most overrated Netflix show or movie.\n\nWhich title do you think gets way more hype than it deserves, and why? \n\nI’m not looking for hate, just honest opinions and maybe a few hot takes. 🫡",
        "upvotes": 204,
        "comments": 683,
        "media": null,
        "permalink": "/r/netflix/comments/1pbnpt4/what_do_you_think_is_the_most_overrated_thing_on/"
    },
    {
        "id": "1pcq0g8",
        "author": "amazon_sdee",
        "title": "Netflix interview structure!",
        "content": "Hey everyone! I’m chatting with a Netflix recruiter soon for a Distributed Systems role and wanted to see if anyone here has insight into their recruiting process or what to expect. Any tips would be super appreciated!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcq0g8/netflix_interview_structure/"
    },
    {
        "id": "1pbdb97",
        "author": "Ha8lpo321",
        "title": "Netflix quietly killed casting from phones to newer Chromecasts and Google TV Streamer",
        "content": "",
        "upvotes": 299,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1pbdb97/netflix_quietly_killed_casting_from_phones_to/"
    },
    {
        "id": "1pbgp78",
        "author": "Such_Environment5893",
        "title": "What is the justification of increasing subscription prices when Netflix continues to cancel shows after 2 seasons?",
        "content": "It doesn't make any sense to me.\n\nWhy get me hooked on shows if they are not going to be finished?\n\nWhat is the justification of this cycle of killing shows after 2 seasons only to start new shows?\n\nIs the price difference THAT MUCH between a renewal vs a new show?\n\nOr is it this overwhelming desire to find the next \"Walking Dead\" or \"Game of Thrones\" mega hit? Is it a case of \"unless it goes viral, its a failure?\"\n\nThe economy of streaming services is pissing me off. These price increases don't seem justified in the slightest.\n\nThis is why I've more often switched to watching YouTube, as at least I can rely on those content creators to keep giving me content I want to watch instead of \"well, my last video didnt get 1 million views, so I guess I'm calling it quits!\".",
        "upvotes": 129,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1pbgp78/what_is_the_justification_of_increasing/"
    },
    {
        "id": "1pceoje",
        "author": "mayyam808",
        "title": "No english subtitles??",
        "content": "I tried to watch one punch man earlier this year and it didnt have english subtitles only arabic ones searched it up no one seemed to have this issue now im trying to watch spy x family exact same problem no english subtitles only arabic my app is on english the languages preference is english i dont have any arabic anywhere on my phone why is it doing that? \n\nFor spy x family i only have english dub the original sub or arabic dub but for the subtitles its only arabic \n\nOne punch man is basically the same but no arabic dub only subtitles \nIm talking about the first episode of the first season so its not like it just didnt get translated yet",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pceoje/no_english_subtitles/"
    },
    {
        "id": "1pckslt",
        "author": "fa11enw1ngs",
        "title": "Restricted on an 18+ account?",
        "content": "Red dead redemption 1 just released and I’ve been trying to access this through my phone, problem is that Netflix keeps telling me my maturity rating is too low to play this even though it’s an unrestricted account? Any fixes for this? My parent’s accounts work just fine and we have the exact same settings?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pckslt/restricted_on_an_18_account/"
    },
    {
        "id": "1pc2rjw",
        "author": "Hot-Slide-7305",
        "title": "Christmas movies",
        "content": "I've recently got netflix got put on my Television, at this time of year there will no doubt be plenty of Christmas TV shows/movies on it, can any of you recommend any of good ones you think I may enjoy?\n",
        "upvotes": 6,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1pc2rjw/christmas_movies/"
    },
    {
        "id": "1pcbv0t",
        "author": "HereW1thoutDorinda",
        "title": "Netflix Home Screen",
        "content": "PSA to parents:  when I opened Netflix today, the first preview clip is the Matt Rife Christmas special and immediately talks about how Santa is really your parents. I tried to contact Netflix to have this updated but hopefully others will message them too. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pcbv0t/netflix_home_screen/"
    },
    {
        "id": "1pc1ufz",
        "author": "TimesandSundayTimes",
        "title": "Gary Lineker nets multimillion Netflix World Cup podcast deal",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pc1ufz/gary_lineker_nets_multimillion_netflix_world_cup/"
    },
    {
        "id": "1pcok9u",
        "author": "SwordfishAdvanced468",
        "title": "Stranger Things star Natalia Dyer sparks concern with thin figure",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pcok9u/stranger_things_star_natalia_dyer_sparks_concern/"
    },
    {
        "id": "1pcodqb",
        "author": "AdMain7963",
        "title": "Netflix’s port of RDR almost bricked my phone",
        "content": "(Bricked isnt the best choice of words my bad I can’t change the title now) I’m using an iPhone XR and I installed Netflix’s port of rdr only to be met by a mess of graphical glitches completely unplayable as I couldn’t see anything (not even text or any images at all), it then completely locked up my phone so I couldn’t get off that screen or even to the Lock Screen, ended up having to force reboot my phone. Netflix needs to fix this asap because that’s quite bad really is it not? I would post images/ videos but this sub doesn’t allow for that.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcodqb/netflixs_port_of_rdr_almost_bricked_my_phone/"
    },
    {
        "id": "1pceo80",
        "author": "demarcomiller",
        "title": "Discussion Forum Over Volume One of Stranger Things Season Five (SPOILERS SORRY)",
        "content": "I just finished up the first volume of Stranger Things, and here are my thoughts:\n\n\n\n One, Dustin. Dustin has been a fragile character that has already gone through a lot. Do not get me wrong, I understand that he would be grieving Eddie, but he wasn’t even greiving him this hard in the last season. I know grief fluctuates, and people go about it in different ways, but there was no inkling of evidence in Season Four that Dustin would turn into this. We feel like a mix between the stoicism of John Bender from *The Breakfast Club* and the corniness of the George Michael-looking boy in the nintento Power Glove commercial. The bro-mantic storylines that we all adored between Dustin and Steve feel over, and I know for a fact things will be mended during the season, or likely have one of them dying in the other’s arms, saying sorry. I would move on to my second point, but I feel I have the best way to put it now. Season One and Season Two of Stranger Things really prioritized characters and writing great characters and scenes rather than prioritizing plot. That I believe is what has become the shows biggest flaw. We all know Stranger things was set to be an anthology series, which inevitably ended up failing as viewers were not as interested in the character eights individual storyline. Of course, the audience were so invested in the original characters from the first season that it would be renewed, but as a serialized show now. I believe after Season Two, it became more about what is happening over the arc of the season than how do our characters interact and care for one another. Why does Hopper have a complete Character reset in season three? In fact, since season three, why has Hopper felt like a new character every season? Because it is not the same Hopper who has learned everything and endured everything he did in the first two seasons. Furthermore, I think even though I personally thought Vecna was cringe, I at least saw how having a humanoid villain was a successful way to continue the show, since it is hard to continue battling a non-verbal dark force the entire show. I kinda am giving up on this at this point, but I wanted to say something. I am enjoying this season are two things. I am enjoying that Will is finally standing up for himself, especially to his mom. (JOYCE BEING ANOTHER CHARACTER THAT HAS NO STAKES ANYMORE.) And I like that they have Robin and Will interacting, yet the scene writing is still terrible, but I believe this was a nice progression, especially since the two of them were not given much last season. With Robin getting a Character reset and Will yearning for the Mike Wheeler ding-a-ling. I believe this is the best thing they have done so far this season. Please let me know what you think, and please let’s not talk about the Holly plot line or how Max even enters it. That is a whole other tangent. \n\n\n\nP.S. I am a big fan of the show, and I am saddened by how the season is going so far. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pceo80/discussion_forum_over_volume_one_of_stranger/"
    },
    {
        "id": "1pcmk2a",
        "author": "OkChemical7492",
        "title": "Red Dead Redemption",
        "content": "I hope netflix sees this post. I request that you tune down the requirements for android devices. My snapdragon 7 cpu can run Subnautica on 60fps with no lag. What's your lame excuse?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pcmk2a/red_dead_redemption/"
    },
    {
        "id": "1pcd303",
        "author": "intelerks",
        "title": "Ross Duffer rules out a 'Stranger Things' feature film as live-action spinoff moves forward",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pcd303/ross_duffer_rules_out_a_stranger_things_feature/"
    },
    {
        "id": "1pc4v3m",
        "author": "SuperhumanVikingr",
        "title": "Am I supposed to have a second Netflix account for my holiday home???",
        "content": "\nI have a holiday home, and previously I’ve always been able to use Netflix there with no issues. \nNow, however, I can’t log into my account and I don’t even get a traveling option for a temporary code. It just asks me to update my household. \n\nDoes anyone have any insight on how to resolve this?\nAm I supposed to have a second account for a holiday home?\n",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pc4v3m/am_i_supposed_to_have_a_second_netflix_account/"
    },
    {
        "id": "1pburn8",
        "author": "funkymoonbeam",
        "title": "Does anyone have the Avatar code for the Kuromi icons?",
        "content": "I cannot find the codes anywhere, was hoping a kind person would be able to share the pouting Kuromi avatar code.\n\n  \nI'm referring to [this](https://pbs.twimg.com/media/GwnZKnWXkAA9jAq?format=jpg&amp;name=large) set of icons they released for the '*My Melody &amp; Kormi*' show. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pburn8/does_anyone_have_the_avatar_code_for_the_kuromi/"
    },
    {
        "id": "1pci6ln",
        "author": "Different-Meat-8562",
        "title": "The Beast in Me",
        "content": "Tried to watch this show but I can’t stand that lead actress, can someone spoil it for me so I don’t have to watch anymore, i made it to episode 2 about half way but I just can’t stand her lol",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pci6ln/the_beast_in_me/"
    },
    {
        "id": "1pbpjhd",
        "author": "pirategonzo",
        "title": "Watching Breaking Bad, Went to Lunch, Came Back and it is GONE??? Is it Just Me?",
        "content": "I feel like I am losing my mind. My \"continue watching\" is gone, and if I search for Breaking Bad I can't find it. I was just watching it less than two hours ago.",
        "upvotes": 6,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pbpjhd/watching_breaking_bad_went_to_lunch_came_back_and/"
    },
    {
        "id": "1patdun",
        "author": "f41ryb0n3s777",
        "title": "Removed a movie while i was watching it",
        "content": "Honestly just sharing it cus it’s funny but a little annoyed by it too. I was watching “Now You See Me 2” and i paused it for like 5 minutes to take a pee break. I come back and turn on the movie and it says title not available. I just brush it off as a typical Netflix glitch and refresh the page to see THAT THEY REMOVED THE MOVIE OFF THE WEBSITE 😭😭😭 REALLY NETFLIX\n",
        "upvotes": 430,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1patdun/removed_a_movie_while_i_was_watching_it/"
    },
    {
        "id": "1pbdvk9",
        "author": "TheMirrorUS",
        "title": "Linda Carman was 'warned' not to go on boat trip with son before death",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbdvk9/linda_carman_was_warned_not_to_go_on_boat_trip/"
    },
    {
        "id": "1pbzep4",
        "author": "GoddessRayne",
        "title": "Shows all look faded",
        "content": "Wondering if others are seeing this. We’ve checked on our tv Netflix as well as our Roku where we usually stream from. Everything seems washed out. Other streaming platforms are fine. It’s just a Netflix thing. I guess it’s better than too dark 😆 ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbzep4/shows_all_look_faded/"
    }
]