[
    {
        "id": "1nifvog",
        "author": "SupermanVFXAMA",
        "title": "Hi /r/movies! We're part of the VFX team behind James Gunn's 'Superman'. We helped create &amp; design Krypto the Superdog, the Fortress of Solitude, the Engineer's Power Suit, the Lex vs Krypto fight, Superman's parent holograms, and lots more with the rest of the team at Framestore. Ask us anything!",
        "content": "Hi r/movies! We’re Stéphane Nazé (VFX Supervisor), Loïc Mireault (Animation Supervisor), and Kevin Sears (CG Supervisor), part of the Framestore team behind Superman's VFX. Here to answer your questions!\n\nIf you want to know more about us here are our credits\n\n* Stéphane Nazé: [https://www.imdb.com/name/nm0623408/?ref\\_=fn\\_all\\_nme\\_1](https://www.imdb.com/name/nm0623408/?ref_=fn_all_nme_1)\n* Loïc Mireault: [https://www.imdb.com/name/nm12787058/?ref\\_=fn\\_all\\_nme\\_1](https://www.imdb.com/name/nm12787058/?ref_=fn_all_nme_1)\n* Kevin Sears: [https://www.imdb.com/name/nm3010149/?ref\\_=nv\\_sr\\_srsg\\_0\\_tt\\_4\\_nm\\_4\\_in\\_0\\_q\\_kevin%2520sears](https://www.imdb.com/name/nm3010149/?ref_=nv_sr_srsg_0_tt_4_nm_4_in_0_q_kevin%2520sears)\n\nHere’s a taste of what we tackled on **Superman**:\n\nWe collaborated closely with director James Gunn and VFX Supervisor Stéphane Ceretti to reimagine Superman’s world, not just with spectacle, but with nuance, heart, and technical innovation.\n\n\\-Krypto the Superdog. Inspired by James Gunn’s dog Ozu, we captured every subtle gesture, emotion, and furry leap to ensure Krypto felt like a genuine canine first, only one who happened to have superpowers.\n\n\\-The Fortress of Solitude: We designed the Fortress using more than 6000 reflective crystals, each one a challenge in shading, lighting, and rendering.\n\n\\-4D Gaussian Splatting: A first in feature film, we used 4D Gaussian Splat to create Superman’s Kryptionian parents hologram.\n\n\\-And also the Engineer’s nanite power suit, SupermanRobots, Lex vs Krypto fight scene and more! You can learn about our work here: [https://www.framestore.com/work/superman](https://www.framestore.com/work/superman) \n\nWe’ll be back today (Tuesday 8/16) at 3PM ET to answer your burning questions. In the meantime, ask away, we’re excited to dive into the murk and magic of bringing Superman to life! Ask us anything!",
        "upvotes": 362,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pddm8jhzqipf1.png?auto=webp&amp;s=7f0da009407262c2ead046800be3c5b29d340e71"
        },
        "permalink": "/r/movies/comments/1nifvog/hi_rmovies_were_part_of_the_vfx_team_behind_james/"
    },
    {
        "id": "1nkrua7",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (HIM / A Big Bold Beautiful Journey) plus throwback discussions",
        "content": "**New In Theaters**:\n\n[HIM](https://old.reddit.com/r/movies/comments/1nkrsiq/official_discussion_him_spoilers/?)\n\n[A Big Bold Beautiful Journey](https://old.reddit.com/r/movies/comments/1nkrsl7/official_discussion_a_big_bold_beautiful_journey/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Almost Famous](https://old.reddit.com/r/movies/comments/1nkrsmq/official_throwback_discussion_almost_famous/?)\n\n**Still In Theaters**:\n\n* [The Long Walk](https://old.reddit.com/r/movies/comments/1nerbo8/official_discussion_the_long_walk_spoilers/?)\n* [Spinal Tap II: The End Continues](https://old.reddit.com/r/movies/comments/1nerbpv/official_discussion_spinal_tap_ii_the_end/?)\n* [Downton Abbey: The Grand Finale](https://old.reddit.com/r/movies/comments/1nerbsd/official_discussion_downton_abbey_the_grand/?)\n* [Demon Slayer: Infinity Castle](https://old.reddit.com/r/movies/comments/1nerbr6/official_discussion_demon_slayer_infinity_castle/?)\n* [Splitsville](https://old.reddit.com/r/movies/comments/1nerbtt/official_discussion_splitsville_spoilers/?)\n* [Twinless](https://old.reddit.com/r/movies/comments/1nerbvd/official_discussion_twinless_spoilers/?)\n\n\n**New On Streaming:**\n\n* [Highest 2 Lowest](https://old.reddit.com/r/movies/comments/1n9h173/official_discussion_highest_2_lowest_spoilers/?)\n* [The Thursday Murder Club](https://old.reddit.com/r/movies/comments/1n5045m/official_discussion_the_thursday_murder_club/?)\n* [The Home](https://old.reddit.com/r/movies/comments/1n5046o/official_discussion_the_home_spoilers/?)\n* [Eenie Meanie](https://old.reddit.com/r/movies/comments/1n5043w/official_discussion_eenie_meanie_spoilers/?)\n* [Fixed](https://old.reddit.com/r/movies/comments/1ms61cu/official_discussion_fixed_spoilers/?)\n* [Night Always Comes](https://old.reddit.com/r/movies/comments/1ms61j7/official_discussion_night_always_comes_spoilers/?)\n* [War of the Worlds (2025)](https://old.reddit.com/r/movies/comments/1mek72y/official_discussion_war_of_the_worlds_spoilers/?)",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1nkrua7/official_discussion_megathread_him_a_big_bold/"
    },
    {
        "id": "1nlvcas",
        "author": "ChiefLeef22",
        "title": "Netflix Considering Bid To Acquire Warner Bros.",
        "content": "",
        "upvotes": 4277,
        "comments": 791,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n7iDoIXu3Fb_fmmzxd0dzMEQqu2C8HFhw6OP6nZWArs.jpeg?auto=webp&amp;s=7c7b2ae14d59d79861a7db1ace2b72665220095a"
        },
        "permalink": "/r/movies/comments/1nlvcas/netflix_considering_bid_to_acquire_warner_bros/"
    },
    {
        "id": "1nlm4ol",
        "author": "EebamXela",
        "title": "The new Naked Gun movie was absolutely fantastic. No notes.",
        "content": "EDIT: marked spoilers cuz of comments. Post is spoiler free. \n\nIf you haven’t seen the originals please go see them. \n\nThen go see this new one. It’s so god damned good. \n\nI really hope the message is clear to movie makers out there that they don’t have to try so hard to be funny and that they need to embrace the idea of getting laughs cuz something is just plain silly or stupid. More dumb jokes. \n\nIMO they really did an amazing job bringing back the vibe of the originals. So freaking refreshing. \n\nLeslie Nielsen fucking crushed that role. \n\nLiam Neeson also crushed it. ",
        "upvotes": 6591,
        "comments": 836,
        "media": null,
        "permalink": "/r/movies/comments/1nlm4ol/the_new_naked_gun_movie_was_absolutely_fantastic/"
    },
    {
        "id": "1nm1mx8",
        "author": "BunyipPouch",
        "title": "Famke Janssen ('X-Men') To Star In Post-Apocalyptic Thriller ‘One Second After’ - Set in the aftermath of an electromagnetic pulse attack on the United States, it explores the collapse of society, the struggle of individuals and communities to survive without modern technology and infrastructure.",
        "content": "",
        "upvotes": 479,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mBXEtsm9MUVYHl37A0Vscrh1S0xCvHsl9DhTl53XQAU.jpeg?auto=webp&amp;s=ccbd798db6ac17b7fe3810a4a08b4a4fcbabee01"
        },
        "permalink": "/r/movies/comments/1nm1mx8/famke_janssen_xmen_to_star_in_postapocalyptic/"
    },
    {
        "id": "1nlyt2g",
        "author": "Remote-Feedback567",
        "title": "How Tarantino Learned To Write",
        "content": "Full interview: [https://youtu.be/dhXZJfLBE3I](https://youtu.be/dhXZJfLBE3I)",
        "upvotes": 480,
        "comments": 53,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dspie9xzrbqf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nlyt2g/how_tarantino_learned_to_write/"
    },
    {
        "id": "1nldhuy",
        "author": "ChiefLeef22",
        "title": "Marvel’s 'Avengers: Doomsday' Has Wrapped Production",
        "content": "",
        "upvotes": 8624,
        "comments": 1427,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aZliqnawVXdUcq7OO_FKaah0JTT-gylPyca2edZxKEE.jpeg?auto=webp&amp;s=7b1b9580fd5e872e93a6b4c58b29f962393406cb"
        },
        "permalink": "/r/movies/comments/1nldhuy/marvels_avengers_doomsday_has_wrapped_production/"
    },
    {
        "id": "1nlosgt",
        "author": "BunyipPouch",
        "title": "‘Sinners’ Will Compete for Best Drama at the Golden Globes",
        "content": "",
        "upvotes": 1018,
        "comments": 175,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nWE-tk9rD9gJdmnOjFtXeGa8AlZ8_qLovY_aemWSAX8.jpeg?auto=webp&amp;s=bef1e9ad806d185cd7c6e4467d8311f678114dd1"
        },
        "permalink": "/r/movies/comments/1nlosgt/sinners_will_compete_for_best_drama_at_the_golden/"
    },
    {
        "id": "1nm1gyg",
        "author": "sizzlinpapaya",
        "title": "Who is an actor that you don’t think of as a favorite but when you see them in something you’re excited.",
        "content": "For me it’s Justin Long. When people ask me favorite actors he doesn’t immediately pop up but when I see him in credits before a movie I’m like “ oh damn nice. I like him “ especially lately since he’s turning into a horror guy. \n\nAnother would be Donal Logue even though he’s mostly TV. \n\nThought of this while rewatching drag me to hell…. Haven’t seen it since release and forgot Long was in it. ",
        "upvotes": 104,
        "comments": 180,
        "media": null,
        "permalink": "/r/movies/comments/1nm1gyg/who_is_an_actor_that_you_dont_think_of_as_a/"
    },
    {
        "id": "1nl3xsk",
        "author": "ColdMinnesotaNights",
        "title": "V for Vendetta continues to be a history lesson",
        "content": "Late night funny man pokes fun at authoritative head of state.\n\nAuthoritative head of state has funny man disappeared.\n\nIt’s as if Donald Trump watched the film on his flight to the United Kingdom, and only finished half of it, got some ideas, phoned his buddy at the FCC, but didn’t see how it ends. Hopefully he sees how it the movie ends. \n\n\n\n\n",
        "upvotes": 19587,
        "comments": 1023,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fgRQi1GBT3Aftu4IVrfUB-gbAGm6gzHGrQZA69Hq08A.jpeg?auto=webp&amp;s=b84b88d2ae1db85626e69b457696f6771f34509b"
        },
        "permalink": "/r/movies/comments/1nl3xsk/v_for_vendetta_continues_to_be_a_history_lesson/"
    },
    {
        "id": "1nlobov",
        "author": "Wonder-Lad-2Mad",
        "title": "Ong-Bak (2003) is fucking insane. I can't believe how many flying knees &amp; elbows Tony Jaa throws that actually connect super hard!",
        "content": "The stunts in this movie fucking rule. It's got everything from free running, to fights, to boss fights, set pieces, shit, there's a fucking tuktuk chase in it. How many action movies can you count where people chase eachother with tuktuks?!\n\n\nLike I said in the title what really makes this movie stand out to me is the fact that Tony's really hitting his opponents and it genuinely shows. The stunt guys are always wearing big wigs, hats, beanies, or layered clothing to hide the protective pads their wearing. It's nuts. The fight choreography is gorgeous in this, Tony Jaa's movement is so fluid and rhythmic, he really brought out the beauty of Muay Thai.\n\n\nThe story is also pretty decent, the simple story of a country bumpkin having to team up with a scummy city slicker to return hope back to their village is pretty cute.\n\n\nI think it's a tie for me between the fight club battles and the final fight for the best fight scene in the movie",
        "upvotes": 432,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1nlobov/ongbak_2003_is_fucking_insane_i_cant_believe_how/"
    },
    {
        "id": "1nly02r",
        "author": "crushedmoose",
        "title": "'Ash is the purest white' (2018)...The ambush",
        "content": "",
        "upvotes": 71,
        "comments": 47,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3zl7xqjnlbqf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nly02r/ash_is_the_purest_white_2018the_ambush/"
    },
    {
        "id": "1nlkdam",
        "author": "EnglishTony",
        "title": "Best monologue in movie history?",
        "content": "I'm gonna go with Quint telling the story of the SS Indianapolis in Jaws.  \n\n\"Still... we delivered the bomb....\"\n\nHonourable mention, Dr Loomis' \"I... met him... fifteen years ago...\" from Halloween.\n\nWhat's your favourite?  Jules explaining bible quotes in Pulp Fiction?  Agent Smith sharing his opinions on humanity?  Something else entirely?",
        "upvotes": 709,
        "comments": 845,
        "media": null,
        "permalink": "/r/movies/comments/1nlkdam/best_monologue_in_movie_history/"
    },
    {
        "id": "1nl5x43",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Now You See Me: Now You Don't'",
        "content": "",
        "upvotes": 3687,
        "comments": 831,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b8di3fxwy4qf1.jpeg?auto=webp&amp;s=92555b5b9061205573f61472093b9339f2015b85"
        },
        "permalink": "/r/movies/comments/1nl5x43/new_poster_for_now_you_see_me_now_you_dont/"
    },
    {
        "id": "1nlkjad",
        "author": "neverleavingthewagon",
        "title": "What ENDING scene will forever live rent free in your mind?",
        "content": "I’m talking the most mindboggling, or the most bizarre, or the most intense ending that you can possibly think of. It could even just be extremely memorable. \n\nThink outside the box here, because there are some movies that have pretty ‘predictable’ endings. I want your one movie that has that ending that sends chills down your entire spine \n\nMY choice is Ghost Ship. I think I’ve watched that movie over 100 times and that ending scene will always just make me go ‘wtfffff’. Her in the ambulance on the port thinking the entire thing is over and that she’s safe. All of a sudden she sees her old crew carrying the gold crates onto the new ship..that incredibly intense song by Mudvayne starts rolling, and at the end of the pack is the demon who she thought she killed, slow motion walking up the deck behind them, peers over at her, nostrils flared while maintaining constant eye contact with her, then smirks at her and she screams ‘NOOOOOO!’ while the ambulance doors close on her  \n\nChills. Every. Single. Time. \n\nWhat’s your most memorable ending?\n\n\n\n",
        "upvotes": 412,
        "comments": 1140,
        "media": null,
        "permalink": "/r/movies/comments/1nlkjad/what_ending_scene_will_forever_live_rent_free_in/"
    },
    {
        "id": "1nly8wt",
        "author": "mickyrow42",
        "title": "Any suggestions for movies that relate to the goldrush specifically, not just “western”?",
        "content": "Recently went through an old mining town and looking for something that deals with the history of the American gold rush in the west. It’s ok if it has typical western elements but not really looking for just a western cowboy kind of movie. Wondering if there’s anything more specially focused on the gold rush aspect. ",
        "upvotes": 24,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1nly8wt/any_suggestions_for_movies_that_relate_to_the/"
    },
    {
        "id": "1nl50y2",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Yorgos Lanthimos’ ‘BUGONIA’",
        "content": "",
        "upvotes": 1520,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hm0vb2vqs4qf1.jpeg?auto=webp&amp;s=a63a4160ee1e44c0da31a51dcfbd5f136b76f080"
        },
        "permalink": "/r/movies/comments/1nl50y2/new_poster_for_yorgos_lanthimos_bugonia/"
    },
    {
        "id": "1nluhud",
        "author": "Jokis_malokis",
        "title": "All these years later, The Vast Of Night just gets better.",
        "content": "Just rewatched this movie tonight in my backyard on a projector and am once again blown away by it. I have seen everything. I don't rewatch movies often. This little film always hooks me without fail.\n\nThe first scene when we follow Everett through the gymnasium, you instantly fall in love with him. He's magnetic thanks to the performance by Jake Horowitz, who screen presence is immediately likeable and natural, he sort of reminds me of RDJ with his ability to not just create chemistry with the other actors but with the audience, almost leaping out of the screen at you. This guy could win Oscars someday. The writing is also so complex and funny, lots of talking over each other between characters but never too chaotic. The old turns of phrase like \"I'll be at the water of you\" or \"He's a nowhere man, a real pale one. You don't want to waste time talking to that tomb stone.\" Or my favorite \"Cut the gas cube, you were a mile wide!\" Are all classics and so well delivered. Right off the bat you are leaning in, you aren't even thinking about aliens, you just want to watch Everett and Faye wander this perfectly realized 1950's town and vibe.\n\nThe film is also like an ASMR stim with its eerie score and the characters fiddling around with the 50's technology. Faye's scene as she listens to the radio and answers calls is so damn hypnotic you don't even realize it is a single unbroken shot for something like 8 or 9 minutes. This movie is impressive, but so immersive you aren't really distracted by all of the next level filmmaking happening. When the movie starts to get spooky it delivers chill inducing moments with its combination of sounds score and visuals on such a high level, you'd think it cost millions to make, but was made for under a million. This is like if Modern Fincher directed an early Spielberg film.\n\nThe tracking shot taking us from the phone operating station, through the gymnasium and then to Everett at the radio station is magnificent and should be studied in film courses. Its an unbelievable achievement. Every time I show this movie to someone, even if they aren't a geek like me, they make some kind of comment about how cool it is. This is the kind of film that asks for you patience but you don't mind giving it. It's stimulating because it's so convincing. Even when there are fx shots later in the film, it's sense of reality is never broken. The fact this film has you sit through two monologues with light to no visual activity, and that those may be the two most captivating scenes in the film shows you how high of a level Andrew Patterson is working at. These two scenes are chill inducing.\n\nThe ending haunts me. I noticed on this watch that everything was burned where the aliens arrived and that there were ashes left behind when the characters disappear, leading me to think we are meant to wonder whether they were abducted or vaporized. \n\nThe Vast of Night is, in my opinion, the greatest alien film ever made. As a debut it's alongside Boogie Nights, Reservoir Dogs, and Jaws. I can't stop thinking about it. It's rhythm is in a class of its own.Andrew Patterson is some kind of Unicorn in the filmmaking world. His directorial voice is so fully formed, his writing is like listening to a book come to life, yet we know nothing about him as if he is intentionally avoiding the limelight. The film is head and shoulders above any film released that year, and I'm still upset it didn't get any awards recognition. I would have put it up for Best Actor, Actress, Cinematography, Editing, Score, and Picture and it would not have been close in some of those categories. I hope this film gets the recognition it deserves as years pass on.\nEvery time I show it someone I get to watch them fall in love with it the way I did. Few films are this special. Even though it's a simple premise, it does the absolute most with it.\n\nI may just watch it again this week. I would highly recommend watching it on a projector out doors, it just feels right.\nAnybody else love this film? Got a favorite scene? Or how about any recommendations for hidden gems that punch way above their weight? ",
        "upvotes": 38,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1nluhud/all_these_years_later_the_vast_of_night_just_gets/"
    },
    {
        "id": "1nlb6kx",
        "author": "LocationNo1077",
        "title": "TRON: ARES (2025) Soundtrack by Nine Inch Nails Released",
        "content": "It finally dropped! I'm so psyched the full soundtrack is out now. The Tron: Legacy soundtrack was so good and so far I've been lovingggggg this one! 'New Directive' (the 22nd track) is straight heat. Feel like I have to show off this crazy-ass 7\" vinyl I got at Comic Con in honor of the full release! Where does the TRON series rank among movie soundtracks for everyone?\n\nhttps://preview.redd.it/4l8azt6nx5qf1.jpg?width=4284&amp;format=pjpg&amp;auto=webp&amp;s=dcc905835d9c0c64efd44c3966ccc6ee70771a4a\n\nAlso here are links to vinyl/cd for anyone interested: \n\nVinyl: [https://interscope.com/products/tron-ares-soundtrack-180-gram-2lp](https://interscope.com/products/tron-ares-soundtrack-180-gram-2lp)\n\nCD: [https://interscope.com/products/tron-ares-soundtrack-cd](https://interscope.com/products/tron-ares-soundtrack-cd)",
        "upvotes": 664,
        "comments": 152,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MInHhmvfEeOyPovwc0P6DtdN08oYEPhW_Sf5PTi23kA.png?auto=webp&amp;s=d0fce50cc6face2e920dd258ea818e7e1fda9a8f"
        },
        "permalink": "/r/movies/comments/1nlb6kx/tron_ares_2025_soundtrack_by_nine_inch_nails/"
    },
    {
        "id": "1nm2ptk",
        "author": "KireRakhsh",
        "title": "Dissident Iranian filmmakers urge Oscars to reject state-linked submissions",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sic7E10WvONpgi2XM7kfzWpPxNjC9oAzsLx2Lrk-Edw.jpeg?auto=webp&amp;s=0363583bfa8795eafa72ec54b3e19ea0322cbf4f"
        },
        "permalink": "/r/movies/comments/1nm2ptk/dissident_iranian_filmmakers_urge_oscars_to/"
    },
    {
        "id": "1nlnizv",
        "author": "All_This_Mayhem",
        "title": "In an interview during production of Terminator: Salvation, director McG said they were trying something groundbreaking that had never been done before. What was that?",
        "content": "I recall seeing an interview with McG discussing the production of Terminator Salvation.\n\nHe referenced attempting something that had never been done before in the production a film that, if successful, would be groundbreaking.\n\nDoes anyone know what he was talking about, if it was successful, and if it was, in fact, groundbreaking?",
        "upvotes": 112,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1nlnizv/in_an_interview_during_production_of_terminator/"
    },
    {
        "id": "1nm2q95",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - DeWanda Wise - Thursday 10/16 at 6:00 PM ET - Actress in 'She's Gotta Have It', 'Jurassic World Dominion', 'Imaginary', 'Love, Brooklyn', 'The Harder They Fall', 'Poolman', 'Fatherhood', and lots more.",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hdpa5pwgjcqf1.png?auto=webp&amp;s=c0a82f7eb148cd349f0eee5dbfc3314754c20181"
        },
        "permalink": "/r/movies/comments/1nm2q95/amaqa_announcement_dewanda_wise_thursday_1016_at/"
    },
    {
        "id": "1nlmnk5",
        "author": "EuphoricButterflyy",
        "title": "‘Black Christmas’ (1974)… the call is coming from inside the house scene",
        "content": "",
        "upvotes": 85,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x5cucl4te8qf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nlmnk5/black_christmas_1974_the_call_is_coming_from/"
    },
    {
        "id": "1nm10o9",
        "author": "Sorry_Manufacturer62",
        "title": "What’s the wildest and/or weirdest movie poster you’ve ever seen?",
        "content": "https://preview.redd.it/oncmki3n6cqf1.jpg?width=1000&amp;format=pjpg&amp;auto=webp&amp;s=7cc95510baa004c1879c827d5885f6ed050a0083\n\nWho doesn’t enjoy a good movie poster? As a teen, I plastered my walls with music posters by Frank Kozik and Coop. In college, I tumbled into a lifelong love affair with movie posters from around the world. \n\nI have a special love for hand-painted posters, as well as foreign posters for Hollywood films. Ghanaian movie posters, which you can [see and read about here](https://alexrollinsberg.substack.com/p/untamed-art-the-glorious-madness), tick both of these boxes. \n\nWhat are your favorite movie posters?\n\nA quick history of these Ghanaian movie posters: The rise of home video brought movies to the most remote corners of western Africa. Mobile cinema operators crisscrossed the countryside, screening films in churches, homes, and open-air markets. To draw crowds, they needed eye-catching advertisements. But there was a problem: Ghana’s military government forbade the import of printing presses. So the mobile cinema operators turned to local artists, most of them self-taught sign painters.\n\nSome had not yet seen the movies, while others had a selective regard for the characters and plots - adding guns, gore, and other salacious embellishments to lure audiences. Using recycled flour sacks as canvases and a mix of house and oil paints, they unleashed their eye-popping visions.\n\nWith the rise of the internet, cinema clubs faded away, and so too did the demand for hand-painted Ghanaian movie posters. Or so it seemed.\n\n5,700 miles away in Chicago, Brian Chankin was running a tiny underground video store when a friend handed him a book called [*Ghanavision*](https://amzn.to/4ipviMF), a tribute to the obscure art form. He was mesmerized. Chankin started collecting the posters and hanging them in his shop. Customers clambered to buy them. As demand grew, Chankin decided to track down the artists. This was the dawn of his Chicago-based gallery, Deadly Prey, which has elevated local African poster artists to global sensations. ",
        "upvotes": 7,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Caxu6xKGCB9dchEiLxWqfjwUSHKeSiKhpY4-tuqYTIE.jpeg?auto=webp&amp;s=5a2821d71125ee71b44c3638b86716ed412d78de"
        },
        "permalink": "/r/movies/comments/1nm10o9/whats_the_wildest_andor_weirdest_movie_poster/"
    },
    {
        "id": "1nm2ggt",
        "author": "AtraMortes",
        "title": "Which up and coming 25 or younger actress do you think will have the best career?",
        "content": "There are quite a few upcoming young actresses under 25 that have done good work and show a lot of promise for having a long great and successful career.  Which of them do you think will end up flourishing into the future A list actresses with a great trajectory, accolades and filmography?\n\nHere is a list of some of the most popular ones along with their age for reference:\n\n* Milly Alcock (25)\n* Sophie Thatcher (24)\n* Rachel Zegler (24)\n* Isabela Merced (24)\n* Thomasin McKenzie (24)\n* Sadie Sink (23)\n* Sophia Lillis (23)\n* Jenna Ortega (22)\n* Millie Bobby Brown (21)\n\nPersonally I think out of this group Sadie Sink will end up having a great and lasting career and will end up being part of the new generation of A listers. She has already shown her range and acting shoes in several projects like The Whale and Stranger Things,  is very charismatic and likeable and looks to be easy to work with.\n\nHow about you? Which one do you think will end up having the best career?",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1nm2ggt/which_up_and_coming_25_or_younger_actress_do_you/"
    },
    {
        "id": "1nlh8k1",
        "author": "KillerCroc1234567",
        "title": "Rupert Friend, Kevin Durand, Jaeden Martell to Star in Guillermo Del Toro-Produced Horror Movie ‘The Boy in the Iron Box’",
        "content": "",
        "upvotes": 99,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hsIcRg6_hA9mYhOBSgRX3BfGsznSVsu3xJcSP5GFsLQ.jpeg?auto=webp&amp;s=4bf4016b6b5c3949c35c042fe485e988a770b95b"
        },
        "permalink": "/r/movies/comments/1nlh8k1/rupert_friend_kevin_durand_jaeden_martell_to_star/"
    },
    {
        "id": "1nlh8cx",
        "author": "BunyipPouch",
        "title": "Pamela Anderson &amp; Her Sons Launch Production Company; Series Based on Her 1996 Film ‘Barb Wire’ In The Works As First Project",
        "content": "",
        "upvotes": 97,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OMZeiGRt4MkwR6tseWaOW9EXeifR2zO7G8JMu7BU_Jk.jpeg?auto=webp&amp;s=7a7875c9489f949fb40aeef5045d58d0f9b89867"
        },
        "permalink": "/r/movies/comments/1nlh8cx/pamela_anderson_her_sons_launch_production/"
    },
    {
        "id": "1nllv8z",
        "author": "TerrifierBlood",
        "title": "‘The Help’ Stars Octavia Spencer &amp; Jessica Chastain Reteam For Holiday Comedy ‘Deck The Y’Alls’",
        "content": "",
        "upvotes": 47,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4tlSDFjg4AsS6V3JpfR-nKlfaui0P1lfLnIpjiG1BIo.jpeg?auto=webp&amp;s=3b5be7a1facc45d77b33bf828bfc167ab2867b5c"
        },
        "permalink": "/r/movies/comments/1nllv8z/the_help_stars_octavia_spencer_jessica_chastain/"
    },
    {
        "id": "1nl1204",
        "author": "yojoono",
        "title": "Spawn (1997) Official 4K Trailer",
        "content": "",
        "upvotes": 607,
        "comments": 214,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/apEpj_TqaJ9qXA7qizw1QU2AsUo38usB6Kh0sysybXc.jpeg?auto=webp&amp;s=02f6dc4b17049f1c6dd0b0e293abac1af2d0a8ae"
        },
        "permalink": "/r/movies/comments/1nl1204/spawn_1997_official_4k_trailer/"
    },
    {
        "id": "1nledic",
        "author": "Sorry_Manufacturer62",
        "title": "What are your favorite lesser-known movie soundtracks?",
        "content": "I’ve been on a movie soundtrack kick lately, especially while writing. Curious what underrated or lesser-known scores you all love.\n\nSome of my recent go-tos: *Under the Skin* (Mica Levi), *Sweet Smell of Success* (Chico Hamilton), and *Gone Girl* (Atticus Ross &amp; Trent Reznor).\n\nWhat are yours? Always looking for gems. If anyone wants to see the list I put together so far on Substack, it’s [here](https://open.substack.com/pub/alexrollinsberg/p/four-things-i-love-about-the-movies?r=87ci5&amp;utm_campaign=post&amp;utm_medium=web&amp;showWelcomeOnShare=false).",
        "upvotes": 111,
        "comments": 404,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qtCDnVkVfUKoAOR0ETnMrB4xCbuFXwuEhX-M7vk7Awo.jpeg?auto=webp&amp;s=3295928ef85358eeb0c57207a80fea5d2702a4a8"
        },
        "permalink": "/r/movies/comments/1nledic/what_are_your_favorite_lesserknown_movie/"
    },
    {
        "id": "1nlerx9",
        "author": "GoldDerby",
        "title": "Emily Blunt will officially submit for Supporting Actress for her work in 'Smashing Machine':",
        "content": "",
        "upvotes": 102,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eKEueWT45Ikqpz_VhVUEl2m2UsdRyCVwb51OmmXsgNY.jpeg?auto=webp&amp;s=e925f46b3f17499b787f032d60d3e5b3ef77241b"
        },
        "permalink": "/r/movies/comments/1nlerx9/emily_blunt_will_officially_submit_for_supporting/"
    },
    {
        "id": "1nkn44i",
        "author": "unxpectedlyevlgenius",
        "title": "What’s the highest amount an actor has earned from the least amount of screen time?",
        "content": "Alec Guinness had approximately 20 minutes of screen time in Star Wars: A New Hope, and in addition to his $150k initial salary, his 2.5% backend gross share earned him approximately $95 million by the time of his death.\n\nAre there any even more impressive examples of actors/actresses earning more money for less screen time?",
        "upvotes": 5392,
        "comments": 926,
        "media": null,
        "permalink": "/r/movies/comments/1nkn44i/whats_the_highest_amount_an_actor_has_earned_from/"
    }
]