[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 479,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 118,
        "comments": 5777,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gzvczt",
        "author": "dailymail",
        "title": "Netflix children's movie that 'teaches kids divorce is ok' is panned by parents",
        "content": "",
        "upvotes": 468,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1gzvczt/netflix_childrens_movie_that_teaches_kids_divorce/"
    },
    {
        "id": "1h0cafz",
        "author": "Matches_Malone010",
        "title": "Netflix needs to let us thumbs up or thumbs down individual seasons for shows.",
        "content": "I love Arcane season 1, but I think Arcane season 2 is pretty bad. I would still recommend people check out season 1, but I would caution them about watching season 2. I feel the same way about Umbrella Academy. Seasons 1-3 are really good, but season 4 is really bad and I feel people should know what they're getting into before they watch a show.",
        "upvotes": 22,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1h0cafz/netflix_needs_to_let_us_thumbs_up_or_thumbs_down/"
    },
    {
        "id": "1gzm3oh",
        "author": "IrishStarUS",
        "title": "JonBenét Ramsey's dad vows to hold on until killer caught - as police 'wait for him to die' amid new Netflix doc",
        "content": "",
        "upvotes": 381,
        "comments": 162,
        "media": null,
        "permalink": "/r/netflix/comments/1gzm3oh/jonbenet_ramseys_dad_vows_to_hold_on_until_killer/"
    },
    {
        "id": "1h0f8bh",
        "author": "darinbb93",
        "title": "New Way Windows Store 'Apps' Are Developed is Trash and Ruined Netflix For Me",
        "content": "Okay, I really hope I'm not the only one who has noticed and is disturbed by how apps from the Microsoft Store now work. Specifically, Netflix, Crunchyroll, YouTube Music, Facebook Messenger, and who knows how many others (probably plenty more).\n\nThe way these applications now function is by essentially using the Microsoft Edge browser. Instead of opening an app, you're basically just opening a browser tab. These \"apps\" rely on Edge's settings and even redirect links to Edge when it's not your default browser. In other words, you no longer get any of the functionality you'd expect from a standalone app. It's literally the same experience as opening the webpage in Edge. How does that even qualify as an application?!\n\nWhat's worse is that if anyone somehow manages to uninstall or delete Edge from their computer, or if a buggy update breaks it, I bet all these so-called \"apps\" will stop working entirely.\n\nI really hope nobody tries to defend this practice because it's indefensible.\n\nRight now, I'm furious about the disappearance of the Netflix app. The app used to let me directly connect to my home theatre receiver and send high-quality audio with surround sound support. That’s gone now—thanks a lot.   \nOn top of that, I'm facing a huge issue with Netflix lowering the resolution when playing via the browser (or the \"app\") for absolutely no good reason. I can see how it quickly buffers about 4 minutes of video, but after playing for just a few seconds, it drops the quality, it stutters, rewinds a second, and starts redownloading another 4 minutes of video. This cycle repeats, and the quality keeps dropping until it hits the lowest resolution, which in my case watching on a big screen makes it unbearable. \n\nAnd yes, before anyone asks:\n\n* My profile is set to high-quality playback.\n* I have a fast, stable internet connection (110 Mbps is more than enough).\n* I'm using a solid gaming build, so there are no hardware issues.\n\nI even tried installing an old Chrome extension called *Netflix 1080p* made by Truedread, because this problem has existed for years. Unfortunately, it hasn't worked yet, I will play around with settings and source code further in attempts to resolve this.\n\nI am new to posting on reddit so if I have not done something right please let me know ( I know you want to).\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h0f8bh/new_way_windows_store_apps_are_developed_is_trash/"
    },
    {
        "id": "1gzzdyf",
        "author": "Alan_Stamm",
        "title": "Anthony Jeselnik is back with his first new special in five years, 'Bones and All'",
        "content": "",
        "upvotes": 41,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1gzzdyf/anthony_jeselnik_is_back_with_his_first_new/"
    },
    {
        "id": "1gzx8f4",
        "author": "kgbking",
        "title": "Thoughts on the Recent Netflix Content? I am Disappointed",
        "content": "I feel like there are thousands of Superhero and Murder / Crime movies, but other than these the content is drying up. \n\nI am into the dramas, and the recent content of the dramas is a bit weak as of recent. I feel like Netflix is losing its well-roundedness and merely catering disproportionately to whatever is in vogue. \n\nWhat are your thoughts on this?",
        "upvotes": 26,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1gzx8f4/thoughts_on_the_recent_netflix_content_i_am/"
    },
    {
        "id": "1h0fqun",
        "author": "Paborate",
        "title": "\"Your device isn't part of this Netflix household",
        "content": "so i wake up one morning and hop on my phone as usual to watch netflix and it says \"Your device isnt part of this netflix household\" i ask my brother and he says his is fine (keep in mind i had already been using netflix on the same phone in the same house on the same router for around 8 months now) so there is no reason it just says this out of NOWHERE keep in mind this all happened 3 weeks ago i still get the same message on my phone when i try to get in even now and have resorted to this post. Anyone have a fix?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h0fqun/your_device_isnt_part_of_this_netflix_household/"
    },
    {
        "id": "1h0aopk",
        "author": "Personafreak",
        "title": "We talked a bit with Vincent Regan and Craig Fairbrass about their work on One Piece. Hope you enjoy it. ",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h0aopk/we_talked_a_bit_with_vincent_regan_and_craig/"
    },
    {
        "id": "1h0e6bz",
        "author": "DanicaHamlin",
        "title": "Is there a way to weed out English dubs from the lineup?",
        "content": "Its a personal preference, but I can't watch entire series'/movies where the audio doesn't sync. It seems like more and more of these poor dubs are popping up.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h0e6bz/is_there_a_way_to_weed_out_english_dubs_from_the/"
    },
    {
        "id": "1h0dpul",
        "author": "WalkingDadPG",
        "title": "Please help: Netflix Glitch on every browser and in the Windows Store App",
        "content": "Hey everyone,\n\nThe title says it all. Two days ago, everything worked great, now - all of a sudden - I see this screen as soon as a video starts. Sound works, though.\n\nThanks for any ideas you've got.\n\nCheers.\n\nhttps://preview.redd.it/qbks4xraf93e1.jpg?width=4080&amp;format=pjpg&amp;auto=webp&amp;s=1c8b599c6130a48a9a06565700e3105f5462343d",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h0dpul/please_help_netflix_glitch_on_every_browser_and/"
    },
    {
        "id": "1gzi47u",
        "author": "techfinpro",
        "title": "Ted Danson’s New Series ‘A Man On The Inside’ from ‘The Good Place’ Creator Michael Schur Debuts at Number 1 on Netflix",
        "content": "",
        "upvotes": 109,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1gzi47u/ted_dansons_new_series_a_man_on_the_inside_from/"
    },
    {
        "id": "1h07pq0",
        "author": "Frungi",
        "title": "How to find ALL the categories associated with a given title, rather than the other way around?",
        "content": "Netflix has a number of “category codes” like `TV Mysteries` (category code 4366), `Sci-Fi Movies` (3276033), `Japanese Miniseries Based on Romanian Folk Tales` (made that one up), etc. But how can I find out *which* categories a title is in? For example, if you’re looking at *If Anything Happens, I Love You*, how would you find that it’s not only a `Tearjerker` (6384), but a `Visually Striking Sentimental Movie` (907), and whatever else it might fall under?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h07pq0/how_to_find_all_the_categories_associated_with_a/"
    },
    {
        "id": "1h0ac8m",
        "author": "WorriedAd870",
        "title": "Riot Clears the Air on Arcane's Future and New League of Legends Stories",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h0ac8m/riot_clears_the_air_on_arcanes_future_and_new/"
    },
    {
        "id": "1gzr53d",
        "author": "localprincessjaaeli",
        "title": "The Lincoln lawyer ",
        "content": "Fantastic crime series, both seasons are good always keeps you on the edge, shot very well ,little nonsense all business, recommend watching it totally,let me know your thoughts if anyone has seen ",
        "upvotes": 21,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1gzr53d/the_lincoln_lawyer/"
    },
    {
        "id": "1h04p1w",
        "author": "Necessarii_Change913",
        "title": "ADs Crashing App",
        "content": "Every time an ad begins it causes my tv to freeze momentarily, and then kicks me all the way out to my Home Screen, only to have to open Netflix again. It just took me 3 attempts to get through one ad. I’ve seen others mention this on Reddit before dating back to at least a year or so ago. Is anyone else still experiencing this like me? How has Netflix not been forced to fix this issue?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h04p1w/ads_crashing_app/"
    },
    {
        "id": "1gzsf6z",
        "author": "Flafaduce",
        "title": "thanks netflix",
        "content": "yall are great, i was really looking forward to watching resident alien but apparently i can’t have nice things and you decide to remove shows without telling anyone!",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gzsf6z/thanks_netflix/"
    },
    {
        "id": "1h002vs",
        "author": "AdStrict9981",
        "title": "Well, that checks out..",
        "content": "https://preview.redd.it/iam1jrphg53e1.png?width=618&amp;format=png&amp;auto=webp&amp;s=84fcaf68c01f4fd5bca78604b97d00cf4b3ad696\n\nHad to repost at first but as I was looking for my next nature documentary to binge, I came across this contradiction. Thought it was funny so I decided to post it",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h002vs/well_that_checks_out/"
    },
    {
        "id": "1h01305",
        "author": "F_enx",
        "title": "Gift card",
        "content": "I’ve bought a gift card but it’s from another country and when i try to redeem the code it says invalid code, is there any solution for this issue?\n\n\n*If anyone from UAE please let me know ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h01305/gift_card/"
    },
    {
        "id": "1h077g0",
        "author": "Bapposaurus",
        "title": "Netflix on edge",
        "content": "Netflix on edge keeps bugging out my monitor, I redownloaded my gpu drivers with direct drive unistaller, reset the cookies, the only thing that sortof helped was turning off hardware acceleration but then the quality drops to 480p the other browsers just play at 480p no matter if hardware acceleration is on or off",
        "upvotes": 0,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g6e6a60li73e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1h077g0/netflix_on_edge/"
    },
    {
        "id": "1gzmuzr",
        "author": "WesHarrison",
        "title": "Harlan Coben’s New Netflix Series ‘Missing You’ Drops Trailer After Runaway Success Of ‘Fool Me Once’",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzmuzr/harlan_cobens_new_netflix_series_missing_you/"
    },
    {
        "id": "1gzwhsu",
        "author": "SwarupMondol",
        "title": "Can't Log in to Netflix on My Laptop – Need Help!",
        "content": "Hey everyone,I’ve been trying to log in to Netflix on my laptop, but it’s just not working. I’ve double-checked my email and password, and they’re correct. I can log in on my phone without any issues, so I’m not sure what’s going wrong.\n\nAlso I reseted my password. I can log in only in my mobile phone.In laptop Netflix is  saying incorrect password in browser &amp; app.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzwhsu/cant_log_in_to_netflix_on_my_laptop_need_help/"
    },
    {
        "id": "1gzwc8f",
        "author": "Similar_Diver9558",
        "title": "Just In: Menendez brothers will stay in prison until at least next year",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzwc8f/just_in_menendez_brothers_will_stay_in_prison/"
    },
    {
        "id": "1h09pln",
        "author": "Alohabailey_00",
        "title": "Netflix charged me even though my account was on pause. They say they can’t do anything. ",
        "content": "My son got a gift card for his birthday. We started the account in July. Paused it in August for vacation. Customer service said there is no way to pause even though I did it and got a restart email when I unpaused the account yesterday. Come to find out they continued taking money off the gift card. They refused to return the funds and refused to extend the time. What awful customer service. So it’s okay to steal money bc it’s a gift card- apparently there is no way to pause even though I had that option on the website. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h09pln/netflix_charged_me_even_though_my_account_was_on/"
    },
    {
        "id": "1gzu5v8",
        "author": "thepotatotwin",
        "title": "Survey on Streaming Habits - Participants Needed!",
        "content": "Hi everyone,\n\nI’m researching viewer habits on streaming services like Netflix, Amazon Prime Video, and Disney+. I'm looking for data on what shows/movies you watch, favorite genres, and viewing times for a school project, I would really appreciate your help!\n\n**Who can participate?**\n\n* Anyone who uses streaming services.\n* All age groups and backgrounds.\n\n**Privacy:** All responses are anonymous.\n\n**Survey Link:** [https://forms.gle/69PEweKLcwNrQnDeA](https://forms.gle/69PEweKLcwNrQnDeA)\n\nThanks for your help!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzu5v8/survey_on_streaming_habits_participants_needed/"
    },
    {
        "id": "1gzeqm3",
        "author": "aBlastFromTheArse",
        "title": "Pantheon",
        "content": "Any love for the show around here?\nI don't watch a lot of animated shows/anime but this show is absolutely blowing me away. \nThe information about season 2 seems very confusing. Looks like it was created but only released in certain parts of the world? \nCan anyone confirm if season 1 wraps everything up before I get to the end? ",
        "upvotes": 14,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1gzeqm3/pantheon/"
    },
    {
        "id": "1gzxat0",
        "author": "kgbking",
        "title": "Children of the Church Steps",
        "content": "This was an excellent show! Highly recommended.\n\nThe writer does an amazing job of giving the viewer a glimpse into the journeys of the various characters by displaying their histories, dreams, aspirations, desires, and hopes, feelings, etc. This allows the view to resonate and identify with the various characters; however, the writer also depicts both the violence and flaws of the characters and also the multiple forms of violence that these characters are subjected to and struggle against.\n\nThe beautiful humanization of those who are neglected, marginalized, and societally abandoned depicted by the series really allows the viewer to feel the full weight of the tragic and horrific final massacre.\n\nNetflix needs to continue employing such great writers and needs to keep producing content that grapples with such important and heavy themes.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzxat0/children_of_the_church_steps/"
    },
    {
        "id": "1gzrqb7",
        "author": "Adventurous_Lake807",
        "title": "New medical drama Pulse",
        "content": "Netflix announced a promising new medical drama way back in February called Pulse. It supposedly wrapped filming in July. \n\nAnyone have any idea on when it may come out? I haven’t been able to find an update on it. The cast is great \n\nI’ve only been able to see that it may arrive early 2025. Not sure if that’s true or not ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzrqb7/new_medical_drama_pulse/"
    },
    {
        "id": "1h01dff",
        "author": "Notoriously_So",
        "title": "Finishing up cancelled shows",
        "content": "Why wont Netflix finish up some of their most popular cancelled shows? They still hold the rights to a massive amount of shows that ends in 2-3 seasons, and many of them on a cliffhanger ending aswell. Having a special or movie to tie up some of their cancelled shows should be a no-brainer.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h01dff/finishing_up_cancelled_shows/"
    },
    {
        "id": "1gzw79a",
        "author": "Ratboyirl",
        "title": "I think my account was stolen. I tried the Netflix support portal and found it be beyond useless- what do I do?",
        "content": "As the title states, I got an email that my information and then email was changed - google says my email has not been accessed? \n\nI cannot log in, and I'm worried about the integrity of my account. Support is useless. Contacting them does not seem to work or be possible? What do I do?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gzw79a/i_think_my_account_was_stolen_i_tried_the_netflix/"
    },
    {
        "id": "1gzveml",
        "author": "x-_-lux-_-x",
        "title": "Captain Fall - i am so angry ",
        "content": "I just finished watching the animated comedy-not-so-comic Captain Fall and found myself so angry when, hunting down every possible hint of a second season in the making, i found out that not only it will never be renewed for such, but that it's been cancelled mid first season. What the fuck, why all the good shows get cancelled and never get a decent, decorous end? It might be one of my new favorite cartoons and realizing that i will never get to know what happens to Jonathan or how to the things that happened in the last episode that has aired will be sorted out. That's horrible ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzveml/captain_fall_i_am_so_angry/"
    }
]