[
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 78,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m1bshr",
        "author": "Longjumping_Land_977",
        "title": "Netflix releases series about baffling case of woman who disappeared on a cruise ship",
        "content": "",
        "upvotes": 137,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bshr/netflix_releases_series_about_baffling_case_of/"
    },
    {
        "id": "1m16z88",
        "author": "PlatinumOg69",
        "title": "Netflix feels so empty now",
        "content": "I dont know what happened but I haven't had Netflix in like 3 months and first thing I notice is it feels like their isint as much to watch anymore. I go through the horror movie category and it seems really short. Did they get rid of everything? basically all that's left is just Netflix originals which I do enjoy but I've watched probably all of their horror movies and their recent originals aren't that great. ",
        "upvotes": 88,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1m16z88/netflix_feels_so_empty_now/"
    },
    {
        "id": "1m103ae",
        "author": "Infamous-Associate99",
        "title": "Most recent show you couldn’t stop watching",
        "content": "I need something good to watch and I feel like I’ve seen it all. I like psychological thrillers and thrillers in general. If anyone has ever seen wayward pines, I would like to watch something like that",
        "upvotes": 183,
        "comments": 365,
        "media": null,
        "permalink": "/r/netflix/comments/1m103ae/most_recent_show_you_couldnt_stop_watching/"
    },
    {
        "id": "1m1dezx",
        "author": "Task_Force-191",
        "title": "Stranger Things 5 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m1dezx/stranger_things_5_official_teaser_netflix/"
    },
    {
        "id": "1m1d8fe",
        "author": "dailystar_news",
        "title": "Netflix stand by decision to axe The Residence a show they 'loved and championed'",
        "content": "",
        "upvotes": 18,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m1d8fe/netflix_stand_by_decision_to_axe_the_residence_a/"
    },
    {
        "id": "1m1dgyc",
        "author": "Indoril-Nerevar337",
        "title": "Jason Isaacs confirms that \"There no chance\" Batmanglij and Marling let go the story of \"OA\", confirms they had talks about it recently.",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m1dgyc/jason_isaacs_confirms_that_there_no_chance/"
    },
    {
        "id": "1m1bh6p",
        "author": "AccurateAd7960",
        "title": "Building the band - E1-E7 - THOUGHTS",
        "content": "So what are we thinking so far? \nMy thoughts below because I wish I knew someone who watched this 😂\n\nI personally am loving this show, so much talent and appreciated that they did all the showcases in one episode, I really thought they’d annoyingly split it. The pace has been good, and I know they need the cheeky cliffhanger. \n\nSZN 4 - \nI absolutely believe that SZN 4 are the clear winners unless they royally screw up. \nI really wish they’d chosen another name though! They all have such star quality, particularly Donzell and Aaliyah - incredibly powerful voices. Cameron’s is so unique and I feel when Katie gains her confidence she shines.  - plus they seem like nice people. \nThey all scream “I would have such a good time chilling at a party with them all” \nAbsolute fan here of what they are bringing to the table; the energy, the difference in voices, the oomph they give. \n\nSweet Seductions - \nI’m on the anti-Allison train and I know she’s being made the villain, but she just seems like such an awfully narcissistic person that I don’t think they could have edited it that much. it goes to show that chemistry on stage and actually having true friendship in the band really shows in the performance, “Sweet seductions” were not conducive - and I don’t see longevity in the band just based on their toxic relationship growing due to Allison being a drill instructor and treating them like props.i wish the other 2 had ended up with the other girls that Allison ditched. Allison will be the demise of them all. \n\nI think Soulidified and 3quency will also go far. \n3quency really surprised me tonight! But wow, they really did work so well together and seemed like such a unit. It was real sweet having the other girls try on the makeup too. \nAgain, seeing people be friendly to each other and supportive of each other is just going to make me like the band more haha but yeah they aced it. \n\nSoulidified is not my cup of tea BUT I can see how they would appeal to others, working hard as well together, seems like they have the business side of it all down pat and there voices do really work with each other. But some are definitely better than others, it doesn’t seem to matter as much though because they are blending so well. They really were great tonight and had fabulous energy with each other. Song choice suited them for sure. Even if they don’t win I think they’ll get signed elsewhere. \n\nMidnight till morning - I’m not going to lie I got my hopes up that they might try something a bit different with country dusky voices but they seem to just be wanting to fit the cookie cutter. I know it’s for the drama, but Connor is annoying me and the immaturity/insecurity shines whenever he makes a snarky comment about another band. Being Australian I was having hopes for them, but maybe the “laid back” Aussie way is preventing them from pushing themselves further 😘 I’d be so frustrated too if you’d made it that far and your 20 something yr old band mate just wanted to get laid. \nAlso very sad moment when Mason spoke to the late Liam Payne about seeing him way back, and about it being full circle. RIP Liam. \n\nAnd finally ! Gosh this is long - \nSiren society - I think they might leave, which is unfortunate as I actually think they did well tonight and really tried to push themselves with so much choreography. They seem really sweet to each other and supportive. I would have preferred them over sweet seduction any day. \nChoosing a song of one of the judges I don’t think did them well either, way too risky at that stage - and as Nicole said - she has her own way of interpreting her own song, to then emulate that - well it doesn’t work. \n\nAnyway everyone, I am SO KEEN to hear your thoughts on everyone! Who are your favorites? Who do you think is being carried? Who’s going out? \n\n",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bh6p/building_the_band_e1e7_thoughts/"
    },
    {
        "id": "1m151io",
        "author": "AKMac86",
        "title": "Trainwreck: Balloon Boy",
        "content": "Just finished the documentary. I remember when that whole saga was on the news. I think the guy was a nut and just wanted a way to make easy money. His wife was willing to go along with whatever he did. I have a lot of questions that were left unanswered by this documentary. Was he actually planning to go in the flying muffin UFO thing? If not, then why build it so large? If so, then how would he have controlled it? To me this seemed like he wanted to build something big enough that it would seem credible for a small person to fit inside when he called the police.  \n\nAnother thought… when the kid said ‘I thought we were doing this for a show,’ I think it spilled the beans that he was always planning to ‘accidentally’ let the balloon go so he could call the FAA. (Who would ever think to call the FAA?! That clearly seemed planned). So I’m wondering if  it’s possible his kid going missing was not the original plan but just became part of it. Either way, I think jail time was suitable. Thoughts?",
        "upvotes": 19,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1m151io/trainwreck_balloon_boy/"
    },
    {
        "id": "1m19wc6",
        "author": "Commercial-Kitchen78",
        "title": "Cozy shows",
        "content": " I’m waiting for cancer biopsy results and need a show I can distract myself with. Bonus if it will also be enjoyed by my kids 18g and 13b. It needs to be sexual assault free. I grew up without TV and wasn't allowed to watch over Pg 13. So my tastes are pretty cozy and mundane— we did watch milloaire house and loved it! \n\n\n\n",
        "upvotes": 7,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1m19wc6/cozy_shows/"
    },
    {
        "id": "1m10ur1",
        "author": "tkjedi",
        "title": "Best Detective Shows",
        "content": "What are your favorite detective show shows on Netflix ? I just got done watching Dept. Q and loved it.  I do enjoy British crime dramas as well as other ones. What do you recommend?",
        "upvotes": 21,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1m10ur1/best_detective_shows/"
    },
    {
        "id": "1m19ncf",
        "author": "strvwbery",
        "title": "Any recommendations for spy/secret agent shows with romance?",
        "content": "I don't come across a lot of spy shows and I have been wanting to watch and read some media regarding this genre + I am a sucker for romance. Please drop your recommendations! ",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m19ncf/any_recommendations_for_spysecret_agent_shows/"
    },
    {
        "id": "1m16z3x",
        "author": "Indoril-Nerevar337",
        "title": "Zack Snyder thinks Rebel Moon 3 might still happen after he wraps up his current project",
        "content": "",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m16z3x/zack_snyder_thinks_rebel_moon_3_might_still/"
    },
    {
        "id": "1m1hk9q",
        "author": "maurwa",
        "title": "Netflix membership ended before expiry date",
        "content": "Hey! I joined Netflix on 5th July, and my membership was supposed to expire on 4th August. However, when I try to sign in now, it’s asking me to restart my membership. I’ve checked my account, and the payment was successfully debited. What should I do now? I tried contacting their Help Center, but it says “chat is unavailable.”\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m1hk9q/netflix_membership_ended_before_expiry_date/"
    },
    {
        "id": "1m1fmvu",
        "author": "Routine-Yellow-5893",
        "title": "Does the st trailer set up the tone for volume 1 or the entire season?",
        "content": "I don't know it just felt much more like a spectacle than the cozy , ominous and eerie small town horror i associate with the series !\nDo you think the grand spectacle vibe is for volume 1 or the entire season? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1fmvu/does_the_st_trailer_set_up_the_tone_for_volume_1/"
    },
    {
        "id": "1m1f56m",
        "author": "EcstaticPangolin9387",
        "title": "What's up with this household thing?",
        "content": "All of a sudden Netflix has decided my devices are not a \"part of my household\". Is there a way to change this? I get they are trying to mitigate account sharing, but who are they to decide which of my devices are actually me? lol I have a laptop, TV, phone and ipad and it keeps booting all of my devices off whenever I log in and makes me use a temp code.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1f56m/whats_up_with_this_household_thing/"
    },
    {
        "id": "1m0ppf0",
        "author": "indiewire",
        "title": "'Adolescence' Star Erin Doherty Reacts to Her First Emmy Nomination",
        "content": "",
        "upvotes": 42,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m0ppf0/adolescence_star_erin_doherty_reacts_to_her_first/"
    },
    {
        "id": "1m0eujo",
        "author": "cloudmountainio",
        "title": "Trainwreck: Balloon boy",
        "content": "What’s everyone thinking? Was it a hoax or did they truly think he was in the balloon? \n\nI can’t decide tbh. The dad was a bit of an oddball and the fact he called the news station himself made me think 🤔 \n\nInterested in other people’s thoughts. ",
        "upvotes": 144,
        "comments": 450,
        "media": null,
        "permalink": "/r/netflix/comments/1m0eujo/trainwreck_balloon_boy/"
    },
    {
        "id": "1m1ckqg",
        "author": "Standard_Mushroom273",
        "title": "Does anyone else every wonder about the Jailbirds?",
        "content": "I went looking for updates on the people who were featured in Netflix Jailbirds (the OG), like Megan \"Monster\" Hawkins. I could only find info from six years ago. I hope our girls are okay and doing better.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1ckqg/does_anyone_else_every_wonder_about_the_jailbirds/"
    },
    {
        "id": "1m1c0ai",
        "author": "eksukoon",
        "title": "Netflix “Ghosts” Anurag Kashyap After 900-Page Maximum City Script",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1c0ai/netflix_ghosts_anurag_kashyap_after_900page/"
    },
    {
        "id": "1m1bt30",
        "author": "aim-mami",
        "title": "HELP",
        "content": "Netflix keeps asking me to add another member when I’m literally not even sharing it 😩 Why does Netflix always assume I want to add someone? I’m not even using extra devices 😭 It’s always asking me to add a member, like chill Netflix, it’s just me 😤",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bt30/help/"
    },
    {
        "id": "1m1bo5i",
        "author": "prashbash",
        "title": "Building the Band : E4-6",
        "content": "I know all reality TV is scripted kinda but in this show it just seems sooo blaringly obvious that they just want to manufacture some drama for the sake of it!!\nHow is it possible to have a freakin romance thing in the 24hrs that they have been together? \nAnd then go out during the 3 days they have to prepare for a competition?😂😂😂\nIt's so cringey omg whatta cringefest going on! If they want filler episodes just make them sing more songs ughh. \nAnd for some random reason, everyone gives Alison so much importance - which I think it's part of the script again!! Even Nicole compliments her specifically - when Elise is out there killing it. \nAlso didn't the pseudo Harry guy get only 5 likes and barely passed the first audition. How did he end up getting into the bands round when there were so many other eligible people!!\nIt's not even adding to the anticipation by any means - I just end up fast-forwarding the drama shit.\nI was hoping this would go like The Voice but for bands but it just gets more n more bleh.\n#whatdoyathink",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bo5i/building_the_band_e46/"
    },
    {
        "id": "1m0wlxz",
        "author": "tarbinator",
        "title": "Giri/Haji",
        "content": "Oh. My. God.  Hands down this is one of the best series I have ever watched on Netflix.  The character development is so amazing, and it surprised me in the best way.  \n\nIf you haven't watched this yet, add it to your watchlist.  I feel like it's a hidden gem. ",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m0wlxz/girihaji/"
    },
    {
        "id": "1m0dk04",
        "author": "Indoril-Nerevar337",
        "title": "Furiosa is leaving Netflix in 72 hours",
        "content": "",
        "upvotes": 92,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1m0dk04/furiosa_is_leaving_netflix_in_72_hours/"
    },
    {
        "id": "1m0mply",
        "author": "BeautifulPotato33",
        "title": "Netflix drama series recommendations?",
        "content": "I want something to binge watch..\n\nI liked: The empress, the queen’s gambit, la casa de papel, bridgerton, anne with an e, first seasons of elite, love 101, behind your touch.\n\nI don’t like horror.\n\nThank you for any suggestions!",
        "upvotes": 21,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1m0mply/netflix_drama_series_recommendations/"
    },
    {
        "id": "1m0ctw8",
        "author": "Indoril-Nerevar337",
        "title": "Netflix’s Cheaper Plan With Ads Is Winning Over Half of New Subscribers",
        "content": "",
        "upvotes": 76,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1m0ctw8/netflixs_cheaper_plan_with_ads_is_winning_over/"
    },
    {
        "id": "1m172pm",
        "author": "Fragrant_Soil_8044",
        "title": "Anyone watching Restaurant War Thailand? S2EP4 Spoiler Alert",
        "content": "&gt;!Dear who is very talented just quit the show like that?!&lt; I get that he's mentally stable but I think all of them are. He's really a very talented chef although &gt;!He can only make a dessert.!&lt;  I feel like something else personally is going on with him. It seems like it didn't matter to him even though every one already affirmed him that he's a good chef. Maybe his burnout is affecting his family or something else. Whatever it is, I hope he could explain more because it was really shocking that he is just quitting when they &gt;!already won twice.!&lt;",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m172pm/anyone_watching_restaurant_war_thailand_s2ep4/"
    },
    {
        "id": "1m16sk5",
        "author": "One-Emu-8210",
        "title": "Suggest movies/shows/anime that have the same vibes/genre as these:",
        "content": "- Girl from nowhere\n- Parasite (anime)\n- Sweet Home\n- Migi &amp; Dali\n- Dahmer\n\nFor reference, I have already tried watching the following:\n- Cabinet of Curiosities\n- Japanese Tales of the Macabre\n\nHowever, I get bored easily. Do you guys have other shows that have the same vibes/genre?\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m16sk5/suggest_moviesshowsanime_that_have_the_same/"
    },
    {
        "id": "1m16c6z",
        "author": "Open-Guava-3779",
        "title": "Looking for a Netflix show about a deadly 'wolf escape' game",
        "content": "Hi! I saw a preview on Netflix of a series or movie where a group of young people are told they must play a game about escaping from the wolf, and only one will survive. One of them is assigned the role of the hunting wolf, and for a moment he goes into shock.\n\nI didn’t save the name and I don’t know how to search for it. I think it was listed under the mystery or thriller category.\n\nAny idea what it might be?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m16c6z/looking_for_a_netflix_show_about_a_deadly_wolf/"
    },
    {
        "id": "1m143vc",
        "author": "Fallenivyyy",
        "title": "Missing downloads",
        "content": "I’m in Greece right now and I was trying to check my downloads for the flight home and they’ve all gone? And when I try to download anything else it says ‘your advert-supported plan is not available in this region’ and I need to upgrade. I’ve never had this before so does anyone know if this is a new thing or if there’s a way around it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m143vc/missing_downloads/"
    },
    {
        "id": "1m0cnxw",
        "author": "Ok_Nobody3894",
        "title": "Old Guard 2 - did you notice?",
        "content": "So here’s my Old Guard 2 questions: \n\n1- So Quynh is out, but she speaks modern language fluently after 500 years? Also she is completely sane and in control? Does this whole immortality and healing thing applies to mental health as well? \n\n2- did they use young face filters on Charlize ? She doesn’t look normal. Too smooth and toned face like instagram filters. Or is it just me? \n\n3- Discord - completely useless character?! She is the first immortal. Ok, but no background story at all? Tua’s speech implies - he said “she is the first immortal by design”. Meaning what?? She was designed? Or is it some English phrase I’m poorly understanding (English isn’t my 1st language).\n\n4- the whole immortality lore - Nile being the last one and she is the destroyer because she has the same mark with Discord. Ok but how and who or what decides it? Why now? And how exactly Book gave up his immortality to Andy? Just by thinking about it? I thought there may be some hug or physical touch, some glow or at least something that implies “hey it’s done”. But just thinking about it transfers immortality? \nEven let’s say Nile is the destroyer, then how the F the other immortals died before? How Discord is mortal? Is that because their mentality or body gives up? Discord doesn’t seem like she gave up on her immortality. I mean in that case Book would’ve died long ago. How those book lore’s created and by whom? There were times when immortals were known or designed ? I thought Andy was just worshipped as a Goddess. But that was it.\n\n5- storyline was WAAAY off - Andy’s mortality and second immortality wasn’t even revealed. That would be badass if Discord just thought Andy was mortal, may be she would even try to approach her and lie about working together for cure, and then betray her by taking all other immortals, and in the last fight she learns Andy is immortal again, which is what she wants the most, and it would anger her so much and that would’ve lead to more aggressive fight sequence? That would be cool. Now, Quynh herself is mortal too. And she is so cool with it? And nobody said to Quynh “yo, Discord actually let you get captured and thrown into the ocean.” I was like “SAY SOMETHING TO HER”.  Quynh would turn against Discord in the end. And this whole bomb sequence? That was just out of nowhere? “Oh hey come to me or I will blow up this country?” And then “I wanna end you because you help people”. Excuse me ?! 😂 did they really sat down and wrote this ? I mean,  these are incredibly strategic immortals fought thousands of wars over the millennias. And this is the sequence you write for these characters’ battle? Chatgpt could’ve written better scenario than this. Discord’s stabbing Tua in the beginning - for what exactly? “i need some books about myself so people don’t know who am I, so lemme stab your immortal ass real quick”. Yeah OK. They were literally pals for centuries, he can tell everyone. And Tua is doing what exactly? Immortal librarian? Sounds cool tho 😂 And what was the scene with Quynh and Andy in the past? No explanation? Am I missing something ? I hope I do, cause that was left out. \n\n6- Fight sequences - the 1st movie fight sequences were the highlight of the movie, they were delicious to watch, old combat styles mixed with modern styles? There was a whole video about choreographing Andy’s fight style. They actually spend time on it. Now in this one? It seemed robotic, weird. First fight scene in the mansion was ok, but other scenes later on? Downgrade from the 1st movie. I was expecting something epic in the last battle with Discord and Andy. And that scene was like someone sketched a good portrait and a toddler scribbled on it. There were good parts but execution and delivery was OFF. \n\n7- acting and directing - Quynh actress: yeah, she didn’t deliver the character. She was slow, kept zoning out of the character, she looked badass and fights scenes were ok, but when she spoke she was speaking like someone just learned how to act, the only time I felt power in her was when she spoke mandarin when she cursed Andy. I was like “damn girl where was that power in other scenes before?” Uma Thurman was just chilling in the movie. She was like - yeah lemme take a walk around the set and you capture me occasionally. She looked bored AF. I heard that she wasn’t interested in the project because the shooting schedule kept changing. Can’t really blame her if that’s the case. \n\nIt just doesn’t feel right to see a sequel to this movie to be done this way. Old Guard 1 was epic. I’m sad. \n",
        "upvotes": 19,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m0cnxw/old_guard_2_did_you_notice/"
    }
]