[
    {
        "id": "1h3xmgd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1h3xmgd/la_piola_friends_meetup/"
    },
    {
        "id": "1h3xmg1",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1h3xmg1/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1haibfg",
        "author": "Major-Maintenance684",
        "title": "Sports bar/restaurant in torino",
        "content": "Hi,\n\nI'm on a business trip in Torino. What would be the best spots to watch the Champions League tomorrow and Wednesday? I note that Juventus is playing on Wednesday.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1haibfg/sports_barrestaurant_in_torino/"
    },
    {
        "id": "1hag9tk",
        "author": "New-Chocolate1637",
        "title": "Looking for brunette girl met yesterday at Pecchia city center ",
        "content": "Yesterday I was in Pecchia restaurant and met a very cool brunette girl that was basically eating at the table in front of me. \nShe was in a group with other friends or colleagues and all of them were foreigners - I would say from a Mediterranean country like Turkey or Greece but not sure. The majority of them had their own reflex camera, so I guessed it was a group of photographers or something like that.\nWe had a very quick conversation at the end of our dinners and I even took their group picture but didn't have the chance to ask for her name. \n\nIf someone could help or knows here it would be great ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1hag9tk/looking_for_brunette_girl_met_yesterday_at/"
    },
    {
        "id": "1hadwrl",
        "author": "Few_Willingness_5198",
        "title": "lavoro a Torino e limitrofi?",
        "content": "ho un amico che ospito e vorrebbe cercare lavoro da queste parti, gli va bene anche lavori umili, pulizie spazzacamini, umidificatore per francobolli umano...\n\nsono anni che non guardo il mondo del lavoro e non so come sia al momento,  consigli?",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1hadwrl/lavoro_a_torino_e_limitrofi/"
    },
    {
        "id": "1h9sbx0",
        "author": "_L_-",
        "title": "NON puoi dire di aver vissuto il Piemonte senza... ",
        "content": "Simile ad un altro post che avevo fatto sul \"non puoi dire di aver vissuto a Torino senza aver fatto queste cose\". \n\n\nQuali cose suggerite di fare a un non-piemontese che abita in Piemonte? \nMi sto per ritrasferire e voglio approfittarne di quest'ultimo anno qui per vedere/fare/mangiare tutte le cose belle che il Piemonte offre, ",
        "upvotes": 20,
        "comments": 41,
        "media": null,
        "permalink": "/r/torino/comments/1h9sbx0/non_puoi_dire_di_aver_vissuto_il_piemonte_senza/"
    },
    {
        "id": "1ha507u",
        "author": "Outrageous_Pea4161",
        "title": "Volontariato Natale 2024",
        "content": "Voglio fare il volontario il 25 dicembre, qualcuno sa indirizzarmi in qualche associazione? ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ha507u/volontariato_natale_2024/"
    },
    {
        "id": "1h9o7eu",
        "author": "Eye-Dust",
        "title": "Componentistica elettronica",
        "content": "Buona sera, conoscete qualche negozio su Torino o provincia che venda condensatori, resistenze ecc al dettaglio?",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1h9o7eu/componentistica_elettronica/"
    },
    {
        "id": "1h9vxnm",
        "author": "Avy_isBored",
        "title": "Sapete se c’è coda per la biglietteria all’xmas comics?",
        "content": "chiedo perché le mie amiche non riescono a fare il biglietto online e hanno optato per la biglietteria però volevo capire quanto possano metterci ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1h9vxnm/sapete_se_cè_coda_per_la_biglietteria_allxmas/"
    },
    {
        "id": "1h8z47n",
        "author": "PhilipDrost",
        "title": "Carrefour prezzi sullo scontrino più alti di quelli esposti?",
        "content": "Sono a Torino non da molto e ho già notato due volte che al Carrefour express di fianco a casa nel quale vado abitualmente, mi ritrovo prezzi più alti sullo scontrino di quelli che c'erano scritti... non applicano gli sconti! Come fare a dirglielo senza incazzarmi? Ha senso parlarne con i lavoratori o provare a contattare l azienda?",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1h8z47n/carrefour_prezzi_sullo_scontrino_più_alti_di/"
    },
    {
        "id": "1h8wsf5",
        "author": "Tita_63",
        "title": "Luoghi del cuore",
        "content": "Votate Rimella museo Filippa luoghi del cuore FAI",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rLoOcngFffH1ZkZf35fFoMqQXrmzxa6HCkHGDDnhsBU.jpg?auto=webp&amp;s=c9964cb422a09a1ba5682f49246242f3d3e0747c"
        },
        "permalink": "/r/torino/comments/1h8wsf5/luoghi_del_cuore/"
    },
    {
        "id": "1h85w69",
        "author": "cawalli",
        "title": "Road to Piazza Vittorio ",
        "content": "",
        "upvotes": 100,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tytmc3uod95e1.jpeg?auto=webp&amp;s=70e03785d26da34ea5813ec8f0fae347a1a23d34"
        },
        "permalink": "/r/torino/comments/1h85w69/road_to_piazza_vittorio/"
    },
    {
        "id": "1h8q1sx",
        "author": "Anonymous_77_",
        "title": "Looking for a job as an English speaker",
        "content": "Hello, Im a 19 year old studying business and Im desperate to find a job in torino without speaking italian does anyone know if it’s possible?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1h8q1sx/looking_for_a_job_as_an_english_speaker/"
    },
    {
        "id": "1h7ydw3",
        "author": "Lentepubblica",
        "title": "Un automobilista ha visto la sua multa per eccesso di velocità annullata grazie a una sentenza del Giudice di pace: il motivo sta nel fatto che l’auto dei vigili era in quel momento, paradossalmente, in divieto di sosta.",
        "content": "",
        "upvotes": 21,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4NfSXdYW97dkZbCI06cnfrHlUd3JlCqdD6wjK_1Ec_o.jpg?auto=webp&amp;s=0c398a98ca8866b8d5094d505d07c223b1b9aa11"
        },
        "permalink": "/r/torino/comments/1h7ydw3/un_automobilista_ha_visto_la_sua_multa_per/"
    },
    {
        "id": "1h7xfjr",
        "author": "Barde_",
        "title": "Bei posti in montagna in cui andare con lei?",
        "content": "Stavo cercando qualche posto carino in montagna da visitare con la mia ragazza. Abbiamo la possibilità di muoverci con l'auto ma se fosse possibile avvicinarsi con i mezzi sarebbe meglio.  \nL'ultima volta siamo andati al lago di Laux e il lago delle rane. Siamo principianti, quindi magari non rifugi a 3000mt d'altezza grazie :)",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1h7xfjr/bei_posti_in_montagna_in_cui_andare_con_lei/"
    },
    {
        "id": "1h7dgtq",
        "author": "Alternative-Oil2330",
        "title": "Inquinamento Torino",
        "content": "Buonasera a tutti,\nA breve mi trasferirò a Torino e ho visto che sia in città sia in tutti i comuni limitrofi vi sono normative stringenti per l'inquinamento. Cercando online mi è apparso il mov'in che con un costo irrisorio permette di usare in maniera limitata i vecchi veicoli. Qualcuno lo utilizza? La richiesta per l'installazione è lunga e tortuosa? Vi sono anche altre casistiche per circolare con un diesel euro 3?\nGrazie a tutti",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1h7dgtq/inquinamento_torino/"
    },
    {
        "id": "1h7db9z",
        "author": "Abradores",
        "title": "Palestra kickboxing o muay thai agonistica a Torino?",
        "content": "Ciao a tutti, eventualmente mi piacerebbe fare muay thai oppure kickboxing , ed eventualmente andare a fare tornei, sono 28m al momento.\n\nMi piacerebbe avere consiglio su quale palestra scegliere.\n\nUtilizzero la ss24 per muovermi dal mio paesino nella palestra, quindi anche altre palestra possono essere ok fuori torino, io penso : Collegno,Rivoli,Susa,Alpignano,Avigliana e Grugliasco.\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h7db9z/palestra_kickboxing_o_muay_thai_agonistica_a/"
    },
    {
        "id": "1h79rxk",
        "author": "Jumpy_Material_439",
        "title": "Hiking recommendations in Gran Paradiso next week?",
        "content": "Traveling to Cogne with beginner hikers. Any recommended short and safe hikes (less than 8km) in Gran Paradiso that is still open now?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h79rxk/hiking_recommendations_in_gran_paradiso_next_week/"
    },
    {
        "id": "1h7863d",
        "author": "Legal_Vegetable_3964",
        "title": "Come fare rapporto con gli torinesi ",
        "content": "Io sono arrivato qua da poco, ho sempre vissuto fuori di Italia , per mi sto trovando un po in difficoltà per creare delle amicizie qua, specialmente con ragazze. Ne ho già fatto alcuni amici uomini, pero sono fidanzati quindi negli weekend fanno i cazzi loro…\nQualche consiglio su abiti o costume dei torinese per aiutarmi a creare un rapporto?\n",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1h7863d/come_fare_rapporto_con_gli_torinesi/"
    },
    {
        "id": "1h7e1mb",
        "author": "DelusionalPanda-",
        "title": "Cinnamon rolls ",
        "content": "Hey guys, do you know a pasticceria that sells cinnamon rolls? If so, I’d appreciate your suggestions.\n\nCheers!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1h7e1mb/cinnamon_rolls/"
    },
    {
        "id": "1h6s96v",
        "author": "itmegiadaaa",
        "title": "Zona massaua",
        "content": "Qualcun* per uscire la sera in zona massaua/Parella? 420 friendly 🌱",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1h6s96v/zona_massaua/"
    },
    {
        "id": "1h6ry31",
        "author": "hammet01",
        "title": "Tennis principiante",
        "content": "M30, trasferito a Torino da poco. Ho iniziato da 2 mesi a prendere lezioni di tennis, cerco qualcuno con cui fare qualche scambio/partita :)",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h6ry31/tennis_principiante/"
    },
    {
        "id": "1h6d8cf",
        "author": "Distinct_Location910",
        "title": "Mancia ai tecnici: sì o no? Consigli per chi si è appena trasferito!\n\n\n\n\n\n\n\n\n\n\n",
        "content": "Ciao a tutti,\n\nMi sono appena trasferito a Torino con la mia famiglia dal Belgio e avrei una domanda: è normale lasciare la mancia ai tecnici? Parlo di persone che installano internet, consegnano elettrodomestici o fanno riparazioni in casa. Abbiamo già avuto qualche consegna e devo dire che tutti sono stati molto gentili e disponibili. Il nostro italiano è ancora molto basilare e finora non abbiamo mai lasciato mance, anche per non sembrare maleducati o dare l’impressione sbagliata, visto che non navighiamo certo nell’oro!\n\nVorrei capire se è una cosa che si usa fare qui, così da essere preparati per il futuro. Qualche consiglio?\n\nGrazie mille!",
        "upvotes": 11,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1h6d8cf/mancia_ai_tecnici_sì_o_no_consigli_per_chi_si_è/"
    },
    {
        "id": "1h6o79q",
        "author": "LimeLeast9996",
        "title": "Monthly bills in Torino?",
        "content": "https://preview.redd.it/vaureoyqqv4e1.png?width=1323&amp;format=png&amp;auto=webp&amp;s=c417c4b3ad94a2549ca06e12f72e6a7f17bb38eb\n\nHi. I moved to Torino in April this year and rented an apartment. I am paying my monthly bills regularly to my landlord, and I remember that in April, when I moved in, my landlord asked me to pay the waste tax (he explicitly said it's once per year), which I did. However, he just sent me another message (see above).  \n\n\nMy question is, if I had already paid the waste tax in April, do I have to pay it one more time now?   \nMy second question is, is it standard to pay for heating 5 months in advance? (the heating season only started a few weeks ago)\n\nThank you!",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1h6o79q/monthly_bills_in_torino/"
    },
    {
        "id": "1h6r42h",
        "author": "RoRoRoub",
        "title": "Cost of living for a family of 3 moving to Turin ",
        "content": "Hi, everyone. I've gotten a job offer from a company in Torino, and our family of 3 is planning to move there from Finland. I was wondering what the cost of living would generally be to live comfortably there (with a few hundred euros/month for savings)?\nFor reference, my gross pay would be 4000 Euros/month, and we'd like our kid to attend an English daycare/kindergarten. For the foresseable future, I might be the sole provider for my family as I'm unsure how long my wife might take to find a job. I've tried to run some numbers from a few sites through a google search, and it seems the cost of private kindergarten will hike the living expenses considerably, to a little over 4000 Euros/month. Obviously, this would be unsustainable for us. Am I missing something with the above estimates? Kindly appreciate your help. Thanks.",
        "upvotes": 1,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1h6r42h/cost_of_living_for_a_family_of_3_moving_to_turin/"
    },
    {
        "id": "1h6sz30",
        "author": "Automatic_Value96",
        "title": "Dance School Recommendations in Turin",
        "content": "Hi everyone! I'm looking for a dance school in Turin, preferably one that welcomes international. My Italian isn't so good, and I'm a bit nervous about communication as an introvert. If you know of any good options, please share. Thank you!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h6sz30/dance_school_recommendations_in_turin/"
    },
    {
        "id": "1h5ss1p",
        "author": "mo_one",
        "title": "Un'auto è andata a fuoco a corso regina margherita",
        "content": "",
        "upvotes": 81,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0dmbocgj4o4e1.jpeg?auto=webp&amp;s=e8f18e77f57a213785bcffab5a09c119a17654ac"
        },
        "permalink": "/r/torino/comments/1h5ss1p/unauto_e_andata_a_fuoco_a_corso_regina_margherita/"
    },
    {
        "id": "1h6c4r5",
        "author": "Lamassaia",
        "title": "Fan dello sci",
        "content": "Chi fan dello sci per questa stagione?",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1h6c4r5/fan_dello_sci/"
    },
    {
        "id": "1h5nqbb",
        "author": "mo_one",
        "title": "Ma come cazzo si fa a convalidare il biglietto se tutte le macchinette sul tram sono fuori uso?",
        "content": "Oggi ero salito sul 3 per andare in uni, e quando vado a convalidare il biglietto, vedo sulla macchina \"fuori uso\" ci provo cmq, ma ovviamente non funziona, quindi seplicemente spero che il controllore non ci sia, perché tanto quando mai ci sono? Però ovviamente dopo due minuti mi ritrovo il &gt;!porco dio!&lt; di controllore accanto a me che controlla la persona che mi sta vicino, quindi corro verso l'altra macchinetta ed oviamente &gt;!porca madonna troia!&lt; anche essa è fuori uso (sorprendente). Quindi non mi tocca altro che scendere alla prossima prima che becchi me, e salire sul tram successivo. \n\nMa come &gt;!gesù porco!&lt; fanno ad esigere che tu paghi il biglietto se le loro fottutissime macchinette m'anco funzionano? Ma come cazzo fa ad essere mia responsabilità ad installare e capire come funziona una app di merda, così è più facile per loro a fottermi i soldi, anche se pagare pagare il tram con il biglietto aquistato in tabaccheria è un modo del tutto leggittimo? Ceh, secondo voi, se gli dicevo che non funzionavano le macchinette mi avrebbe cmq fatto la multa? Perché poi c'era una terza macchinetta in fondo — che non avevo controllato, perché il tram era stra fottutamente imbottito di gentaglia — e se essa funzionava allora di sicuro me lo metteva in culo, perché quando mai i controllori della GTT hanno qualità umane come l'empatia? Poi non gli volevo parlare perché non ho voluto beccarmi la multa. \n\nMa sto punto dev'essere intenzionale, loro mettono le macchinette fuori uso, così possono raccogliere il big cash da tutte le multe dai poveri sfigati che sono incapaci di usare le arti arcane magiche per far funzionare la macchinetta così posso pagare il biglietto alla nobile GTT che sacrifica tutto pur per provvedere un sevizio di qualità agli ingrati villani cittadini di Torino.\n\nMa sul serio, che avrei dovuto fare in una situazione del genere?",
        "upvotes": 57,
        "comments": 46,
        "media": null,
        "permalink": "/r/torino/comments/1h5nqbb/ma_come_cazzo_si_fa_a_convalidare_il_biglietto_se/"
    },
    {
        "id": "1h6ew7u",
        "author": "gianlucadinat",
        "title": "Tecnico inutile",
        "content": "Prendo un giorno di ferie per aspettare il tecnico Fastweb per un trasloco di linea (dal terzo piano al quarto piano eh, non ho cambiato quartiere) si presenta puntualissimo e mi dice: “come immaginavo non si può far nulla, la ricontatteranno per fissare un nuovo appuntamento”\nSono incazzato come una bestia",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1h6ew7u/tecnico_inutile/"
    },
    {
        "id": "1h5wwbu",
        "author": "fabi-to",
        "title": "Corso per imparare a fare il pane ",
        "content": "Ciao bellezze. Qualcuno conosce un posto che faccia corsi per imparare a fare il pane a Torino? Mi sembra un regalo carino da fare ma non trovo molte opzioni. \n\nGrazie!!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h5wwbu/corso_per_imparare_a_fare_il_pane/"
    },
    {
        "id": "1h5swn6",
        "author": "NoPromotion1328",
        "title": "CAPODANNO TORINO",
        "content": "Io e la mia ragazza (24 e 20 anni) passeremo il capodanno a torino, ma è la prima volta per entrambi che vediamo la citta e di conseguenza non sappiamo minimante cosa fare. Siamo disperatamente in cerca di idee su cosa fare o inviti! ",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h5swn6/capodanno_torino/"
    }
]