[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1opy07f",
        "author": "DistributinOfWealth",
        "title": "Appartamenti vuoti (senza cucina né nulla) ma affitti altissimi… chi ci investe?",
        "content": "Raga, ma qualcuno mi spiega questa cosa?\n\nSto guardando annunci di appartamenti in affitto a Torino e vedo un sacco di case completamente vuote, senza cucina, senza mobili, spesso pure da sistemare un minimo… eppure chiedono affitti altissimi.\n\nCioè, uno dovrebbe pagare centinaia (o migliaia) di euro di affitto **e** pure spendere soldi per montarsi una cucina e arredare tutto da zero? Ma chi lo fa? Che senso ha investire su un posto che non è tuo e che magari fra 4 anni devi lasciare?\n\nMi sfugge la logica… è normale questa cosa qui o è un fenomeno recente post-pandemia / post-mercato-impazzito?",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1opy07f/appartamenti_vuoti_senza_cucina_né_nulla_ma/"
    },
    {
        "id": "1oq1urn",
        "author": "Ipazia85",
        "title": "Iniziare a giocare D&amp;D",
        "content": "Ciao a tutti, vorrei iniziare a giocare a D&amp;D magari anche ad assistere a partite in modo tale da poter imparare, avete qualche consiglio se ci sono posti che organizzano? Purtroppo mi sono trasferita a Torino da qualche anno ma non conosco bene la città e non ho amicizie, grazie. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oq1urn/iniziare_a_giocare_dd/"
    },
    {
        "id": "1opmijg",
        "author": "Marui1988",
        "title": "Vicini di casa insopportabili",
        "content": "Ciao, ho 2 figlie piccole, 8 mesi e 2 anni, e nell'ultimo mese i vicini del piano di sotto hanno iniziato regolarmente con serate di karaoke, cori, spostamento mobili, urla e quant'altro. \n\nLa peggiore è stata alle 5 venerdì scorso, che con una figlia che si sveglia alle 6 vuol dire aver fatto la notte in bianco, ma non ho chiamato i carabinieri perchè era venerdì e non voglio passare per il solito torinese rompipalle. \n\nIeri notte però alle 3 son dovuto scendere e stare attaccato al campanello di sti animali, giorno lavorativo e sempre solita storia. \n\nAh in tutto questo ovviamente quando gli suoni non escono e non si confrontano neanche, porta chiusa e fanno finta di non sentire. cosa si può fare a riguardo?",
        "upvotes": 22,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1opmijg/vicini_di_casa_insopportabili/"
    },
    {
        "id": "1oq10kt",
        "author": "FutureVirtual6811",
        "title": "Health Insurance for Residence Permit",
        "content": "Is it common practice to not include health insurance in the residence permit application until the fingerprint appointment? My friend had healthcare insurance was an absent document in his immigration portal because he didn’t include it in his application post. He said he will give a brand new 1 year insurance policy just before his fingerprint appointment so the permit legth of 1 year starts shortly before his fingerprint appointment instead of it starting shortly before his postal application. Is this true? Is he not supposed to send the absent document immediately?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oq10kt/health_insurance_for_residence_permit/"
    },
    {
        "id": "1opti8f",
        "author": "skier-jon",
        "title": "Where to watch American Football?",
        "content": "Looking specifically to watch the patriots/buccaneers game this Sunday (9/11/25) are there any bars that will have it on a tv? Any chance any bars will play it with audio?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1opti8f/where_to_watch_american_football/"
    },
    {
        "id": "1opvads",
        "author": "NinaKrunz",
        "title": "Pareri CSM Torino",
        "content": "Ciao a tutti! Qualcuno ha mai usufruito dei servizi al Centro di Salute Mentale di Torino?\n\nIn particolare il CSM di via Petitti e relativamente a visite psichiatriche. Sarebbe un gran risparmio economico rispetto ad una visita privata ma non vorrei neanche che sia un gran perdita di tempo (non sono di Torino e per esperienza personale purtroppo in altre città lo è stata).\nSe ti va raccontami la tua esperienza, sarebbe di grande aiuto!\n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1opvads/pareri_csm_torino/"
    },
    {
        "id": "1opu27f",
        "author": "Hyzev_",
        "title": "Study group",
        "content": "Hi guys, last week I make a post on this sub to looking for people to form a study group (in the evening and weekend).\n\nSo far, we are seven, with a age between 27 and 30 (but even if you're younger, is not a problem). \nIt doesn't matter what degree course you're on. \n\nThe group is a way to find some motivation, spend our breaks together and sometimes go for a beer after studying.\n\nIf you are interested write me a direct message!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1opu27f/study_group/"
    },
    {
        "id": "1optpn6",
        "author": "martaseesthings",
        "title": "Zone Torino per alloggiare weekend",
        "content": "Salve verrò a Torino 3 Giorni per vedere qualche mostra e fare un giro. Quali sono le zone migliori per alloggiare vicino al centro? Grazie! ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1optpn6/zone_torino_per_alloggiare_weekend/"
    },
    {
        "id": "1oph90t",
        "author": "X_RayMind",
        "title": "Fine settimana a torino",
        "content": "Ciao, questo weekend arriverò a Torino per il derby e sarò in città tra venerdì notte e domenica pomeriggio. \nAl solito, consigli su cose \"\"\"\"non turistiche \"\"\"\" da vedere ?\n\nGrazie",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oph90t/fine_settimana_a_torino/"
    },
    {
        "id": "1oplf4u",
        "author": "GamerSince1996",
        "title": "Serate a torino questo fine settimana",
        "content": "Ciao, siamo due ragazzi di 29 e 28 anni. Cerchiamo qualche club/discoteca con musica techno questo fine settimana. Consigli? \n\nSe qualcuno volesse aggiungersi è ben accetto ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oplf4u/serate_a_torino_questo_fine_settimana/"
    },
    {
        "id": "1opxnrb",
        "author": "Current_Emu4588",
        "title": "Ci sono teenagers su questo sub?",
        "content": "Chiedo perché mi sembra di essere l'unic*",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1opxnrb/ci_sono_teenagers_su_questo_sub/"
    },
    {
        "id": "1ooabb4",
        "author": "Iaco_V8",
        "title": "Il Museo Egizio di Torino non è più il secondo museo più grande al mondo interamente dedicato all'antico Egitto",
        "content": "Oggi, 4 novembre 2025, ha aperto al pubblico il Grand Egyptian Museum a Giza, che è ufficialmente il più grande museo egizio al mondo, con oltre 100.000 reperti su 500.000 m².\n\nCon questa apertura, il Museo Egizio di Torino perde il titolo di secondo museo interamente dedicato all’antico Egitto più grande al mondo.\n(Specifico “interamente dedicato” perché non mi è chiaro se la sezione egizia del British Museum sia più grande o meno)\n\nMolti reperti verranno trasferiti gradualmente dal Museo del Cairo al nuovo Gran Egyptian Museum, ma il museo storico del Cairo resterà aperto, diventando il secondo museo egizio più grande al mondo.",
        "upvotes": 295,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9my4c7gye9zf1.jpeg?auto=webp&amp;s=0de5508e480bae15b3a2718e9724d403bb1edf4d"
        },
        "permalink": "/r/torino/comments/1ooabb4/il_museo_egizio_di_torino_non_è_più_il_secondo/"
    },
    {
        "id": "1opa4my",
        "author": "Agosto05",
        "title": "Consigli per un viaggio a Torino",
        "content": "Io e la mia ragazza siamo due ragazzi appena maggiorenni e vorremmo concederci una vacanza di tre giorni a Torino sotto Natale, però non conosco veramente la città e quindi volevo un pò di consigli su dove stare e le zone da evitare. Tra le opzioni avevamo un hotel vicino alla stazione di Porta Nuova o un appartamento vicino piazzia Vittorio Veneto; come vi sembrano le opzioni? \n\nSono curioso di sentire le opinioni di qualcuno che ci vive.",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1opa4my/consigli_per_un_viaggio_a_torino/"
    },
    {
        "id": "1op0wtc",
        "author": "Least-Gear330",
        "title": "Qualcuno per visita alla Gam?",
        "content": "Ciao!\nCome da titolo, questo venerdì o il prossimo pensavo di andare a visitare la Gam, e mi chiedevo se ci fosse qualcuno interessato ad aggiungersi, come occasione per fare nuove amicizie :)\n\nEdit: giustamente mi è stato fatto notare che qualche informazione in più su di me non avrebbe guastato. Sono uno ragazzo di 22 anni, studente di Giurisprudenza, interessato a fare nuove amicizie su interessi comuni (letteratura, arte, politica...) ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1op0wtc/qualcuno_per_visita_alla_gam/"
    },
    {
        "id": "1opfrak",
        "author": "Heart0fPaper",
        "title": "Corsi di ballo per adulti",
        "content": "Ciao a tutti! Sapreste indicarmi qualche scuola di ballo per adulti (M33 nel mio caso) che insegni la shuffle/Melbourne shuffle? Grazie a chiunque mi darà indicazioni! \n\nP.S. anche la electro swing si avvicina molto? Chiedo per ignoranza in materia",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1opfrak/corsi_di_ballo_per_adulti/"
    },
    {
        "id": "1op52nu",
        "author": "saribbeccamoingiro",
        "title": "Torino. Luoghi insoliti",
        "content": "Quali luoghi poco conosciuti vale la pena visitare a Torino avendo a disposizione un weekend?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1op52nu/torino_luoghi_insoliti/"
    },
    {
        "id": "1ooym63",
        "author": "Bruno_Barbiere",
        "title": "Stiamo vivendo il rinascimento culinario dei piatti anni ’80 in Piemonte? Confermate amici torinesi?",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6tny1h7wsezf1.jpeg?auto=webp&amp;s=43d7ad988b612a0d4f793dfd2f87c45ef6de36ea"
        },
        "permalink": "/r/torino/comments/1ooym63/stiamo_vivendo_il_rinascimento_culinario_dei/"
    },
    {
        "id": "1op2534",
        "author": "Worried_Technician38",
        "title": "Commercialista che puo parlare Inglese / English-Speaking Commercialista",
        "content": "Ciao Tutti!  Sto cercando per una commercialista che parla inglese.  Se avete alcuni consigli, fammi sapere.  Grazie!\n\n\\-\n\nHey Y'all, looking for an english-speaking commercialista to talk over my organizing my finances.  If you have any recommendations or referrals, would be very much appreciated.  Thanks!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1op2534/commercialista_che_puo_parlare_inglese/"
    },
    {
        "id": "1oopspb",
        "author": "ExpensiveCarrot7026",
        "title": "Things to know about Torino before going there?",
        "content": "Hey, i may soon be moving to Torino from Australia. Is there anything I should know about the city and its people before going. Btw I speak English but I am trying to learn italian.",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1oopspb/things_to_know_about_torino_before_going_there/"
    },
    {
        "id": "1oob43d",
        "author": "nickname1917",
        "title": "ATP Finals...",
        "content": "praticamente la cronaca locale è al delirio:\n\n\\- la stanza dove alloggia sinner\n\n\\- il ristorante dove mangia sinner\n\n\\- l'ospedale dove fa beneficienza sinner\n\n\\- l'automobile con cui è arrivato sinner...\n\nquando finiscono le ATP finals?",
        "upvotes": 14,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1oob43d/atp_finals/"
    },
    {
        "id": "1oogqh6",
        "author": "Independent-Job3535",
        "title": "Ciao, sto cercando dei posti carini per andarci con la mia ragazza, avete consigli?",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oogqh6/ciao_sto_cercando_dei_posti_carini_per_andarci/"
    },
    {
        "id": "1oo9znx",
        "author": "eliss00000000",
        "title": "Cerco nuove amicizie/gruppi per uscite",
        "content": "Ciao a tutti, sono una ragazza di 25 anni che vive a Torino da 3 per l'università ed è in procinto di laurearsi tra qualche mese (finalmente ahah). Ho diverse amicizie a Torino, ma non un gruppo numeroso con cui organizzare uscite, per cui mi chiedevo se esistessero dei gruppi con questa finalità in cui essere inserita, oppure se qualcuno ha intenzione di crearne uno mi scriva pure🤗",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1oo9znx/cerco_nuove_amiciziegruppi_per_uscite/"
    },
    {
        "id": "1ooeaf3",
        "author": "DistributinOfWealth",
        "title": "Come si vive in questa zona? (San Salvario)",
        "content": "https://preview.redd.it/y2xeucow4azf1.png?width=1256&amp;format=png&amp;auto=webp&amp;s=b7db23cbf6338aa19a659b5d6a62c750b1eb3fc1\n\n  \n  \nproprio all'angolo dell'Apart Hotel; è sicura? è tranquila? sembra un po' complicata come zona di notte",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ooeaf3/come_si_vive_in_questa_zona_san_salvario/"
    },
    {
        "id": "1ooi1ig",
        "author": "verdemanzia",
        "title": "Stasera a Torino",
        "content": "Cosa fare stasera a Torino in solitaria? ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1ooi1ig/stasera_a_torino/"
    },
    {
        "id": "1ooa4zi",
        "author": "Resident_Welcome9276",
        "title": "Join me for sushi event",
        "content": "🇬🇧 Heyy everyone, I will go to Miyo Sushi to have \"all you can eat\" menu in a few days, any sushi lovers who'd love to join me?\n\n🇮🇹 Ciao a tutti, tra qualche giorno andrò al Miyo Sushi per provare il menù \"all you can eat\". C'è qualche amante del sushi che vorrebbe unirsi a me?\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ooa4zi/join_me_for_sushi_event/"
    },
    {
        "id": "1oo6si8",
        "author": "davivesp",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti, mi sono trasferito a Torino da qualche anno, ma tra una cosa e l’altra non sono mai riuscito a fare davvero nuove amicizie.  \nHo 30 anni, mi piace la fotografia, passeggiare e in generale passare del tempo in modo tranquillo.  \nMi piacerebbe conoscere qualcuno/a con cui fare due chiacchiere, uscire ogni tanto o semplicemente condividere interessi. \n\nSe anche voi siete nella stessa situazione o vi va di ampliare la compagnia, scrivetemi pure :)",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1oo6si8/nuove_amicizie/"
    },
    {
        "id": "1on8yx9",
        "author": "DistributinOfWealth",
        "title": "Torino, città di Dio",
        "content": "Sono sud americano, vivo qui a Torino da cinque anni e penso davvero che la vita in questa città sia fantastica; tutti si lamentano di quanto sia brutta la vita qui, di quanto sia diffusa la criminalità (haha lol), questo e quello\n\nMa in realtà, la città è davvero spettacolare\n\nSo che la città ha dei problemi, ma tutte queste persone che si lamentano non sanno come si vive in Sud America; lì abbiamo dei problemi, qui quasi tutti hanno il pane da mangiare e un'auto per andare al mare, che dista quasi due ore a piedi.\n\nÈ quasi incredibile come gli italiani (dal mio punto di vista) vivano male, perché hanno tutto ciò che serve per vivere bene, e sì, lo so, ci sono dei problemi, ma in realtà tutti i paesi hanno i loro problemi.\n\nE sì, il Paese è indietro in alcune cose come la tecnologia, la corruzione, ecc., ma tu fai parte di questa società, quindi inizia da te stesso, vai a votare per eliminare ciò che non ti piace e leggi e impara per evitare che altre persone ripetano il problema, non piangere su Reddit; poco a poco renderemo di nuovo bella la città e il Paese.\n\nHai ancora un futuro, se lo vuoi.\n\n",
        "upvotes": 201,
        "comments": 41,
        "media": null,
        "permalink": "/r/torino/comments/1on8yx9/torino_città_di_dio/"
    },
    {
        "id": "1oo8rjr",
        "author": "Embri21",
        "title": "Indicazioni mezzi di trasporto",
        "content": "Ciao raga, settimana prossima per motivi lavorativi sarò a Torino. Precisamente dovrei raggiungere Val della Torre. \nHo avuto di guardare Maps ma è poco chiaro e probabilmente dà indicazioni errate. Mi sapete dire in che modo arrivarci, che mezzo prendere ?\n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oo8rjr/indicazioni_mezzi_di_trasporto/"
    }
]