[
    {
        "id": "1oc23pv",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 20,
        "comments": 3088,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oc23pv/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ofota5",
        "author": "scoreboard-app",
        "title": "[Pre-Match Thread] : Real Madrid vs Barcelona, La Liga Game 10",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1ofota5)",
        "upvotes": 98,
        "comments": 219,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ofota5/prematch_thread_real_madrid_vs_barcelona_la_liga/"
    },
    {
        "id": "1ogags7",
        "author": "Pallav_Pokhrel",
        "title": "Bro really needs to be humbled tonight",
        "content": "",
        "upvotes": 291,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fdmsxddzkdxf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ogags7/bro_really_needs_to_be_humbled_tonight/"
    },
    {
        "id": "1oftoht",
        "author": "busyblckboy",
        "title": "Vini defends -&gt; Bellingham assist -&gt; Endrick strike",
        "content": "",
        "upvotes": 672,
        "comments": 67,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/inryokimv9xf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oftoht/vini_defends_bellingham_assist_endrick_strike/"
    },
    {
        "id": "1ogbl33",
        "author": "DxS_Neo",
        "title": "90 minutes at the Bernabéu is a long time…",
        "content": "A lot was said last season, a lot has been said …. always. \nCriticism has always been answered, and grins always responded. \nLately, Lamine has been rage-baiting, delusional and self-absorbed, and needs to be set in place. \nAnd he shall be !\n\nI love how we have been evolving under Alonso, and how we have been playing. There indeed seem a lot of stones to be turned and pages to be written, but while in the process, I believe. \n\nA test lies ahead.. and I know we got this.. \n\nAnd so shall those.. who doubt. \n\nDoubt, mock, grin …. All of that will be settled. And everyone knows ..\n\n90 minutes at the Bernabéu is a long time …\n\nHala Madrid. ",
        "upvotes": 51,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ogbl33/90_minutes_at_the_bernabéu_is_a_long_time/"
    },
    {
        "id": "1ofqw45",
        "author": "GravitasEcho",
        "title": "So what's your prediction?",
        "content": "",
        "upvotes": 800,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cwa6xuiu99xf1.png?auto=webp&amp;s=71c7968b3dad4151c466c174e24acb1ef70490ef"
        },
        "permalink": "/r/realmadrid/comments/1ofqw45/so_whats_your_prediction/"
    },
    {
        "id": "1ogf8r3",
        "author": "TheFeatherDiaries",
        "title": "Sevilla coach Matías Almeyda who beat Barcelona 4-1 - “I've been studying Barcelona for years!” “I’ve done a comprehensive study - Teams that simply sit back and wait against them lose 98% of the time. The teams that cause them problems are the ones that dare a bit more.”",
        "content": "",
        "upvotes": 24,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Cdwdniqs1LhgDc-01BazjkeCABf7ENn3qDFB95k40gY.jpeg?auto=webp&amp;s=728f86400f2f5334b8f18f7e10e04c673ed41fd4"
        },
        "permalink": "/r/realmadrid/comments/1ogf8r3/sevilla_coach_matías_almeyda_who_beat_barcelona/"
    },
    {
        "id": "1ofq42l",
        "author": "dakdakdakp",
        "title": "Xabi Alonso on Lamine Yamal's statement: \"I'm not going to go into that. There are a lot of statements from people at Barcelona, and I can't analyse them all.\"",
        "content": "",
        "upvotes": 529,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DphwOetPcoK2meWifFqW4SJzM14xO2C_H8eNKf6Kny4.jpeg?auto=webp&amp;s=84d918691f59f43d4de80f08ba06b7ae10149cb2"
        },
        "permalink": "/r/realmadrid/comments/1ofq42l/xabi_alonso_on_lamine_yamals_statement_im_not/"
    },
    {
        "id": "1ofpre0",
        "author": "More-Comparison8969",
        "title": "some of rare images for real madrid players",
        "content": "",
        "upvotes": 327,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ofpre0/some_of_rare_images_for_real_madrid_players/"
    },
    {
        "id": "1ofn08x",
        "author": "hith4ish",
        "title": "Dani Carvajal to have 'serious conversation' with Lamine Yamal — Real Madrid unhappy with scandalous El Clasico comments",
        "content": "According to Spanish media reports, Lamine Yamal’s recent comments, in which he suggested that Real Madrid often benefits from refereeing decisions, have sparked anger and disappointment among players at the capital club on the eve of El Clasico.\n\nIn Madrid, the remarks were viewed as a sign of disrespect, not only toward the team but also toward Yamal’s Spanish national teammates.\n",
        "upvotes": 495,
        "comments": 210,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ofn08x/dani_carvajal_to_have_serious_conversation_with/"
    },
    {
        "id": "1ofrqn5",
        "author": "No-Independent2522",
        "title": "Squad list for Clasico",
        "content": "",
        "upvotes": 150,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g3fgzt7rg9xf1.jpeg?auto=webp&amp;s=644637402a3b671da532c29689af9daeee8fcf2f"
        },
        "permalink": "/r/realmadrid/comments/1ofrqn5/squad_list_for_clasico/"
    },
    {
        "id": "1ogfwxv",
        "author": "chunchunmaru1129",
        "title": "I hope Valverde stays glued to Pedri the whole Match",
        "content": "If we can block Pedri then we will 100% win the midfield game against Barcalona.Valverde is our most hardworking midfielder he is the road runner.I hope Valverde man marks Pedri the whole match and stays glued to him like a Magnet.Barca's main man is Pedri if his game is disturbed then defeating Barcalona is very easy.\n\nI hope we go with 4-4-2 diamond with Jude at CAM and Güler and Valverde as the 2 CM and Tchoumeni as the CDM. \n\nIf Valverde is able to disturb Pedri's game and allow Güler to do his magic then we will surely win the upcoming el clasico against Barcalona.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ogfwxv/i_hope_valverde_stays_glued_to_pedri_the_whole/"
    },
    {
        "id": "1oflqpq",
        "author": "Omkarop_06",
        "title": "We have no more excuses for El Clasico.",
        "content": "Last year there were many. Injuries. Mbappe's Arrival. Tactics not working. Vacuum left by Kroos. Barca's Excellent form. Madrid's bad defence.\n\nThis year we have no excuses. Mbappe is in an amazing form. Midfield is looking good with Guler. Vini looks in good form. Defense is looking good, better than Barca and the most important thing, we have a good structure now. Xabi has done a lot of hardwork. \nBarcelona is not looking as good as last year. Inigo's Departure and Injuries has left them vulnerable. Raphinha and Lewandowski (their best El Clasico players last year) are also not playing. \n\nLast two El Clasico, we were close, very close to winning. But it's okay, it's in the past. Only thing that matters is tomorrow. We will get the 3 points and shut all of them up. Hala Madrid🤍\n\n\nEdit : People are still crying in the comments, we don't have this, we don't have that, we won't have stability unless we have this player. BRO WHAT? Do you think Barca is the most stable team? We definitely have an upper hand for this match. If we cannot even win this, what will we do in the away match in may next year?",
        "upvotes": 320,
        "comments": 83,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oflqpq/we_have_no_more_excuses_for_el_clasico/"
    },
    {
        "id": "1ofj1g6",
        "author": "SaniaXazel",
        "title": "Kylian Mbappe named Real Madrid’s POTM for the second month in a row",
        "content": "",
        "upvotes": 431,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lve15fwrw6xf1.jpeg?auto=webp&amp;s=22dcb4f56b954a7b307b8d10d6d3ab41aeb448c9"
        },
        "permalink": "/r/realmadrid/comments/1ofj1g6/kylian_mbappe_named_real_madrids_potm_for_the/"
    },
    {
        "id": "1ofrl8a",
        "author": "Finn_Madridista",
        "title": "When you just wanted to dribble but ended up in an MMA fight 😭 (OC)",
        "content": "",
        "upvotes": 71,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x3xb903if9xf1.jpeg?auto=webp&amp;s=f164ae1267ad4252f1352efa805b21429264e8a5"
        },
        "permalink": "/r/realmadrid/comments/1ofrl8a/when_you_just_wanted_to_dribble_but_ended_up_in/"
    },
    {
        "id": "1og0dsi",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [2]-0 Real Avilés Industrial - Loren Zúñiga 25'",
        "content": "",
        "upvotes": 24,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sygoy25r7bxf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1og0dsi/real_madrid_castilla_20_real_avilés_industrial/"
    },
    {
        "id": "1og07sp",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [1]-0 Real Avilés Industrial - Loren Zúñiga 19'",
        "content": "",
        "upvotes": 23,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qrscgb3i6bxf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1og07sp/real_madrid_castilla_10_real_avilés_industrial/"
    },
    {
        "id": "1of41wb",
        "author": "ViniciusFastAF",
        "title": "This made me feel so nostalgic. We were truly lucky to witness prime Real Madrid.",
        "content": "",
        "upvotes": 1133,
        "comments": 55,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4jy9qeqzh3xf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1of41wb/this_made_me_feel_so_nostalgic_we_were_truly/"
    },
    {
        "id": "1ofjoqb",
        "author": "amerhodzic",
        "title": "Barca Pres and then Yamal accuse Real Madrid of ref manipulation..",
        "content": "Barca Pres claimed a few days ago that somehow the blame falls on Real Madrid that Hansi Flick lost his head and made an obsene gesture at the ref, after complaining about the amount of extra time.\n\nSpecifically, the gesture is basically the Spanish (and European) version of the American middle finger at the ref. You tell me, does that not deserve a second yellow? But no, according to Barca Pres, he got the yellow because of Real Madrid.\n\nAnd now this little wet behind his ears punk echoes that ridiculous claim. Lamine Yamal is really showing what a petty and unattractive personality he's got. I understand he's still a teenager but he's over 18, acting like he's 14.\n\nYou got to feel sorry for these people. They even blamed Real Madrid for being discovered to have had a ref on their payroll. Can you imagine?\n\nOne thing that really annoys me is how Barca media constantly sane washes Barcelonas actions. Imagine if Real Madrid had a ref on their payroll, and they claimed it was for some reports. The media attacks would never stop. \n\nRecall when Real Madrid claimed that ref were biased following some insane decisions in 4 games in a row, what the media reaction was. Look at what they're claiming and the media's judged it as just quirky. And you tell me media isn't biased.\n\nApologies if there's a topic on this already.",
        "upvotes": 115,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ofjoqb/barca_pres_and_then_yamal_accuse_real_madrid_of/"
    },
    {
        "id": "1ofxfev",
        "author": "ChrisJBurns",
        "title": "How often do RM games get rescheduled to different dates?",
        "content": "I'm planning a trip to Madrid with my girlfriend (a huge Real Madrid fan) centered around their match on April Wednesday 22nd. We're thinking of staying from the 21st to 27th to give us some flexibility in case the fixture gets moved to a different date - possibly that following weekend.\n\nMy main concern isn't kick-off times changing, but rather the match being rescheduled to an entirely different day. How common is this for Madrid games? Am I overthinking it, or do late-season fixtures regularly get moved around due to Champions League scheduling or domestic cup conflicts?",
        "upvotes": 14,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ofxfev/how_often_do_rm_games_get_rescheduled_to/"
    },
    {
        "id": "1ofjvnx",
        "author": "chunchunmaru1129",
        "title": "Arda is going to either Cook or Ghost against Barcalona there is no in between for him",
        "content": "There will be a lot of pressure on Güler for the upcoming el clasico as it's the first time the whole world will be keeping a eye on him especially.He needs to stay out of pressure and social media and just focus on his game.Arda in the upcoming match will either Cook Barcalona or Ghost the whole match as it's possibly the biggest game of his life until now.So let's hope Arda shows his magic and makes all of us proud.",
        "upvotes": 97,
        "comments": 43,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ofjvnx/arda_is_going_to_either_cook_or_ghost_against/"
    },
    {
        "id": "1ofdgcz",
        "author": "Finn_Madridista",
        "title": "When Güler decides parking the bus won’t save you anymore 🚌✂️(OC)",
        "content": "",
        "upvotes": 248,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7sl6iba5g5xf1.jpeg?auto=webp&amp;s=cdb4d14b8319075a8eb4d4889f5376639e71afbc"
        },
        "permalink": "/r/realmadrid/comments/1ofdgcz/when_güler_decides_parking_the_bus_wont_save_you/"
    },
    {
        "id": "1og6fow",
        "author": "Wrong_Damage4344",
        "title": "Pubs to watch el clasico in Dublin?",
        "content": "So the el clasico is tomorrow, I’m looking for a place for a nice screening place. I was here almost over a year ago, and the Camden and woodshed are good but almost always way too crowded. I remember tapped also being good, any other good places? If not, please tell me if the woolshed or the Camden are showing it today or not?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1og6fow/pubs_to_watch_el_clasico_in_dublin/"
    },
    {
        "id": "1ofzjf8",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - Real Avilés Industrial | Primera Federación, Matchday 9",
        "content": "#FT: CASTILLA 2:0 AVILÉS\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 Loren Zúñiga 19'\n\n2:0 Loren Zúñiga 25'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n⚽ 19' - GOLLLLLL DEL CASTILLA - Palacios advances on the left side and puts in a lovely cross onto the head of Loren, who heads it into the net with force from a short distance! \n\n20' - the goal is getting challenged reviewed for whatever reason, but it stands\n\n22' - now another challenge, a penalty is getting checked for Real Avilés \n\n25' - after a lengthy review, the referee thinks the pull by Valde on the Avilés player is not enough to warrant a penalty. Avilés can't ask for another challenge for the rest of this half\n\n⚽ 25' - GOLLLLLL DEL CASTILLA - and on the other side of the pitch, pressure by Cestero leads to an early recovery from David - he moves forwards into the box, and squares it to Loren, who managed to break completely free and only has to calmly slot it into the net for a quick brace \n\n39' - almost the hattrick for Loren - Cestero intercepts a pass and puts through Loren with a great through ball - his first touch isn't great, but he can chip or over the keeper in time. A defender clears it off the line to prevent an early KO for Avilés \n\nHT - lovely first half by Castilla against an inconsequential Real Avilés. The team is arriving at the opposing box with ease, with Loren converting 2/3 of his opportunities to give us a comfortable lead for now. The midfield of Cestero, Manuel Ángel and Pitarch is doing a spectacular job so far, but Real Avilés have slowly taken control closer to the end of the second half, so the team cannot relax yet \n\n46' - 2nd half underway \n\n🔄 63' - Diego Aguado and Dani Yáñez on for Manu Serrano and Pol Fortuny\n\n64' - huge chance for Avilés after a lobbed pass and a mistimed tackle from Joan, but their player fires the volley shot against the post from a very short distance\n\n68' - Avilés pushing hard to get one back here \n\n74' - first good chance in quite some time for Castilla, Yáñez cuts inside at the edge of the box, and his curled shot goes just wide low at the far post \n\n🔄 76' - Mesonero on for today's goalscorer Loren\n\n🔄 88' - Manuel Ángel and Thiago Pitarch off for Cristian David and Bruno Iglesias\n\nFT - the second half was more open, with Avilés trying their hardest to get back into this match, but with a few exceptions, Castilla handled the pressure well and bag 3 deserved points at home. Arbeloa's team has now won 4 in a row and will finish this matchday in the promotion playoff spots\n\n&amp;#x200B;\n\n**Kickoff:** 21:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: Álvaro Cánovas García-Villarrubia \n\n**Competition:** Primera Federación, Grupo 1, Matchday 9\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Manu Serrano (63' Diego Aguado), Víctor Valdepeñas, Joan Martínez, David Jiménez - Jorge Cestero, Thiago Pitarch (88' Bruno Iglesias), Manuel Ángel (88' Cristian David) - César Palacios, Loren Zúñiga (76' Dani Mesonero), Pol Fortuny (63' Dani Yáñez)\n\nBench: Guille Súnico (GK), Jesús Fortea, Mario Rivas, Lamini Fati, Gabri Castrelo. \n\nUnavailable: Sergio Mestre (first team call-up), Roberto Martín (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** LLWWW\n\n**1ª RFEF stats:** 6th | 12pt | 4-0-4 | 10:10\n",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ofzjf8/match_thread_real_madrid_castilla_real_avilés/"
    },
    {
        "id": "1of6dm1",
        "author": "Full_Fly_8046",
        "title": "Jude Bellingham must use El Clasico to show he - not Marcus Rashford - remains La Liga's top English dog",
        "content": "",
        "upvotes": 224,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ycwD2TGVpsIEH1kLBPPvQDegKr3aKU3e7yalpK7oGVU.jpeg?auto=webp&amp;s=a08e54537778b20c452e828e4673ea89571aecca"
        },
        "permalink": "/r/realmadrid/comments/1of6dm1/jude_bellingham_must_use_el_clasico_to_show_he/"
    },
    {
        "id": "1of4d49",
        "author": "vil727",
        "title": "Nico Paz absolutely dominating the Serie A at the beginning of the season. (Surprise appearance from Modric👑)",
        "content": "",
        "upvotes": 191,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/krw27nr5k3xf1.jpeg?auto=webp&amp;s=8c0681ef95a14e8f611f88b29b3a8567415bf390"
        },
        "permalink": "/r/realmadrid/comments/1of4d49/nico_paz_absolutely_dominating_the_serie_a_at_the/"
    },
    {
        "id": "1of0i98",
        "author": "SamuraiGamesYT",
        "title": "Inter Milan Ready To Offer €58M to Como for Nico Paz",
        "content": "As stated in the title, Inter Milan are  Ready To Offer €58M to Como for Nico Paz. The only thing stopping it are the Como administration and the players opinion.\nNow, I don't think Nico will go anywhere as he already rejected a 70M offer from Spurs, but still I wanted to share this.\nSource: https://www.goal.com/en/lists/inter-ready-spend-big-nico-paz-real-madrid-eur58m-buy-back-option-como/bltd271ca65b5b60e9f",
        "upvotes": 224,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NV-pQBFGzxhO7PTrrW2EMEuXfU-Ljt3jAUSKhWwSCYA.jpeg?auto=webp&amp;s=23bce01964ef410ef3a4caf2bf3d96652a9acb03"
        },
        "permalink": "/r/realmadrid/comments/1of0i98/inter_milan_ready_to_offer_58m_to_como_for_nico/"
    },
    {
        "id": "1of4m1h",
        "author": "Silver_Tip260",
        "title": "I can't watch Real Madrid matches with my brother anymore",
        "content": "My brother has made watching Real Madrid matches absolutely MISERABLE this season. \n\nHe's one of those guys who thinks he knows better than everyone he always criticize  Xabi choice.\n\nBefore every match, he sends me his \"correct lineup\" on WhatsApp. Not asking. Not suggesting. Just \"This is what Carlo should do.\"\n\nDoes anyone else have a friend/sibling like this? Or am I cursed with the world's most annoying armchair manager?",
        "upvotes": 107,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1of4m1h/i_cant_watch_real_madrid_matches_with_my_brother/"
    },
    {
        "id": "1oew6hp",
        "author": "Gaengsa",
        "title": "Unpopular OPINION:We need Guler as a DLP more than a number 10",
        "content": "",
        "upvotes": 215,
        "comments": 96,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/614um98ux1xf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oew6hp/unpopular_opinionwe_need_guler_as_a_dlp_more_than/"
    },
    {
        "id": "1oetlcx",
        "author": "Journalist-Trick",
        "title": "RANT: Sub’s quality has really gone downhill",
        "content": "I’ve been a regular on this sub for quite a long time, and honestly, over the past year I’ve noticed a real drop in the quality of discussion. I actually find myself avoiding visiting this place lately because of how toxic it’s become (somehow even more than r/soccer, which says a lot). The amount of hate toward certain players, especially Vini, is absurd.\n\nThen there are the so called “tactical analysis” posts popping up daily. Things like \"why Mbappe is better as a LW\", \"why Fede should play as an RW\", etc are low-effort, repetitive, and doesn't offer any real insight.\n\nWhat’s even worse is the atmosphere. The sub now seems entirely driven by player agendas, and anyone who expresses a different opinion gets instantly downvoted into oblivion.  Even though the sub didn't offer very high quality discussions it still used to feel like a space for Madristas. Now it feels like a fan community just with hot takes and echo chambers.\n\nMods, please approve this post**.** I’m not trying to start drama, just sharing honest feedback from someone who’s been here for a long time and really wants this sub to feel enjoyable again.\n\n",
        "upvotes": 303,
        "comments": 129,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oetlcx/rant_subs_quality_has_really_gone_downhill/"
    }
]