[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hqxs0j",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1hqxs0j/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1i5omb4",
        "author": "ivlia-x",
        "title": "Magic The Gathering (soprattutto EDH) a Torino? ",
        "content": "Ciaooo\nSo che in alcuni negozi è possibile giocare a MTG, vorrei provare anch’io perciò cercho le persone che vogliano giocare insieme. Non sono esperta però, ho un paio di mazzi ma devo ancora imparare tanto :^)\n\nL’unico problema (spero non lo sia) è che non sono italiana ma polacca e tutti i miei mazzi sono in inglese. Parlo l’italiano senza problemi, ma so che per altri potrebbe essere difficile \n\nFatemi sapere se avete dei gruppetti per giocare insieme, grazie!",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1i5omb4/magic_the_gathering_soprattutto_edh_a_torino/"
    },
    {
        "id": "1i5u5h5",
        "author": "_anna816_",
        "title": "palestra a torino consigli",
        "content": "ciao, sono una ragazza universitaria fuorisede che vorrebbe iscriversi in una palestra qui a torino\novviamente non lavorando il mio budget non è altissimo e ne starei cercando una che mi permetta di non vendere un rene al mese\ninoltre ho letto di varie palestre super low cost che ti propinano degli abbonamenti che poi non si possono disdire e si è obbligati a continuare a pagare\nio abito in zona panche e ne starei cercando una più meno nella zona\n(se ne sapeste consigliare anche una che permette eventualmente delle sospensioni dell’abbonamento nei periodi di non utilizzo sarebbe fantastico)\nscusate il poema ma vengo da un paesino molto piccolo dove le palestre sono un sogno, ne stavo cercando una qui simile🫶🏼\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i5u5h5/palestra_a_torino_consigli/"
    },
    {
        "id": "1i5pwg3",
        "author": "Proud_Lifeguard_8626",
        "title": "Fotocopie economiche ",
        "content": "Come da titolo sto cercando un posto dove fare delle fotocopie a Torino senza farmi derubare. Qualche consiglio? \nSu Maps ne ho trovati alcuni tra corso san Maurizio e corso regina ma tra le recensioni nessuno osa parlare di prezzi come al solito.",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i5pwg3/fotocopie_economiche/"
    },
    {
        "id": "1i5b5l6",
        "author": "Substantial-Hall-964",
        "title": "Amici a torino?",
        "content": "vivo a torino da un po di anni, e all'inizio avevo anche una vita sociale abbastanza attiva. Poi, dal nulla, ho perso pian piano il mio vecchio gruppo di amici universitari e ora mi sembra davvero impossibile fare delle amicizie nuove.\n\nse qualcuno è nella mia stessa situazione e vuole fare qualche nuova conoscenza, mi scriva!\n\nho 24 anni, mi piace andare al cinema, seguo la serie a, uscire per una chiacchierata o fare qualche gioco da tavolo (e me la cavo anche in cucina premetto). ",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1i5b5l6/amici_a_torino/"
    },
    {
        "id": "1i4vcm7",
        "author": "LuxJupiterian",
        "title": "11,90 euro di biglietto al cinema nel 2025",
        "content": "Cinema UCI Lingotto: 11,90 euro di biglietto + 6 euro di parcheggio per l'assenza di comunicazione nello spiegare come ottenere il rimborso delle 3 ore di parcheggio gratuito.\n\nUn centro commerciale senza parcheggi gratuiti... mi dite come stracazzo sia contemplabile una cosa simile nel 2025?\n\nSe conoscete alternative decenti vi ascolto, altrimenti non metterò più piede in un fottuto cinema a Torino.",
        "upvotes": 107,
        "comments": 66,
        "media": null,
        "permalink": "/r/torino/comments/1i4vcm7/1190_euro_di_biglietto_al_cinema_nel_2025/"
    },
    {
        "id": "1i5mme1",
        "author": "-xGarnet99x-",
        "title": "Compleanno Karaoke",
        "content": "Ciao! Tra poco festeggio il mio compleanno e avrei voluto organizzare qualcosa di diverso rispetto alla solita cena/discoteca.\n\nMi piacerebbe trovare un posto dove si possa “affittare” una stanza adibita per il karaoke. Teoricamente dovremmo essere tra le 20-30 persone. \n\nHo provato a chiedere al Cantinone ma mi hanno sparato un prezzo folle e alcuni miei amici mi han detto che non è proprio “privato” ma nel mezzo ci passa gente esterna e via dicendo.. \n\nAvete altri locali da consigliarmi? Grazie :) ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i5mme1/compleanno_karaoke/"
    },
    {
        "id": "1i5c8lp",
        "author": "wilco67italy",
        "title": "Radio a valvole anni 60 ",
        "content": "Cerco appassionato di radio d epoca. He ho trovata una che porterò a Torino. Sto cercando qualcuno che eventualmente sa ripararla per poi tenerla. Sono anche disposto a regalarla piuttosto di non essere costretto a buttarla. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i5c8lp/radio_a_valvole_anni_60/"
    },
    {
        "id": "1i547zn",
        "author": "BlueLights420",
        "title": "Pesce crudo",
        "content": "Ciao a tutti! Mi è venuta la pazza idea di fare il sushi in casa ma non so minimamente dove potrei trovare del salmone crudo abbattuto. Voi sapete suggerirmi un negozio dove comprarlo di qualità decente e che contemporaneamente non mi costi un rene? Grazie in anticipo 🫶🏻",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1i547zn/pesce_crudo/"
    },
    {
        "id": "1i5cxzu",
        "author": "NoAd4257",
        "title": "Corsi a Torino",
        "content": "Bella raga, sarei interessato ad intraprendere un corso riguardo grafica/art direction oppure sull’ambito linguistico, voi cosa mi consigliate anche in base a prezzi e possibilità/sbocchi lavorativ*?  (online o in presenza anche) :):) ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1i5cxzu/corsi_a_torino/"
    },
    {
        "id": "1i5cqcn",
        "author": "realcvnce",
        "title": "qualcuno con cui uscire?",
        "content": "M19 se volete scrivetemi qui o su insta così in sti giorni organizziamo ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i5cqcn/qualcuno_con_cui_uscire/"
    },
    {
        "id": "1i54yte",
        "author": "CryingAlwaysCrying",
        "title": "Qual è l’assicurazione sanitaria più conveniente a Torino?",
        "content": "Ciao a tutti! 😊\n\nMi sono trasferito a Torino e sto cercando un'assicurazione sanitaria affidabile e conveniente. Mi interessa la copertura di base, le emergenze e magari l'assistenza preventiva. Qualcuno ha qualche esperienza o consiglio sulle opzioni private qui in Italia?\n\nSto cercando qualcosa che sia davvero facile da usare quando devo andare dal medico, senza problemi.\n\nGrazie mille! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i54yte/qual_è_lassicurazione_sanitaria_più_conveniente_a/"
    },
    {
        "id": "1i52j3q",
        "author": "Ok-Salamander8485",
        "title": "Processo di iscrizione per strangeri EU",
        "content": "Ciao ragazzi, sono una ragazza spagnola e l’anno prossimo vorrei andare a studiare a Torino nel corso di Global Law and Transnational Legal Studies. Mi chiedevo come posso iniziare il processo di iscrizione, dato che è necessario avere lo SPID e non so come funziona per gli stranieri in Italia. Qualcuno può aiutarmi? Grazie mille!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i52j3q/processo_di_iscrizione_per_strangeri_eu/"
    },
    {
        "id": "1i4yubi",
        "author": "chack1172_temp",
        "title": "Acquisto bici usata",
        "content": "E' da un pò che sono a Torino e sto valutanto adesso di comprarmi una bici per spostarmi senza aspettare sempre i mezzi che di sera sono pessimi e molte volte non passano.  \nSiccome al momento non ho un posto dove tenerla al chiuso stavo pensando di iniziare prendendo una bici usata a poco e vedere quanto tempo mi dura prima che me la rubano...  \nSo che a Porta Palazzo le vendono a poco, sapete dirmi esattamente dov'è che le trovo però? Grazie",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i4yubi/acquisto_bici_usata/"
    },
    {
        "id": "1i49nem",
        "author": "Important_Still5639",
        "title": "Is borgo filadelfia a safe place to stay for an Erasmus Semester or should I look for appartments in other districts of turin? I have only heard bad stuff about barriera di Milano/falchera/vallette/Aurora",
        "content": "",
        "upvotes": 21,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bys4b6mjqrde1.png?auto=webp&amp;s=ad0047ab7b6de294d137ab5eb8eacd3767aaab49"
        },
        "permalink": "/r/torino/comments/1i49nem/is_borgo_filadelfia_a_safe_place_to_stay_for_an/"
    },
    {
        "id": "1i48k6o",
        "author": "Equivalent-Cable-846",
        "title": "Sciare senza auto",
        "content": "Io e la mia ragazza vorremmo provare due giorni nel complesso sciistico della Via Lattea.\n\n Siamo due principianti assoluti quindi non avremmo problemi nel caso le piste più difficili fossero chiuse. \n\nL'unico problema è che ci vorremmo spostare tramite mezzi pubblici e non sono sicuro di quali siano i migliori posti dove alloggiare per raggiungere le piste. Per esempio ho notato Sestrière come meta gettonata ma non sono sicuro se renda più accessibili le piste o meno.\nVorremmo fare almeno un giorno con un istruttore e avevo visto la maggior parte si trovavano lì a Sestriere ma non so se effettivamente convenga, quindi accetto qualsiasi consiglio. \n\nGrazie mille in anticipo",
        "upvotes": 10,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1i48k6o/sciare_senza_auto/"
    },
    {
        "id": "1i4inxv",
        "author": "Interesting_Cry1672",
        "title": "Motociclisti di montagna",
        "content": "Ciao! (31M) volevo sapere se qualcuno conoscesse qualche gruppo o luogo (online e non) in cui conoscere altri motociclisti con la passione dei viaggi in montagna, a Torino o in provincia. Ho cominciato a guidare la moto l’anno scorso, ho viaggiato un po’ soprattutto dalle parti della val pellice e val chisone, per ora mi son spinto fino al Colle delle Finestre e Vandalino come mete più “complicate”.\n\nPurtroppo della mia cerchia di amici, parenti e conoscenti sono l’unico a guidare la moto, e mi piacerebbe provare mete più impegnative ma mi rendo conto del pericolo di andare da solo, mi sentirei più tranquillo - soprattutto essendo neopatentato - a viaggiare insieme a un gruppo di altri motociclisti possibilmente.\n\nGuido una Kawasaki KLX250.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1i4inxv/motociclisti_di_montagna/"
    },
    {
        "id": "1i4c0o7",
        "author": "bec0m1ng",
        "title": "Acid Arab stasera 18/01 Notorius",
        "content": "Ciao, qualcuno vende un biglietto per Acid Arab stasera a un prezzo decente (max 30 euro)? Non sarò a Torino prima di mezzanotte e non riuscirò a prendere un biglietto alla porta.\nGrazie ☺️ ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i4c0o7/acid_arab_stasera_1801_notorius/"
    },
    {
        "id": "1i4ag4o",
        "author": "ciotinho",
        "title": "Torino Filadelfia/Lingotto negozi/tabacchi con cui posso ricevere pacchi",
        "content": "Salve, lavoro dal lunedì fino al sabato e arrivando a casa la sera verso le 20 faccio fatica a essere presente al momento dell’arrivo del corriere, onde per cui avrei bisogno di un negozio/posto che ritiri a nome mio il pacco che farò spedire da giù. Voi vi affidate a qualcuno zona filadelfia/lingotto per il ricevimento di pacchi? Se sì chi? Grazie",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i4ag4o/torino_filadelfialingotto_negozitabacchi_con_cui/"
    },
    {
        "id": "1i44ryw",
        "author": "man-teiv",
        "title": "dove trovare marmite? ",
        "content": "mi serve del marmite per delle ricette ma non riesco A trovarlo in giro per Torino. su Amazon costa 13€ al barattolo che no grazie.\n\nqualcun* ha avuto fortuna? anche del vegemite penso vada bene lo stesso, o non so se esistano equivalenti italiani ",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1i44ryw/dove_trovare_marmite/"
    },
    {
        "id": "1i3gbhg",
        "author": "Prestigious_Use9038",
        "title": "Band emergenti punkrock/metal?",
        "content": "Ciao ragazzi, sono diversi mesi che sto scoprendo nuove band punk/poppunk/punkrock/metalcore di Torino, avete qualche nome da farmi? Questo sottobosco musicale che sto scoprendo mi piace sempre di più :D",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i3gbhg/band_emergenti_punkrockmetal/"
    },
    {
        "id": "1i31ej4",
        "author": "BrutalSock",
        "title": "Questo è “Io sono leggenda”",
        "content": "9:47, il protagonista sta guardando il telegiornale e per qualche motivo i giornalisti, sullo sfondo, hanno Piazza San Carlo. ",
        "upvotes": 67,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3rwz07oxnfde1.jpeg?auto=webp&amp;s=238dd7283009f47bbac23dd3d093fd2351ee4fe9"
        },
        "permalink": "/r/torino/comments/1i31ej4/questo_è_io_sono_leggenda/"
    },
    {
        "id": "1i3c7fl",
        "author": "selalleroo",
        "title": "Partitelle di pallavolo ",
        "content": "A breve conto di trasferirmi a Torino , e mi farebbe piacere ricominciare a fare qualche partita di pallavolo. Al momento sono troppo arrugginita per pensare di entrare in una vera squadra in campionato. L'idea sarebbe quella di trovare una squadretta in amicizia per fare qualche partita con l'obiettivo di divertirsi (tipo \"il calcetto della domenica\"). F27, ho un livello da terza divisione ormai. Esiste già qualche bella compagnia (anche mista eh, non per forza solo al femminile) che fa questa cosa? Grazie ciaooooo ",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1i3c7fl/partitelle_di_pallavolo/"
    },
    {
        "id": "1i3lfzc",
        "author": "Advanced_Air9286",
        "title": "Consiglio locale zona santa Rita, stadio olipico",
        "content": "Ciao ragazzi, qualcuno conosce un bel locale per bere zona santa Rita stadio olimpico? La di corso agnelli. Per serata con 6 persone di target 30 anni",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i3lfzc/consiglio_locale_zona_santa_rita_stadio_olipico/"
    },
    {
        "id": "1i3kx3a",
        "author": "idontknowausernamer",
        "title": "Ricostruzione unghie a Torino",
        "content": "Ciao a tutti, vorrei iniziare a fare la ricostruzione alle unghie, anche da privati, l'importante è che non costino un rene. Consigli?\n\nvanno bene anche posti nei dintorni di Torino. Grazie a chiunque risponderà.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i3kx3a/ricostruzione_unghie_a_torino/"
    },
    {
        "id": "1i398ec",
        "author": "_Luigino",
        "title": "L'Italia in cartolina – Torino",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HX4PpolbWaNqAjGbBBXRlUuEnPE_rI1q3k-pOwVyJfU.jpg?auto=webp&amp;s=25de4b15bf3c91a4c471c3795f921097ce9fb4f5"
        },
        "permalink": "/r/torino/comments/1i398ec/litalia_in_cartolina_torino/"
    },
    {
        "id": "1i3iogv",
        "author": "AfroJn",
        "title": "Domanda per i locali",
        "content": "Ciao gente di Torino! Presto mi trasferirò a Torino e ho trovato un bel appartamento al confine tra Lingotto e Mirafiori Nord. Ho letto alcune opinioni negative su queste zone su internet e mi chiedevo cosa ne pensano i locali. Sarebbe sicuro per una donna, sia di giorno che di notte?",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1i3iogv/domanda_per_i_locali/"
    },
    {
        "id": "1i3mowd",
        "author": "ApprehensiveStar2568",
        "title": "Acqua dentro a ciabatta ",
        "content": "Buonasera, prima di uscire di casa ho inavvertitamente fatto cadere dell'acqua dentro a una ciabatta e ho proprio visto l'acqua entrare all'interno delle spine di questa ciabatta. La quantità caduta non è tantissima ma nemmeno definibile come \"schizzi\", all'incirca un fondo di bicchiere per intenderci. A questa ciabatta (che per di più è molto vecchia quindi non so quanto sia affidabile come sistemi di sicurezza) è collegato un caricatore di un telefono. Purtroppo ero molto di fretta e l'unica cosa che ho fatto è spostare la ciabatta dal comodino, dove era appoggiata, al pavimento. Dall'altra parte del letto ho un'altra ciabatta collegata a una presa a parete che però, ahimè, prende l'elettricità dalla presa a cui è attaccata l'altra ciabatta (con delle canaline da cui passano i cavi). Purtroppo io sarò assente da casa mia per due notti e ho spiegato tutto l'accaduto alla mia ragazza. Volevo sapere se per voi fosse comunque sicuro utilizzare un caricatore che è già attaccato alla seconda ciabatta (dunque non a quella incriminata) per caricare il telefono. Quando è successo il fatto non è saltata la corrente e specifico inoltre che hanno cambiato il contatore giusto un paio di giorni fa. Grazie a tutti in anticipo per la disponibilità.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1i3mowd/acqua_dentro_a_ciabatta/"
    },
    {
        "id": "1i31sb8",
        "author": "BlueLights420",
        "title": "Parrucchiere per colorare i capelli",
        "content": "Salve gente, conoscete per caso un buon parrucchiere qui a Torino che se la cavi bene nel fare i capelli colorati e che offra possibilmente un prezzo non altissimo?\nGrazie a tutti 😉",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i31sb8/parrucchiere_per_colorare_i_capelli/"
    },
    {
        "id": "1i39nv7",
        "author": "Jhon_Titorto",
        "title": "Soddisfazione reciproche",
        "content": "PARCHEGGIO TORINO (M35 Bisex) : paecheggi, abbassi il sedile mettendoti comodo e ti... ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i39nv7/soddisfazione_reciproche/"
    },
    {
        "id": "1i2xq6q",
        "author": "barbax-7",
        "title": "Qual è il food delivery più usato?",
        "content": "Mi metto sempre a confrontare i vari servizi di food delivery perché mi è capitato in passato di trovare prezzi più alti in uno, ma andando a risparmiare alla fine poiché commissioni più basse.\n\nPerò ho come la sensazione che, per esempio, Just Eat sia il meno usato perché ha un sacco di posti che non ho mai sentito, e in generale hanno veramente poche recensioni.\n\nQual è invece l'opinione di voi altri che vivete Torino? Qual è il food delivery più usato dai locali, e quale preferite usare voi e perché?\n\n[View Poll](https://www.reddit.com/poll/1i2xq6q)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i2xq6q/qual_è_il_food_delivery_più_usato/"
    }
]