[
    {
        "id": "1kw5kt9",
        "author": "SanderSo47",
        "title": "May 23-25 Box Office Recap – It was the biggest Memorial Day weekend in history. 'Lilo &amp; Stitch' debuted with a colossal $341 million worldwide, while 'Mission: Impossible – The Final Reckoning' debuted with $204 million worldwide.",
        "content": "https://preview.redd.it/veq3xk1ey63f1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=2abc6ed70f57166cfe3163e0f00b28d593335138\n\nIt was a record breaking Memorial Day weekend.\n\nDisney's live-action remake of ***Lilo &amp; Stitch*** opened with the best Memorial Day debut, as well as the third biggest debut for any live-action remake. ***Mission: Impossible – The Final Reckoning*** also reached franchise highs this weekend, although its numbers are overshadowed by its colossal budget.\n\nThe Top 10 earned a combined $260.8 million this weekend. That's not just a colossal 166.8% up from last year, but it was the biggest Memorial Day weekend in history.\n\nEasily earning the #1 spot, ***Lilo &amp; Stitch*** debuted with a gigantic $145.5 million this weekend ($183 million four-day). That's the biggest Memorial Day debut, passing ***Top Gun: Maverick*** ($126 million, $160 million four-day). It's also the third biggest debut for a Disney live-action remake, just behind 2019's ***The Lion King*** ($191 million) and 2017's ***Beauty and the Beast*** ($174 million).\n\nThat's absolutely impressive, considering the original film made $145.7 million domestically back in 2002 (yes, the remake has already outgrossed it in just four days). So how did it open that high, especially considering other animated films had higher box office?\n\nSimply put, Stitch has been a merchandising monster for the past decades. It's been a main point of attention in Disney Parks, as well as in other venues. There's a lot of toys, shirts, caps, bedsheets, etc., with the character attached. The film has also grown massively through home media, cable reruns and streaming, particularly with Millennials and Gen Z. Contrary to the belief, Gen Z still likes going to theaters, and their familiarity with Stitch helped.\n\nThe original animated film had a crazy marketing campaign, where Stitch crashed other Disney animated films, which helped raise awareness. Disney used a similar tactic with the remake; some posters have Stitch messing with other remakes like ***Aladdin***, ***Cinderella***, ***Snow White***, and ***Beauty and the Beast***. Not to mention a spot in Super Bowl LIX, where Stitch \"interrupted\" the kickoff. It's simply a case of a pretty great marketing campaign.\n\nIt's crazy to think that this was going to be straight to Disney+. Whoever decided to shift that just earned a raise. And while Disney is often known for their large amount of money spent on productions, ***Lilo &amp; Stitch*** came in far lower. It cost just $100 million, which is quite cheap. And if you watched the final version of the film, it clearly shows.\n\nAccording to Disney, 64% of the audience was female. As previously said, Millennials and Gen Z loved the franchise and the data supports it: a massive 79% of the audience was under 35. Reviews were middling (68% on RT), but the audience was much more forgiving: they gave it a great \"A\" on CinemaScore. Even with some family competition on its way, ***Lilo &amp; Stitch*** should easily get to $500 million domestically. \n\nThis franchise will self destruct in 8 films.\n\nIn second place, ***Mission: Impossible – The Final Reckoning*** debuted with $64 million ($77.5 million four-day) in 3,857 theaters. That's the franchise's biggest debut, although it comes with an asterisk in terms of attendance. Adjusted for inflation, it's the third lowest debut, just behind ***Ghost Protocol*** and ***Dead Reckoning***.\n\nOn its own, when a franchise hits a high at the box office for its final outing, it should feel celebratory. So why is this not considered a great start? Perhaps for the fact that the film cost a staggering $400 million to produce (although some have it lower at $300 million), making it one of the most expensive films ever made. Why did it cost that much?\n\nWhile films film around a few months, some blockbusters can last longer. But in the case of ***The Final Reckoning***, it was even bigger. Filming started in March 2022 with certain sections of the film, followed by a break. Then in 2023, production was halted after the WGA-SAG strike. Once they were allowed to film, they still needed to pay for actors' availability and rewrites, complicating matters. As such, the film didn’t wrap until November 2024. It wasn't a continuous shoot, and the film paid the crew despite months of not working on the film. No one involved in the film went into this expecting it to cost that much.\n\nWith all that said, it still raises the question: the film couldn't open at least higher than this? Sure, it's a franchise best, but considering it's barely above ***Fallout*** ($61 million) and it's sold as the absolute final film, it feels like it could've been higher. But it looks like the franchise simply has a ceilling at the box office. One of its biggest challenges was adding fans with time, but here's the thing: this franchise is 29 years old. Fans of the franchise will watch it, but it's unlikely it can add new fans. After all, the attendance peaked with the second film ($401 million adjusted).\n\nSo the film was sold simply as a send-off for Tom Cruise. To the point that the trailers emphasized the \"I need you to trust me one last time\" line. For the past years, Cruise and McQuarrie have said that this wouldn't be the end and that Cruise was looking forward to play the character for years. But that was put to rest a few days ago, when Cruise finally confirmed that the title of the film pretty much says it all: it's not called ***The Final Reckoning*** for nothing. The franchise has been a critical darling for the past few entries, and while reviews were positive (80% on RT), it wasn't as acclaimed as the previous films.\n\nAccording to Paramount, 63% of the audience was male. The film had no appeal for young audiences: 62% of the audience was 35 and over, with its biggest demo being 55 and over (29%). That shouldn't be a surprise. They gave it a solid \"A–\" on CinemaScore, although it's below both ***Fallout*** and ***Dead Reckoning***. The film will enjoy a 3-week exclusive run in IMAX, as part of a deal secured back in 2023. But with competition on its way, it's very unlikely ***The Final Reckoning*** could hit $200 million domestically. \n\nLast week's champ ***Final Destination: Bloodlines*** added $19.3 million ($23.9 million four-day). That represents a steep 62% drop from last week, which is worse than both ***The Final Destination*** (54.9%) and ***Final Destination 5*** (57.3%). Looks like the film will be playing like a standard horror film, but considering it's already the highest grossing film in the franchise, it's not like it matters much. Through 11 days, the film has earned $94.1 million, and it should close with around $130 million domestically.\n\nIn fourth place, ***Thunderbolts*** dropped 45%, adding $9.1 million this weekend ($11.8 million four-day). The film hasn't fully collapsed, but it hasn't held very well neither, thanks to a large slate of competition. Through Monday, the film has earned $174 million and it's gonna be struggling to hit $200 million at this rate.\n\n***Sinners*** earned $8.6 million this weekend ($11 million), which represents a 43% drop, its biggest so far. Which just speaks volumes of what an insane run it has had so far. The film has earned $258.8 million, and it should get close to $290 million by the end of its run.\n\nIn sixth place, Angel Studios' ***The Last Rodeo*** debuted with $5.2 million ($6.2 million four-day) in 2,205 theaters. The film got an \"A\" on CinemaScore, and it should earn over $15 million domestically.\n\nEven more good news this weekend. A24 expanded ***Friendship*** into wide release, and the film earned a very solid $4.5 million ($5.5 million four-day) in 1,055 theaters. That's pretty good, especially considering the selling point is pretty much just Tim Robinson and Paul Rudd. The film has amassed $7.6 million so far, and it should continue adding screenings.\n\nIn eighth place, ***A Minecraft Movie*** was clearly hit by the newcomers. It collapsed 63%, its biggest drop so far, earning $2.2 million this weekend ($2.8 million four-day). The film has earned $421 million so far, and it will finish with around $430 million domestically.\n\n***The Accountant 2*** dropped 59% and added $1.9 million ($2.5 million) this weekend. That takes its domestic total to $63.3 million, and it's gonna close with less than $70 million lifetime.\n\nRounding up the Top 10 was ***Hurry Up Tomorrow***, which managed to lose over 500 theaters on its second weekend. The film collapsed a brutal 78%, making just $715,000 this weekend ($860,000 four-day). That's simply horrible, but not surprising considering the film's terrible word of mouth. The film has earned $4.9 million, and it won't make it pass $6 million domestically.\n\n#**OVERSEAS**\n\n***Lilo &amp; Stitch*** was also incredibly strong overseas. The film debuted with a colossal $158.7 million overseas, for a gigantic $341 million worldwide debut. Basically, in one single weekend, it already outgrossed the worldwide lifetime of the original. The best debuts were in Mexico ($23.7M), UK ($12.9M), Brazil ($11.1M), France ($10.7M) and Italy ($9.2M). This is an easy billion.\n\n***Mission: Impossible – The Final Reckoning*** debuted with $127 million overseas, which was a $204 million worldwide debut, another franchise record. Its best debuts were in South Korea ($12.7M), Japan ($11M), the UK ($10.7M), India ($9M), France ($7.8M), Australia ($7.7M), Taiwan ($6.3M),  Germany ($6M), Mexico ($3.9M), UAE ($3.6M) and Hong Kong ($3.3M).\n\nThere's been talks over how the film is going to recoup its $400 million budget. Deadline reported something and here's the thing: it won't. The film by itself is going to lose a lot of money in theaters. But it also notes that Paramount is playing the long game: the value of franchise properties increases with each subsequent installment and across multiple revenue streams. So Paramount can be able to profit with multiple \"The Complete Franchise\" deals in home media and streaming. It's gonna take a long time for that, but it's gonna be a big asset. And even if it doesn't, what's gonna happen? Cancel the franchise? It's already over.\n\n***Final Destination: Bloodlines*** added $23 million overseas, taking its worldwide total to $186.7 million. It has already passed ***The Final Destination*** to become the highest grossing film in the franchise, achieving it in just 2 weekends. The best markets are the UK ($9.2M), Mexico ($9.2M), Philippines ($6M), India ($6M) and France ($5M). It will cross $200 million in the next few days, and it will finish with around $270 million worldwide. Truly impressive.\n\nIf you thought ***Thunderbolts*** was struggling domestically, it pretty much died this weekend in the rest of the world. The film collapsed a horrible 64% and added just $5.6 million, taking its worldwide total to $355 million. Clearly the arrival of Stitch and Tom Cruise took a toll on its overseas prospects. Well, we gave it the benefit of the doubt, but now it's guaranteed to finish below $400 million. As such, we finally a consensus: this is a box office flop.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Captain America: Brave New World* | Feb/14 | Disney | $88,842,603 | $200,500,001 | $415,101,577 | $180M\n\n- You should've done better, Marvel. ***Captain America: Brave New World*** has ended its run with just $200 million domestically and $415 million worldwide. Given that its budget was $180 million, we can safely call this a box office failure. It didn't fully collapse from its weak reception, given that it had very small competition for a lot of weeks. Nevertheless, its 2.26x multiplier is quite bad. It's not a surprise, considering the film itself is a Frankenstein's Monster that fails to properly delve into any of its themes or ideas. What's Marvel gonna do now? Especially considering the better received ***Thunderbolts*** is set to finish below this? \n\n#**THIS WEEKEND**\n\nWith such a huge debut, ***Lilo &amp; Stitch*** ain't losing the top spot this weekend.\n\nSony is releasing ***Karate Kid: Legends***, the sixth film in franchise, starring Jackie Chan, Ben Wang, and Ralph Macchio. The franchise has been massively popular, and the success of ***Cobra Kai*** on Netflix has helped it add new fans over the years. But the decision to sandwich the film between two anticipated family films (***Lilo &amp; Stitch*** and ***How to Train Your Dragon***) is concerning. Will the audience pay a ticket or just wait for streaming?\n\nA24 is also releasing the horror film ***Bring Her Back***, which is directed by Danny and Michael Philippou (***Talk to Me***). That film was a sleeper hit back in 2023, earning $90 million worldwide. Will they strike gold again?\n\nAnd on limited release, there's Wes Anderson's ***The Phoenician Scheme***, starring Benicio del Toro, Mia Threapleton, Michael Cera, Riz Ahmed, Tom Hanks, Bryan Cranston, Mathieu Amalric, Richard Ayoade, Jeffrey Wright, Scarlett Johansson, Benedict Cumberbatch, Rupert Friend, and Hope Davis. The film has already premiered in Cannes, where it earned a very solid response. Anderson's films often deliver high numbers on limited release, so look for this film to deliver the year's best per-theater average.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 181,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Cw4tk4-XUl6fC6PF9OjtTsgZ-OIdRrVk_Gr6GDoxZ4.png?auto=webp&amp;s=b2f7524081308c95d3c8545666b05d8f1a9f6fb3"
        },
        "permalink": "/r/movies/comments/1kw5kt9/may_2325_box_office_recap_it_was_the_biggest/"
    },
    {
        "id": "1knzwcl",
        "author": "BringHerBackAMA",
        "title": "Hi /r/movies - We're Danny &amp; Michael Philippou, directors of A24's upcoming horror BRING HER BACK. It stars Sally Hawkins and is out in theaters May 30. We also directed A24's TALK TO ME. Ask us anything!",
        "content": "Hi r/movies \\- We're Danny &amp; Michael Philippou, directors of A24's upcoming horror BRING HER BACK. It stars Sally Hawkins and is out in theaters May 30. We also directed A24's TALK TO ME. Ask us anything!\n\nSynopsis:\n\nA brother and sister uncover a terrifying ritual at the secluded home of their new foster mother.\n\nCast: \n\nBilly Barratt, Sora Wong, Jonah Wren Phillips, Sally-Anne Upton, Stephen Phillips, Mischa Heywood and Sally Hawkins\n\nTrailer:\n\n[https://www.youtube.com/watch?v=kBskrYZfhw8](https://www.youtube.com/watch?v=kBskrYZfhw8)\n\nTicketing Link:\n\n[tickets.bringherback.movie](http://tickets.bringherback.movie)\n\nOut in theaters May 30.\n\nAsk us anything! Back at 3 PM ET later today Friday 5/16 for answers.",
        "upvotes": 216,
        "comments": 229,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yy5qx7lqq41f1.png?auto=webp&amp;s=6f3cffe4e10a06544a941ca86361c8229da4b6fc"
        },
        "permalink": "/r/movies/comments/1knzwcl/hi_rmovies_were_danny_michael_philippou_directors/"
    },
    {
        "id": "1kw8cdm",
        "author": "chrispdx",
        "title": "You often hear the phrase \"They Couldn't Make That Movie Today!\" about a movie that they could. What movies from the past could they LITERALLY not make today?",
        "content": "The one that pops to my mind is from 1984: \"Blame It On Rio\", where middle-aged Michael Caine has a sexual relationship with his co-worker's teenage daughter while on vacation in Brazil.\n\nIn fact, most of the late-70s to mid-80s teenage sex comedies couldn't be made today due to hightened sensibilities about exploitation.\n\nAny others?",
        "upvotes": 6024,
        "comments": 3433,
        "media": null,
        "permalink": "/r/movies/comments/1kw8cdm/you_often_hear_the_phrase_they_couldnt_make_that/"
    },
    {
        "id": "1kwfvq8",
        "author": "Fabulous_Bluebird931",
        "title": "Robin Williams' Popeye Was Filmed While the Set 'Snowed with Cocaine'",
        "content": "",
        "upvotes": 678,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x13Ggv0_QZC8I5LgJfcMchqki5FZ33N4neWgaDSqsQU.jpg?auto=webp&amp;s=4011768d553bf6aef22cb25b97af625ae56b5f38"
        },
        "permalink": "/r/movies/comments/1kwfvq8/robin_williams_popeye_was_filmed_while_the_set/"
    },
    {
        "id": "1kwdyva",
        "author": "diapersareforgods",
        "title": "\"What movie scene or trope do most people dismiss as unrealistic, but you know from personal experience is actually spot-on?\"",
        "content": "I’m curious — are there any moments in movies that people often call out as \"Hollywood exaggeration\" or \"totally unrealistic,\" but you've lived through something just like it?\n\n\n\nMaybe it's something as dramatic as surviving a freak accident, or as mundane as how a workplace operates. What’s a scene or trope that felt weirdly real to you because you've actually experienced it?\n\n\n\nBonus points if you can name the movie and the scene!",
        "upvotes": 282,
        "comments": 355,
        "media": null,
        "permalink": "/r/movies/comments/1kwdyva/what_movie_scene_or_trope_do_most_people_dismiss/"
    },
    {
        "id": "1kvynwo",
        "author": "JannTosh70",
        "title": "30 Years Ago, 'Die Hard With a Vengeance' Revitalized the Franchise With Samuel L. Jackson In a Dynamite Buddy-Cop Pairing",
        "content": "",
        "upvotes": 2000,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1kvynwo/30_years_ago_die_hard_with_a_vengeance/"
    },
    {
        "id": "1kvlltr",
        "author": "freudian_nipps",
        "title": "Werner Herzog on shooting extra footage for films",
        "content": "",
        "upvotes": 25469,
        "comments": 906,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7hg3zzon023f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kvlltr/werner_herzog_on_shooting_extra_footage_for_films/"
    },
    {
        "id": "1kw6yvc",
        "author": "SanderSo47",
        "title": "Netflix Buys Richard Linklater’s New Film ‘Nouvelle Vague’ For $4M – Starring Guillaume Marbeck and Zoey Deutch, it follows the filming of Jean Luc-Godard's ‘Breathless’ in 1959.",
        "content": "",
        "upvotes": 464,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fiC2eAbb443xY_wqWgUpXNSjjoNhwpCFFimDSn9fDac.jpg?auto=webp&amp;s=7ac2986753bd523507091947c74eb699f31d282e"
        },
        "permalink": "/r/movies/comments/1kw6yvc/netflix_buys_richard_linklaters_new_film_nouvelle/"
    },
    {
        "id": "1kw78h2",
        "author": "doodlebuuggg",
        "title": "Pee-Wee as Himself is a beautiful depiction of an artist - with poor execution",
        "content": "I'm not going to pretend I knew Paul Reubens, nor am I a professional documentary director. But I have some brief experience in interviewing artists and people in the industry for what little time I have been doing mini-documentaries. (I even interviewed a few people in this one on a different subject!)\n\nBut after watching Pee-Wee as Himself, the new two-part documentary about the life of Paul Reubens, something rubbed me the wrong way. Here we are going through Paul's entire life- from birth to death- and along the way we discover that he's a difficult person to work with. Director Matt Wolf immediately runs into this during production; Paul not wanting to disclose his sexuality, wanting to take control of the documentary because it's about *him* and everything he's done. But it seems, as the documentary goes on, Wolf doesn't understand how to collaborate with Paul. Paul isn't a very trusting person and instead of Matt trying to earn that trust over time, he seems to constantly ask for it, and from what I could tell that only made Paul more nervous about the entire thing. It's obvious during the entire documentary that Paul works best with other artists- other like-minded people when he's creating something. What I saw in this documentary didn't reflect that relationship, I saw someone who directs documentary just trying to make another one on his subject. Paul wasn't just another subject, he was more than that, and I think Matt should've let Paul take the helm a few times like he wanted. There was too much focus on his relationship with Paul in the documentary. A director inserting themselves in their own doc always feels weird and this time was the weirdest for me thus far.\n\nI don't know what Matt and Paul's relationship was like behind the camera, I'm sure there's more I didn't get to see and maybe they were closer than what the documentary lets on, but, I didn't feel that Matt knew how exactly to play with and respect Paul as a human being. The documentary itself also felt heavily disorganized and sometimes disorienting. I don't know, I was just disappointed.\n\nEdit: To clarify, I overall enjoyed the film. Gave it four outta five stars. I just had to express my feelings about Paul and Matt's relationship. I think things could've gone better.",
        "upvotes": 257,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1kw78h2/peewee_as_himself_is_a_beautiful_depiction_of_an/"
    },
    {
        "id": "1kvzx4l",
        "author": "MuddyBuddy-9",
        "title": "80’s movies that are OK to watch with my 12 year old",
        "content": "My 12 year old and I have been bonding over watching movies from my youth. So far, they’ve been fine- without coming across a super cringey scene or some kind of sexism that was OK back then but not now. So I’ve been lucky, and want to continue my streak. \n\nWe have watched: \n- the Goonies \n- Teen Wolf \n- the Wonder Years (show)\nPlan to watch: \n- Stand By Me\n- E.T. \n\nRefuse to watch: \n- any brat pack movies \n\nPlease share your thoughts on 80’s movies that have aged well: \n\n",
        "upvotes": 636,
        "comments": 1899,
        "media": null,
        "permalink": "/r/movies/comments/1kvzx4l/80s_movies_that_are_ok_to_watch_with_my_12_year/"
    },
    {
        "id": "1kw88o9",
        "author": "Slateboard",
        "title": "When did corporate villainy become popular in movies?",
        "content": "I was watching Blade from 1998, and the vampires were heavily organized, involved with big businesses, politics, etc, and it showed the leaders sitting around a long table in big office chairs. \n\nSo seeing that, it had me wondering where this kind of thing started, or what may have triggered it, since I see it in various forms in media.",
        "upvotes": 152,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1kw88o9/when_did_corporate_villainy_become_popular_in/"
    },
    {
        "id": "1kvxfp4",
        "author": "nickrashell",
        "title": "Who is your most hated character in all of film?",
        "content": "What character do you absolutely loath? They don’t need to be the most evil just the one that really gets under your skin.\n\nFor me it is **Mrs. Carmody** from The Mist. My god I cannot stand her. She is the embodiment of self-righteousness and forcing religion and beliefs on to other people, and pleasure she takes in dealing out punishment, I just hate her.\n\nWho is your pick?",
        "upvotes": 546,
        "comments": 684,
        "media": null,
        "permalink": "/r/movies/comments/1kvxfp4/who_is_your_most_hated_character_in_all_of_film/"
    },
    {
        "id": "1kwa3nd",
        "author": "JannTosh70",
        "title": "How Steven Spielberg and J.J. Abrams Helped Bring 1995's Casper to the Big Screen",
        "content": "",
        "upvotes": 89,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dR1_O20SUXD6Ok_WBCTnz1VYfuADBT1SJEtvUjEMP9o.jpg?auto=webp&amp;s=0344e968c4a0e72262cee4150d76c09ecd061974"
        },
        "permalink": "/r/movies/comments/1kwa3nd/how_steven_spielberg_and_jj_abrams_helped_bring/"
    },
    {
        "id": "1kw2xet",
        "author": "Historical_Ostrich",
        "title": "What's the last movie you couldn't finish?",
        "content": "For me, it's The End. Saw it on Hulu and the premise looked interesting - a family surviving in a bunker after the end of the world - but I had no idea it was supposed to be a musical. Really wasn't in the mood for that, and the songs were just bad and off-putting. \n\nI also gave up on Y2K pretty recently. That one I had a better sense of the premise, but I just didn't think it was particularly funny or well-executed, and I didn't care to spend another 45 minutes on it.",
        "upvotes": 230,
        "comments": 791,
        "media": null,
        "permalink": "/r/movies/comments/1kw2xet/whats_the_last_movie_you_couldnt_finish/"
    },
    {
        "id": "1kw3m37",
        "author": "Interesting_Case32",
        "title": "I Loved 12 Angry Men - What Should I Watch Next?",
        "content": "\n\nHey everyone!\nI'm in the mood to watch something really compelling, and I’d love to get some recommendations. One of my all-time favorite films is 12 Angry Men (1957). I was completely blown away by how such a simple setting—a single jury room—could produce so much tension, drama, and emotional impact. The way the characters’ personalities clashed, the powerful dialogue, and the slow unraveling of biases and hidden motives really made it an unforgettable experience for me.\n\nI’m looking for more movies that have a similar vibe: dialogue-driven, character-focused, and intellectually engaging. I don’t mind black-and-white or older films at all—in fact, I kind of love them. I appreciate stories that dive into human nature, justice, morality, and conflict—especially ones where the stakes are high and the tension builds slowly through conversation rather than action.\n\nOne of my other favorites is The Shawshank Redemption (1994)—such a brilliant story about hope, justice, and inner strength. I also enjoyed A Few Good Men for its courtroom drama and To Kill a Mockingbird for its exploration of justice and racism.\n\nSo if you know any films like 12 Angry Men, whether they’re courtroom dramas, intense one-room settings, or just smart, dialogue-heavy stories, please send them my way. I’d also love to hear what your favorite movies are—even if they’re not exactly in the same genre. I’m open to watching anything that leaves a strong impact or makes you think.\n\nThanks in advance, and I look forward to diving into some of your suggestions!",
        "upvotes": 202,
        "comments": 394,
        "media": null,
        "permalink": "/r/movies/comments/1kw3m37/i_loved_12_angry_men_what_should_i_watch_next/"
    },
    {
        "id": "1kw5kzv",
        "author": "ControlCAD",
        "title": "Marcel Ophuls, Oscar-winning film-maker of 'The Sorrow and the Pity', dies aged 97",
        "content": "",
        "upvotes": 116,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TnkPlWyWROGj0KfJbkOzpM5taCFpz6dTIS8p954Dkz0.jpg?auto=webp&amp;s=64aec2bf0ab1cdfcfe319ea0aef4872ef6c58d47"
        },
        "permalink": "/r/movies/comments/1kw5kzv/marcel_ophuls_oscarwinning_filmmaker_of_the/"
    },
    {
        "id": "1kw4mt7",
        "author": "Ghostmoderator",
        "title": "Long ass day movies",
        "content": "What are movies that if it was actually real, that by the end of the movie you would say to yourself \"Damn, that was one long ass day!\" A couple examples of this are Training day and Changing Lanes. I think these kind of movies will always leave you thinking about life for a bit afterwards. The movie doesn't necessarily have to take place all in one day, but they usually do.",
        "upvotes": 115,
        "comments": 294,
        "media": null,
        "permalink": "/r/movies/comments/1kw4mt7/long_ass_day_movies/"
    },
    {
        "id": "1kvcddc",
        "author": "Honkydoinky",
        "title": "The princess bride just stole my heart",
        "content": "I watched the princess bride for the first time today, and everything about that movie is perfect in my eyes. At no point of the movie was I bored for a moment, I went in thinking I’d watch half and finish it later. Boy was I wrong. Every character felt charming and fleshed out enough for their role in the story. I really was rooting for Inigo, hoping Westley and buttercup would find a way to end up together. There were funny enough gags to get a chuckle out of me like the mawwage part towards the end. I just wanted to get a short rant off about how much I love this movie",
        "upvotes": 6880,
        "comments": 593,
        "media": null,
        "permalink": "/r/movies/comments/1kvcddc/the_princess_bride_just_stole_my_heart/"
    },
    {
        "id": "1kvplm0",
        "author": "mrjohnnymac18",
        "title": "Hush over Hollywood: why has it become so hard to make films in Los Angeles?",
        "content": "",
        "upvotes": 636,
        "comments": 111,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EiNGwa7L5o2bLg92ZOors2DY-BfelbicXy4rdtxcKfE.jpg?auto=webp&amp;s=0a8b8bf54727eb0e9bb6185c9084923e94478bcd"
        },
        "permalink": "/r/movies/comments/1kvplm0/hush_over_hollywood_why_has_it_become_so_hard_to/"
    },
    {
        "id": "1kw4tk7",
        "author": "BunyipPouch",
        "title": "Poster for Supernatural-Horror 'The Surrender' - When the family patriarch dies, a grieving mother and daughter risk their lives to perform a brutal resurrection ritual and bring him back from the dead.",
        "content": "",
        "upvotes": 75,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uwbbj4pvs63f1.jpeg?auto=webp&amp;s=b09108269ac3ff9bc6cb9b3b753e4dfc53451899"
        },
        "permalink": "/r/movies/comments/1kw4tk7/poster_for_supernaturalhorror_the_surrender_when/"
    },
    {
        "id": "1kw8q45",
        "author": "gilette_bayonete",
        "title": "The Master (2012)",
        "content": "Joaquin Phoenix's best role IMO. It's incredible how dysfunctional he was able to play the character. Everything from the mannerisms to the way he talks, it's like both the booze and WW2 messed him up so bad psychologically that he was permanently disfigured physically. \n\nThere's something about this movie that nails suffering right on the head. The only character that I can think of that was that bad on the booze is Daniel Plainview which happened to be another Paul Thomas Anderson film 😂\n\nThat scene of the two of them getting arrested is seared into my brain. As someone whose both struggled with alcohol as well as seen it secondhand I have to say it's scary accurate how Freddy acts. ",
        "upvotes": 30,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1kw8q45/the_master_2012/"
    },
    {
        "id": "1kw46pi",
        "author": "Big_Collection373",
        "title": "Movies that are similar to knives out",
        "content": "So Knives out is essentially my favorite movie of all time. I have looked through many subreddits with the recommendations of similar movies like murder at the orientation express or see how they run. I’ve basically seen many murder mysteries and not one has given me the pleasure of knives out. Does anyone have any recommendations? It doesn’t even have to be a murder mystery as long as it’s something of that style. Oh also godsford park is on my watch list for the upcoming weekend.",
        "upvotes": 58,
        "comments": 197,
        "media": null,
        "permalink": "/r/movies/comments/1kw46pi/movies_that_are_similar_to_knives_out/"
    },
    {
        "id": "1kw9z5t",
        "author": "Constant-Way-6570",
        "title": "What would you call the trilogy of Blow-Up, The Conversation, and Blow-Out?",
        "content": "Blow-Up is a 1966 movie where a photographer accidentally realizes the background of his photos may contain evidence of a murder, The Conversation is a 1974 movie where a surveillance guy overhears something that suggests someone he's spying on will soon be murdered, and Blow-Out is a 1981 movie where an audio engineer accidentally records evidence of a murder. They're pretty similar, but I don't know what you'd call them as a little trilogy. ",
        "upvotes": 24,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1kw9z5t/what_would_you_call_the_trilogy_of_blowup_the/"
    },
    {
        "id": "1kvf79v",
        "author": "Dramatic-Airline-415",
        "title": "Missing scene in The Apprentice 2024 was it cut for streaming",
        "content": "I saw The Apprentice in the cinema and remember a scene where Trump, after the scalp reduction procedure, shouts at Ivana saying “Your f***ing doctor has ruined me.”\n\nI just rewatched the movie on a streaming platform and that scene is gone. I checked IMDb and Wikipedia and found no mention of different versions or edits.\n\nIs it possible this scene was removed between the theatrical release and the streaming version? Or am I misremembering? If it was cut, does anyone know the reason?\n\n\nEdit : Thank you all for your comments. I wasn’t expecting such a lively discussion. I found an article in Vanity Fair, dated 11 October and written by Julie Miller, that mentions this specific moment I referred to. It is from Harry Hurt III’s book Lost Tycoon: The Many Lives of Donald J. Trump, which served as one of the main sources for the film.\n\nNow I’m confused, because several of you said you saw the scene too. So, I rewatched the final act and tried to figure out where it might have been. In my memory, it came after the surgery. He’s in pain from the skull reduction and blamed Ivana and her doctor. \n\nThis shouldn’t be confused with the earlier rape scene. In that one, Ivana brings him a book about the G-spot and female pleasure. He tells her he no longer finds her attractive, and she tells him he’s getting fat, bald, and orange. He gets angry, throws her to the floor, and forces himself on her.\nI saw the film when it was released in France last year, and I don’t think our version was any different. So now I’m genuinely unsure if I’m remembering something that wasn’t there, or if the scene was actually included. Maybe because I’d already read the article and a similar one after watching the movie, I mentally inserted the scene into the narrative.\n\nHowever my initial reaction when I watched the film was - where is that scene?\nNow I’m wondering, where would it even fit. Because after the surgery, he finishes his transformation into this sort of Trump-stein, then comes the last scene with Tony Schwartz, the ghostwriter of The Art of the Deal, and shares what are supposed to be his life lessons, learned from Roy Cohn.\nSo I am not sure how another Ivana scene will fit there.\nI thought looking into it would clear things up, but honestly I feel even more lost now. I guess we’ll have to ask the director 🙂",
        "upvotes": 1953,
        "comments": 126,
        "media": null,
        "permalink": "/r/movies/comments/1kvf79v/missing_scene_in_the_apprentice_2024_was_it_cut/"
    },
    {
        "id": "1kwhrly",
        "author": "Throatgoatgirly",
        "title": "Give me recommendations for a movie that keeps you on the edge of your seat but also has happy vibes",
        "content": "Bored and looking for a movie to watch with husband, I get bored easily and I want something not too scary or gritty, but still interesting. \nI was going to show him the hunger games series but I don’t feel like seeing something I’ve already watched. We are both big Star Wars fans and like the prequel trilogy, i like Tom hanks movies, &amp; Adam Sandlers click. Some films I tried and didn’t like: I tried to watch the Truman show once, saw black widow twice and couldn’t get myself to pay attention ",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1kwhrly/give_me_recommendations_for_a_movie_that_keeps/"
    },
    {
        "id": "1kvgu3r",
        "author": "indiewire",
        "title": "Scarlett Johansson Says She Has Always Wanted to Direct, but Acting Took Precedence",
        "content": "",
        "upvotes": 1360,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C7tsG-ngybjw6IKfH3PuJWZyvjfrLLTWZd-WKtV8oE4.jpg?auto=webp&amp;s=a9c7626cf85c64658af03c5fc1409e97814485d3"
        },
        "permalink": "/r/movies/comments/1kvgu3r/scarlett_johansson_says_she_has_always_wanted_to/"
    },
    {
        "id": "1kvuj7b",
        "author": "kosmokatX",
        "title": "Aniara",
        "content": "I just watched Aniara last night. A movie I wouldn't have watched without it being mentioned on here. I wasn't aware of it at all before. But as a big Scifi Fan I was invested as soon I heard of it of course. I was prepared for the worst (i.e. going into The Road without any knowledge before watching it). This movie was SO incredible! I mean everything of it.\n\nEven as a European consuming a lot of non Hollywood movies I'm not used to actors/actresses looking that human. I had to overcome my own expectations and prejudices regarding the looks of the actors/actresses. What a refreshing experience! And what a miss for any big budget production. Watching the unfiltered charakters handling this extremely hard situation helps immensely to dive into this experience.\n\n\nThe movie itself was just emotionaly mind-blowing and cognitively confirming at the same time. I'm glad I'm part of this Sub to be able to learn about movies I would miss otherwise. So a big Thanks to all of you!\n\n\nETA: The discussion I intended to start is about the design of the characters, mainly the outside, the look of all participants. In my understanding it was bleak, showing how good one of the characters is handling this situation. I would appreciate some screenshots i.e. ",
        "upvotes": 93,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1kvuj7b/aniara/"
    },
    {
        "id": "1kwhsu5",
        "author": "mrjohnnymac18",
        "title": "James Bond franchise owners request more time to defend control of 007 spy name",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_KifZuq4wrFppOqWeABnOmkgSv-iviGJg0AMRqZF454.jpg?auto=webp&amp;s=8d6e940420654218613444d72919e02cd4d4eb63"
        },
        "permalink": "/r/movies/comments/1kwhsu5/james_bond_franchise_owners_request_more_time_to/"
    },
    {
        "id": "1kvkaq3",
        "author": "Wonder-Lad-2Mad",
        "title": "Holy shit, Wrath of Khan (1982) blew my mind. When Star Trek is good, It's *really* fucking good.",
        "content": "My only experience with Star Trek was the first JJ movie, so I have some basic familiarity with the setting. Suddenly I got the urge to go back and experience the classic series. I'm not still sure about commiting to watching any of the shows so I decided to check out the movies.\n\n\nI saw Star Trek The Motion Picture. Man, that was slow as hell. The story is fine, but the plot progresses at the speed of snails. So many unnecessary exterior shots and scenary. But despite that, I got a taste for what classic Trek was like and I dug it.\n\n\nRn I finished Wrath of Khan. Ah that hit the spot man. It was so good. Ugh I love old timey acting so much. So much class and the performances are so elegant.\n\n\nWhat a kick ass story, high stakes and emotional. They totally got me. I &gt;!wasn't expecting at all to see Spock die, bravo. And the eulogy scene is brilliant!&lt;\n\n\nShatner's great as Kirk. I love how cunning and willful his Kirk is, compared to the wildcard rebel that's Chris Pine's Kirk. I'm really curious now what young Kirk must be like.\n\n\n\nBest performance is hands down Ricardo Montalban. Holy shit that guy can act and deliver a mean monolouge. Every line he speaks is iconic. 10/10 delivery. Ironicly this isn't the first time I've seen Montalban. I knew him as the villain from Naked Gun 1 lmao. He was performing his heart out in that too. What a great actor.\n\n\n\nOh man, I dug the vibes of the this movie so much that I'm gonna watch Star Trek 3 and 4 too. I don't care if they're not as good, as long as I get more from the cast I'm gonna enjoy it.\n\n\n\nAlso, R.I.P. &gt;!Captain Terrell!&lt;, you're only crime was wearing a red coat.",
        "upvotes": 552,
        "comments": 209,
        "media": null,
        "permalink": "/r/movies/comments/1kvkaq3/holy_shit_wrath_of_khan_1982_blew_my_mind_when/"
    },
    {
        "id": "1kw2eio",
        "author": "Lumpy-Marsupial-6617",
        "title": "Thirteen Days with Bruce Greenwood, Kevin Costner, Steven Culp",
        "content": "What an absolute masterpiece, besides Kevin Costner's atrocious accent. I daresay it was better than Oppenheimer in my humble opinion for being a period documentary piece, though not with the veneer quality from the obvious disparity in budget and thus production value. \n\nI can't believe how many heavy hitters they had in the movie. Steven Culp to me totally stole the show as Bobby Kennedy. \n\n",
        "upvotes": 30,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1kw2eio/thirteen_days_with_bruce_greenwood_kevin_costner/"
    },
    {
        "id": "1kwf657",
        "author": "xmaxmonkeyx",
        "title": "Movies like these?",
        "content": "3 of my favorite movies are Friday, Mid 90s, and the fast and the furious, and I feel like they give off a certain aesthetic or vibe that I just really enjoy. What are some other movies or even tv shows like this? Maybe its something about the time period or that they are all set in LA but I would appreciate any suggestions. ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1kwf657/movies_like_these/"
    },
    {
        "id": "1kwb2dl",
        "author": "Virologist_LV4",
        "title": "Wishmaster (1997) 2,3,4.",
        "content": "I'm watching Wishmaster on TUBI. I've watched Wishmaster 1, 2, and I'm currently watching Wishmaster 3. Afterwards I will be watching Wishmaster 4.\n\nAfter watching Wishmaster 1 and 2, as a Djinn, I'd be pretty pissed off at the Wishmaster, considering he's the only hope for his race to exist on Earth and leave the space between worlds.\n\nImagine being the only hope for your entire race to exist and continually fuq it up. If I were a Djinn, I'd be seriously pissed off at the Wishmaster, and if I was watching the Wishmaster try and free us again, I'd have no confidence in his ability to deliver.\n\nWishmaster is seriously lucky to be trapped in the Secret Fire Opal, because his entire race would be beating his ass for being outsmarted by human women over and over again. Seriously, tag out and let any other Djinn take a crack at it.\n\nI believe the only reason Earth hasn't been overtaken by the Djinn, is because the same one keeps bricking wishes. At this point, the Wishmaster is probaby purposely failing out of fear from what the Djinn race would do to his ass once released for fuqing up so many times.\n\nThe Djinn race is sitting there pulling their tentacles out asking themselves how many different ways the Wishmaster can fuq them over again and again. He's definitely torturing the Djinn race in ways he could never hope to torture humans.\n\nAnyways, what did you think about Wishmaster? Have you seen it? Do you think this Djinn is failing his entire race on purpose at this point, or is he genuinely being outsmarted by the smartest humans on earth with the bad luck of always coming across them as the ones who released him?",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1kwb2dl/wishmaster_1997_234/"
    }
]