[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lb5tck",
        "author": "_reasonabledictator_",
        "title": "come mannaggia si trova un lavoro a torino",
        "content": "Io personalmente non abito più a Torino da un paio d'anni, ma ho una cara amica molto giovane (23 anni) che abita lì da diverso tempo. Per varie ragioni personali sta pensando di lasciare l'università e cercare lavoro, ma nonostante mille cv mandati (anche al mc, non ha tante pretese, le andrebbe benissimo fare la cameriera), nessuno la chiama. Quando abitavo a Torino ho notato anche io una situazione disperata a livello lavorativo, ora che sono in Veneto non ho di questi problemi e ho avuto decine di colloqui in pochissimo tempo e ampia possibilità di scelta. Come consigliereste di muoversi in una città come Torino a una ragazza in questa situazione? Preciso che non ha esperienza, qualche lavoro saltuario da cameriera e volontaria coi bambini.\n",
        "upvotes": 27,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1lb5tck/come_mannaggia_si_trova_un_lavoro_a_torino/"
    },
    {
        "id": "1lb77i7",
        "author": "initial_chris",
        "title": "Regolamenti comunali accensione aria condizionata",
        "content": "\nCiao a tutti,sto cercando di capire se qualcuno sia a conoscenza di eventuali regolamenti comunali a Torino che limitino l’uso dell’aria condizionata nelle stanze riservate agli studenti.\n\nSono in una residenza universitaria privata (che ospita anche un hotel) e, a differenza delle camere destinate a chi soggiorna ai piani riservati per l hotel, l’aria condizionata per gli studenti è attiva solo dalle 11 alle 18. La direzione sostiene che sono obbligati a fare così a causa delle norme del comune che impediscono loro di tenerla accesa in altri orari, e che anzi l’hanno già accesa “in anticipo”, dato che secondo loro la legge imporrebbe di attivarla solo dal 15 giugno.\n\nIo però ho una stanza esposta completamente al sole, con pareti vetrate e tende nere. Stanotte sembrava di essere in un forno crematorio con zero ricircolo dell'aria (tenessero almeno la ventola attiva), e diventa praticamente impossibile dormire.\n\nHo confrontato la situazione con un’altra residenza privata (seppur in parte convenzionata da Edisu), e lì l’aria condizionata è attiva H24, con attivazione automatica tramite badge e un setpoint regolato tra 23 e 24 gradi. Quindi inizio a dubitare fortemente dell’esistenza di “regole comunali”.\n\nQualcuno ha info più precise? Davvero a Torino esistono normative che limitano l’uso dell’aria condizionata solo per le stanze studenti e non per quelle alberghiere, all’interno della stessa struttura?\nÈ possibile muoversi in qualche modo per costringerli ad accendere l'aria condizionata allo stesso modo di come è accesa nel resto della struttura?\n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lb77i7/regolamenti_comunali_accensione_aria_condizionata/"
    },
    {
        "id": "1lb73fi",
        "author": "Ok-Eye4820",
        "title": "Biblioteche con aria condizionata",
        "content": "Esattamente come da titolo, ma non solo a Torino, anche in provincia. Dove andate abitualmente per non cuocere tutto il giorno?",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lb73fi/biblioteche_con_aria_condizionata/"
    },
    {
        "id": "1laqvow",
        "author": "_L_-",
        "title": "Madonna che caldo",
        "content": "Chi non ha un climatizzatore è spacciato ",
        "upvotes": 86,
        "comments": 43,
        "media": null,
        "permalink": "/r/torino/comments/1laqvow/madonna_che_caldo/"
    },
    {
        "id": "1lb2nj5",
        "author": "esme87_",
        "title": "La curiosità mi attanaglia",
        "content": "Ciao a tutti, ieri, come anche altre sere, sono andata a Venaria. Ho parcheggiato all’inizio del viale che porta all’ingresso del parco La Mandria (ingresso Ponte Verde, non Tre Cancelli).\nEd è proprio nello spiazzale dei parcheggi all’ingresso che vedo sempre un via vai continuo di auto, luci che si accendono e si spengono, auto che percorrono il viale e si fermano lì in mezzo con le luci accese.\nInquietante, anche perché non si sentono rumori se non le rane che gracidano.\nHo pensato possa trattarsi di coppie che cercano un posto per appartarsi, ma la quantità di auto mi sembra eccessiva.\nPunto per scambisti? Guardoni? Sesso in generale?",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1lb2nj5/la_curiosità_mi_attanaglia/"
    },
    {
        "id": "1lbcp6a",
        "author": "Short_Chocolate_6815",
        "title": "Vostra esperienza a Torino",
        "content": "Solo io trovo difficilissimo rimorchiare qualche ragazzo a Torino? Mi sembra che non sia proprio fattibile fare una bella chiacchierata o qualcosa di più con qualcuno. Perché? Sbaglio io o non si vuole più sc**are? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lbcp6a/vostra_esperienza_a_torino/"
    },
    {
        "id": "1lbafy9",
        "author": "Few_Willingness_5198",
        "title": "c'è una ditta edile di Torino un minimo affidabile?",
        "content": "avevo idea di creare un bagno e cucinotta aggiuntivi  dal momento che i miei sono sempre occupati da moglie e figli, quindi non è un lavorone enorme. qualcuno conosce qualcuno che non faccia disastri e sia un minimo affidabile?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lbafy9/cè_una_ditta_edile_di_torino_un_minimo_affidabile/"
    },
    {
        "id": "1lb766f",
        "author": "silviuzX2",
        "title": "Elettricità stamattina",
        "content": "Preciso la zona: Parella. Tra stanotte (4-5) e stamattina fino a due orette fa é saltata la corrente in gran parte della zona (tantissimi antifurti che suonavano ecc) almeno 4 volte, per circa 20 minuti ciascuna all’incirca (ma anche una settimana fa é successo). Io penserei anche che il motivo sono i 3000 condizionatori accesi contemporaneamente date le temperature di questi giorni, ma è possibile che la rete sia così vecchia e scarsa ? É successo anche in altri quartieri ? Mannaggia ad Iren",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lb766f/elettricità_stamattina/"
    },
    {
        "id": "1lb8usq",
        "author": "TroubleForward4985",
        "title": "Ciao qualcuno con cui uscire a torino stasera",
        "content": "Sono vicino Porta Susa con un amico, cerchiamo compagnia questo ultimo giorno in quanto domani dovrò ripartire per Milano. \nFateci sapere! nel caso vi parleremo meglio di noi 2 ‼️‼️🤣🤣 yogurt ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lb8usq/ciao_qualcuno_con_cui_uscire_a_torino_stasera/"
    },
    {
        "id": "1lazb2y",
        "author": "Libertymobile",
        "title": "Come posso trovare stanza?",
        "content": "Sono brasiliano, 34 anni con passaporto europeo, come posso trovare monolocale o stanza? Ho provato alcuni gruppi su Facebook ma nessuno risponde, non so se è perché sono brasiliano. Qualcuno conosce una stanza e potrebbe consigliarla? Sono una persona molto pulita e tranquilla, passo più tempo nella mia stanza a lavorare.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lazb2y/come_posso_trovare_stanza/"
    },
    {
        "id": "1lb8rll",
        "author": "SpeechHaunting8877",
        "title": "Parcheggi vicino Parco Leopardi?",
        "content": "Bella raga, sapete dove posso trovare un posto comodo per la macchina in zona Parco Giacomo Leopardi? Ce ne sono\nCome orari andrò domenica prossima al mattino  ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lb8rll/parcheggi_vicino_parco_leopardi/"
    },
    {
        "id": "1lb8dvx",
        "author": "glorious-ahole",
        "title": "compleanno presto",
        "content": "Sono nuovo a Torino, è il mio primo mese per essere precisi. Tra poco festeggerò il mio compleanno e vorrei regalare qualcosa ai miei colleghi (niente di troppo costoso). Stavo pensando a dei cioccolatini. È una buona idea?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lb8dvx/compleanno_presto/"
    },
    {
        "id": "1lb4tol",
        "author": "andrew003345679",
        "title": "Vermouth Rosso buono?",
        "content": "Devo fare un regalo, non bado a prezzi",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lb4tol/vermouth_rosso_buono/"
    },
    {
        "id": "1lb4bog",
        "author": "Unknowndragon10",
        "title": "Cerco gente appassionata di giochi da tavolo, di ruolo o videogiochi (tra i 20 e i 27 anni)",
        "content": "Ciao a tutti!\nSono alla ricerca di persone a Torino che abbiano voglia di condividere le stesse passioni: giochi da tavolo, giochi di ruolo e videogiochi.\n\nSono un ragazzo di 23 e mi piacerebbe trovare un gruppetto con cui giocare dal vivo ogni tanto, passare una serata nel chill su qualche videogioco o chiacchierare davanti ad una birra.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lb4bog/cerco_gente_appassionata_di_giochi_da_tavolo_di/"
    },
    {
        "id": "1la96x3",
        "author": "theallglowing",
        "title": "VHS ambiguo in zona Porta Susa. Esperimento sociale?",
        "content": "Due sere fa' ho trovato questo VHS, posizionato in modo \"strategico\". Qualcuno sa se si tratta di una campagna pubblicitaria/esperimento sociale di qualche content creator? \n\nÈ stato veramente strano trovare un VHS, così de botto, con scritto 'sex' sopra e mi ha incuriosito! ",
        "upvotes": 120,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7lan7jkm4n6f1.jpeg?auto=webp&amp;s=42525433dcdb0361e3a49d7feaf9a1e15bd1787e"
        },
        "permalink": "/r/torino/comments/1la96x3/vhs_ambiguo_in_zona_porta_susa_esperimento_sociale/"
    },
    {
        "id": "1laf670",
        "author": "cerebralme",
        "title": "Furto cassa automatica Esselunga",
        "content": "Oggi ero in coda per le casse dell esselunga di porta nuova, la commessa mi indica di andare a una delle automatiche dove una ragazza stava imbustando tipo 8 confezioni di tofu, mi metto lì  vicino mentre questa freneticamente si spinge il tofu nello zaino, le dico che non deve fare di corsa, che aspetto bolentieri e mi cade l'occhio  sul conto scansionato ancora da pagare: 2.99 euro, mi rendo conto della situazione e del perché  sia così  in ansia. Le rivolgo un piccolo sorriso e lei dice \"allora io vado\" e con ancora lo zaino aperto scappa verso l'uscita lasciando il conto aperto, la commessa mentre mi sbloccava la cassa lasciata aperta ha notato la cosa e credo abbia mandato qualcuno a vedere di \"bloccare la ragazza\"\n\nOra io non giudicherò mai qualcuno che ha bisogno di mangiare seppur devo dire 8 confezioni di tofu sono una dieta poittosto triste  ma la tecnica utilizzata mi e sembrata talmente stupida: è  uscita denza pagare nemmeno lo scontrino \"ridotto\" e con un evidente impedimento al sembrare nonchalant. Boh. \n\nVorrei chiedervi le vostre esperienze con queste casse che ormai è  il segreto di pulcinella vengano usate  per rubare.\n\n Vi è  mai successo di \"dimenticarvi\" di scannerizzare un articolo? Di essere beccati?\n\n Per essere chiari con i nostri amici delle forze dell ordine prego di scrivere solo storie di nostri amici lontani 🫣",
        "upvotes": 35,
        "comments": 52,
        "media": null,
        "permalink": "/r/torino/comments/1laf670/furto_cassa_automatica_esselunga/"
    },
    {
        "id": "1lac6v8",
        "author": "dreamskij",
        "title": "Anche il todays e' morto... (si', sono in ritardo)",
        "content": "E insomma, oggi d'improvviso mi rendo conto di non avere ancora visto i manifesti per il Todays... e scopro che dopo l'ultima edizione col cambio di sede (venue troppo grande in effetti, a parte per i Massive Attack), e' morto un festival che aveva lineup senza dubbio fighi e che per tanti anni e' stato l'ultimo regalo dell'estate.\n\nSul pratino dello Spazio 211 avevo visto Pj Harvey, gli Editors, gli Interpol, i Sonic Youth... e Anna Calvi, Black Country New Roads, Jarvis Cocker, The War on Drugs, King Hannah e altri che ora dimentico. Peccato, e' la morte di una piccola era per me :(",
        "upvotes": 44,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lac6v8/anche_il_todays_e_morto_si_sono_in_ritardo/"
    },
    {
        "id": "1laftih",
        "author": "kaiserxol",
        "title": "Metro e GTT: perfavore tenete i bocchettoni aria sempre aperti",
        "content": "Come da testo, sono proprio ora in metro e finalmente scorre parecchia aria all’interno, ovviamente solo in movimento. Sicuramente hanno aperto qualcosa nella parte superiore, cosa che non mi capita di sentire da tempo.\n\nSono vagoni sigillati, vi prego teneteli sempre aperti almeno in primavera/estate. Non fanno miracoli, ma almeno si riesce a respirare e non manca l’aria!!\n\nGrazie 🙏 ",
        "upvotes": 19,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1laftih/metro_e_gtt_perfavore_tenete_i_bocchettoni_aria/"
    },
    {
        "id": "1laoi5p",
        "author": "No-Disaster-2966",
        "title": "Eventi di speed dating a Torino?",
        "content": "Ciao a tutti! Come da titolo volevo sapere se ci sono degli eventi di speed dating a Torino frequentati da giovani ragazzi e ragazze (fascia 20/30 anni) e in caso come ci si può unire!\nGrazie a tutti per le risposte 😁",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1laoi5p/eventi_di_speed_dating_a_torino/"
    },
    {
        "id": "1lamepa",
        "author": "peroniperore",
        "title": "Com'è la zona Basse di Mirafiori Sud?",
        "content": "Ciao a tutti, io e la mia ragazza stiamo cercando casa a Torino e domenica abbiamo appuntamento per una casa in zona Basse di Mirafiori Sud. Non è ancora detto nulla ma la casa sembra molto bella e il prezzo forse non esagerato (850 con condominio e riscaldamenti).\n\nVolevo chiedervi com'è questa zona: se è rischioso la sera uscire lì in zona, soprattutto se la mia ragazza sta sola lì in giro, o se in generale il rischio di subire violenza fisica o furti è alto. Da quello che leggo non sembra chissà quanto pericolosa, ma mi confonde il fatto che dei colleghi di mio padre che ci vivono l'abbiano sconsigliata. Se si tratta solo di un po' di spaccio sticazzi, in teoria proprio gli spacciatori dovrebbero essere i primi a farsi i cazzi loro. Stessa cosa per fuochi d'artificio, monnezza, gente che urla eccetera perché tanto sono nato e cresciuto nella periferia di Palermo e non credo possa essere peggio di qui alla fine ahahah.",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lamepa/comè_la_zona_basse_di_mirafiori_sud/"
    },
    {
        "id": "1lalgxd",
        "author": "AstronomerCapable206",
        "title": "Visiting this weekend",
        "content": "Hey :) Im visiting this weekend until Wednesday. Are there any special events on worth checking out? It's my partner's birthday on Sunday so anything on then would be of particular interest. Enjoy music, meals out, drinks, cultural events etc. thanks!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lalgxd/visiting_this_weekend/"
    },
    {
        "id": "1lajgaw",
        "author": "Dense_Statistician_4",
        "title": "Parcheggio supermercato coperto",
        "content": "Buonasera devo partire per alcuni giorni e volevo chiedere se dovessi lasciare l'auto nel parcheggio coperto del mercatò o del Carrefour zona corso Montecucco risciò qualcosa?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lajgaw/parcheggio_supermercato_coperto/"
    },
    {
        "id": "1lacxlz",
        "author": "helenahjlee_01",
        "title": "Winery tour for Solo traveler from Torino",
        "content": "Hi all, \nIs there any soli traveler interedted in going to a winery tour on 16th of June? I am trying to book one but everyone says that minimum 2 people to book!! 😢 \n\nI would like to have another solo trVeler who wants to do the winery tour with me. \n\nMessage me if you are keen. \n\nThank you!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lacxlz/winery_tour_for_solo_traveler_from_torino/"
    },
    {
        "id": "1lafmtg",
        "author": "edwardemeo",
        "title": "Posti per studiare",
        "content": "Qualcuno conosce aule studio/bar/università aperte di sabato (l'ideale sarebbe anche domenica, e anche ad Agosto)? \n\nSono sempre stato abituato alle aule studio della mia università ma nel weekend è chiusa e ovviamente anche ad Agosto, a casa è improponibile per il caldo.. \n\nQualcuno conosce posti del genere? \nGrazie in anticipo ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lafmtg/posti_per_studiare/"
    },
    {
        "id": "1laezbb",
        "author": "Potential-Gain47",
        "title": "Affitare in zona Campus Einaudi (via Catania)",
        "content": "Abito in quella zona ma devo trasferirmi per lavoro, vorrei affittare il bilocale che ho in zona. Secondo voi quanto potrei chiedere d'affitto? È completamente ammobiliato.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1laezbb/affitare_in_zona_campus_einaudi_via_catania/"
    },
    {
        "id": "1l9zzto",
        "author": "LinguisticScarpa",
        "title": "Affittare in piazza della repubblica",
        "content": "Ciao, so che sono già stati fatti dei post su questa cosa ma non mi sono chiarita troppo le idee, quindi cerco altre opinioni. \n\nSono una ragazza che vive a Torino da tre anni, e ho trovato una stanza carina a porta palazzo, esattamente in piazza della repubblica.\nAlcune persone dicono che è sicura, altre che è da evitare come la peste. Ho vissuto in zona piazza statuto finora, e generalmente la sera sto a casa, ma mi capita di uscire e di tornare da sola. Ho la bici, che mi fa sentire più sicura, ma non so se a prendere la stanza rischio di mettermi in situazioni pericolose.\n\nConsigli?",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1l9zzto/affittare_in_piazza_della_repubblica/"
    },
    {
        "id": "1l9q9l9",
        "author": "blunathan",
        "title": "Anche da voi blackout da un'ora?",
        "content": "Auto tra Aurora e Barriera e la corrente è saltata da un'ora. i semafori vanno ma dalle case vicino continuano a suonare gli allarmi\n\nedit: tornata alle 19:10 dopo più di un'ora e mezza",
        "upvotes": 9,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1l9q9l9/anche_da_voi_blackout_da_unora/"
    },
    {
        "id": "1la0his",
        "author": "Libertymobile",
        "title": "Cosa pensa su straniero che vive solo in tua citta?",
        "content": "Vedo molte persone che si trasferiscono in Italia e si lamentano di sentirsi sole, di non fare amicizie, e di quella vecchia storia che sembra ripetersi all'infinito in tante storie. Ma volevo capire il lato di chi vive in Italia e vede queste persone arrivare. Cosa ne pensi? Hai qualche opinione sul perché ci siano così tante storie di persone che si trasferiscono e si lamentano di sentirsi sole? Come le vede una persona nata e che vive in Italia?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1la0his/cosa_pensa_su_straniero_che_vive_solo_in_tua_citta/"
    },
    {
        "id": "1l9o4m0",
        "author": "akkyuz",
        "title": "Palestra di boxe",
        "content": "Ciao, vorrei iscrivermi a una palestra di boxe, ho già fatto un anno di boxe in un'altra città quindi non parto proprio da zero, ma non sono neanche un veterano.\n\nSapreste consigliarmi? Possibilmente con un coach che ti segua e con ambiente regolare senza troppi invasati\n\nGrazie!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l9o4m0/palestra_di_boxe/"
    },
    {
        "id": "1l9k6o9",
        "author": "bandbxb",
        "title": "Qualcuno che va al Kappa?",
        "content": "Cerco persone con cui andare al Kappa music festival il 4, 5 o 6 luglio. La data è indifferente, devo ancora comprare il biglietto! \n",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1l9k6o9/qualcuno_che_va_al_kappa/"
    }
]