[
    {
        "id": "1jjjm2f",
        "author": "McVeigh-AMA",
        "title": "Hi /r/movies! I'm Mike Ott, director and co-writer of 'McVeigh', an upcoming psychological-thriller about Timothy McVeigh and the Oklahoma City bombing in 1995. It stars Alfie Allen, Ashley Benson, Tracy Letts, Brett Gelman, Anthony Carrigan and is out soon in theaters . Ask me anything!",
        "content": "",
        "upvotes": 16,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ubnwpnldauqe1.png?auto=webp&amp;s=f26a07965662d4813eac6c4dfc380cb916d5a984"
        },
        "permalink": "/r/movies/comments/1jjjm2f/hi_rmovies_im_mike_ott_director_and_cowriter_of/"
    },
    {
        "id": "1jjhsrj",
        "author": "Muffin_Most",
        "title": "Is Robert Patrick the only actor who gets killed by all three Planet Hollywood icons?",
        "content": "Robert Patrick plays thee characters who get killed by the Planet Hollywood stars in only seven years time.\n\nIn Die Hard 2 his character is fatally shot by Bruce Willis’s John McClane.\n\nIn T2: Judgment Day his T-1000 is terminated by Arnold Schwarzenegger.\n\nIn Cop Land Sheriff Sylvester Stallone uses his shotgun to end his life.\n\nDo you know other actors who met their untimely death by the hand of all three stars that backed the Planet Hollywood restaurants?\n\nUPDATE!\n\nPlanet Hollywood was initially backed by Schwarzenegger, Stallone, Willis AND Demi Moore in 1991.\n\nTurns out Robert Patrick also gets whacked by Demi Moore’s Madison in Charlie’s Angels: Full Throttle on top of Griffith Observatory.\n\nThat’s four out of four!\n\nShoutout to u/DEATHMTN for pointing this out.\n\nSECOND UPDATE!\n\nLinks to the four death scenes:\n\nDie Hard 2 (1990)\nhttps://youtu.be/g-P53rME1xE?si=oH-ozdKCLijIplD6\n\nTerminator 2: Judgment Day (1991)\nhttps://youtu.be/yiBHj8Xs4sg?si=FDrSN59EDk22d4ip\n\nCop Land (1997)\nhttps://youtu.be/emeGfvVJaBY?si=IE0AcPTsbm6BlXNJ\n\nCharlie’s Angels: Full Throttle (2003)\nhttps://youtu.be/7uP-CjEtSyM?si=4wOWFHX0V5nV_oOl",
        "upvotes": 1859,
        "comments": 254,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M96bo6bLYb0g57foqaRtxKLVSQedlHgjAQGw_W6rpmw.jpg?auto=webp&amp;s=70233b963dfbeb83dff7804c03b67872a25198e7"
        },
        "permalink": "/r/movies/comments/1jjhsrj/is_robert_patrick_the_only_actor_who_gets_killed/"
    },
    {
        "id": "1jjiv9q",
        "author": "MarvelsGrantMan136",
        "title": "‘No Other Land’ Co-Director Hamdan Ballal Has Been Freed, Yuval Abraham Says",
        "content": "",
        "upvotes": 1118,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dkLYyR9YRbbbwkyd1F0oX95hgcfFXFuXI6FVJtTQzUc.jpg?auto=webp&amp;s=1d02af4359b241c50534260f78361a8aadc384fb"
        },
        "permalink": "/r/movies/comments/1jjiv9q/no_other_land_codirector_hamdan_ballal_has_been/"
    },
    {
        "id": "1jjicbn",
        "author": "Sisiwakanamaru",
        "title": "In Warning Sign for Hollywood, Younger Consumers Are Choosing Creator Content Over Premium TV and Movies",
        "content": "",
        "upvotes": 558,
        "comments": 288,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IBIm0yqsQNepqN5TXDHgYVa6e2bzJ8MN8ZLvv7X5WGo.jpg?auto=webp&amp;s=0feb263a7d1e57ee7360026c2e7be2ab46dd8030"
        },
        "permalink": "/r/movies/comments/1jjicbn/in_warning_sign_for_hollywood_younger_consumers/"
    },
    {
        "id": "1jjlehl",
        "author": "MarvelsGrantMan136",
        "title": "Final Destination Bloodlines | Official Trailer",
        "content": "",
        "upvotes": 343,
        "comments": 125,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U41WzISFP8xZYh6zTcP2orHnlntgSbOae3F4ZyhWMIA.jpg?auto=webp&amp;s=9936c4420e3cfcaf3d5feeeb175bc4d58a749269"
        },
        "permalink": "/r/movies/comments/1jjlehl/final_destination_bloodlines_official_trailer/"
    },
    {
        "id": "1jiw7cm",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Tony Todd in 'Final Destination Bloodlines', His Final Film Role",
        "content": "",
        "upvotes": 7883,
        "comments": 323,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cxcsmfqs8oqe1.jpeg?auto=webp&amp;s=b86a30f6e2c204df6daf6f18eb38ea1d9583393e"
        },
        "permalink": "/r/movies/comments/1jiw7cm/first_image_of_tony_todd_in_final_destination/"
    },
    {
        "id": "1jjlynn",
        "author": "poweley",
        "title": "Which Movie Did You Expect to Be Mid but Ended Up Loving?",
        "content": "Sometimes, a movie surprises you in the best way possible. You go in expecting it to be forgettable, but by the end, you’re sitting there like, “Wait… was that actually amazing?”\n\nFor me, it was *Edge of Tomorrow*. I thought it was just another action-packed Tom Cruise flick, but it turned out to be one of the most clever and well-paced sci-fi movies I’ve seen in years.\n\nWhat’s a movie you had low expectations for but ended up loving?",
        "upvotes": 122,
        "comments": 355,
        "media": null,
        "permalink": "/r/movies/comments/1jjlynn/which_movie_did_you_expect_to_be_mid_but_ended_up/"
    },
    {
        "id": "1jjiuww",
        "author": "AporiaParadox",
        "title": "Marketing/trailers that tried to trick audiences",
        "content": "A recent strange phenomenon is how Hollywood goes out of its way to hide the fact that musicals are musicals in the marketing. The trailers won't show any of the characters singing and will make it look like it's a normal movie. The reason for this seems to be that marketing teams know that some people don't like musicals, so they think they can get them to buy a ticket by tricking them into thinking a musical is not a musical and I guess hope that they won't bother doing any research beforehand. Wonka and Mean Girls are some recent examples of this.\n\nBut Hollywood does this kind of deceitful marketing all the time. Most infamously, the movie [Kangaroo Jack](https://www.youtube.com/watch?v=SuyLeUjuT_k)'s marketing made it look like a fun family movie with a talking kangaroo that raps, but in reality it's a comedic crime movie for adults and the kangaroo barely appears and only talks in one scene where a character is hallucinating. In fact, the movie was originally R-Rated and was going to be called Down and Under, but then was retitled and edited to a PG rating by producers because the kangaroo scene was the only think test audiences liked.\n\nSo what other movie marketing campaigns tried to basically trick audiences into thinking that the movie was going to be about something else or even of a different genre?",
        "upvotes": 160,
        "comments": 167,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gSef-ocNnHWodm-VaE71AV8rlQI55F5N3K6z8W6XD1g.jpg?auto=webp&amp;s=d8ee8d5472f1e427bdb0655cb1e9a697333d39ba"
        },
        "permalink": "/r/movies/comments/1jjiuww/marketingtrailers_that_tried_to_trick_audiences/"
    },
    {
        "id": "1jj55jz",
        "author": "crome66",
        "title": "Jellyfish Pictures, Animation Producer Of 'Dog Man,' Shuts Down Amid Industry Crisis",
        "content": "",
        "upvotes": 1668,
        "comments": 243,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fRTaWLaFyT1MMCbUOQjh8hqK7YObSsjmZ6-G8b1nbE0.jpg?auto=webp&amp;s=69ca9b79f16573ef4786a848c43784c8a1100fba"
        },
        "permalink": "/r/movies/comments/1jj55jz/jellyfish_pictures_animation_producer_of_dog_man/"
    },
    {
        "id": "1jjbsk3",
        "author": "purelyinvesting",
        "title": "What’s the Best Movie Twist You Never Saw Coming?",
        "content": "There are plot twists, and then there are *those* plot twists. The kind that make you sit in silence during the credits, questioning everything you just watched. The ones that make you want to immediately rewatch the movie just to catch all the hints you missed.\n\nFor me, *The Sixth Sense* was a game-changer. The way the twist recontextualized the entire movie was genius—I had to pick my jaw up off the floor. Then there’s *Fight Club*, which completely shattered my perception of what I had just seen. The unreliable narrator trope had never hit me that hard before.\n\nAnd don’t even get me started on *The Prestige*. That final reveal still lives rent-free in my head. The moment you realize just how far Borden and Angier went for their craft? Chilling.\n\nWhat’s a movie twist that absolutely blew your mind? The kind that made you rethink everything as soon as the credits rolled?",
        "upvotes": 556,
        "comments": 1101,
        "media": null,
        "permalink": "/r/movies/comments/1jjbsk3/whats_the_best_movie_twist_you_never_saw_coming/"
    },
    {
        "id": "1jisip5",
        "author": "RVarki",
        "title": "Seth Rogen doesn't get enough credit for the sheer volume of decent to high-quality movies and shows he's made",
        "content": "Seth Rogen has been a major figure in the film industry for almost two decades now, and in that time, a lot has been said about him, his abilities, the type of movies he makes and more recently, his political values\n\nThe one thing I've rarely seen people discuss is his insane record in terms of well made [movies and shows ](https://www.rottentomatoes.com/celebrity/sethrogen)(both as a performer and producer)\n\nJust in the past few years, he has acted in movies like Dumb Money, Fablemans, Long Shot and American Pickle, while producing TMNT:Mutant Mayhem, Joy Ride, Good Boys and Blockers. That's without talking about his hit-making run in the mid 2000s to mid 2010s, or his TV show resume, which is arguably even more impressive (he's literally about to come out with a show that has near-universal critical acclaim pre-release)\n\nUnlike other leading men who have a lot of well regarded stuff in their filmography, Rogen isn't really playing a numbers game. The man hasn't really been in a whole lot, it's just that a large portion of what he does do, is some version of good\n\n",
        "upvotes": 5697,
        "comments": 623,
        "media": null,
        "permalink": "/r/movies/comments/1jisip5/seth_rogen_doesnt_get_enough_credit_for_the_sheer/"
    },
    {
        "id": "1jiz14c",
        "author": "bluemonday239",
        "title": "No Other Land co-director attacked by settlers and arrested by the Israeli army",
        "content": "",
        "upvotes": 2014,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OXQYlMpysJcB3uOBddbYgfAvXcmSboRx9QuBb5Oykh4.jpg?auto=webp&amp;s=8da393b7b1c7178097ad15c9621ebf75bfc8d0e1"
        },
        "permalink": "/r/movies/comments/1jiz14c/no_other_land_codirector_attacked_by_settlers_and/"
    },
    {
        "id": "1jiq8x5",
        "author": "BunyipPouch",
        "title": "First Image from Dystopian-Thriller 'The School Duel' - Starring Oscar Nunez ('The Office') and Kelsey Darragh - Set in near-future Florida, schoolchildren are recruited to take part in a deadly, statewide competition known as “The School Duel”, in order to try to curb the rise of school shootings.",
        "content": "",
        "upvotes": 6336,
        "comments": 723,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bh672p4svmqe1.jpeg?auto=webp&amp;s=8c35292babaf0dc81e909626f1aa8a8200fa3b14"
        },
        "permalink": "/r/movies/comments/1jiq8x5/first_image_from_dystopianthriller_the_school/"
    },
    {
        "id": "1jj65wc",
        "author": "Alternative-Cake-833",
        "title": "Intermissions Are Standard in India — Even Filmmakers Can't Stop Them",
        "content": "",
        "upvotes": 747,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iR7HGARx_bWU5s4hXNMv_WoWFbSOd3Wo0m5LdF8Fkfo.jpg?auto=webp&amp;s=2a5de5523a0dc1069ef44fadc5946576b86ea832"
        },
        "permalink": "/r/movies/comments/1jj65wc/intermissions_are_standard_in_india_even/"
    },
    {
        "id": "1jjnxcb",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Accountant 2'",
        "content": "",
        "upvotes": 31,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/371poofj7vqe1.jpeg?auto=webp&amp;s=62c45bfe0f3939f7ce748f61075a926fdcf1cc83"
        },
        "permalink": "/r/movies/comments/1jjnxcb/new_poster_for_the_accountant_2/"
    },
    {
        "id": "1jiq3v9",
        "author": "DemiFiendRSA",
        "title": "New Official Poster for A24's 'Death of a Unicorn'",
        "content": "",
        "upvotes": 4161,
        "comments": 230,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/aii8z6miymqe1.jpeg?auto=webp&amp;s=6e668a4ee68ffb54db98d6171335b7816b84b514"
        },
        "permalink": "/r/movies/comments/1jiq3v9/new_official_poster_for_a24s_death_of_a_unicorn/"
    },
    {
        "id": "1jj4e6c",
        "author": "_BestThingEver_",
        "title": "First Official Poster for The Storm Queen (2026)",
        "content": "",
        "upvotes": 518,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a3393efwupqe1.jpeg?auto=webp&amp;s=16779c1455d54527510a36347a1c132355706359"
        },
        "permalink": "/r/movies/comments/1jj4e6c/first_official_poster_for_the_storm_queen_2026/"
    },
    {
        "id": "1jj7jdz",
        "author": "mildOrWILD65",
        "title": "Jack Reacher 2012",
        "content": "Top edit:\n\nBegin edit:  I have never read any of the books. I totally understand all the comments respecting the books. I have not read any of them. My observation on the first movie stands by itself in a vacuum. End edit\n\n\nI'm not a huge Tom Cruise fan, he's done some good films, shadowed by his involvement with Scientology, but whatever. He's a decent actor.\n\nI was channel surfing and came across this first Jack Reacher movie. So, first of all, I don't understand the criticism that he wasn't this huge muscle-bound macho guy. He played the role well and was a good fit for it, I thought.\n\nMost of all, holy Hell! This was a great movie. A solid thriller with a well-thought mystery behind the premise. There was enough action to keep it moving along, without going over the top, and only one car chase scene, which had a funny conclusion. That's Pittsburgh for you!\n\nI'd watch it again and if you haven't, it's worthwhile.",
        "upvotes": 266,
        "comments": 246,
        "media": null,
        "permalink": "/r/movies/comments/1jj7jdz/jack_reacher_2012/"
    },
    {
        "id": "1jjjxq1",
        "author": "jrrybock",
        "title": "Movies where everyone might die in the end....",
        "content": "So, rewatched Serenity, a movie based ona half-season TV, both or which I love. Now, spoiler alerts, but will be vague and not use the Reddit spoiler cover,,,, Act II has a main character die which drives our hero into info final, action.... About 1/3 into Act III, a beloved character very suddenly dies. \n\nI hated either character passing, but narratively I think it is brilliant as all your characters, literally set for 'a last stand', you are no longer sure who or if any will survive....\n\nSo, my Q is movies that set up everyone or most could die in the finale? \n\n",
        "upvotes": 27,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1jjjxq1/movies_where_everyone_might_die_in_the_end/"
    },
    {
        "id": "1jjapgs",
        "author": "ShaunisntDead",
        "title": "The Deer Hunter is devastating and I haven't seen another film quite like it",
        "content": "This has been one of my favorite films since I was 18 years old, it hit me at just the right age I think. I love this movie. I don't find it slow at all. I love the pace of the opening and the wedding sequence. It feels like a documentary. It gives us time to get comfortable with the characters as real human beings, not just movie characters. The acting is so naturalistic. Every scene in Clariton feels very much like an Altman ensemble film with its wandering camera, overlapping dialogue and the very naturally realistic acting style. The characters aren't given big monolgues to express themselves, they do it all in a look. Character interaction and quick expressive moments build the characters and their stories without pandering to the audience. It's an exceptionally subtle piece of filmmaking. The fact that Michael and Nick are in love with the same woman is pretty clearly set up in the wedding sequence. Nick is very often framed with a stuffed deers head on the wall, foreshadowing his death by \"one shot\" later in the \n\n\nThe film deals with so many themes that are crystallized in the famous POW sequence. The gambling over death defying acts of masculinity is set up earlier in the film with Michael and Nick gambling over the car race. Their focus on guns and the 'one shot' philosophy is set up during the deer hunting sequence. The idea of never leaving a friend behind is set up when they jokingly leave John the bartender on the side of the road when driving to hunt the deer. Michael's use of a flamethrower is set up in the opening scene when he's making steel in the hellish factory. The death of SPOILERS Nicky is foreshadowed by his repeated framing with a stuffed deers head and a photo of JFK.\n\nThere is quite a bit more subtle foreshadowing and callbacks throughout the film but I'll stop here. It's a very subtle, emotional, beautifully atmospheric small town epic. It feels like a novel that gets better on repeat viewings. ",
        "upvotes": 154,
        "comments": 92,
        "media": null,
        "permalink": "/r/movies/comments/1jjapgs/the_deer_hunter_is_devastating_and_i_havent_seen/"
    },
    {
        "id": "1jjjhcr",
        "author": "bunkscudda",
        "title": "The Peanut Butter Solution (1985)",
        "content": "Anyone remember this one? I saw this when i was a kid and it haunted me for years. I couldn’t remember the name and all i could describe it as was:\n\n“a bald kid puts peanut butter on his head because ghosts told him to and his hair wouldn’t stop growing, then he was  kidnapped and put in a factory where they made magic brushes from his hair to make paintings that he tried to escape through by jumping into them”\n\nEveryone i mentioned it to thought i was nuts. ",
        "upvotes": 28,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1jjjhcr/the_peanut_butter_solution_1985/"
    },
    {
        "id": "1jj2j39",
        "author": "SanderSo47",
        "title": "March 21-23 Box Office Recap: It was another terrible weekend, as 'Snow White' flopped with an awful $85.3 million worldwide, against a $270 million budget. Meanwhile, 'The Alto Knights' also flopped with just $3.1 million domestically.",
        "content": "https://preview.redd.it/t9od7mdwgpqe1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=8dbdf627ab9d7355869c0772f7334f9c0b3a6c65\n\nAnother brutal weekend at the box office.\n\nDespite topping the box office, ***Snow White*** massively flopped in its opening weekend, indicating it was a bad apple after all. But that wasn't the only flop this weekend. WB also released ***The Alto Knights***, and it had one of the worst debuts for a film playing at over 2,500 theaters. Oh and there was also the long-delayed debut of ***Magazine Dreams***, which unsurprisingly tanked in 815 theaters.\n\nThe Top 10 earned a combined $68.5 million this weekend. That's off a rough 30.3% from last year, when ***Ghostbusters: Frozen Empire*** topped the box office.\n\nDebuting in first place, ***Snow White*** flopped with just $42.2 million in 4,200 theaters. This debut is lower than the live-action ***Dumbo*** remake ($45.9 million), coincidentally another adaptation of a very old Disney property. It's so far off from other recent films like ***The Little Mermaid*** ($95.5M), ***Maleficent*** ($69.4M), and ***Cinderella*** ($67.8M).\n\nThe bad news don't stop there. These numbers are eerily similar to the debut of ***The Marvels*** ($46.1 million), which also had a similar budget to ***Snow White*** ($270 million). So yep, ***Snow White*** is performing right on par with one of the biggest flops in movie history.\n\nWhile Disney has had success with their live-action remakes, there's always that black sheep that deviates from the formula and that's the case with ***Snow White***. The film had a similar case to ***Dumbo***, in that the original films are very old (the original ***Snow White*** is 88 years old and ***Dumbo*** is 84 years old). While the public is aware of these films and know they're iconic, perhaps their popularity hasn't been as big as other animated films like ***The Lion King***, ***Aladdin*** or ***Beauty and the Beast***.\n\nIt didn't help that ***Snow White*** has been done to death for the past decades. So it falls into the same problem as other stories like ***Robin Hood***, ***The Three Musketeers***, or ***Sherlock Holmes***, in that the public can recognize them but that doesn't mean they'll watch everything with them. Of course, some hit bigger than others. In 2012, ***Snow White and the Huntsman***, a dark reimagining, made almost $400 million worldwide. Simply put, the Disney remake didn't offer much to differentiate itself from other adaptations.\n\nAlright, now we have to address two big problems with the film, which are main factors for its performance. The first involves the Seven Dwarfs, which are, obviously, pivotal to the story. Back in 2022, Peter Dinklage expressed his frustration with the film, deeming it a \"backward story\". So Disney decided to simply... make the Dwarfs with CGI instead of casting actors with dwarfism. And the design used for the film simply looks... awful. Even though Dinklage faced backlash for his comment, it was Disney who made the decision to listen and act upon it. But that's not everything.\n\nRachel Zegler has been the subject of media attention since 2022, when she made comments joking about the Prince and Snow White's characterization in the original film. These comments have been in the eye of the public for the past years, drawing negative attention to the remake. Gal Gadot didn't escape criticism either; not just for her perceived lack of acting range, but because of her Israel support. Whether you agree or not with everything just mentioned, it's clear the general audience wasn't content in the slightest with anything.\n\nSo that's basically it. It's a simply a factor of so many decisions that went awry, as well as an incredibly high $270 million budget. Disney knew this, which is why they scaled back on the premieres and press junkets for the film. Add in very weak reviews (44% on RT), and the film has already lost so many people.\n\nAccording to Disney, 68% of the audience was female and 47% was in the 18-34 demographic. Even though it's a family film, only 15% of the audience was 17 and under. So kids were pretty much not interested in the film.\n\nThe long term prospects for ***Snow White*** don't look great. It received a lukewarm \"B+\" on CinemaScore, which is worse than any of the Disney live-action remakes, and suggests word of mouth will only be a bit better than its reviews. With competition like ***A Minecraft Movie*** coming up, ***Snow White*** is unlikely to leg out and it's set to be one of the lowest Disney remakes. For now, a domestic total around $110 million is likely. Which means it will make less money than ***Snow White and the Seven Dwarfs*** ($184.9 million) and that's not even adjuste for inflation! Another failure for Disney this year.\n\nSteven Soderbergh's ***Black Bag*** kept the second place spot, earning $4.2 million this weekend. That's a good 44% drop from last weekend, although its numbers are still way too small to make it look notable. Through 10 days, the film has earned $14.7 million, and it will finish with over $20 million domestically.\n\n***Captain America: Brave New World*** may have weak word of mouth, but the very lack of competition is working wonders. The film eased just 29%, adding $4 million this weekend. That took its domestic total to $192 million.\n\nAfter topping the box office last week, ***Novocaine*** felt a gut punch this weekend. The film dropped a very rough 58%, earning $3.6 million this weekend and falling to fourth place. That's just brutal, although it's a better drop than Jack Quaid's previous film, ***Companion***, which collapsed 67.7% (but ***Companion*** faced the Super Bowl in its second weekend). Through 10 days, the film has earned a meager $15.6 million, and won't make it much further than $20 million, especially with three wide releases coming up this weekend.\n\nWith the loss of PLF screens, ***Mickey 17*** suffered another rough drop this weekend. It dropped 51% and added $3.6 million this weekend. The film has earned a very weak $40 million, and with the film hitting PVOD tomorrow, it will continue falling. For now, it should finish with around $45 million domestically.\n\nIt's not until sixth place where we find the other newcomer, WB's ***The Alto Knights***. Debuting in 2,651 theaters, the film flopped with a horrific $3.1 million this weekend. That's one of Robert De Niro's worst debuts as leading man, as well as the 26th worst debut for a film playing at over 2,500 theaters.\n\nThe film achieved some notoriety, given that it was the first film greenlit by David Zaslav when he joined Warner Bros. Discovery back in 2022. But there were already signs that the film would struggle. For starters, director Barry Levinson had a very successful career... but that peaked in the 90s. His films in the 21st century have been flopping across the board, suggesting he might not deliver the quality he once commanded. Not to mention that gangster films haven't fared well in the past few years.\n\nThere's also the very weird decision to cast Robert De Niro in the roles of both Vito Genovese and Frank Costello, even though they are not twins nor anything. WB has also moved the release date, and the first trailer didn't premiere till two months ago, which is a very short release window for a major film. And despite the amount of names attached, reviews were very poor (39% on RT). The film simply couldn't overcome the \"been there, done that\" feeling that plagued other gangster films.\n\nAccording to WB, 58% of the audience was male. Unsurprisingly, it skewed massively old; 77% of the audience was 35 and over, and 33% over 55. They gave it a middling \"B\" on CinemaScore, which is simply not good for its long-term prospects. With many new releases coming up, ***The Alto Knights*** will disappear quickly from theaters. It would be a surprise if it finished anywhere close to $10 million.\n\n***The Day the Earth Blew Up: A Looney Tunes Movie*** added $1.8 million this weekend. That's a 41% drop, which isn't bad, but it's kinda rough for an animated film. Through 10 days, the film has earned just $6.5 million so far. Despite these low numbers, Ketchup looks content with its performance, given that they are currently bidding $50 million to acquire ***Coyote vs. Acme***.\n\nIn eighth place, Neon's ***The Monkey*** eased 39%, adding $1.5 million. That takes its domestic total to $37.8 million.\n\nIn ninth place, DreamWorks' ***Dog Man*** dropped 42% and added $1.4 million this weekend. The film has amassed $95.6 million and it's on its last legs to hit the $100 million milestone.\n\nRounding up the Top 10 was ***The Last Supper***, which added $1.3 million this weekend. That's off 51% from last week, which is a very bad drop for a Christian drama. Through 10 days, the film has earned $5.3 million so far.\n\n2 years after its debut in Sundance, ***Magazine Dreams*** has finally hit theaters. Released by Briarcliff in 815 theaters, the film tanked with just $701,365 this weekend. This shouldn't be a surprise to anyone; you really expect the public to pay a ticket for a film with Jonathan Majors?  \n\nRLJ Entertainment also released ***Ash*** in 1,136 theaters, but the film flopped with a terrible $689,144. Expect it to fade quickly.\n\n#**OVERSEAS**\n\n***Snow White*** led the overseas box office, yet its numbers were far below the most pessimistic scenario. It debuted with a very weak $43.1 million overseas, for a terrible $85.3 million worldwide debut. Wow, not even hitting $100 million is pathetic. The film had very weak numbers in the UK ($5.1M), Mexico ($4.1M), Italy ($4M), France ($3M) and Spain ($2.6M). With a debut this soft, you can count on something: the film is not making it to $300 million worldwide, and $250 million could be in danger if it collapses. As mentioned, this cost $270 million. Big, big failure.\n\n***Mickey 17*** added $8.7 million this weekend, taking its worldwide numbers to $109.8 million. The best markets are South Korea ($19.6M), UK ($7.5M), France ($6.8M), Germany ($3.6M) and Mexico ($3.3M).\n\n***Captain America: Brave New World*** added $3.1 million, allowing the film to cross $200 million worldwide. The best markets are the UK ($22.5M), Mexico ($16M), China ($14.4M), France ($14M) and Korea ($11.4M).\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Love Hurts* | Feb/7 | Universal | $5,800,440 | $15,683,090 | $17,561,938 | $18M\n\n- Well, it truly lived up to its title. ***Love Hurts*** has ended its run with a very poor $17 million, below its already low $18 million. While Ke Huy Quan is in the middle of a return to films, this was an offer he was better off turning down. He reportedly accepted the role after Steven Spielberg convinced him. Ouch.\n\n#**THIS WEEKEND**\n\nThere's three wide releases this weekend. And while ***Snow White*** will probably continue at the top spot, one film will fight to be as close as possible.\n\nThat film is Amazon MGM's ***A Working Man***, starring Jason Statham. The plot is... come on, you watch a Jason Statham film for the plot? What's important is that it's action, that's it. Statham is a very reliable name, with his latest film, ***The Beekeeper***, earning over $150 million worldwide last year. \n\nThere's also the release of A24's ***Death of a Unicorn***, which stars Paul Rudd and Jenna Ortega as a father and daughter who accidentally hit and kill a unicorn, causing them to be hunted down by its parents. Despite a promising premise, reviews out of SXSW aren't glowing (currently at a middling 64% on RT).\n\nThe other release is Universal/Blumhouse's ***The Woman in the Yard***, which follows a family that sees a strange woman, dressed in all black, staying in their yard. Blumhouse is currently not at its best; their previous film, ***Wolf Man***, was one of their few box office flops. With a very generic premise and lack of buzz, it'd be a surprise if this film got close to $10 million this weekend.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 485,
        "comments": 235,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pi-uj-bf5vpFW0cy3BAfQMiafvW_SBzWcqr_4YALda8.png?auto=webp&amp;s=3271e95b62f00bb481bbe7e1d4a734381663dc91"
        },
        "permalink": "/r/movies/comments/1jj2j39/march_2123_box_office_recap_it_was_another/"
    },
    {
        "id": "1jjmiyj",
        "author": "LaserDiscCurious",
        "title": "Mary Tyler Moore might have won the Oscar had she competed as Supporting Actress for \"Ordinary People\"",
        "content": "I don't think anyone stood a chance against Sissy Spacek for \"Coal Miner's Daughter\". The movie was a hit and Spacek was praised by every critic in Tinseltown. She not only had the perfect narrative but she was also deserving. She acts and sings. I saw Coal Miner's Daughter and I can't disagree with her victory, even though I still have issues with how it minimizes domestic violence and I do feel Beverly D'Angelo should have been recognized for her turn as Patsy Cline (way better than Jessica Lange's take in Sweet Dreams). \n\nI think Mary Tyler Moore was completely memorable as Beth Jarrett. That character is such a prize for any actress, the degree of complexity and moral ambiguity and what Moore does in making Beth such a horrible mother but also someone who's hurting and afraid of breaking down and losing control. \n\nThe role itself could have gone either way, lead or supporting. I do think she stood a greater chance at winning had she been placed as supporting. To this day, people talk more about Beth Jarrett than even the movie itself and I think that's a testament to how good she was.",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1jjmiyj/mary_tyler_moore_might_have_won_the_oscar_had_she/"
    },
    {
        "id": "1jj1tgj",
        "author": "MarvelsGrantMan136",
        "title": "‘Saw XI’ Removed From Lionsgate Calendar as ‘Strangers: Chapter 2’ Takes Its Slot (September 26)",
        "content": "",
        "upvotes": 247,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wg5FZ5G-ggyMOOOyajmNJBqJ6YNqUOGOVKW7lXuudno.jpg?auto=webp&amp;s=bd8be2e00657bd8285aad164d3b27abb6824e20e"
        },
        "permalink": "/r/movies/comments/1jj1tgj/saw_xi_removed_from_lionsgate_calendar_as/"
    },
    {
        "id": "1jj8n2x",
        "author": "KillerCroc1234567",
        "title": "‘Street Fighter’ Removed From Sony Release Calendar, ‘Beneath the Storm’ Shifts to July 2026 and Renamed ‘Shiver’",
        "content": "",
        "upvotes": 87,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NzVIElAVSV821cFEHB9tuFroRW57u3cRxExUnO_TSqo.jpg?auto=webp&amp;s=bd4d985f70972a7f51481d1e84f72110565a00e7"
        },
        "permalink": "/r/movies/comments/1jj8n2x/street_fighter_removed_from_sony_release_calendar/"
    },
    {
        "id": "1jiu6yn",
        "author": "NoCulture3505",
        "title": "Apple Officially Lands UFO-Disclosure Project From Joseph Kosinski And Jerry Bruckheimer",
        "content": "",
        "upvotes": 400,
        "comments": 106,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AfbAub5iR1Jc7lnOY-Zc0qB8SAJCOQGrhJyyOdvxbbw.jpg?auto=webp&amp;s=f810cc46d00339c7db418030f586c79f4f7b1ccb"
        },
        "permalink": "/r/movies/comments/1jiu6yn/apple_officially_lands_ufodisclosure_project_from/"
    },
    {
        "id": "1jivohk",
        "author": "MarvelsGrantMan136",
        "title": "Nicholas Hoult To Star In Bank Heist Movie From Amazon MGM Studios With David Leitch Directing",
        "content": "",
        "upvotes": 287,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hq68tCKHNOifREmo1_2R4TTRThiFDbbUeDyIW62nMqk.jpg?auto=webp&amp;s=e0f3ded3cdde1a46e3492fc324891f3e572eefd2"
        },
        "permalink": "/r/movies/comments/1jivohk/nicholas_hoult_to_star_in_bank_heist_movie_from/"
    },
    {
        "id": "1jji7ec",
        "author": "Ok_Establishment419",
        "title": "Reevaluating the Ending of War of the Worlds (2005): A Quiet, Thoughtful Conclusion That Deserves More Credit",
        "content": "I’ve noticed that the ending of War of the Worlds (2005) is often criticized for being anticlimactic or lacking payoff. But I believe that judgment overlooks the quiet power and intention behind how the film chooses to conclude.\n\nUnlike most alien invasion movies, this one doesn’t end with a dramatic final battle or human triumph through force. Instead, it reminds us that life on Earth has evolved with its own natural defenses, and that our survival sometimes comes not from strength, but from balance and design.\n\nThe aliens weren’t defeated by heroism or technology — they were brought down by bacteria, organisms too small to be seen but powerful enough to stop a superior force. It’s not a twist; it’s a statement. A reminder that for all our fears of the unknown, the world we live in is more intricate and resilient than we think.\n\nThe closing narration captures that perfectly — acknowledging the long struggle of humanity, and how even in our darkest moments, there’s a larger system at work that favors life. To some, that message feels underwhelming… but to others, it can be quietly profound.\n\nI’d argue that this kind of ending isn’t a flaw — it’s intentional. Spielberg didn’t want another explosive victory. He wanted reflection. Humility. Perspective.\n\nSometimes, the most powerful endings aren’t the loudest ones.",
        "upvotes": 7,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1jji7ec/reevaluating_the_ending_of_war_of_the_worlds_2005/"
    },
    {
        "id": "1jj2yw6",
        "author": "Sisiwakanamaru",
        "title": "Dolby and Christie to Launch New Dolby Vision Projector in Effort To Expand Premium Theater Locations",
        "content": "",
        "upvotes": 105,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r8KSUtdPD8Mo6e4ZldQLGYEBNpuXvF8rRgbm5sBldvI.jpg?auto=webp&amp;s=24c2f11a08c23a9fc9c5ae1480bd5a81ea4f81cd"
        },
        "permalink": "/r/movies/comments/1jj2yw6/dolby_and_christie_to_launch_new_dolby_vision/"
    },
    {
        "id": "1jj4roc",
        "author": "thebradmoshpit",
        "title": "Pavements | Official Trailer",
        "content": "",
        "upvotes": 78,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7dSpj0FZmwAVTvCgE_2sUG9hSWgz8TYPB-iZfg7qJZc.jpg?auto=webp&amp;s=fbbbb575de31b139301c913a5732958fb158c0c0"
        },
        "permalink": "/r/movies/comments/1jj4roc/pavements_official_trailer/"
    },
    {
        "id": "1jjl4qa",
        "author": "atomicpoppet",
        "title": "What is a movie with a really bad soundtrack/score/music (in your opinion)?",
        "content": "I was intrigued by something lately.\n\nNo matter how bad most films are (both critic/audience wise), I've always thought that the music made was pretty good, regardless of genre, audience or time period. If the music was made specifically for the movie, then the artist(s) put somewhat of a good enough effort into it to the point that it is one of the very few areas a reviwer can't fault. If the music was liscenced or bought, it tends to be worse, yeah, but most film scores, IMO, rarely drag the film down any worse than any other element of it.\n\nBut what are those rare, few times were the music is genuinely of itself a critique? Where the music is poorly made, poorly edited in, does not match the movies' theme at all, is too quiet, is too overbearing, makes no sense for the plot, has no sustenance or meaning, is placed in at all the wrong times, etc? \n\nAnd when this happens, who do you normally cite as responsible? The executives? The director? The musician? Whoever directly chose the music? \n\nI'm going to include SFX/ambience in as well, since even the simplest of sounds can invoke all the wrong emotions.",
        "upvotes": 3,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1jjl4qa/what_is_a_movie_with_a_really_bad/"
    }
]