[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 692,
        "comments": 5087,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nsrqsy",
        "author": "Ok_Kiwi_5692",
        "title": "I feel so bad for the dad in this show man",
        "content": "Adolescence (2025)",
        "upvotes": 118,
        "comments": 66,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/95txb29ffxrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nsrqsy/i_feel_so_bad_for_the_dad_in_this_show_man/"
    },
    {
        "id": "1ns5sby",
        "author": "No_Holiday5742",
        "title": "Black Rabbit is a masterpiece",
        "content": "I just finished Black Rabbit and honestly, I think it’s one of the best shows I’ve seen in a long while.\n\nExciting and unpredictable – Every episode had me hooked. There’s this constant tension and unease that made me lean in, waiting to see what would happen next.\n\nEmotionally provoking – It’s rare for a show to hit so many emotional notes; anger, sadness, empathy, anxiety and dread. All in the same arc. I found myself genuinely caring about what happened to the characters.\n\nCharacters you invest in – Even when they’re flawed or making questionable choices, I couldn’t help but root for them or at least understand them. That level of writing and acting is what kept me so engaged.\n\nActing – Top-tier. The performances felt layered, raw, and real, like you’re watching people rather than actors.\n\nCinematography – The dark, grey tones of NYC were such a perfect backdrop. It wasn’t just filmed in New York; the city itself felt like a character. That moody aesthetic pulled me in even deeper.\n\n\nWhat I don’t understand at all is why The Guardian gave it a negative review. Honestly, did we even watch the same show? For me, it delivered on every front; storytelling, visuals, acting, and atmosphere.\nEdited to add the music matched the dark and gritty theme so well also!\n\nOverall, Black Rabbit just worked. It’s one of those rare shows that stays with you long after the credits roll.\n\n\nAnyone else feel the same way, or equally baffled by the negative takes?\n\n",
        "upvotes": 207,
        "comments": 221,
        "media": null,
        "permalink": "/r/netflix/comments/1ns5sby/black_rabbit_is_a_masterpiece/"
    },
    {
        "id": "1ns3tc5",
        "author": "Bunny2804",
        "title": "Alice in Borderland is better than Squid Games",
        "content": "I swear people are sleeping on Alice in Borderland.\n\nThe mindgames, the thrill and the overall tone, in my humble opinion is much better than Squid Games and it should have had the hype and success similar, if not greater than SG.\n\nI don't know if season 3 is the final one or not but man I really hope they can continue if there are more stories to tell. \n\nThis and One Piece are two of the best live action manga adaptations we have imo.",
        "upvotes": 157,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1ns3tc5/alice_in_borderland_is_better_than_squid_games/"
    },
    {
        "id": "1nsk7dj",
        "author": "alexthagreat98",
        "title": "Billionare's Bunker is actually Pretty Good",
        "content": "I'm in the US so maybe this show was released prior, but just discovered it now. If you liked Money Heist, you will probably like this series too. They did have one of the actors from Money Heist in this one. It's sort of a mystery, thriller meets telenovela. I hope they make a season 2. ",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nsk7dj/billionares_bunker_is_actually_pretty_good/"
    },
    {
        "id": "1nsmjra",
        "author": "Wylershipper09",
        "title": "The Ultimate Wyler Pitch: Scenes/Scripts For Wednesday Season 3 🖤",
        "content": "Don’t worry: no Season 2 spoilers here, just fan-made ideas and imagined Season 3 moments.\n\nPlease read all of my scenes, they aren’t in any particular order and before you start, here are pictures from Season 1 &amp; 2 that we need to see from Wednesday again 😉\n\nScene 1: Jealousy SparksA heated moment where jealousy shows, either from Wednesday or Tyler (or both). That enemies-to-lovers energy adds fire to their journey and deepens the tension.\n\nScene 2: The Woods, North of the Canadian BorderEnid is missing in her wolf form, and Wednesday refuses to give up searching. Tyler insists on helping. As they move through the dark woods together, the danger pulls them closer.Tyler: “She used to tell me the woods would protect me. But now it feels like they’ve turned against me.”Wednesday (coldly honest): “The woods don’t betray. People do. The trees are indifferent, like me. But indifference can be a shield if you know how to use it.”Tyler (dark laugh): “Trust you to make grief sound like survival training.”Wednesday (steps closer, voice low): “It is. And if you want to survive, stop seeing these woods as haunted… and start seeing them as ours.”\n\nScene 3: The Angry Love ConfessionSomeone insults Wednesday. Tyler steps in, furious.Tyler: “Say that again and I’ll make you regret it.”Wednesday (eyes flash with fire): “You didn’t have to—”Tyler: “Of course I did. Because I love you, Wednesday. And whether you like it or not, you’re mine… my Graveheart.”Wednesday (pauses, smirks): “Finally. It took rage to drag it out of you. I’m yours too…. my Ruin. I love you.”Tyler: “We really are two black-hearted souls ready to pillage the world together.” (smirks)Wednesday: allows the faintest ghost of a smile to slip through.Their first real kiss ignites.\n\nScene 4: Wednesday’s NarrationWednesday (voiceover):“I never believed in love, and I’ve always hidden my emotions because they reveal a weakness others could use against me. But Tyler saw through it. He’s seen the sides of me I promised I’d never show. And despite everything he’s done, I love him. I can’t bring myself to get through any day without him.”\n\nScene 5: Tyler’s GriefWednesday helps Tyler face his mother’s death, not with softness, but brutal honesty. She tells him grief never disappears, but it can sharpen you. For the first time, Tyler realizes she understands him better than anyone else.\nTyler (voice low, almost breaking): “You’re the only one left for me. No one sees me the way you do. I only have you.”\nScene 5.5: Tyler’s Apology\nTyler: “I’m so sorry for everything I’ve done. I know I don’t deserve forgiveness, but I need to hear it from you eventually so I can live without hating myself.”\nTyler’s narration: “I feel like such a hypocrite asking her for forgiveness, knowing I’ve done nothing to earn it… yet. I never realized how special she was before, but now I do. Wednesday deserved better than me, way better than me.”\n\nScene 6: Favourite TortureTyler: “You’re my favourite type of torture.”Wednesday (smirks): “The kind you won’t survive.”Tyler (leans closer, voice trembling, hands twitching as he resists touching her): “Then I’ll die happy.”\n\nScene 7: Kidnapping/DangerIf Wednesday is captured:Tyler: “If you think I’ll let her die, you’re dead wrong.”Wednesday (with her signature smirk): “Wednesday Addams doesn’t die, Tyler. You should know that by now.”\nIf Tyler is trapped:Tyler: “I thought you despised me. Turns out you can’t get rid of me that easily, Wednesday Addams.”Wednesday (rare flicker of emotion): “No. I can’t.”\n\nScene 8: Wednesday Takes Control (NEW SCENE)After being betrayed by Isadora or the Hyde pack, Tyler allows Wednesday to become his master, dark tension, power play, and Wyler chemistry at its peak.\n\nScene 9: Proving HimselfTyler earns Enid’s forgiveness by showing up when it matters most. Later, he saves not only Wednesday but also someone from her family, Pugsley, Thing, or even Uncle Fester. The ultimate way of proving his loyalty and securing his place in her world.\n\nScene 10: Gothic Romance Moments\n* The fiery kiss scored with a song like “Wrong” by Chris Grey (personal favourite, but many options).\n* A Phantom of the Opera inspired dance at Nevermore, gothic and hauntingly beautiful. Before they dance, Tyler greets her with a kiss to her hand.\n* Wednesday stumbles across a hidden drawing of herself in Tyler’s sketchbook, proof that he’s been haunted by her all along.\n\nScene 11: The Unspoken TruthTyler: “Tell me the real reason you missed.”Wednesday (eyes narrowing, voice low but teasing): “I missed because even someone like me can care… for someone like you, even when I shouldn’t.”\n\nScene 12: Choosing Her Over the PackTyler stands between his Hyde pack and Wednesday, torn for a moment but then resolute.Hyde pack: “Just leave her, Tyler. She’s not worth it.”Tyler (eyes blazing, voice steady): “That’s where you’re wrong. She’s worth more than every ruby, every diamond, every secret you hide behind. I’m choosing her. You were never even an option.”\n\nBonus Scenes &amp; Fan FavesThese are just a bit more standout Wyler moments. There are extra jealous sparks, emotional confessions, and suspenseful moments that add even more depth to their story. Each scene builds on their dark, emotional journey and shows why Season 3 could be the most talked-about chapter yet.\n\nWrap-upScenes like these keep Wyler gothic and emotional at its finest. This is a full pitch of Wyler that could make Season 3 unforgettable and trending online. Scenes like these could boost Netflix’s views, smash their own records, and satisfy Wyler fans everywhere.\nWyler isn’t just romance, it’s gothic history in the making.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nsmjra/the_ultimate_wyler_pitch_scenesscripts_for/"
    },
    {
        "id": "1nsehv0",
        "author": "Throwaway-1001-",
        "title": "Any good documentaries with plot twists?",
        "content": "Really liked Sweet Bobby, Tell me Who I Am and the recent one i can't name without getting this post taken down. Was looking for something with a good plot twist, any recs? No need for trigger warnings.",
        "upvotes": 20,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1nsehv0/any_good_documentaries_with_plot_twists/"
    },
    {
        "id": "1nsrqxe",
        "author": "it-s-luminescent",
        "title": "Two men arrested after fight over Netflix account ends with gunfire",
        "content": "SAN ANTONIO - Two men have been arrested after a fight over a Netflix account ended with gunfire.\n\nBrian Travis Reynolds, 19, and Anthony Constante, 19, were taken into custody this week in connection with an incident outside a home on Calle Briseno, according to the Bexar County Sheriff’s Office.\n\nInvestigators said the confrontation started on September 23, after Reynolds changed the name on 20-year-old Vincent Munoz’s Netflix account to an insult. Munoz then agreed to fight Reynolds and Constante after feeling disrespected.\n\nWhen the pair showed up, they jumped a fence to get to Munoz. Reynolds had a handgun in his waistband, which he allegedly handed to Constante during the fight. At one point, Constante was seen on video striking Munoz repeatedly while holding the weapon, deputies said.\n\nThe fight continued after the gun was passed back to Reynolds. A shot was fired during the struggle, and Munoz was left bleeding from the head. It’s still unclear if he was struck by a bullet or injured another way.\n\nDeputies also noted the gun had been modified with an illegal device known as a “switch,” which turns it into a fully automatic weapon.\n\nReynolds and Constante were arrested.\n\n[Reynolds &amp; Constante: a cautionary tale in being careful re: sharing your Netflix password](https://preview.redd.it/ua398llofxrf1.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=78e07955aabdf562b102294f9beeaff3b28df1ee)\n\n[news article link](https://foxsanantonio.com/newsletter-daily/two-men-arrested-after-fight-over-netflix-account-escalates-to-gunfire-gun-violence-switch-television)",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nsrqxe/two_men_arrested_after_fight_over_netflix_account/"
    },
    {
        "id": "1nsrlo7",
        "author": "Upstairs-Ad6502",
        "title": "Season 1 tires review a light hearted hit",
        "content": "\n​I think Season 1 of Tires is simply an awesome watch from start to finish. The show is packed with light-hearted fun that makes it incredibly easy to binge. It has that great quality of being simple, pure entertainment without much heavy lifting. While the main story arc builds in a somewhat predictable way, the journey is still highly enjoyable. I was particularly impressed with the interpersonal conflict and sharp dialogue between the characters. The entire cast has been perfectly picked for their respective roles in the auto shop. Shane and Will are especially perfect, carrying the comedy with their brilliant chemistry. Their relationship is the heart of the show and provides most of the laughs. The comedic timing is insane to watch. I genuinely like the show's approach to covering various social subjects. It addresses them realistically and with a good sense of humor, which is refreshing. Crucially, it manages to bring a positive message to the world without ever feeling like a boring public service announcement. Overall, I really loved the first season of Tires and highly recommend it for a fun, quick watch.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nsrlo7/season_1_tires_review_a_light_hearted_hit/"
    },
    {
        "id": "1nsj6lp",
        "author": "CocoaKpopsTTV",
        "title": "One of the best Japanese movies I have ever seen...",
        "content": "Drawing Closer came out in 2024. It stars Ren Nagase, Natsuki Deguchi, and Mayu Yokota. I don't want to really spoil anything. When you pull it up on Netflix you'll get the jist anyway. I have watched this several times but recently I find myself in a similar situation:  metastasized colon cancer. Anyway, who cares about that. I was going through my watch later list cleaning things out because no one lives forever right? I came across this and watched it again but in a WHOLE different light. It is SO well acted. The feelings they showed were visceral.  The beginning, the middle, the end. All perfect. It has been a tear jerker everytime I watched it but now, the whole \"live for the moment\" storyline took on a whole different meaning. Anyway, this isn't meant to be a soapbox. I'd like you to watch it. Sure you need subtitles but believe me it in no way diminishes the feelings you'll have. It's not depressing either if that's what you think. It's sad, almost unbearably so. But it celebrates life in a way that makes it uplifting. Maybe it's my own situation making me write this review but it seems like the most original movie dealing with this subject matter that maybe I have ever seen.  So please check it out. Thanks for reading.  :)",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nsj6lp/one_of_the_best_japanese_movies_i_have_ever_seen/"
    },
    {
        "id": "1nscs8m",
        "author": "Ambitious-Drama-9313",
        "title": "It's 8:00 o clock, raining and you're alone with your pet, which show are you binging?",
        "content": "[Ginny and Georgia](https://preview.redd.it/33h2upzwdtrf1.png?width=312&amp;format=png&amp;auto=webp&amp;s=12cb96c7acd2ce079a257d71cec997574e05facc)\n\n[Cobra Kai](https://preview.redd.it/0p8xy9m3etrf1.png?width=450&amp;format=png&amp;auto=webp&amp;s=a403fe12cba952e197d3f2fa1fb60f7be603402d)\n\n[Stranger Things](https://preview.redd.it/jzheye67etrf1.png?width=184&amp;format=png&amp;auto=webp&amp;s=662cb190c7651ce05f1cad9aa20cd77b4c5d7bdb)\n\n[Wednesday](https://preview.redd.it/co36spqcetrf1.png?width=300&amp;format=png&amp;auto=webp&amp;s=040c096065f15e1a1bf6fc6dd2fbc15aeba6a4f0)\n\n[Jurassic World: Camp Cretaceous](https://preview.redd.it/27mgnuwhetrf1.png?width=183&amp;format=png&amp;auto=webp&amp;s=959209ac17372208ea31f02eefeba2fa6ab0b0f8)\n\n[Squid Game](https://preview.redd.it/6aghpimnetrf1.png?width=190&amp;format=png&amp;auto=webp&amp;s=7fdde753d2181b22aa3d77722291f5f7a6827f60)\n\n\n\n[Outer Banks](https://preview.redd.it/ateg0tctetrf1.png?width=450&amp;format=png&amp;auto=webp&amp;s=d86802cd78db121252bdb7729aa1eb18a96266b1)\n\nNo other options!",
        "upvotes": 12,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1nscs8m/its_800_o_clock_raining_and_youre_alone_with_your/"
    },
    {
        "id": "1ns9sdx",
        "author": "savingrace0262",
        "title": "What I should I watch? Black Rabbit or Wayward?",
        "content": "I’ve got some free time and want to start a new show, but I’m stuck between Black Rabbit and Wayward. Both look interesting, but I don’t want to commit to one and regret it halfway through. Any recs?",
        "upvotes": 18,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1ns9sdx/what_i_should_i_watch_black_rabbit_or_wayward/"
    },
    {
        "id": "1nrzl61",
        "author": "Beneficial_Pickle288",
        "title": "Altered Carbon",
        "content": "I never see anyone talk about this show or even recommend it when people ask for recommendations, which leads me to believe a lot of you have not seen it!  Definitely worth a watch, sci-fi action thriller with great characters, and a compelling story line.  I think they also have an animated series, which I have not seen yet, but definitely highly recommend the live action show!  Here is the trailer for your viewing pleasure.\n\nhttps://youtu.be/-Yt89b5AcwY?si=HVAoOhI4BiOW_p9P\n\n",
        "upvotes": 56,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1nrzl61/altered_carbon/"
    },
    {
        "id": "1nsnd6t",
        "author": "Feelinoutthere",
        "title": "Netflix freezes sometimes when in fullscreen",
        "content": "When watching netflix it will randomly freeze the frame and audio will continue for a second and then stop. When you leave fullscreen it will go back to normal, it happens randomly, not instantly when entering fullscreen and not when subtitles for example show up. It's not regular either, can be with 1 minute breaks or 20min breaks, we tried updating drivers because I've seen others mention that could be causing issues but it didn't help. We've also tried two different monitors, one which is 60hz and one which is 144hz, it makes no difference.   \nAnyone recognize this?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nsnd6t/netflix_freezes_sometimes_when_in_fullscreen/"
    },
    {
        "id": "1nsiz6v",
        "author": "OkRecommendation1643",
        "title": "Netflix text verification removed?",
        "content": "On my TV, I used to see both “send text” and “send email” as verification options, but now it only shows “send email.” I’m wondering if Netflix has removed the text option due to household sharing. \nWhat can be done to get the “send text” option back?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nsiz6v/netflix_text_verification_removed/"
    },
    {
        "id": "1ns8eth",
        "author": "grayblesbeing",
        "title": "If you enjoyed The Sinner, may I recommend…",
        "content": "…the delightful Detective Frost? Grizzled fella, solves cases by his own non-traditional methodologies, endearingly neglects his personal life, and the subjects of his cases represent little ecosystems in the human community. And British flavored!\n\nI somehow watched season 4, then 1-3 of The Sinner and the thing that irked me most about the show is that Ambrose is hardly impacted by the administrative expectations of his actual job. I mean, in season 2 he spent the whole time basically volunteering his services for another PD lol. Meanwhile, Detective Frost is more realistically part of a department and has an amusing relationship with a boss who actually makes professional demands of him. There’s pretty good running jokes about the growing piles of unfinished paperwork associated with cases backing up. Lastly, he takes mentoring younger members of the department seriously and that’s pretty sweet to see. \n\n",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ns8eth/if_you_enjoyed_the_sinner_may_i_recommend/"
    },
    {
        "id": "1nskp4n",
        "author": "JudyluvsV",
        "title": "Lara Croft vs. T-Rex - Legend of Lara Croft",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nskp4n/lara_croft_vs_trex_legend_of_lara_croft/"
    },
    {
        "id": "1ns4ve7",
        "author": "Gloomy_Barnacle777",
        "title": "‘Monopoly’: Trio Of Producers Pass Go In Contest To Make Netflix Game Show Based On Board Game",
        "content": "",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ns4ve7/monopoly_trio_of_producers_pass_go_in_contest_to/"
    },
    {
        "id": "1nsabf3",
        "author": "Which_Mammoth9402",
        "title": "What other shows are similar to “You” or “Shameless”",
        "content": "I’m not too big on netflix shows or movies but I did really enjoy You and Shameless. I also LOVED ozark, money heist, orange is the new black and baby \n\nIm looking for shows that are interesting and good right off the bat- not those shows where you have to watch at least 5 episodes before it gets good\n\nAny suggestions? 🫶🏻",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nsabf3/what_other_shows_are_similar_to_you_or_shameless/"
    },
    {
        "id": "1nseems",
        "author": "bananabread9876",
        "title": "Is there a way to watch netflix in hd on pc?",
        "content": "i’m trying to watch 28 years later a film that’s in 2.76:1 on my pc because my ps5 letterboxes everything to 16:9 but the playback quality is awful. i’m using the official netflix pc app and it’s still awful. is there any way to fix this ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nseems/is_there_a_way_to_watch_netflix_in_hd_on_pc/"
    },
    {
        "id": "1ns22z9",
        "author": "Brakonah",
        "title": "El Chapo or Narcos ?",
        "content": "What is Your choice and what? \nI’m fascinated with El Chapo history but seems like opinions about Narcos are better. \nWhat’s differences and history worth to watch? \n\nI just listened few histories on yt and just wanna know what do You think or maybe u know some facts from your life ? \n",
        "upvotes": 11,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1ns22z9/el_chapo_or_narcos/"
    },
    {
        "id": "1nryevi",
        "author": "BrainImpressive9529",
        "title": "Need new recommendations 😭",
        "content": "So, I want some new series recommendations.. it feels like I have watched everything on netflix and can’t find any good series now.. please recommend me some good series..\n\nI have watched wednesday, alice in borderland, squid game, my life with walter boys, stranger things etc, and kdramas..\n\nI need something fun, mystery, feel good, could be anything but worth watching.. ",
        "upvotes": 15,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1nryevi/need_new_recommendations/"
    },
    {
        "id": "1nrdav5",
        "author": "JollyToe440",
        "title": "Tired of seeing cheating in relationships in Netflix Shows",
        "content": "This ain’t no spoiler. I just began The Waterfront Episode 1. Before half of the episode was done, it seems like one of the main guys runs into his high school sweetheart. It is then made clear that they are both partnered up already. The next day, he goes to her shop where she works and they strike a convo. It feels like there will be cheating already, and i’m just fed up with that storyline. I won’t continue watching this show if the characters are just typical netflix tropes; unrelatable yet oh-so cheesy. Also, it just feels unnecessary to start this cheater narrative when the guy could’ve just been single. So cliché. \n\nReally wondering why this show is at the top searches. \n\nAnyone can let me know if there will be actual cheating or will they be normal people for once? ",
        "upvotes": 420,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1nrdav5/tired_of_seeing_cheating_in_relationships_in/"
    },
    {
        "id": "1nsa2ik",
        "author": "luci-fan-since07",
        "title": "I’m on episode four of building the band and Allison…",
        "content": "Okay, I can’t be the only one who’s watching this and feeling like Allison can’t be serious. It feels like satire. She is such a horrible person! So cocky, so shallow, so vein and honestly, borderline *CRUEL*. I was so p!ssed off when &gt;!she through to be a band!&lt;. This girl is the reason I’m so nervous and self conscious around girls my age (I’m 18 and I feel like this is too much of a common theme with girls 10/11 - early 20s). Anyways, I just wanted to put this out there and get others opinions. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nsa2ik/im_on_episode_four_of_building_the_band_and/"
    },
    {
        "id": "1nsc8uw",
        "author": "ADDRAY-240",
        "title": "El refugio atomico really disappointed me",
        "content": "The first two episodes were nice and all, but the rest devolved into yet another spanish drama (albeit in fallout-pilled suits).\nI wanted to know way more about the details of the plan, especially after Casa de papel.\nThe two families were too weird for me to feel empathy for them (I swear, the dad who's desperate for love and friendship is the most sane of the bunch), the two 'kids' felt so dumb (WHO expects to find a usable blood-purifier after a nuclear carpet bombing?) and it felt extremely anticlimatic for the whole compound to shut down because of a shortcut. Designed by a top-tier architect and her genius engineer of a brother, but beaten by a blockhead with a prison formation to be electrician. And for their super AI (that is CRUCIAL to the plan) not to have a back-up source of power was a bit too much for me.\n\nAaaaand, the CEO's associate's whole arc was basically useless. The dude had a perfect love story (orchestrated by the gang to serve the plan) but got a random info that made him doubt everything. And when we thought he was about to make the whole thing fail..... the gang just offs him. One pushed him into the other's arms, the latter breaking his neck just likmke that, on the street. Unless this death plays an important part in a potential second season, this arc was pointlessly focused upon.\n\n\nAnd tge final problem I have with how mister blockhead \"Muh, my dad's pathetic and my mom's a psycho that regrets I was born\" managed to get out. The command center just needed to cut the power to stop the final elevator. This would have given their staff ten times the time to, idk, release the elevator and off the guy. But no, they all watch him reach the exit (I know he had a tablet, but that wasn't gonna do jack if  the power was cut)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nsc8uw/el_refugio_atomico_really_disappointed_me/"
    },
    {
        "id": "1ns50ja",
        "author": "Gloomy_Barnacle777",
        "title": "Luke Wilson To Re-Team With Will Ferrell In Netflix Golf Comedy Series",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ns50ja/luke_wilson_to_reteam_with_will_ferrell_in/"
    },
    {
        "id": "1ns9yky",
        "author": "Doogie102",
        "title": "Canadian Netflix while parents at vacation home in the states.",
        "content": "Hey so my family and I live in Canada. We have a family cabin in the states. What happens as I will stay at home and they stay at the cabin for prolonged times (retired life). The thing is when they go to the cabin I loose my access to netflix. \n\nIs there any way to set a primary residents and a vacation address. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ns9yky/canadian_netflix_while_parents_at_vacation_home/"
    },
    {
        "id": "1ns2f5j",
        "author": "Cold_Link_1057",
        "title": "Can anyone suggest me thriller movies/series",
        "content": "I recently watched the girlfriend and i like it  please suggest some good thriller and fun series'/movie\nMy favs\nwhy women kill\nbased on true story\nalice in Borderland \nyou\nthe menu\n",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ns2f5j/can_anyone_suggest_me_thriller_moviesseries/"
    },
    {
        "id": "1nsc3po",
        "author": "Gabienchoi",
        "title": "Black Rabbit",
        "content": "I recently watched Netflix’s Black Rabbit, and I’m not sure how to classify its genre. On the surface it feels like a thriller or mystery, but the way it dives into relationships and psychology gives it more of a drama vibe. At times it even carries a noir-like atmosphere with crime elements mixed in. I’m curious—how do you all see it? Do you think it fits better as a thriller, a drama, or a crime series?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nsc3po/black_rabbit/"
    }
]