[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 38,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qfs60q",
        "author": "DemiFiendRSA",
        "title": "Matt Damon Says Netflix Wants Movies to Restate the ‘Plot Three or Four Times in the Dialogue’ Because Viewers are on ‘Their Phones While They’re Watching’",
        "content": "",
        "upvotes": 743,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1qfs60q/matt_damon_says_netflix_wants_movies_to_restate/"
    },
    {
        "id": "1qf6w3z",
        "author": "Remarkable-Gate-9944",
        "title": "Santa Clarita Diet deserved better. WE deserve better.",
        "content": "I just found out from Reddit that Santa Clarita Diet ended.\n\nNot ‘ended years ago, we all processed it’ ended.\n\nEnded as in I was living my life under the delusion that Sheila Hammond was still somewhere out there, eating bad people and making suburban chaos look fun.\n\nNetflix said - zombies, but make it domestic.\n\nThen said - cool concept, great cast, cliffhanger? Yeah, no. Buhbye. Nailed the coffin shut.\n\nWhat makes it worse is that this show was early to a very specific vibe that’s everywhere now. Dark but cozy, absurd but oddly wholesome. Violent things happening while people argue about mundane nonsense. Basically existential dread with popcorn.\n\nShows like Ghosts are carrying that torch. Dead people. Ridiculous problems. Jokes that are dumb, sharp and self-aware at the same time. The kind of humor that doesn’t try too hard but still sneaks up and punches you in the face. Politely.\n\nI’m convinced this genre works because most of us are tired, mildly unhinged and coping through irony. We don’t want prestige misery. We want chaos that knows it’s chaos. We want death jokes that somehow feel comforting.\n\nAnyway, RIP Santa Clarita Diet. Gone too soon.\n\nTaken from us mid-bite.\n\nNetflix, I forgive a lot, but I will never forgive you for this one. If ever I get bitten, you know who I’m coming for",
        "upvotes": 864,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1qf6w3z/santa_clarita_diet_deserved_better_we_deserve/"
    },
    {
        "id": "1qfyefn",
        "author": "PhenomenalPhoenix",
        "title": "When I click on a show or a movie it automatically starts playing instead of going to the series info/episode list screen. Does anyone know if there’s a way to change that?",
        "content": "I can go the info screen without an episode starting on the app on my phone but when I’m watching on my tv there’s no way to just go straight to the info screen anymore. It just starts playing the show when I click on it and I have to wait for it to load so I can click on series info from there. I want to know if there’s a way to change that because sometimes I want to see more about a new show without it auto starting or if I exit the episode I’m watching without letting it get far enough through the credits, it’ll start that episode completely over instead of going to the next one. It’s just generally annoying and there doesn’t seem to be any app settings that I can find but I want to know if there’s a way to change it that I’m just missing.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qfyefn/when_i_click_on_a_show_or_a_movie_it/"
    },
    {
        "id": "1qforjn",
        "author": "SecretaryPresent16",
        "title": "His and Hers - opinions and spoilers",
        "content": "Personally I thought this was a fun, quick watch. Was it realistic? No. Was it far-fetched? Absolutely. But I enjoyed it. Entertaining for sure and I appreciated the plot twist no matter how ridiculous it was \n\nBUT There were quite a few plot holes. I can let things go, but the one that really bothered me was WHY WOULD ANNA BE MARRIED TO THE BROTHER OF A GIRL WHO WATCHED AND LAUGHED WHILE SHE GOT RAPED??\n\nSure, Jack was flawed, but an overall good man who loved Anna and definitely went out of his way to protect her, but still, you’d think she’d stay far away from those girls and anyone related to them, let alone marry a sibling. Those girls were just plain evil. And they didn’t even have any remorse. Helen making a comment about her dead child? Zoe giving her the finger and telling her to stop holding a grudge??\n\nI wish there had been some backstory of how she and Jack got together. Anything that would explain how she could possibly be content with Zoe being his sister-in-law. I thought maybe she fell in love with Jack before she knew Zoe was his sister? Or maybe she started dating Jack so she could keep Zoe close and somehow get revenge … but then accidentally fell for him?? Idk. At least some kind of explanation. \n\nAnyway, that is all. ",
        "upvotes": 22,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qforjn/his_and_hers_opinions_and_spoilers/"
    },
    {
        "id": "1qfv5it",
        "author": "got2bfaster",
        "title": "His &amp; Hers",
        "content": "I had mixed feelings about this show. Just binged watched it and I couldn’t believe those 3 girls would SING AND LAUGH happy birthday WHILE Anna was being SA’d. That was beyond sadistic. \n\nAs f’d up it was to kill them, they deserved everything. \n\nAnd Catherine Alexis (Lexy) was such a b when Anna said a couple times she didn’t know the other girls would bully her let alone the fact Anna STEPPED IN when those trifling men were going to SA HER. she also was a b to kill her sister and then tried to act like she was sad. \n\nThe grandma killing all the girls didn’t make sense logistically esp as she would’ve had footprints in the wood (they found footprints but didn’t see the other set?) and there should’ve been fingerprints SOMEWHERE  but I know they did that so the twist would be such. \n\nAlso, did she walk EVERYWHERE? how the hell she end up at the lake house? It doesn’t seem like that was a commuter friendly town as everyone else drove except her and her timing for being everywhere was impeccable. I knew she could’ve tossed her gown from the first killing but wouldn’t they had found that somewhere along the path to the forest. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qfv5it/his_hers/"
    },
    {
        "id": "1qfmmpd",
        "author": "sadwoodlouse",
        "title": "Seven Dials: full of AI?",
        "content": "Watching the new Agatha Christie's Seven Dials series: is it just me or is it distractingly full of AI?\n\nAt first I thought it was just an odd directors choice that almost everything and everyone in the background is blurred/out of focus.\n\nFor example, there's a scene at the 41 minute mark in a market square with every background artist either walking away from the main camera, has blurred/smudged faces, or is moving unnaturally.\n\nIt's infuriating, won't bother watching the rest. I wish there was a notification on Netflix content which includes AI of any kind. ",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qfmmpd/seven_dials_full_of_ai/"
    },
    {
        "id": "1qf8xbk",
        "author": "BradyPhoenix",
        "title": "The Rip was a pleasant surprise",
        "content": "I’m not normally into heist/cop movies but I gave this one a shot due to the stacked cast. I had a lot of fun with it. \n\n🛑Plot Spoilers Ahead:🛑\n\nI assumed either Affleck or Damon was gonna be the mole and the drama of the film was gonna be them facing off and it seemed to be going that way, but I really liked that it ended with them teaming up and utilizing their bromance.\n\nI think all the other actors did a great job too!\n\n  \nMy only real complaint was they had these 3 interesting ladies and didn’t utilize them at all in the climax. It was like ”Alright you girls just sit here while we go have our Man Action Finale™️ now” lol\n\n  \nBut overall I really did like it! 👍",
        "upvotes": 45,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1qf8xbk/the_rip_was_a_pleasant_surprise/"
    },
    {
        "id": "1qfw1s8",
        "author": "unicorngoesvroom",
        "title": "Everything I watch skips/glitches",
        "content": "I took a video of it but I cant post it here. Initially I bought a new tv and noticed any time I watched netflix, anything i watched would skip for a couple of seconds pretty frequently. Thought it was the tv and where I bought it from so I got a different tv from a different place and the issue persists. We have 2 other tvs in the house that dont have this issue. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qfw1s8/everything_i_watch_skipsglitches/"
    },
    {
        "id": "1qfnnry",
        "author": "No-Raise-8779",
        "title": "Genuine question for Harlan Coben fans",
        "content": "I have a question for people who have read Harlan Coben books.\n\nI have seen some of his adaptations on Netflix. My feelings are...pretty mixed overall. I'll get into it soon. The point is: I hear the books are actually great and get butchered by adaptations. I just want to ask: is that true? I mean, are the books better? And if so, how?\n\nSpecifically, these are the adaptations I've watched so far and my opinions on them\n\n\\-You fool me once, british show. I thought it was pretty good. Yeah, there were some stretches in logic, a couple plot holes and a few storylines that ended up not leading anywhere, but overall, it was pretty good and engaging\n\n\\-Caught, spanish show. I was pretty mixed on this one. Even more unresolved storylines, the mystery was not nearly as engaging, plus I think the main character is one of the most annoying main characters ever and I was actually rooting for the villain to kill her in the final episode.\n\n\\-The woods, polish show. This one I did not like. Pretty much all the characters are boring, pretty much all the storylines are pointless, the mystery is not that interesting and the answers we get aren't really worth the wait.\n\n  \nSo, if you have read the books those shows are based on, are they better?And what do they do that makes them better? Honestly, my main issue with all three shows is the overblown amount of characters and storylines, which results in most of them being underdeveloped. Is that problem present in the books or is it done better?\n\nIf you know, please tell me. Thank you for your time.",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qfnnry/genuine_question_for_harlan_coben_fans/"
    },
    {
        "id": "1qfyaax",
        "author": "vokabulary",
        "title": "Paparazzi King",
        "content": "what the hell was the doc about lmao - I couldn’t follow a damn thing they were talking about? the guy manufactured scandals ? he exploited his model wife? what? berlusconi ? what ? no idea and turned it off midway. let me know if you understood it ?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qfyaax/paparazzi_king/"
    },
    {
        "id": "1qfy228",
        "author": "Character_Fold1605",
        "title": "Help me figure out which show this was!",
        "content": "Pretty sure it was on Netflix, but there’s a chance I’m fusing different shows together. It was a drama/mystery with a teen girl lead. She had a close friend who was new to the trans community and her mother would constantly deadname her. Eventually I believe the trans girl’s mom thought the lead character was a bad influence and wouldn’t let her hang out with her anymore. I’m so sure of this trans character, but I can’t find the show I’m thinking of anywhere! It had A Good Girl’s Guide to Murder vibes.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qfy228/help_me_figure_out_which_show_this_was/"
    },
    {
        "id": "1qfxra2",
        "author": "VastConfusion8174",
        "title": "Kdrama on Netflix with an English audio description",
        "content": "No I've been watching some k-dramas and I haven't found any yet that have like the audio description they use for like people who have hard time seeing​so I was wondering are there any with the audio description feature thank you in advance~~​~~",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qfxra2/kdrama_on_netflix_with_an_english_audio/"
    },
    {
        "id": "1qfx8y6",
        "author": "Candid_Coconut4733",
        "title": "Adolescence",
        "content": "I finally got around to watching this after I have heard so many positive reviews. I was astonished by Ep. 3 - I have a question here. Why did the child psychologist gag at her own sandwich? The cheese &amp; pickle sandwich? I interpreted it as she knew it was a bad sandwich &amp; was using it as a part of her evaluation to see if he would eat it or not. Did anyone else pick up on this? \n\nAlso - super bummed when I realized at the end of Ep. 4 the show was over. I really wish we got to see what happened with Ryan. Did they ever find the knife? What was Jamie’s sentence? I wish we got to know more about Katie &amp; Jades relationship. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qfx8y6/adolescence/"
    },
    {
        "id": "1qfx4vh",
        "author": "Quick_Expression6410",
        "title": "Absentia?",
        "content": "I wrote a review recently on Season 1 and I proclaimed it was terrible writing. But I couldn't stop watching. Once I start a show, I want to finish it but it's becoming painful to watch 🤣 I'll just stop at the end of season 2. \n\nBut here are a few concerns: how is Emily able to go back to work at the FBI under her current circumstances? She's not stable. But if that isn't obvious to her peers and superior, how do we not see her cleared for work by a psychologist or psychiatrist or something? \n\nDon't the FBI do drug testing? Was she not abusing drugs a few days ago? So how does she make that leap? \n\nI'm fuming over this show but I'll still complete season 2. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qfx4vh/absentia/"
    },
    {
        "id": "1qf2bj8",
        "author": "Creative-Pudding-392",
        "title": "His &amp; Hers is Amazing!",
        "content": "I read this one post on Reddit about how bad the show is and or how it's comical and doesn't compare to the book or some stuff like that. Anyway, the show is amazing. The ending is amazing. The twists are amazing. I am in complete shock by the ending so much so that I had to rewind it, just to watch it again. You had people talking about the actors and their acting as if the cast isn't filled with seasoned performers. Come on! Some people are complaining for no reason at all. We need more shows like this that has good unsuspecting twists. ",
        "upvotes": 73,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1qf2bj8/his_hers_is_amazing/"
    },
    {
        "id": "1qez4kr",
        "author": "Texanlivinglife",
        "title": "The Rip",
        "content": "Oh my goodness. Damon and Affleck have done it again. Best movie!!! I mean full on suspense throughout. I hope they continue making great movies. The ending though wow!!! ",
        "upvotes": 75,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1qez4kr/the_rip/"
    },
    {
        "id": "1qemamp",
        "author": "Reddit_Sucks_1401",
        "title": "The Live-Action Zelda Movie Is Coming To Netflix Following Its Theatrical And Home Entertainment Release Periods",
        "content": "",
        "upvotes": 317,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1qemamp/the_liveaction_zelda_movie_is_coming_to_netflix/"
    },
    {
        "id": "1qf4de7",
        "author": "JemJemIsHerName",
        "title": "The Rip (just about the dog)",
        "content": "No plot/story spoilers here! When I saw there was a dog in the movie I was worried about the dog’s outcome. I love how much the movie addresses this and tells us how ok the dog is and also how much other people in the movie care about how the dog is doing. Dog is ok! ",
        "upvotes": 27,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qf4de7/the_rip_just_about_the_dog/"
    },
    {
        "id": "1qf5bel",
        "author": "AccomplishedPut5175",
        "title": "The Rip",
        "content": "Just finished watching and… Ben is brilliant, Matt is always an A+, they never disappoint when it comes to acting, always A+. The film, is it good? Yes. Could it have been better in my opinion? Yes. Definitely my recommendation to watch, it will hold your attention, no doubt about that. Honestly, 8 out of 10. This is just my opinion, so… All the best☘️",
        "upvotes": 24,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qf5bel/the_rip/"
    },
    {
        "id": "1qfi1u1",
        "author": "nobuouematsu1",
        "title": "Appalachian Trail Documentary",
        "content": "They had a documentary on here years ago, I think from NatGeo about the Appalachian trail. Any idea where I could watch it? Ive checked Netflix and Disney+ since they have NatGeo content now. thanks l!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qfi1u1/appalachian_trail_documentary/"
    },
    {
        "id": "1qfoc6e",
        "author": "OpportunityAny5178",
        "title": "Dolby Vision error?",
        "content": "Hi, has anyone encountered this glitch on Netflix? It seems to me like some kind of Dolby Vision streaming error. It’s happened to me three times now with the movie The Rip, and in the past it also happened with some Netflix series, but I don’t remember which one — I just know it also used Dolby Vision. I have an LG OLED A1.\n\n[https://imgur.com/a/PDQtKTq](https://imgur.com/a/PDQtKTq)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qfoc6e/dolby_vision_error/"
    },
    {
        "id": "1qfnvt7",
        "author": "Twan88mot",
        "title": "Netflix Interface Back to Normal with New Ziggo Mediabox?",
        "content": "For a long time, the Netflix interface was frustrating. Many options and categories were missing.\n\nToday, I start Netflix and now looks normal again, just like it used to.\n\nHas anyone else experienced this? Could it be a coincidence, or has Netflix rolled back the changes?\n\nMy TV hasn’t been updated at all—only the Ziggo mediabox was replaced. From my television provider.",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qfnvt7/netflix_interface_back_to_normal_with_new_ziggo/"
    },
    {
        "id": "1qf3ip6",
        "author": "Own-Resource4156",
        "title": "Movie about ex wife trying to warn new fiance",
        "content": "I was working, not paying much attention but a trailer popped up on netflix about an ex wife going to the new fiances home. She said she just needed 5 minutes of her time. The fiance put her hand on the doorframe, showing off her painted nails. The ex wife looked shocked and said \"he lets you paint your nails?\" And that stood out to me. I was on the phone with a client and several trailers past and now its not on mh account anymore. I tried google, chatgpt, phone-a-friend and im starting to feel crazy. In the trailer it was at night in what looked like a suburb. Both women had american accents, i believe the ex wife was brunette and the fiance was a redhead. Thanks in advance!",
        "upvotes": 13,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qf3ip6/movie_about_ex_wife_trying_to_warn_new_fiance/"
    },
    {
        "id": "1qfl6ev",
        "author": "Left_Actuary_7890",
        "title": "Binge watching",
        "content": "How do you guys go about watching tv shows and movies. I feel like my list keeps expanding 🤣 without me ever actually making a dent in it.  Many times I don’t even know where to start, what to watch next. Should I watche a movie or a tv show ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qfl6ev/binge_watching/"
    },
    {
        "id": "1qfq2wm",
        "author": "MyNameIsNotMarcos",
        "title": "No seatbelts in Captain Fall?",
        "content": "The animation is great. I just find it intriguing that very rarely characters use seatbelts when in vehicles. Especially considering how they're actually quite detail oriented otherwise.\n\n I wonder if it has to do with the cultural background of the animators (Norwegian?).\n\nAnyone else noticed that?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qfq2wm/no_seatbelts_in_captain_fall/"
    },
    {
        "id": "1qfw5tx",
        "author": "Princesspartya",
        "title": "Is it worth it to restart stranger things from the beginning?",
        "content": "So I initially watched stranger things for the first time right when it came out, but only watched a couple episodes and I guess something else caught my attention more. Now that everyone’s talking about season 5 I’m thinking about re starting it all together! Is it worth it? ",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1qfw5tx/is_it_worth_it_to_restart_stranger_things_from/"
    },
    {
        "id": "1qg0k6i",
        "author": "lettersnumbersetc",
        "title": "Streaming is a joke, 😂",
        "content": "Pretty much all of the shows on Netflix everybody’s watching category are like 5 to 10 years old. Streaming blows. It has been such a step backward. I’m sure it’s all intentional, though reintroduce ads slow down production time release less quality shows. It all works out in the studio’s favor not so much for the subscriber.",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qg0k6i/streaming_is_a_joke/"
    },
    {
        "id": "1qer9e2",
        "author": "Icy-Calligrapher1188",
        "title": "His&amp;Hers... a few things made no sense. Anyone care to explain?",
        "content": "The series was okay. Enough for me to binge it in a day and keep wanting to play the next episode. But dialogue and acting was... meh. \n\nOk, things that didn't make sense and I'm unsure if it was just a weird way to think one way and throw us off track? If so... kind of sloppily done. \n\n1) the whole intro. Anna hurrying to clean up her apartment and her tooth being infected or whatever? \n\n2) what was Lexy and Richard's end game?? Why did they have all of that stuff at the lake house? \n\n3) So did Lexy become a news anchor just to get back at Anna or to do what? (See 2) \n\n4) I don't even understand the whole Clyde and Helen side quest. \n\n5) Why did Zoe say to Jack that Anna isn't who he thinks she is. Guessing to side-blame because shit was about to go down?? \n\nI'm sure there's others I am unsure about but that's in my brain rn. ",
        "upvotes": 30,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1qer9e2/hishers_a_few_things_made_no_sense_anyone_care_to/"
    }
]