[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1ogee04",
        "author": "Western_Quit_4966",
        "title": "Netflix doesn’t care about good writing anymore",
        "content": "The platform is full of shows with huge production value but terrible scripts. It’s all visuals and marketing, zero substance. People only praise it because it’s on Netflix. Who’s tired of this?",
        "upvotes": 129,
        "comments": 111,
        "media": null,
        "permalink": "/r/netflix/comments/1ogee04/netflix_doesnt_care_about_good_writing_anymore/"
    },
    {
        "id": "1ogo0q8",
        "author": "Newfie3",
        "title": "House of Dynamite - wholly unsatisfying (spoiler)",
        "content": "I should have known by the horrible deliberate camera-shaking that the movie was going to suck. There is no good reason for deliberate camera-shaking. Then the plot repeated itself from three or four perspectives. Then the movie just ended with zero resolution whatsoever. Sorry Netflix, this movie was a bomb, but not in a good way.",
        "upvotes": 15,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ogo0q8/house_of_dynamite_wholly_unsatisfying_spoiler/"
    },
    {
        "id": "1og8tmv",
        "author": "liveoutdoor",
        "title": "I really hate Netflix at the moment.",
        "content": "As a pet/house sitter I am usually away from my house. I bring my own device to stream, so far tonight I have had to update my household, ener codes etc 5 times. Then the family back at home gets booted it is so ridiculous.\n\nJust a rant. ",
        "upvotes": 135,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1og8tmv/i_really_hate_netflix_at_the_moment/"
    },
    {
        "id": "1ogep7t",
        "author": "YeetMyM3at",
        "title": "Anyone else spend more time scrolling than actually watching?",
        "content": "I open Netflix planning to watch something, then end up scrolling for 30 minutes trying to pick a show.  \nBy the time I finally choose, I’m not even in the mood anymore.\n\nDoes anyone else do this, or is it just me?",
        "upvotes": 40,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ogep7t/anyone_else_spend_more_time_scrolling_than/"
    },
    {
        "id": "1ogbg13",
        "author": "Short_Pin_6243",
        "title": "House of Dynamite was so close to being great",
        "content": "*Potential minor spoiler*\n\nJust watched the movie and I don’t think I’ve ever felt this way about a film before. Everything was right there to make a great film but they veered off so unnecessarily. \n\nAll the film needed to do was continue to build off the tension of the first act. It felt plausible yet unbelievable at the same time. It captured the complete panic that would take place. \n\nThen they had to switch perspectives…..twice. It completely took me out of the tense feeling of the first third. It sucks because it was completely unnecessary. ",
        "upvotes": 60,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1ogbg13/house_of_dynamite_was_so_close_to_being_great/"
    },
    {
        "id": "1ogomhe",
        "author": "Ok-Lingonberry5621",
        "title": "THE PERFECT NEIGHBOR EXTRA FAMILY INFO THAT MAY CHANGE THINGS??",
        "content": "i just watched the documentary and was hoping the family got proceeds for the kids college or the general recovery of the family\nthey didn’t.\nno money at alllll from netflix.\nthey can only receive donations from their gofundme",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogomhe/the_perfect_neighbor_extra_family_info_that_may/"
    },
    {
        "id": "1ogeycg",
        "author": "Leen88",
        "title": "Just finished a show and now I have that what do I watch next",
        "content": "I just finished my latest binge and now nothing else feels interesting.  \nI scroll for like 20 minutes but can’t commit to a new show.\n\nAnyone else get that empty feeling after finishing a really good series?",
        "upvotes": 8,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ogeycg/just_finished_a_show_and_now_i_have_that_what_do/"
    },
    {
        "id": "1ofvchr",
        "author": "ShirtyManhole",
        "title": "Why do they shoot these shows in literal darkness?",
        "content": "Just finished The Black Rabbit. Really enjoyed it. Slow burn… two kids forged by a rough upbringing, bound together by brotherly love in a highly toxic way.\n\nBut why do they shoot half of these shows in literal darkness? I spent more time squinting at shadows than actually watching. At some points, it was more similar to listening to an audiobook than watching a show. I get that it’s moody, atmospheric, and dark for effect. However I feel I need military-grade night-vision goggles to follow the plot.",
        "upvotes": 142,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1ofvchr/why_do_they_shoot_these_shows_in_literal_darkness/"
    },
    {
        "id": "1ogq4vr",
        "author": "Honest_Conclusion538",
        "title": "Ewrly Netflix Pop up -Accidentally clicked away",
        "content": "I was on Netflix today on my tv and got a pop up an offer that said something about screening titles early. I instinctively clicked away but actually was interested.\n\nDoes anyone know what this is about or how I can opt in? \n\nNetflix customer support was no help. :(",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogq4vr/ewrly_netflix_pop_up_accidentally_clicked_away/"
    },
    {
        "id": "1ogpzw5",
        "author": "That-Skin-1728",
        "title": "Suggest me thriller movies",
        "content": "Hey everyone! I’m in the mood for some intense, edge-of-the-seat thriller movies on Netflix and could really use your suggestions. I love films that keep you guessing till the very end — with smart plots, psychological twists, or a touch of mystery. I’ve already seen the big ones like Gone Girl, Prisoners, The Call, and The Girl with the Dragon Tattoo, so I’m hoping to discover some hidden gems or underrated thrillers that deserve more attention. I enjoy both slow-burn psychological thrillers and fast-paced crime mysteries — something gripping enough to binge in one sitting. If you know of any Netflix originals or international thrillers worth watching, drop them in the comments! Bonus points for unexpected endings or brilliant storytelling. What’s the best thriller you’ve seen lately that left you completely stunned? I’d love to make a weekend watchlist!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ogpzw5/suggest_me_thriller_movies/"
    },
    {
        "id": "1ogpae7",
        "author": "That_One_Prog",
        "title": "I have a question for the \"Monster\" series: Would they be willing to do a season for another murderer who's still alive?",
        "content": "They did it for the brothers, but I feel like it didn't really matter since people don't like rich people anyway so it had a bit of a White Lotus vibe to it.\n\nI think a good subject would be the case of Darrell Brooks, not for his stunts in the courtroom but rather exploring the lives of Erika Patterson and the Waukesha victims of the attack to show how these people lived their lives before Darrell Brooks drove through the Waukesha Christmas Parade in his mother's Ford Escape and killed 6 people.\n\nYou could take a look into underprivileged communities via red-lining, which was the main focus of the defense's claim during sentencing, as long as you emphasize that what Darrell Brooks did represented a heavy outlier in the community and that might have been caught sooner if not for the fact that most of it happened at the time when we were dealing with the COVID-19 crisis.\n\nI think it would be interesting to see how the Monster series handles the COVID-19 crisis, they could make a whole episode about just that. Maybe show a person dying of Covid in a prison cell, I don't know, maybe the *true* monster was Covid-19 all along.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogpae7/i_have_a_question_for_the_monster_series_would/"
    },
    {
        "id": "1ogie6d",
        "author": "Wild-Dragonfly1137",
        "title": "1080P vs 4K",
        "content": "Hello All\n\nFor those of you who went from 1080P to 4K, what are the features and Benifits that you realized ?\nIs it a significant difference?\nIs it worth the extra cost?\nDo you notice the difference in quality automatically? \n\nThank You for your replies. \n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ogie6d/1080p_vs_4k/"
    },
    {
        "id": "1ogg3iw",
        "author": "Siren_Flight",
        "title": "What should I watch?",
        "content": "Hi. So I've been seriously running through the entirety of Netflix for the last two years because it's been the perfect escapism for me especially when I find a great show. I finished all of 'This is us' while it was still on Netflix... and I've been trying to fill the gap since! I'm currently watching Nurse Jackie (loving the 7 seasons) but I need something lined up for when I finish that in a few weeks or something to watch WHILE I'm watching that so I can take a break since there's so many episodes.\n\nI have watched and loved: Ginny &amp; Georgia, Atypical, Sex Education, Great Pretender, Never Have I Ever, Beyond the Bar, Sirens, North of North, Queen's Gambit, Wednesday, The Four Seasons, Derry Girls, Dare Me (sad it didn't get picked up), Pulse, The Apothecary Diaries, Delicious in Dungeon, Toxic Town, Maid, Apple Cider Vinegar, Arcane...\n\nI could just go on for hours. Is there any sort of shows y'all can recommend to me based on what I've given here? ...that I've hopefully not watched already? I appreciate all and any input! Extra note: I've been looking for more WLW/Yuri/Lesbian media as well if you have any good recommendations! Gonna watch Soulmate on prime soon!(For K-dramas I've watched Beyond the Bar, Attorney Woo, The Glory, Death's Game, Be Melodramatic and Age of Youth/Hello my Twenties. Those are all of my favorites! Trigger was okay ☺️ )\n\nEdit: I'm gonna try and binge Stranger Things as well. Haven't watched it yet if you can believe that 🤣",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ogg3iw/what_should_i_watch/"
    },
    {
        "id": "1ofsij2",
        "author": "wilhelmstarscream",
        "title": "Netflix changed country of my account to get me to end grandfathered lower rate",
        "content": "Netflix changed my account from U.S. to Venezuela to try to get me to close my grandfathered $5.99 account. I don’t know where that rate came from, Netflix had it as an option. \n\nSuddenly my billing said it was paused and I had to update payment,  but Netflix blocked every option I had to update the payment method. I opened the account in the U.S. in 2010 and they changed my billing and phone number to Venezuela and said the account was opened in Venezuela a year ago. Their customer service just keeps pushing for me to close the account and open a new one under the new rates. When I try to update the billing, they changed my U.S. phone number to a Venezuela phone area code and it doesn’t let me change it or verify the new billing method.\n\nI have email proof that the account was opened in the U.S. in 2010. Netflix claims they only keep billing records for a year so they have no record of it. At first I thought I might have been hacked but their customer service is so intent on me ending the account. \n\nTheir customer service actually said,” and just to let you know if your account was created in United States you should be paying us $17.99 not $5.99.”\n\nSeems like I have no recourse and it’s a dirty way they’re getting longtime customers to end their grandfathered rate accounts.",
        "upvotes": 91,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1ofsij2/netflix_changed_country_of_my_account_to_get_me/"
    },
    {
        "id": "1ogkguh",
        "author": "WeepingWings",
        "title": "Anyone else experiencing Netflix jumping all over the place",
        "content": "I'm not sure if this is because I've jumped all over before when watching \"Nailed It\" since some episodes I like more than others, but it like I would be watching S7E1 and then it jumps to S6E1, then S6E4...it aint playing the episodes in order and I'm not sure if anyone else experienced that kind of thing...if anyone have experienced this, were you able to fix the problem or is it like \"Netflix f\\*\\*ked up and we're stuck with this until they decide fix it, if they ever decide to fix it\" kind of deal...",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ogkguh/anyone_else_experiencing_netflix_jumping_all_over/"
    },
    {
        "id": "1ogjx3o",
        "author": "Den1se1965",
        "title": "Account issues - happened to anyone else?",
        "content": "I have had a Netflix account since 2023 - and I include an additional account that I use in my holiday home. Had no issues until Friday when I got an email to say that my additional account had been removed. I logged into my account and sure enough the email address for my additional account had been changed to some random email. I immediately changed my password and logged out of all devices. I also added a profile lock. I reinstated the additional account then later that evening I got another email to say the additional account had been removed. Logged in and sure enough it had been removed but no other address had been added. This time I changed my email address and my password, signed out of all devices. I couldn’t reinstate my additional account as you can only invite twice per month. About 2hrs later I get another email email from Netflix telling me they had blocked a suspicious attempted purchase and additional account. Online chat is useless as all they say is change password. No escalation or investigation whatsoever.\nI have scanned my devices for virus/malware etc - clean. I use unique email addresses for all my accounts and use a password generator for all my passwords. I think I am going to cancel my subscription as something feels a bit ‘off’",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ogjx3o/account_issues_happened_to_anyone_else/"
    },
    {
        "id": "1ofzwn9",
        "author": "MakeMeToasty",
        "title": "Need help finding a show I watched.",
        "content": "Edit: It was the sinner thank you everyone who replied\n\nI’m almost certain this show was on Netflix at some point but I may be wrong about it. The premise of it was that they would show what was a seemingly random murder at the start of episode 1 and then the rest of the season would be about everything that led up to that point. I swear it was a multiple season thing with different stories and characters each time, or maybe it was like different shows all kind of linked by a premise. The season I remember most vividly, the initial murder happened on the beach of a lake, and the story behind why the woman did it was because her sickly sister wanted to come out and party with her and they ended up taking ecstasy or something and because of her condition she went into cardiac arrest and the guy who was murdered at the start tried to perform cpr and ended up caving her chest in and killing her. I thought it was called Monsters or something but that seems to be a true crime thing. That’s about all I remember though pls help thank you v much everyone",
        "upvotes": 26,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1ofzwn9/need_help_finding_a_show_i_watched/"
    },
    {
        "id": "1oghsry",
        "author": "Smooth-Butterfly9136",
        "title": "Just finished watching Carter wow, what a ride! Non stop action, crazy stunts, and full throttle the whole way (at least for me).Highly entertaining and totally action packed. Any other Korean action films this good?",
        "content": "Ive  recently started watching Korean movies, and wow !I realized it’s not just the K-dramas that are amazing. They also make some really solid action films! Any recommendations for must watch Korean action movies?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oghsry/just_finished_watching_carter_wow_what_a_ride_non/"
    },
    {
        "id": "1ogeyj4",
        "author": "energyim497",
        "title": "Netflix deletes itself",
        "content": "Im not sure if its netflix or something on my phone. For context, I found out netflix had disappeared and later found out it had been deleted. However, when I tried downloaded it again, it just stops when its at the installation part. Any help?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ogeyj4/netflix_deletes_itself/"
    },
    {
        "id": "1ofzf13",
        "author": "Jerswar",
        "title": "I'm being asked to update my payment information. Is this legit?",
        "content": "I got an email saying my membership is on hold, and to update my payment info... by the end of November. Why is it on hold already, but... I  have a month to update?\n\nWell, either way, I can't access Netflix shows without updating.",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ofzf13/im_being_asked_to_update_my_payment_information/"
    },
    {
        "id": "1og7spg",
        "author": "randomperson365247",
        "title": "video player doesnt work it shows black on fullscreen and my desktop on window mode",
        "content": "**technical info: i use opera gx browser alr updated on my mac**  \n  \nit works fine until i start watching a show then it either a: turns black on fullscreen or B: shows my desktop on window mode. the only way i can see what im watching is popping out the video. PLS HELP ME i have disabled every extension for this and when i try on safari it works so idk what to do.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1og7spg/video_player_doesnt_work_it_shows_black_on/"
    },
    {
        "id": "1of2s3h",
        "author": "Longjumping_Land_977",
        "title": "Ajike Owens’ mother shares brutal response to so-called ‘apology’ Susan Lorincz gave her",
        "content": "",
        "upvotes": 557,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1of2s3h/ajike_owens_mother_shares_brutal_response_to/"
    },
    {
        "id": "1ogfcyv",
        "author": "internettblob",
        "title": "Unpopular opinion: Boots does not need a second season",
        "content": "All of their comments on socials are people asking for a second season, and the actors have been vocal about wanting one as well. But as much as I loved all of the characters and wouldn’t be mad at seeing more things explored, I also feel like the show is already a complete story. Netflix has a tendency of milking things at the expense of quality, and I think we need to normalize leaving shows at one season and not dragging out projects just because we can. \n\nAs someone who was in the military, there’s something really special about boot camp and I think that specific setting was very vital to the storyline. You’re thrown into this new world, cross paths with all of these incredible people and DIs that completely change your life, and then you never see them again. Everyone gets separated for job training and then different assignments all over the world and moves on with their careers and lives. But there’s something so special about it while you’re there and it’s a memory you look back on forever. I think the show does an amazing job at capturing that, and it’s a complete story to me. \n\nIt would be really hard to keep the same characters when everybody would be in a different place. They would either need to find a new cast of people for wherever Cope ends up stationed or pan back and forth between all the current characters and their storylines. The GW storyline wouldn’t really work because they have job training and wouldn’t just get deployed straight to the conflict. \n\nSullivan ended up being dishonorably discharged (something he’s not getting around) so although he was a great character it would be hard to make him work in the story when he’s no longer a Marine. A lot of people didn’t like his ending but I think it was a really good depiction of someone living through the DADT era, and how it can eat you alive. He suppressed himself to that extent and it ended up not even being worth it, because the anger from all that suppression caused him to get kicked out anyway. It’s a complete arc, showing how damaging (and pretty ridiculous) these policies were and how they even caused the military to lose out on great soldiers. Perfect, model Marine with a silver star but ultimately gets kicked out just because he’s gay.\n\nI know the memoir this is based on covers many more years of Cope’s career beyond boot camp, so they could make it work if they wanted to. But I feel like it isn’t necessary and don’t really see it working without a significant dip in quality. There’s nothing worse than amazing shows being cheapened by weaker and weaker follow up seasons. Reminds me of Squid Game which had no business having a second and third season, the director himself said it was only because he needed money lol.",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ogfcyv/unpopular_opinion_boots_does_not_need_a_second/"
    },
    {
        "id": "1ofm2aq",
        "author": "Dragonbite2020",
        "title": "Netflix Monster Series Has Competition: Gacy’s Devil in Disguise Is as Good as Dahmer S1",
        "content": "Just started watching *Devil in Disguise: John Wayne Gacy* by accident. I was watching *The Gacy Tapes* on Netflix, then googled it and found out Peacock made a whole series. I was curious if Monster would ever do Gacy, but another platform just created it. It is a good watch if you like Monster series and have seen the Gacy tapes as well. \n\nWow — Netflix really has to step up its game now.\n\nI’d say *Devil in Disguise: John Wayne Gacy* is just as good as *Dahmer: Monster* Season 1. Seasons 2 and 3 of *Monster* are okay, but now Netflix has real competition — everyone’s jumping into the true crime series game.",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ofm2aq/netflix_monster_series_has_competition_gacys/"
    },
    {
        "id": "1og85bx",
        "author": "JunkyYT",
        "title": "YOU (so far)",
        "content": "Season 1 is absolutely fire, it was amazing and seeing it gave me chills and excitement, Elizabeth lail was perfect, only issues that she died 💔\n\nSeason 2 started off boring but became a lot more interesting, but I really hated forty he’s such an annoying character, ending was good, \n\nJust started of season 3 and I don’t feel like finishing it, I feel like it should’ve ended at season 2, it’s a bit too boring now,\n\nWhat do yall think?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1og85bx/you_so_far/"
    },
    {
        "id": "1offdqx",
        "author": "TurbulentFlame",
        "title": "A House of Dynamite felt more like a fizzle than a bang.",
        "content": "I don't want to say too much about it, because I know it just came out for streaming and people are going to be watching it. But I just watched *A House of Dynamite* and I'm both so frustrated and beyond disappointed, at the same time.\n\nThe trailer for this movie had me super hyped. I've been looking forward to watching this movie all week. While the movie underperformed, in my opinion, it wasn't actually terrible; just kind of a let down from what I expected out of the trailer. But still not awful...at least not until that \"ending\". That was just so anticlimactic and bad. I don't know for sure what I was expecting instead, but that wasn't it.\n\nWhat is it with Netflix and these cliffhangers? So many quality films have felt ruined by poor endings: *How It Ends*, *Fractured*, *Leave the World Behind* and now *A House of Dynamite*, just to name a few.\n\nWhy does Netflix keep doing this?",
        "upvotes": 68,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1offdqx/a_house_of_dynamite_felt_more_like_a_fizzle_than/"
    },
    {
        "id": "1og6zai",
        "author": "Warm_Ad_7917",
        "title": "Whats your secret?",
        "content": "How do you people know what you want to watch? Everytime I open netflix I just get slapped with choice. Even my save for later is filling giving me to much to choose from.   \nNeed suggestions for good movies (classics) but also advice on how know what to watch with all these options.  \nThank you!",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1og6zai/whats_your_secret/"
    },
    {
        "id": "1og6j6d",
        "author": "Time_Writing4634",
        "title": "Is streaming still cheaper than cable",
        "content": "For context my family splits who pays for which streaming service but as the password crackdowns continue that becomes less true. If you take into account that streaming has ads now Im not sure it is any different than cable. Sure streaming services have original content but I’m hard pressed to say original content is even worth it anymore. People are afraid to admit Netflix original content is cheeks. Apple original content is the only streaming service I’d stand on business for. HBO is $10/mo with cable vs $20/mo as a standalone.\n\nI’m not switching to cable but at what point does the streaming pig get slaughtered? ",
        "upvotes": 0,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1og6j6d/is_streaming_still_cheaper_than_cable/"
    }
]