[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1icvvrm",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix finally adds \"Download Season\" button for iPhone and iPad users",
        "content": "",
        "upvotes": 56,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1icvvrm/netflix_finally_adds_download_season_button_for/"
    },
    {
        "id": "1icnzzl",
        "author": "StarKCaitlin",
        "title": "Netflix's Music Streaming Platform Is Coming in 2025, According to Industry Experts",
        "content": "",
        "upvotes": 216,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1icnzzl/netflixs_music_streaming_platform_is_coming_in/"
    },
    {
        "id": "1icq7il",
        "author": "S4v1r1enCh0r4k",
        "title": "‘The Night Agent’ Season 2 Soars to No. 1 on Netflix Top 10 with 13.9 Million Views!",
        "content": "",
        "upvotes": 81,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1icq7il/the_night_agent_season_2_soars_to_no_1_on_netflix/"
    },
    {
        "id": "1icqr8m",
        "author": "Whobitmyname",
        "title": "'He Is the One True Geralt': The Witcher's New Netflix Anime Film Director Explains 'Irreplaceable' Casting Choice",
        "content": "",
        "upvotes": 28,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1icqr8m/he_is_the_one_true_geralt_the_witchers_new/"
    },
    {
        "id": "1icn5lb",
        "author": "strawberrylemontart",
        "title": "Binge watched American Primeval",
        "content": "Damn the mormons, lol..\n\nAnyway, I liked the show. I don't really watch old American western shows, but it kept me entertained. I liked that they actually used a Native American cast and language. I liked the conflict plot between the different groups a bit more than the journey portion. But Oh My God, the shots of nature were gorgeous! And of course the acting was great all around. I just liked it, lol. There were some things that were...questionable \\*cough\\*wolfattack\\*cough\\* and some others, but whatever.\n\nI def wanted to slap Sara a few times, like girl! Just listen one time!! Two moons was so cute!! Bridger was awesome! I'd like to have a drink with him. \n\nI know the mormon church is probably pissed about how they are being represented...but IYKYK\n\n",
        "upvotes": 44,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1icn5lb/binge_watched_american_primeval/"
    },
    {
        "id": "1icofec",
        "author": "Association-Feeling",
        "title": "White chicks on Netflix has been edited! The famous p. Diddy white party has been cut out.",
        "content": "That is all. Did this happen before or after all this shiz came out. Is the media gonna get censored or is this something he did himself? \n\nI know it’s not the first movie to be altered on a streaming service but to what end? ",
        "upvotes": 23,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1icofec/white_chicks_on_netflix_has_been_edited_the/"
    },
    {
        "id": "1icxglx",
        "author": "Real_Following6634",
        "title": "Ads are louder???",
        "content": "I noticed yesterday when watching queer eye that the ads (which is a whole other discussion, really Netflix?! Ads on yet another platform we pay for, such bs) were SO much louder than the show itself. I was watching on my phone connected to a speaker and had to turn the whole thing down like 5 notches because the volume increase was crazy. Anyone else notice this?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1icxglx/ads_are_louder/"
    },
    {
        "id": "1icqj79",
        "author": "SparkleDust0",
        "title": "Account getting hacked",
        "content": "Hi,\nAnyone know how my account got hacked? Someone changed the linked email address to their own. What i don’t understand is how someone knew that there was even a Netflix account linked with that email address and how they got in to it? Surely it shouldn’t be that easy!\nHow can i prevent it from happening again?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1icqj79/account_getting_hacked/"
    },
    {
        "id": "1ic6pni",
        "author": "boltsofsaffron",
        "title": "The Bernie Mac Show - a freaking gem",
        "content": "Man....I forgot just how funny this show is. The subtle humor, the flashbacks, the writing over the scenes, the end scenes that add extra context to what happened during the show...its hilarious man. Jordan, Baby Girl and Vanessa have some great comedic timing for being kids, and Bernie...well, he's a legend. I've been watching from the beginning again, and it might be one of my new all time faves. ",
        "upvotes": 98,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ic6pni/the_bernie_mac_show_a_freaking_gem/"
    },
    {
        "id": "1icqm7z",
        "author": "Acceptable-Knee-2217",
        "title": "Question about breaking bad",
        "content": "I only have one question: is it really going to be removed by February? I’ve barely watched it since I’ve only gotten Netflix lately and uh I just want to ask a question so I know whether do I have to speedrun watching it or what? I’m on episode 4 right now. ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1icqm7z/question_about_breaking_bad/"
    },
    {
        "id": "1icqc2a",
        "author": "zamb00",
        "title": "Netflix's Music Streaming Platform Is Coming in 2025, According to Industry Experts",
        "content": "In a bold industry move that could reshape the entertainment landscape, Netflix is reportedly planning to launch its own music streaming platform by 2025. Industry experts and insiders suggest that the streaming giant, already a dominant force in video content, is looking to expand its reach into the music industry, challenging established players like Spotify, Apple Music, and Amazon Music.\n\n**The Vision:** Netflix has long been synonymous with video streaming, but its foray into music streaming signals a strategic shift toward becoming a one-stop entertainment hub. According to reports, the platform will integrate music streaming with its existing video content, offering users a seamless experience that combines movies, TV shows, and music.\n\nThe move aligns with Netflix's broader strategy of diversifying its offerings and retaining subscribers in an increasingly competitive market. By adding music to its portfolio, Netflix aims to create a more immersive ecosystem where users can enjoy curated playlists tied to their favorite shows, exclusive soundtracks, and even live performances by artists featured in Netflix originals.\n\n**The Netflix Plan:** The music streaming industry is already crowded with heavyweights like Spotify, Apple Music, and YouTube Music. However, Netflix's entry could disrupt the market in several ways:\n\n1. **Integration with Video Content**: Netflix's unique advantage lies in its vast library of original content. The platform could leverage its popular shows and movies to create exclusive music experiences, such as curated playlists inspired by hit series like *Stranger Things* or *The Witcher*. This integration could attract fans who want a deeper connection to the content they love.\n2. **Exclusive Partnerships and Original Music**: Industry experts speculate that Netflix may partner with artists to produce exclusive music or host live-streamed concerts. Given Netflix's track record of investing in original content, it could also venture into producing music documentaries, biopics, and reality shows centered around musicians.\n3. **Competitive Pricing and Bundling**: To lure users away from established platforms, Netflix might offer competitive pricing or bundle its music streaming service with its existing video subscription. This approach could appeal to cost-conscious consumers looking for an all-in-one entertainment solution.\n4. **Personalization and AI-Driven Recommendations**: Netflix's expertise in data analytics and personalized recommendations could give it an edge in music streaming. By leveraging user data, the platform could offer highly tailored playlists and music suggestions, enhancing the overall user experience.\n\nWhile Netflix's entry into the music streaming market is exciting, it won't be without challenges:\n\n* **Licensing and Royalties**: Securing licensing deals with record labels and artists will be a complex and costly process. Netflix will need to navigate the intricacies of music rights to build a comprehensive library.\n* **Competition**: Established players like Spotify and Apple Music have a stronghold on the market, with loyal user bases and extensive music catalogs. Netflix will need to offer something truly unique to carve out its niche.\n* **User Adoption**: Convincing users to switch from their preferred music streaming platforms won't be easy. Netflix will need to demonstrate clear value to attract and retain subscribers.\n\nThe news of Netflix's music streaming platform has sparked mixed reactions within the industry. Some experts believe that Netflix's brand recognition and global reach give it a strong foundation to succeed. Others caution that the company's lack of experience in the music industry could pose significant hurdles.\n\nArtists and record labels, meanwhile, are cautiously optimistic. Many see Netflix's entry as an opportunity to reach new audiences and explore innovative ways to monetize their work. However, concerns remain about how Netflix will handle artist compensation and copyright issues.\n\nFor consumers, Netflix's music streaming platform could mean more choices and a more integrated entertainment experience. Imagine watching a Netflix original series and instantly accessing its soundtrack, or discovering new artists through exclusive content. If executed well, the platform could redefine how we consume music and video.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1icqc2a/netflixs_music_streaming_platform_is_coming_in/"
    },
    {
        "id": "1icm1az",
        "author": "MindOfDay",
        "title": "Kill me but I enjoyed Night Agent S2",
        "content": "I finished the season just a bit ago and im not gonna lie I kinda liked it. Although I do think S1 was way better, I don't think this season was bad. I checked what other people were saying after I finished so my opinion couldn't be swayed by others and thank god I didn't. Some points I didn't like were Farhad, Rose (she was off icel), and Tomas specifically what annoyed me was the fact that no one could lie to save their life. BUT I loved the action I think it was 10x better than S1 kinda felt repetitive with the mole or whatever but I still enjoyed it. I'm not no film critic or wtv i'm actually employed but I'm hoping for a S3 with the last scene with Peter and Catherine seemed promising.",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1icm1az/kill_me_but_i_enjoyed_night_agent_s2/"
    },
    {
        "id": "1ict5qv",
        "author": "beverlyhillsbrenda",
        "title": "Question about basic Netflix",
        "content": "Since the price of Netflix is going up again I am thinking of switching to the basic subscription. Are there any shows that I won’t be able to watch, or is the only downfall the ads?  Thanks in advance for any help. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ict5qv/question_about_basic_netflix/"
    },
    {
        "id": "1ict2bp",
        "author": "Cute-Tea-1287",
        "title": "Download picture quality issues？",
        "content": "My device is iPad Pro2024. The package is a high -end package. When watching online, there will be Dolby Vision, but there is no when downloading to the device offline. What is the reason? \"In the download settings, the download is enabled and downloaded high -quality quality\"",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ict2bp/download_picture_quality_issues/"
    },
    {
        "id": "1icq080",
        "author": "Suitable-Macaron-784",
        "title": "The Midnight Cantina",
        "content": "Hello everyone!\nA couple of years ago I saw the series named in the title. There were two seasons... But I see on the internet that they have released, in principle, another season (on other sites I have seen that there is a fourth season). Netflix is ​​not going to continue broadcasting this series?\n\nThank you very much and I wish you a good day!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1icq080/the_midnight_cantina/"
    },
    {
        "id": "1icm61d",
        "author": "jadesxs",
        "title": "Is my subscription whack, is Netflix going crazy or am I going crazy?",
        "content": "Just how the title says, am I going crazy or is Netflix going crazy? I live in the Philippines, and I just want to go about my day when I noticed that I couldn't watch some of the titles that I was currently watching. I tried searching for some of the titles and surely enough, they weren't there. I tried searching information on the internet if something happened or were they removed by Netflix but they weren't. For context, I was rewatching SPY X FAMILY and currently watching SAKAMOTO DAYS.\n\nI have my account logged in on both our TV, Laptop, and my phone. I noticed that I couldn't search up the titles on the TV. I tried searching in on the web then clicking the link to redirect me to Netflix, it worked but I couldn't play the series. The series shows up on my phone too, but there wasn't any play button as well. I don't know if I'm going crazy or what. **(EDIT: Just a few days ago, even yesterday, I was watching SPY X FAMILY just fine.)**\n\nI don't know if this information helps but I was also on time with payment for my subscription. I am currently on the Standard plan, \"Great video quality in Full HD (1080p). Watch ad-free on any phone, tablet, computer or TV. Download on 2 devices.\"\n\nAnyone knows what happened here? Thanks in advance for any answers!",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1icm61d/is_my_subscription_whack_is_netflix_going_crazy/"
    },
    {
        "id": "1ic4h53",
        "author": "StarKCaitlin",
        "title": "Jeremy Allen White to Star in 'Enigma Variations' Series at Netflix",
        "content": "",
        "upvotes": 17,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ic4h53/jeremy_allen_white_to_star_in_enigma_variations/"
    },
    {
        "id": "1icr47u",
        "author": "Darktommy2",
        "title": "lost my old base subscription without advertising from nowhere",
        "content": "good morning\n\n\n\nmy mother and I still had the basic subscription to netflix, the one for 9.99 without ads, and we had no intention to let it expire (although we don't watch netflix often), yesterday out of nowhere we got the email from netflix saying that we were chosen to switch to the premium subscription, which we didn't do, the only thing we did was to connect a new smart tv to the netflix account (there are 2 pc's and the ps5 connected to netflix, but not conteporably) \n\nis what happened normal? i mean, Netflix decided to take away everyone's old subscription without warning, because, if i remember correctly, it was possible to keep it as long as it didn't stop, although the email said that WE (me and my mother) had decided to switch to premium\n\nis there any chance, that you know of, to go back to the old basic subscription, because now we had to put on the standard subscription with advertising.... \n\nah right, we live in Italy, I don't know if it matters but I also put this information",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1icr47u/lost_my_old_base_subscription_without_advertising/"
    },
    {
        "id": "1icf854",
        "author": "HospitalHairy5133",
        "title": "cult-like documentaries &amp; series?",
        "content": "I love anything cult-related or borderline cult. I've seen and enjoyed:\n\n\\-Keep Sweet Pray and Obey\n\n\\-Wild Wild Country\n\n\\-Filthy Rich (both the Epstein and Ghislaine episodes)\n\n\\-Jimmy Saville\n\n\\-Bikram\n\n\\-Zodiac \n\n\\-The Program\n\n\\-Escaping Twin Flames\n\nAnything on or off Netflix that's similar - send it my way!",
        "upvotes": 5,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1icf854/cultlike_documentaries_series/"
    },
    {
        "id": "1icc93t",
        "author": "orange-black-tea",
        "title": "French Adaption of the Show Alpha Male",
        "content": "I watched the French adaption of the Spanish show “Alpha Male” called “Shafted” last night. My God, it was so bad. It reminded me of another French show “Hookup Plan. \n\nThen I googled it, turned out the producer of “Hookup Plan” Noemie Saglio is the director of the French version of “Alpha Male”. \n\nI love the original Spanish version. Netflix is adapting into French, Italian and Dutch versions. Hope that the Italian and the Dutch versions will have the same high quality as the original Spanish version.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1icc93t/french_adaption_of_the_show_alpha_male/"
    },
    {
        "id": "1iclcjk",
        "author": "Outrageous_Cheek7940",
        "title": "Thrillers?",
        "content": "Hi!\n\nI loveeeeeee Netflix’s sci-fi/horror/thriller/mystery shows it’s created but I feel like I’ve watched all the good ones including:\n\n1899\nBoth “the haunting of”s\nDark \nMidnight mass \nRatched \n3 body problem \nThe Rain \nThe oa \nManiac\n\nThe terror \nTrue detective \n\n\nIf you’re into similar genres and know of any more I’d love to hear and I have nearly every other streaming service as well. Interested in movies too\n\nThank you!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iclcjk/thrillers/"
    },
    {
        "id": "1ickc5h",
        "author": "Winter_Pollution_692",
        "title": "Can’t remember the Name of series",
        "content": "Hi. Can somebody help me out please. I forgot the title of the series. It’s about a woman who murdered some guy during a picnic at the beach? She just suddenly killed a random guy at the start of the series. Then she was put in the prison and she kept on seeing a wallpaper in her thoughts, which brought pieces together that lead the detective to prove her innocence. Turned out she was drugged by someone which led her to murder the guy and forget things about her past. Idk something like that. I think it was a Spanish or French series. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ickc5h/cant_remember_the_name_of_series/"
    },
    {
        "id": "1ictz62",
        "author": "TikiZach",
        "title": "The OA after being cancelled has now reached over 100,000 signs on the petition",
        "content": "After being cancelled after 2 seasons the fans have rallied and united to try to bring back this unique show; with them reaching this number how many more have to sign before netflix hears them?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ictz62/the_oa_after_being_cancelled_has_now_reached_over/"
    },
    {
        "id": "1icrguc",
        "author": "Upper-Display-9089",
        "title": "Suggestions on what should I watch next. Left photo (loved), Right photo (disliked).",
        "content": "P.S. - I like Netflix shows most of the time. Squid game, Black mirror any many I could not include in one screenshot.\n\nThis post of mine might sound similar to the post i made in another subreddit related to video games suggestions.\n\nI used to watch a lot of fiction since my childhood, now I hardly watch 1 tv show in a year. I want to watch something phenomenal. Last year I watched Attack on Titan. I attached the screenshots of my taste for reference. I am still learning why I like what I like. This is my first post in this subreddit so be nice please. I tried posting this elsewhere but most subreddits don’t allow attaching images idk why.",
        "upvotes": 0,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1icrguc/suggestions_on_what_should_i_watch_next_left/"
    },
    {
        "id": "1icg5au",
        "author": "Heavy-Rough-3790",
        "title": "Horrible audio clipping",
        "content": "Has anyone else noticed horrible audio clipping? I have been watching the walking dead season 11 and the loud scenes sound like someone screaming into the mic. It’s so bad. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1icg5au/horrible_audio_clipping/"
    },
    {
        "id": "1icpbw9",
        "author": "North_Drummer2034",
        "title": "Thoughts on “Man on the Inside” ???",
        "content": "I’ve been watching it and I really wanted to like it but I just can’t get into it. I know it’s supposed to be funny but it’s just really cringe and corny to me. I’m already halfway through the series so I feel like I might as well finish it now but I keep getting distracted during the episodes and having to start over 🤣🤣 I might just skip to the last episode ",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1icpbw9/thoughts_on_man_on_the_inside/"
    },
    {
        "id": "1ib9728",
        "author": "Whobitmyname",
        "title": "Carey Mulligan ‘Just Started’ Filming ‘Beef’ Season 2 and Says ‘Almost Everything’ Is Different",
        "content": "",
        "upvotes": 520,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1ib9728/carey_mulligan_just_started_filming_beef_season_2/"
    },
    {
        "id": "1icfglg",
        "author": "DashiellHammett",
        "title": "Night Agent S2 ~ Let's List All the Unbelievable, Ridiculous, or Flat-Out Stupid Plot Points",
        "content": "So many to choose from.  I'll go first, sticking to Episode 1 (because I bailed by the end of Episode 2 because I couldn't take it anymore).  But please post examples from the entire second season. \n\nRose is a genius computer software engineer, and she goes into a potentially make-or-break meeting with an investor with $50 million dollars on the line for an amazing computer program she helped to create, and....She takes her phone into the meeting. It is not on silent. She is apparently unable to figure out how to  make it be silent as it continually interrupts the meeting, forcing her to finally leave the meeting while her boss explains that she is apparently having an \"off day\" (or something). ",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1icfglg/night_agent_s2_lets_list_all_the_unbelievable/"
    },
    {
        "id": "1ico9gh",
        "author": "waitingtogrowup",
        "title": "Netflix, I don't want to see games",
        "content": "Netflix, why is there no option to turn off games?\n\nWe're adults, there's no kids in the house, yet there's a huge game trailer/video on the main page and have two upper rows of games. We have never played games, we do not intend to play games (at least not on this platform), we even deleted the \"kids\" profile, and there's still no option to get rid of this annoyance. \n\n  \nNetflix, please give us the option to disable the games. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ico9gh/netflix_i_dont_want_to_see_games/"
    },
    {
        "id": "1icde8o",
        "author": "Old-Firefighter224",
        "title": "Need show recommendations",
        "content": "I’ve watched all the newer shows and documentary’s on Netflix. Need some good recommendations of shorter shows. I can’t commit to something like greys anatomy lol ",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1icde8o/need_show_recommendations/"
    }
]