[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h7q0zc",
        "author": "Playful_Disaster3227",
        "title": "netflix account scams",
        "content": "Keep an eye on your netflix account.  I just recently noticed a netflix monthly charge had gone from basic service at approx $8 to $43.\n\nWent in account and discovered scammers had upgraded my account to premium and added two members at $8 each with bogus email addresses.  This had actually been happening for the last 5 months and cuz payments are auto deduct I really didn't notice until recently.\n\nI contacted Netflix and was told they could only refund the last month of overcharges.  My response to that was to cancel the account.",
        "upvotes": 27,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1h7q0zc/netflix_account_scams/"
    },
    {
        "id": "1h7w7em",
        "author": "drmfranz",
        "title": "Netflix Hidden Gems: What’s a Lesser-Known Show or Movie You Loved?",
        "content": "I feel like I’ve scrolled through the same trending titles a million times, but I know Netflix has some hidden gems that don’t get enough attention. I’m talking about those lesser-known shows or movies that blew you away but no one seems to talk about.\n\nFor me, it was *The Endless*—a mind-bending sci-fi film I stumbled upon late at night. It’s low-budget but insanely creative.\n\nWhat’s your favorite under-the-radar pick on Netflix? I’d love some recommendations to shake up my watchlist!",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1h7w7em/netflix_hidden_gems_whats_a_lesserknown_show_or/"
    },
    {
        "id": "1h7epxx",
        "author": "Lost_Distribution546",
        "title": "EXCLUSIVE: Official Episode Runtimes Revealed for Squid Game Season 2",
        "content": "",
        "upvotes": 35,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1h7epxx/exclusive_official_episode_runtimes_revealed_for/"
    },
    {
        "id": "1h794tn",
        "author": "hospitalsinwinter",
        "title": "Spielberg and critics are fans of Mo, and season 2 is finally coming in January",
        "content": "",
        "upvotes": 47,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h794tn/spielberg_and_critics_are_fans_of_mo_and_season_2/"
    },
    {
        "id": "1h7ws0v",
        "author": "DannyAgama",
        "title": "Am I crazy or has Woman of the Hour suddenly been removed?",
        "content": "I recall watching part of the movie and adding it to my list. I see no mention of it being removed anywhere and now it's not on my list. It's been taken off search results but I was able to find the title's page [here](https://www.netflix.com/title/81728818) \\- it allowws me to set a reminder for when the title is available again. Anyone know why it's been taken down so soon?\n\nI am in the U.S. by the way.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h7ws0v/am_i_crazy_or_has_woman_of_the_hour_suddenly_been/"
    },
    {
        "id": "1h729mg",
        "author": "Longjumping_Pen_2405",
        "title": "Looking for netflix series that are COMPLETED already with multiple seasons (not limited series). Im sick to death of them cancelling every second good fkn show",
        "content": "Just finished KAOS. Thought it was unique, creative, and incredibly well done. Its obviously been cancelled. As was archive 81, lockwood &amp; co, Mindhunter, CAOS (sabrina), midnight club, the society, 1899..... all this suspenseful and engaging shows that I've LOVED. \n\nSuggestions for series with at least 2 seasons and that have a proper conclusion/ending?",
        "upvotes": 129,
        "comments": 200,
        "media": null,
        "permalink": "/r/netflix/comments/1h729mg/looking_for_netflix_series_that_are_completed/"
    },
    {
        "id": "1h7sl4c",
        "author": "Crafty_DIY",
        "title": "Help me fix crummy streaming quality issue with Apple TV",
        "content": "I'm watching Griselda on Netflix on my Apple TV and the quality is grainy and terrible.\n\nMy internet connection may not be the best. There's not much to be done there.\n\nHowever, I'd rather just like wait for the show to load and watch it in high quality than watch it now so grainy I can't hardly make out facial expressions.\n\nHow would I force Netflix or my Apple TV to buffer, wait, and let me watch it full quality?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h7sl4c/help_me_fix_crummy_streaming_quality_issue_with/"
    },
    {
        "id": "1h7v7bp",
        "author": "banana_habana",
        "title": "Netflix household account?",
        "content": "Bit of a rant but what’s the point of paying for 4 screens if I can’t use 4 screens? On a shared account with my friend that we pay half on. \nOne for me and for my GF and one for my friend and his partner. Tried to watch a show tonight and got stuck with the “Your device isn’t part of the Netflix household for this account”. Never had this issue till now. Tried logging off and on again and same issue. What’s the point of having a mobile app as well if you can’t watch on the go? Does this mean I have to pay for a new account?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1h7v7bp/netflix_household_account/"
    },
    {
        "id": "1h7r5vx",
        "author": "Loud_Opinion230",
        "title": "Netflix Black Screen",
        "content": "Hi, I've been experiencing problems when trying to watch anything on Netflix. It's just a black screen with the video audio. I use a MacBook and watch on Google Chrome. I've tried using Safari but it's the same thing. help please!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h7r5vx/netflix_black_screen/"
    },
    {
        "id": "1h7sj6k",
        "author": "anti_procrastinator",
        "title": "Tomorrow and I",
        "content": "This might be the one of the most fucked shows ever.\n\nSince Thailand as a country has fed the foundation of the world for decades, it makes sense that artists there get to explore some of the darker shades of grey more unabashedly.\n\nIt’s like LDR on steroids. Highly recommend, some parts might be really disturbing ngl.\n\nCurious to hear what others think.\n\nEDIT: not LDR on steroids, maybe LDR if it was a bit more tangible.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h7sj6k/tomorrow_and_i/"
    },
    {
        "id": "1h7guoe",
        "author": "LetterheadFun3697",
        "title": "American Primeval | Official Trailer | Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h7guoe/american_primeval_official_trailer_netflix/"
    },
    {
        "id": "1h77fvm",
        "author": "Whobitmyname",
        "title": "'One Piece' Season 2 Aiming for Christmas 2025 Release According to Actor",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h77fvm/one_piece_season_2_aiming_for_christmas_2025/"
    },
    {
        "id": "1h7o1yy",
        "author": "Tydli",
        "title": "4K playback not working",
        "content": "Hello, i cant get my netflix to play 4K.\n\n1) Dell G3223Q 4K HDR + Displayport 1.4, HDCP 2.2 support (both cable and monitor)  \n2) i5-14600KF + RTX 3080   \n3) Win 11 + HEVC support installed  \n4) obviously Netflix premium plan  \n5) 2700 mbps symetric internet line (effectively limited to 2500mbps by motherboard, 500mbps symetric DEDICATED TO ME,  rest shared) -&gt;&gt; no doubt about speed  \n6) tried using edge or netflix app, still getting 1080p   \n7) in-app settings are set to highest possible  \n8) HDR enabled/disabled tried both  \n9) refreshrate 144/120/60 Hz tried   \n10) secondary 1080p screen disconnected\n\nIs there anything else i can do? Still cant figure out why am i not playing 4K....",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h7o1yy/4k_playback_not_working/"
    },
    {
        "id": "1h7b6qm",
        "author": "indiewire",
        "title": "The 27 Scariest Movies on Netflix: Pearl, Psycho, Jaws &amp; More",
        "content": "",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h7b6qm/the_27_scariest_movies_on_netflix_pearl_psycho/"
    },
    {
        "id": "1h7ngmf",
        "author": "kheifert1",
        "title": "Picture quality from episode to next episode. ",
        "content": "I’m sure this has been brought up before but there is still a problem with going from one episode to the next and then the picture going blurry. Once you back out or restart the app, the picture is once again clear. I’m watching on the newest ATV with 500mb + wired internet. \n    Does anyone know why this happens and is there a fix ? Is it Netflix or Apple ? This has been like this for quite awhile now. Real frustrating. Thanks. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h7ngmf/picture_quality_from_episode_to_next_episode/"
    },
    {
        "id": "1h75rok",
        "author": "Fit_Argument3087",
        "title": "What's Your Perception of English Dubbing?",
        "content": "Hi everyone! I’m currently working on my master’s thesis and I’m exploring English dubbing - its quality, cultural impact, how it’s perceived by audiences. I’d love to hear your thoughts! \n\n\\- What do you think of English dubbing in general? (e.g., films, TV shows, anime, etc.)\n\n\\- Are there any specific examples (good or bad) that stand out to you?\n\n\\- Have you watched \"Dark\" or \" Money Heist \" in English? Did you like it?\n\n\\- Do you think it is useful to watch English dubbed movies to learn English (if you are not a native English speaker)?\n\nPlease also let me know, if possible, where you're from (or, at least, if you are a native English speaker or not). Your input would be invaluable to my research, and I’m truly grateful for any insights you can share. Feel free to be as detailed or brief as you’d like!\n\nThank you so much for helping out, and I’m looking forward to reading your opinions.",
        "upvotes": 9,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1h75rok/whats_your_perception_of_english_dubbing/"
    },
    {
        "id": "1h73dzr",
        "author": "upikaroh",
        "title": "Netflix's horror code is 8710 and 8711.",
        "content": "Hie fellow redditors. \n\nJust type 8710 (for Dark movies) and 8711 (for the horror movies) in the search bar and it will bring up all things horror (and one or two weirdly not) .\n\nThese are all the horror themed films and shows without an algorithm applied.\n\nEnjoy and happy spooky season",
        "upvotes": 14,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h73dzr/netflixs_horror_code_is_8710_and_8711/"
    },
    {
        "id": "1h7a1nx",
        "author": "Tomhyde098",
        "title": "Yearly return for one month!",
        "content": "It's that time of year, I'm subscribing to Netflix for a month so I'm wondering what are the best things that I missed out on! I also skipped last year so technically what are some of the best shows and movies from the last couple years? Thanks!",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h7a1nx/yearly_return_for_one_month/"
    },
    {
        "id": "1h7kxz3",
        "author": "cinemaritz",
        "title": "Is the old windows app still avaible? ",
        "content": "Is the old windows netflix app still available? At the end of August it didn't work for me at all, even with the updates disabled. So are we now stuck with the web app for windows? I preferred the old one not only for the downloads but also because it had a better stereo mix imho and it was ideal for pc and headphones. \n\n\nI know there's a procedure to install the old one, I did that but it worked only till late August. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h7kxz3/is_the_old_windows_app_still_avaible/"
    },
    {
        "id": "1h6h49s",
        "author": "misana123",
        "title": "‘Wednesday’ Season 2 Wraps Production",
        "content": "",
        "upvotes": 138,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1h6h49s/wednesday_season_2_wraps_production/"
    },
    {
        "id": "1h7i4ic",
        "author": "Deep-Jackfruit-5101",
        "title": "La Brea",
        "content": "Has a gripping story and some really good visual effects that pull you in. The sets and backgrounds are beautifully done, adding to the immersive experience. That said, the casting feels like it’s missing something—a more familiar face as the lead could have made a big difference. The acting is decent, but it doesn’t always hit the emotional highs the story calls for. The dialogue delivery also feels a bit off, almost like it was dubbed from another language, which can be distracting at times. Still, the show’s intriguing concept and good visuals make it worth a watch, especially if you love adventure and mystery.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h7i4ic/la_brea/"
    },
    {
        "id": "1h79zh5",
        "author": "Pink_Raven88",
        "title": "Teenage bounty hunters",
        "content": "Stumbled across this one recently. It’s so cute! Only one season because I think Covid got in the way, but I recommend it. I would’ve lived to get another season or 2 out of it. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h79zh5/teenage_bounty_hunters/"
    },
    {
        "id": "1h79iau",
        "author": "Proper_Ad_5547",
        "title": "Looking for a Netflix show I watched a few years ago ",
        "content": "Basically where people would pitch to a crowd and people would press a light if they wanted to buy it. It was in the Uk and potentially a collab with channel 4- driving me crazy that I can’t remember the name!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h79iau/looking_for_a_netflix_show_i_watched_a_few_years/"
    },
    {
        "id": "1h74m3w",
        "author": "Few-Revolution8907",
        "title": "Tv show reccomendations ",
        "content": "I’m on the hunt for a new TV show to completely obsess over! I absolutely LOVE romantic TV shows, so if it’s got a swoon-worthy love story, I’m in. Whether it’s light and feel-good, dramatic and steamy, or filled with heartache and longing, I’m open to anything as long as romance is at the center of it. Bonus points if it has great chemistry between the leads, compelling storylines, or unforgettable moments that will have me rewatching scenes over and over again.\n\nHelp me expand my watchlist—I want something I can binge and completely fall in love with. What’s the most romantic TV show you’ve ever seen? Drop your recommendations below!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h74m3w/tv_show_reccomendations/"
    },
    {
        "id": "1h76ye0",
        "author": "credoinvisibile",
        "title": "Cheers, darlings! Black Doves is now playing on Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h76ye0/cheers_darlings_black_doves_is_now_playing_on/"
    },
    {
        "id": "1h76xzy",
        "author": "JCEurovision",
        "title": "Interactive specials regarding trivia are gone, forever.",
        "content": "I enjoy playing \"Trivia Quest\" and \"Triviaverse\" because there would be excellent interactive specials for game show aficionados and those who want to do more quizzes. Sadly, that has been long gone, and I wish all those interactive specials would return on Netflix. But now, only four interactives remain from the Netflix library, and I can't watch any of them.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h76xzy/interactive_specials_regarding_trivia_are_gone/"
    },
    {
        "id": "1h70026",
        "author": "Ashyboi13",
        "title": "Weird color saturation",
        "content": "So I was watching Stranger Things tonight and in the middle of an episode the color saturation went wild. Scenes will switch being looking completely normal to being colored green to colored red, to the point it’s hard to see in darkly lit scenes. On the Netflix menu everything is colored normally. In fact, my entire TV looks totally normal, and I went through my color settings and everything was fine. Has anyone else had this problem ever? Any possible fixes?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h70026/weird_color_saturation/"
    },
    {
        "id": "1h70bkr",
        "author": "Famous-Back8353",
        "title": "In the series “baby” what happens at the club? ",
        "content": "I have so many questions from the pilot. When chiara and ludo go to club. There are two guys who say “those two will make me a lot of money” but in the second episode it doesn’t mention what happens after that. It time jumps to the next day instead. Did those guys drug them or did they get away? Also I’m so upset for chiara ignoring ludo in front of her friends.. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h70bkr/in_the_series_baby_what_happens_at_the_club/"
    },
    {
        "id": "1h7kyu7",
        "author": "Primary-Artichoke140",
        "title": "WTF Netflix?",
        "content": "I can watch „vergiss mein nicht“ (eternal Sunshine of a spotless mind“ but only if i go over the google link. If i try to search it or put it in my watchlist, it doesnt appear? Am i missing something?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h7kyu7/wtf_netflix/"
    },
    {
        "id": "1h7mw15",
        "author": "AccurateInflation167",
        "title": "'Squid Game' criticised for not casting transgender actor in trans role",
        "content": "",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1h7mw15/squid_game_criticised_for_not_casting_transgender/"
    }
]