[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 38,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q8z5px",
        "author": "Deadpool-fan-466",
        "title": "What was the point of casting Linda Hamilton in Stranger things S05?",
        "content": "When I first found out about it, I thought it's gonna be interesting. Either she's gonna be an important character, or Netflix wants star power (as usual) to hype up the final season.\n\nThen it became as bland as it could be: She's the new \"Papa\", trying to restore \"the program\". She even does exactly what was shown in the trailer, shooting at Eleven &amp; co.\n\nI know that being Sarah Connor in those 2 terminator movies is the only career highlight of her, but being in Stranger things doesn't change much either (for her &amp; the show)",
        "upvotes": 950,
        "comments": 172,
        "media": null,
        "permalink": "/r/netflix/comments/1q8z5px/what_was_the_point_of_casting_linda_hamilton_in/"
    },
    {
        "id": "1q98hpp",
        "author": "OkCartographer4028",
        "title": "Just finished watching “Homeland”, now I don’t know what do with myself",
        "content": "I just finished watching Homeland and it’s honestly the best show I’ve seen in years. I looked forward to returning home everyday to continue watching it, I even stayed home at weekends to chill and enjoy the show. Captivating 8 seasons. Now it’s ended, I’m so sad. I can’t stop thinking about it, now I don’t know what to watch. \n\nCan someone recommend similar shows? Something as captivating ",
        "upvotes": 107,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1q98hpp/just_finished_watching_homeland_now_i_dont_know/"
    },
    {
        "id": "1q935t3",
        "author": "intelerks",
        "title": "Netflix pushes 'Wednesday' to 2027 as 'Bridgerton', 'One Piece', and 'The Witcher' line up for 2026",
        "content": "",
        "upvotes": 162,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1q935t3/netflix_pushes_wednesday_to_2027_as_bridgerton/"
    },
    {
        "id": "1q9furg",
        "author": "nvmatt",
        "title": "His &amp; Hers .... wow bad.",
        "content": "Good actors meet incredibly poor writing / directing. Fine for a no-brainer binge but if you're looking for anything more than that, look elsewhere. The \"twist\" isn't much of a twist ... we guessed it mid-run. I guess the best thing about it was the many laughs my wife and I had while watching it. ",
        "upvotes": 9,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1q9furg/his_hers_wow_bad/"
    },
    {
        "id": "1q97n3a",
        "author": "Strange_Light5219",
        "title": "Why Netflix?",
        "content": "Just finished watching Lockwood &amp; co and found out the show's not being renewed for season 2. \n\nI can definitely say it's one of the hidden gems and a nice thriller. It should have gotten more attention than it received as it is also has \"mostly liked\" tag.",
        "upvotes": 19,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1q97n3a/why_netflix/"
    },
    {
        "id": "1q8c7eq",
        "author": "GiveMeSomeSunshine3",
        "title": "‘Black Mirror’ Renewed For Season 8 At Netflix",
        "content": "",
        "upvotes": 1249,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1q8c7eq/black_mirror_renewed_for_season_8_at_netflix/"
    },
    {
        "id": "1q9m25p",
        "author": "Spiritual-Honey-4587",
        "title": "His and Hers episode 4 ending",
        "content": "I know I’m behind, but I just finished episode 4, and the ending really bothered me. They just had the most cathartic moment- opening up about the mutual trauma around losing Charlotte. The sex scene in the back of the van feels unnatural. Maybe I’m from a different world, but how do you move from that powerful emotional moment to having sex in such a structured parallel to what happened with Rachel— another traumatic event they both shared. Am I the only one who finds that unrealistic?? ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q9m25p/his_and_hers_episode_4_ending/"
    },
    {
        "id": "1q8yyqs",
        "author": "Unable-Youth",
        "title": "His &amp; Hers Had Potential",
        "content": "Spoiler Alert below.\n\nThis show had a lot of potential but was problematic and had loose ends:\n\n1. What’s the story with Anna’s tooth at the beginning and end? Does not serve a purpose.\n2. Why did Zoe hate Anna, if Anna was the rape victim? Zoe gives Anna the finger in one episode, and then she tries to warn Jack towards the end that “Anna isn’t who you think she is…”\n3. No explanation of why they were all friends then stopped being friends when they all seemed to watch Anna’s rape\n4. Why did Zoe stop being friends with Helen and Rachel if she was complicit in the rape?\n5. Why was Catherine trying to get back at Anna when it was Anna that was raped? What was with all the “murder” supplies she got Richard to buy\n6. Jack said Alice showed signs of dementia during the year Anna left. Was she premeditating that far in advance?\n\nFinally, how am I supposed to believe an old woman is capable of pulling off gruesome murders that require lots of physical strength as noted in one episode… I mean 40 stab wounds? Also, how did she get the friendship bracelets? Did Anna have them in her box I.e do we assume they all gave them back to her?\n\nWhat was the side story about the blackmail In Rachel’s phone when it came to their weird shit with Duffie?\n\nLazy ending and the show had more potential.",
        "upvotes": 24,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1q8yyqs/his_hers_had_potential/"
    },
    {
        "id": "1q9mjlu",
        "author": "Famous-Donut-2394",
        "title": "What was the WORST Ending to A Netflix Original Series??",
        "content": "Just throwing it out there, since I have seen people complain about many Netflix shows ending. Cancelled series do NOT count (ex. Lockwood &amp; Co.) Neither do unfinished series (Wednesday, OBX etc.)",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1q9mjlu/what_was_the_worst_ending_to_a_netflix_original/"
    },
    {
        "id": "1q9mi61",
        "author": "BigOrangeVol98",
        "title": "Why can’t I resume WWE Raw where I left off?",
        "content": "I never start watching raw when it begins because I like to fast forward through the boring stuff. Occasionally I will catch up to the live broadcast but not always. And I have to get up really early for work the next day so I’m never able to watch the entire episode the night it airs. But it would be really nice when I go back the next day to finish the episode, that I could resume where I left of the night before. It never gives me the option to resume. So I’m stuck fast forwarding to where I left off the night before. Is there anyway to resume instead?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q9mi61/why_cant_i_resume_wwe_raw_where_i_left_off/"
    },
    {
        "id": "1q9lzaf",
        "author": "ybutton",
        "title": "I need help finding a coming of age/teen Nordic or Central European show I watched sometime in the last year",
        "content": "The show was about a ND teenage girl and her childhood friend who go on a vacation together with their parents, and is centered around the girl trying/wanting to make a short film for something college related, with her friend’s help. There is some conflict around her wanting to have sex with him and him not wanting to (i think because he’s gay) and she/they eventually end up finding another guy to also star in the film/play the romantic part. I hope that’s enough info. thanks",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9lzaf/i_need_help_finding_a_coming_of_ageteen_nordic_or/"
    },
    {
        "id": "1q9cq0d",
        "author": "AggravatingCamp9315",
        "title": "Good night &amp; good luck",
        "content": "It took me a moment to get into this but it ended up being a really powerful show. I particularly liked the tie from mccarthy to current events ( which has not been lost on many of us for some time now.) Although the lighting was a bit dark for me at times, I really ended up with goosebumps at the end. History lesson and current event in one. \n\nI wish we had more filmed theatre on Netflix. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9cq0d/good_night_good_luck/"
    },
    {
        "id": "1q91d49",
        "author": "abitworndown",
        "title": "Netflix double subtitles",
        "content": "This is driving me crazy. I have toggled subtitles off and on but nothing seems to fix the issue. If there are english subtitles built into a show or movie, even with subtitles off Netflix adds their own subtitles and puts them on top of the built in subtitles. I wanted to add a picture of the issue but I dont think this subreddit allows it. \n\nI can see that the subtitle option is obviously turned off since the subtitles only happen when a language other than English is spoken. Its impossible to read what's on the screen which can affect the plot of what I'm watching. I've tried to find solutions but haven't had any luck. \n\nhttps://imgur.com/a/4W8QtEo",
        "upvotes": 14,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q91d49/netflix_double_subtitles/"
    },
    {
        "id": "1q9c81c",
        "author": "NatrenSR1",
        "title": "IOS app not working?",
        "content": "For a while now I’ve had an issue with the iPhone app where it always gives me a network error as soon as I open it. I figured that it was due to my phone needing to be updated, but even after updating (and holy hell the new IOS is ugly) it persists. I’ve tried it over WiFi and cellular and still it doesn’t work. Is this a known issue, and how do I fix it?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q9c81c/ios_app_not_working/"
    },
    {
        "id": "1q96x1s",
        "author": "Low-Collection3307",
        "title": "Looking for thriller show :)",
        "content": "Hey !!\n\nI would like some recommendation on shows to watch.\n\nRecently I loved :\n\nThe Beast In Me\nApple Cider Vinegar\nAdolescence\nInventing Anna\nDon’t fuck with cats (doc) \n\nThank you 🙏 ",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1q96x1s/looking_for_thriller_show/"
    },
    {
        "id": "1q8hpk0",
        "author": "FunRealistic7609",
        "title": "Scrolling Netflix for 30 mins. Still haven't picked anything",
        "content": "Please suggest a really good show or movie that’s genuinely worth watching. Any genre works drama, romance, thriller, comedy, or even something underrated that surprised you. I’m in the mood to binge or just relax and enjoy a good story. Drop your best Netflix recommendations and save me from endless scrolling.",
        "upvotes": 201,
        "comments": 277,
        "media": null,
        "permalink": "/r/netflix/comments/1q8hpk0/scrolling_netflix_for_30_mins_still_havent_picked/"
    },
    {
        "id": "1q8svwg",
        "author": "FluidModeNetwork",
        "title": "Isn't netflix wrong about stranger things?",
        "content": "if dustin, will, lucas, max, and mike all started high school in 1985, how did they graduate in 1987? Wasn't there 3 and a half years that passed in season 5 alone?\n\nWhy is netflix's merch say graduating class of 87?",
        "upvotes": 49,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1q8svwg/isnt_netflix_wrong_about_stranger_things/"
    },
    {
        "id": "1q9a4zo",
        "author": "valienpire",
        "title": "Do all profiles get a \"Payment Pending/Declined\" notification in the app or does only the account owner get it?",
        "content": "Long story short I'm sharing the account with a family member whom I'm planning to go no-contact with, however I've been paying for it by myself for a while even though we were agreed to share the payment. I don't want to bother with deleting their profile/opening a new account but I do want to put a bit of a pressure on them so they at least send me the money. Confronting them myself would result in a bigger fight.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q9a4zo/do_all_profiles_get_a_payment_pendingdeclined/"
    },
    {
        "id": "1q9ik6w",
        "author": "urmommy6942032",
        "title": "Btightness issues",
        "content": "Idk what happened, i never messed with the settings at all since i started using the app, but for some apparent reason it seems like my brightness is locked at around 70-80% brightness? Everytime i mess with the brightness and move it up and down it seems like theres no difference between 70-100. On my PC it works fine but not for my phone, im using an S24 FE if that helps.\n\nThanks in advance!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9ik6w/btightness_issues/"
    },
    {
        "id": "1q9c8k5",
        "author": "alexxx729",
        "title": "Very bad quality on desktop app",
        "content": "I recently wanted to watch the social network and didn't continue because the quality or compression was so bad that many scenes were just a pixel mush.\n\nNow I'm trying to watch blade runner 2049 and have the same problem. I have the windows 11 App and original content like arcane, stranger things, etc looks great and actually like 1080p.\n\nWhat am I doing wrong or is there any way around this (no the quality doesn't improve over time sadly and I already set the data to \"high\"",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q9c8k5/very_bad_quality_on_desktop_app/"
    },
    {
        "id": "1q9grkc",
        "author": "jgsanchezg",
        "title": "Primer película original en México?",
        "content": "Mi esposa y yo tenemos un vago recuerdo de que la primer película original de Netflix que vimos fue Bright, pero nos generó la duda, cuál fue la primer película original de Netflix liberada en México? Se que \"Beasts of no nation\" fue la primer película original pero, se liberó al mismo tiempo en México?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9grkc/primer_película_original_en_méxico/"
    },
    {
        "id": "1q9a4s8",
        "author": "Highly_Dumb",
        "title": "People We Met on Vacations (Movie)",
        "content": "I just wanted to ask about what's your perspective on Sarah in general,like how would you view Poppy and Alex as her? As someone who is in a long relationship but also has really meaningful friendships I really wanna know varied opinions",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9a4s8/people_we_met_on_vacations_movie/"
    },
    {
        "id": "1q95gv1",
        "author": "The_Girl_1985",
        "title": "Runaway - sound of silence - artist?",
        "content": "Does anyone know who sang the song \"sound of silence\" in the episode 4 of the show \"Run away\"? \n\n  \nI'm loving it but I can't find it anywhere. Any help will be appreciated!",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1q95gv1/runaway_sound_of_silence_artist/"
    },
    {
        "id": "1q8lcdu",
        "author": "AltruisticAide9776",
        "title": "The people we meet on vacation movie was so without depth and even without romance ?",
        "content": "I'm starting to feel like romance only works in tv shows not in movies when there is not a hint of mystery/unpredictability. In tv shows the characters gets time to develop their own characters as well as a connection with each other , in movies there just isn't that time. Look at how interesting the romance felt in heated rivalry compared to people we meet on vacation, heck even Emily in Paris romance arks are better though people are tired of them now.\n\nThis movie while watchable was just not it, there just wasn't really a reason as to why they did not get together earlier . I feel like friends to lovers works only in tv shows, like that is why so many people were shipping Harry and Hermione ( well that is a series of films/books but you get the point ).\n\nThe only redeeming quality was Poppy speaking honestly with Sarah and apologizing for her closeness with Alex.\n\nI don't get why Alex was pissed at Poppy for not I guess being more forward with her feelings when um he has a girlfriend and even got engaged to her after they had an emotional moment the previous night ? Like isn't that him running away and not wanting to acknowledge he feelings for Poppy and he is accusing her of running away?\n\nThe ending where Poppy was like \" home is where you re with your person \" was soo juvenile .\n\n  \nEdit : I know I said the \" only redeeming quality was Poppy speaking honestly with Sarah and apologizing for her closeness with Alex but really it was for Alex to have those boundaries , he was the one engaged to Sarah after all , why is it Poppy the one to apologise. ",
        "upvotes": 61,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1q8lcdu/the_people_we_meet_on_vacation_movie_was_so/"
    },
    {
        "id": "1q9hbq9",
        "author": "tymriq",
        "title": "Becky",
        "content": "I just watched Becky. There is so much going on in that movie. It is similar to Home Alone in a much darker way. Kevin James played a bad guy. And he did it extremely well. Not a great movie, but I am so happy I watched it.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q9hbq9/becky/"
    },
    {
        "id": "1q9fwcp",
        "author": "Great_Sun_zo",
        "title": "Alpha Males Season 4 seems like they lost budget mid season. Horrible ending",
        "content": "I love this show but was disappointed that the last season is only 6 episodes but the rest are 10+. After seeing how abruptly the show ended on episode 6, it seems like they cut the season short and were forced to leave multiple storylines open or unanswered. Does anyone else feel like this? They must have lost budget. It’s the only explanation I can think of. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q9fwcp/alpha_males_season_4_seems_like_they_lost_budget/"
    },
    {
        "id": "1q96bjp",
        "author": "ronfromsacramento",
        "title": "What do you think about these random choices of judges for the next \"Star Search\" reboot?",
        "content": "# Jelly Roll, Sarah Michelle Gellar and Chrissy Teigen Join Netflix’s ‘Star Search’ Reboot as Judges\n\nJelly Roll, Sarah Michelle Gellar and Chrissy Teigen have joined Netflix’s upcoming “Star Search” revival as judges, the streamer announced Tuesday.\n\nJelly Roll, Gellar and Teigen will be on hand as “Star Search” premieres live on Netflix on Jan. 20. The new edition of the talent competition series will be hosted by Anthony Anderson. The five-week event will feature new episodes on Tuesdays and Wednesdays at 9 p.m. ET/ 6 p.m. PT, with real-time voting via TV remote or mobile app.\n\n[Jelly Roll, Sarah Michelle Gellar and Chrissy Teigen Join Netflix’s ‘Star Search’ Reboot as Judges](https://www.yahoo.com/entertainment/tv/articles/jelly-roll-sarah-michelle-gellar-180000064.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuYmluZy5jb20v&amp;guce_referrer_sig=AQAAAJxCl9TtY0gWpwuH1-QI9wZcgHby_Z5WreelOA2g6OG13NaER4gSZyc11j2aQG6sMSX9ejTahHxdg1k-Nu4Hd6oiEqvVWjAp3wqJcH0_G59KjU5gdvktvDMY3rOSsrV44BeRf9Ad_wgRldoU41x64xPZjtIapxq_wVpyCZXSpT-v)\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q96bjp/what_do_you_think_about_these_random_choices_of/"
    },
    {
        "id": "1q8rkrp",
        "author": "AccomplishedPut5175",
        "title": "His &amp; Hers",
        "content": "Just finished and... I love series like this, and this kind of action. In my opinion, the series is very good, it kept my attention the whole time. Honestly, my recommendation.",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q8rkrp/his_hers/"
    }
]