[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1llsjqw",
        "author": "Fuocoblu",
        "title": "Il concerto del 24 è stato orrendo a causa dei torinesi",
        "content": "Il 24 ho lavorato come addetto alla gestione flusso per il concerto del patrono, e lasciatemi dire che il 99% delle persone con cui ho avuto a che fare sono state incredibilmente cafone, al limite dell'indecenza e assolutamente indecorose.\n\n\nDovete capire che se ci sono delle limitazioni al flusso di persone in piazza, è per la vostra fottuta sicurezza. È per evitare nuovamente tragedie come quella di anni fa durante la quale sono scappati molti feriti.\nE dovete anche capire che noi addetti alla gestione flusso NON NE POSSIAMO NIENTE DELLE REGOLE CHE VENGONO IMPOSTE! Noi siamo messi lì, sottopagati e senza pause (dalle 16 alle 00:30 non ho mangiato, pisciato, riposato un secondo fosse uno) e dobbiamo fare rispettare le regole a costo di due soldi che altrimenti non ci vengono dati, e non possiamo fare eccezioni per voi solo perché ce lo chiedete gentilmente.\n\n\nLa maggior parte delle regole messe sono stronzate? È stupido che per entrare in piazza anche se ci si abita o ha una prenotazione si abbia bisogno di una certificazione! SÌ, ASSOLUTAMENTE!\nMa non siamo noi a decidere ste cose, né tantomeno i nostri responsabili, e non possiamo fare quel cazzo che vogliamo solo perché ci state particolarmente simpatici.\n\n\nChe poi molti addetti alla gestione flusso, soprattutto i responsabili, siano davvero cafoni e vi rispondano male lo capisco, ma vi assicuro che alcuni invece cercano sempre di mantenere un clima sereno e anzi si scusano pure per il disagio causato dalle limitazioni alla mobilità imposte per l'evento.\n\n\nAlla fine dell'evento, dopo aver specificato a tutti molte volte che non si potevano attraversare le barricate per muoversi come cazzo si voleva, la gente è andata fuori di testa e ha fatto il cazzo che gli pareva, aprendo le barricate e muovendosi ovunque. \"Tanto non mi potete detenere con la forza\", mi è stato detto da un padre che portava la figlia in braccio mentre rompeva bellamente le regole messe per la sicurezza comune. Che bell'esempio che da alla sua pargoletta.\n\n\nI nostri responsabili ci hanno insultati e sono quasi arrivati alle mani, minacciandoci pure di non pagarci, perché la maggior parte dei presenti al concerto alla fine ha deciso di fare il cazzo che gli pareva contro le regole che gli venivano ripetute fin dall'inizio. A tutte le persone che hanno agito così: andatevene a fanculo, siete il motivo per cui odio gli italiani e odio questo paese di merda.\nLa società ha delle regole che vanno rispettate: se volete fare LA STRAMINCHIA CHE VOLETE, STATE A CASA SUL DIVANO, NON USCITE!\n\n\nE ho fatto tutto questo per soli 44 euro, perché sono disperato nel guadagnare qualche spicciolo per pagarmi gli studi. Ma non ne è valsa decisamente la pena.\nSono tornato a casa stanco, con una bella tendinite, sudato marcio, riempito di insulti come non mai e con l'animo straziato da una mancanza di rispetto che come mai prima d'allora avevo provato.",
        "upvotes": 234,
        "comments": 102,
        "media": null,
        "permalink": "/r/torino/comments/1llsjqw/il_concerto_del_24_è_stato_orrendo_a_causa_dei/"
    },
    {
        "id": "1lmhlgb",
        "author": "SafeZookeepergame573",
        "title": "Mezzanotte di compleanno a San Salvario: idee?",
        "content": "\nCiao!\nTra un po’ di giorni sarà il mio compleanno e vorrei aspettare la mezzanotte in un bar (è un giorno feriale) e offrire qualcosa da bere ai miei amici (circa 10 persone). Siccome siamo tutti di San Salvario e il giorno dopo lavoriamo, vorrei farlo in zona.\n\nLa domanda: avete qualche consiglio su dove andare? Qualcosa che chiuda dopo mezzanotte (anche solo alle 00:30), con prezzi più o meno normali (budget 5-6€ a consumazione) e dove si possa portare una torta da fuori.\nDa come l’ho descritta sembra una cosa super impegnativa, ma in realtà vorrei semplicemente incontrare amici, offrire una consumazione, spegnere le candeline (non fondamentale) e poi andare a nanna.\n\nAvevo pensato allo Sbarco e alla Casa del Quartiere, ma chiudono a mezzanotte in punto.\nAvevo pensato all’Imbarchino, ma non si possono portare cose da fuori (al massimo lascio stare la torta, o ci spostiamo sul prato prima di salutarci).\nAvete altre idee?\n\n(Eh sì raga, ai compleanni è il festeggiato che deve offrire, e senza aspettarsi nulla in cambio… proprio così!)\n\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lmhlgb/mezzanotte_di_compleanno_a_san_salvario_idee/"
    },
    {
        "id": "1lmhjf7",
        "author": "raphyy_sanchez",
        "title": "Shop recommendation",
        "content": "Ciao ! I visited Florence and really liked the Flow store. They have trendy clothes at medium price range, I wanted to know if there were suggestions in Torino for similar vibe? They were selling PT Torino pants which I don’t know where to buy here.. Grazie mille ! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lmhjf7/shop_recommendation/"
    },
    {
        "id": "1lmh3nm",
        "author": "Complete_Jump7811",
        "title": "cercasi gente con voglia di fare (contenuti audiovisivi)",
        "content": "we\n\nsto cercando persone che abbiano voglia di produrre cortometraggi (molto amatoriali specifico). ultimamente ho delle idee che mi piacerebbe molto trasformare in qualcosa di più ma purtroppo le persone attorno a me non sono interessate o non si impegnerebbero davvero a fondo. Vorrei trovare gente motivata con cui condividere idee e lavorare insieme su scrittura e stesura delle idee/sceneggiature, scenografia, ambientazioni, props, riprese (ho una mirrorless che può tornare utile), montaggio, musica, etc\n\nfatemi sapere spero di trovare qualcun",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lmh3nm/cercasi_gente_con_voglia_di_fare_contenuti/"
    },
    {
        "id": "1lm2ef6",
        "author": "Enea_616",
        "title": "Presto mi trasferisco vicino a un Mercatò e non ho mai frequentato questa linea di supermercati, vorrei sapere se è buona a livello di prezzo. vengo da un Pam Panorama, i prezzi sono migliori?",
        "content": "",
        "upvotes": 6,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1lm2ef6/presto_mi_trasferisco_vicino_a_un_mercatò_e_non/"
    },
    {
        "id": "1llv41n",
        "author": "BrightMud165",
        "title": "weekend mare da Torino",
        "content": "Mi consigliate un posto per due/tre giorni di mare partendo da Torino?\n\nDi solito il posto più noto è la riviera ligure, solo che non vorrei spendere molti soldi e vorrei un mare decente.\n\nAvete suggerimenti?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1llv41n/weekend_mare_da_torino/"
    },
    {
        "id": "1lm1bay",
        "author": "No-Preference5798",
        "title": "Ciao tutti!",
        "content": "I'lll be moving to Turin in September for my master's. Can you suggest some things to do in Italy. Are there any neighborhoods to avoid, especially for a woman?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lm1bay/ciao_tutti/"
    },
    {
        "id": "1llt0el",
        "author": "Babele_20",
        "title": "Dizionario per esame, per favore help",
        "content": "Ciao! Venerdì ho un esame e mi servirebbe urgentemente un dizionario inglese monolingue con la trascrizione fonetica, preferibilmente della Oxford.\nQualcuno lo vende e può scambiarlo in tempi super brevi!! Sono disperataaaaaaa",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1llt0el/dizionario_per_esame_per_favore_help/"
    },
    {
        "id": "1llxs61",
        "author": "FreeAd8663",
        "title": "Festival sinergie d'estate - 28 giugno 2025 - presso A.P.S. Ancora di Saronsella (TO)",
        "content": "Per chi fosse interessato, domani 28 giugno 2025 presso gli impianti sportivo di Saronsella ci sarà un concerto con musica dal vivo che vedrà impegnate diverse band del torinese. L'evento inizierà alle ore 21 e naturalmente non mancheranno cibo e bevande! P.s. non sono l'organizzatore per cui non so molto altro.",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v5woijmhuh9f1.jpeg?auto=webp&amp;s=91a9a60a1b717d895fe55ac8cf97b47680ffff77"
        },
        "permalink": "/r/torino/comments/1llxs61/festival_sinergie_destate_28_giugno_2025_presso/"
    },
    {
        "id": "1llnb3c",
        "author": "KappaKarter",
        "title": "Cercasi comitiva per escursioni!",
        "content": "Ciao a tutti! Sono un ragazzo da poco tornato a Torino (nato e cresciuto qua) con una passione enorme per le escursioni in montagna e per le tendate in natura.\n\nAvendo però io la grandissima capacità di circondarmi di amici un po’ pigroni mi trovo sempre in solitaria e sinceramente comincia a diventare un po noioso e ripetitivo 😅\n\nQualcuno su questo sub è nella mia stessa situazione? Sarebbe bello creare un gruppo di montagnini/esploratori/bivaccatori per organizzarci uscite! 😊",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1llnb3c/cercasi_comitiva_per_escursioni/"
    },
    {
        "id": "1lluhup",
        "author": "Cronos8989",
        "title": "Meccanico onesto per revisione",
        "content": "Qualcuno conosce un meccanico onesto in zona Santa Rita per fare la revisione ad una opel Astra?  \nCon la mia vecchia macchina andavo da Midas, ma mi sono sempre trovato male.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lluhup/meccanico_onesto_per_revisione/"
    },
    {
        "id": "1llojin",
        "author": "Last_Anywhere5528",
        "title": "we diventiamo amici",
        "content": "Sono qui da un anno e se continuo a fare casa - lavoro implodo, ho 24 anni, mi piacciono le cose dei veri nerdsz, sto in zona san salvario\n\n",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1llojin/we_diventiamo_amici/"
    },
    {
        "id": "1llsyom",
        "author": "Hack64",
        "title": "Opinioni su zona Secondo - Mauriziano",
        "content": "Ciao a tutti,\n\nsono nel bel mezzo della ricerca per l'acquisto di una casa a Torino e mi sono imbattuto in un immobile nei pressi del Mauriziano, in particolare nella zona indicata sulla mappa.\n\nDa altri post ho letto che la zona non è delle migliori, soprattutto durante la sera pur essendo a ridosso di Crocetta, ma queste informazioni sono ormai di qualche anno fa. È davvero ancora così o la situazione è cambiata, vedendo anche la rivalutazione a cui sta andando incontro San Salvario?\n\nGrazie mille a chi mi potrà aiutare :)\n\nhttps://preview.redd.it/ru9hxtthtg9f1.png?width=1814&amp;format=png&amp;auto=webp&amp;s=7ff9ecfdea4b67dfed09149b226f16ca2405b573\n\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1llsyom/opinioni_su_zona_secondo_mauriziano/"
    },
    {
        "id": "1llsw7l",
        "author": "MaleficentHurry8609",
        "title": "Festa di San Giovanni!",
        "content": "Sono uno studente universitario giunto a Torino l'anno scorso e che questo anno ha assistito al concerto di San Giovanni (che da quanto ho capito viene proposto per la prima volta, poiché gli anni scorsi vi era il solo spettacolo pirotecnico).\n\nTra torinesi DOC e non (immigrati come me lol) cosa ne avete pensato di questa proposta (lasciando stare i problemi di organizzazione imbarazzanti quale gestione della piazza Vittorio Veneto e gestione dei mezzi pubblici dopo l'evento): sto parlando in modo specifico del concerto-siparietti a cui abbiamo assistito.\n\nLascerò un commento qui sotto con i miei pensieri! Fatemi sapere!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1llsw7l/festa_di_san_giovanni/"
    },
    {
        "id": "1llp0kr",
        "author": "junanor1",
        "title": "Com’è la vità a Cavoretto",
        "content": "Ciao tutti e tutte \n\nTutta la famiglia sul punto di trasferirsi a Torino. Cerchiamo una casa perché abbiamo bambini e non vogliamo più abitare in un centro città perché è troppo faticoso. \nHo visto dei annnunci immobiliari a cavoretto e mi domandava com’è là qualità di vita in quella parte della città.\nGrazie per l’aiuto ",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1llp0kr/comè_la_vità_a_cavoretto/"
    },
    {
        "id": "1llxcqy",
        "author": "Ilovefootball_it205",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti!\nSono un ragazzo di quasi 17 anni che abita in provincia di Torino. Mi piacerebbe conoscere nuove persone, ragazzi o ragazze, con cui uscire e fare due chiacchiere . Poi vi mando il mio insta in privato ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1llxcqy/nuove_amicizie/"
    },
    {
        "id": "1lm5lo4",
        "author": "sico666",
        "title": "Cercasi stregone/sacerdote neopagano Torino",
        "content": "Siamo un gruppo di amici di Torino, cerchiamo stregoni interessati di esoterismo per fare amicizia e leggere tarocchi insieme. \nAstenersi maniaci, non facciamo orge, niente fascisti",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1lm5lo4/cercasi_stregonesacerdote_neopagano_torino/"
    },
    {
        "id": "1llrh7k",
        "author": "d4cl0vetra1n",
        "title": "who is playing now in Torino?",
        "content": "gigs",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1llrh7k/who_is_playing_now_in_torino/"
    },
    {
        "id": "1lkxv89",
        "author": "eleask",
        "title": "Favore retribuito (movimento di un pacco) - Torino Centro",
        "content": "EDIT: ce l'ho fatta! Un cortesissimo torinese si e' fatto avanti ed e' adesso in missione! Grazie, Torino!!!\n\n\n\n\n\n\\-----------------------------------------------------------------------------------------------------\n\nHey gente di Torino (centro). Stasera (stanotte) arrivero' in aereo a Torino, e domattina vorrei partire per le montagne presto (col treno delle 5:30).\n\nHo ordinato del gas da campeggio, ma per via di un po' di sfiga, non e' arrivato in tempo in hotel, quindi, ho una piccola missione per chiunque sia disposto.\n\nChi ha voglia di andare al decathlon di torino centro, recuperare una bomboletta di gas e trasferirla cento metri piu' in la' all'hotel nizza, questo pomeriggio?\n\nIn cambio, vi pago qualsiasi cosa vogliate in Decathlon per un valore di diciamo 10 euro :) Anche na carta regalo se riesco!\n\nFatemi sapere, e grazie in anticipo a chiunque voglia provarci! Grazie!",
        "upvotes": 31,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lkxv89/favore_retribuito_movimento_di_un_pacco_torino/"
    },
    {
        "id": "1ll7g0p",
        "author": "Particular-Bed9438",
        "title": "Conoscenze",
        "content": "Ciao! Sono una studentessa fuorisede di 22 anni.\n\nAmmetto che faccio un po’ fatica a fare nuove amicizie (e ancora più fatica a mantenerle o coltivarle). Sono abbastanza introversa e selettiva, e tendo ad aprirmi solo in contesti in cui mi sento davvero a mio agio.\n\nA complicare un po’ le cose c’è anche la mia espressività… o meglio: la mia *\"resting bitch face\"*. Spesso le persone mi dicono che sembro altezzosa, giudicante, o addirittura cattiva – quando in realtà è solo la mia faccia da default.\n\nDetto ciò, ultimamente sento davvero il bisogno di compagnia: mi piacerebbe visitare musei, esplorare la città, uscire a mangiare, o anche andare a ballare in discoteca – non per bere, ma solo per il puro piacere di ballare.\n\nIl problema è che... non ho nessuno con cui farlo.\n\nAh, e per il ragazzo che propone sempre di scrivergli per entrare nel gruppo che hanno creato: **non riesco a scriverti!**\n\nSe qualcuno si è trovato o si trova nella mia stessa situazione e ha voglia di condividere qualche uscita, mi farebbe super piacere!\n\n",
        "upvotes": 7,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1ll7g0p/conoscenze/"
    },
    {
        "id": "1llsy2p",
        "author": "rrsafety",
        "title": "Has the city made efforts to fix the graffiti problem?",
        "content": "I loved my visit. I was surprised by the amount of graffiti. Has the city made efforts to stop graffiti?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1llsy2p/has_the_city_made_efforts_to_fix_the_graffiti/"
    },
    {
        "id": "1llagxq",
        "author": "Yigit_im",
        "title": "Is there a website to find job as a student?",
        "content": "Please I need to earn some moneeey",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1llagxq/is_there_a_website_to_find_job_as_a_student/"
    },
    {
        "id": "1llc2xa",
        "author": "sturmfrey",
        "title": "Lezioni di musica a prezzi accessibili??",
        "content": "Ciao. Sono davvero interessato a imparare il violino e/o il pianoforte. Ma da studente, alcuni dei prezzi di queste lezioni sono folli! \nIntendevo solo un po' troppo per me \n\nQuindi mi stavo chiedendo se voi ragazzi conoscete qualche lezione di violino/piano a un prezzo accessibile/economico? anche qualche raccomandazione su dove posso impararli? \nHo visto alcuni volantini in giro per Comala su lezioni di musica gratis qualche mese fa, ma ho perso le foto, quindi se qualcuno ne sa di più, per favore condividetele. \n\nGrazie mille. Voglio davvero provare una cosa nuova quest'anno haha \n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1llc2xa/lezioni_di_musica_a_prezzi_accessibili/"
    },
    {
        "id": "1llo9w9",
        "author": "_agnee",
        "title": "qualcuno che vuole fare amicizia?",
        "content": "ciao, sono una ragazza di 18 anni e mi piacerebbe conoscere nuove persone (specialmente femmine, ma anche se sei un maschio scrivimi tranquillamente).",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1llo9w9/qualcuno_che_vuole_fare_amicizia/"
    },
    {
        "id": "1ll1f1t",
        "author": "lospavaldo",
        "title": "cerco amicizie a torino",
        "content": "io e un mio amico siamo grandi appassionati di viaggi in bici, roba ovviamente amatoriale e per il momento i viaggi piu lunghi sono stati di circa 60 km. Cerchiamo giusto qualcuno con la nostra stessa passione per stare in compagnia\n\nIo e il amico abbiamo 18 e 19 anni",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ll1f1t/cerco_amicizie_a_torino/"
    },
    {
        "id": "1llafbk",
        "author": "Yigit_im",
        "title": "Compirò 18 anni tra un mese. Sarò libero per i prossimi due mesi a causa delle vacanze estive e vorrei lavorare e guadagnare qualcosa.",
        "content": "Non so l'italiano, quindi non posso fare il barista o simili. Dove posso trovare lavoro come prossimo diciottenne?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1llafbk/compirò_18_anni_tra_un_mese_sarò_libero_per_i/"
    },
    {
        "id": "1ll7t0a",
        "author": "Curious-Albatross896",
        "title": "Miglior Barbiere di Torino?",
        "content": "Mi consigliate il miglior barbiere qua a Torino per tagli da maranza? Top barbieri bravi che ci sanno fare e che conoscono gli ultimi tagli. Sono in zona lingotto, ma mi faccio anche 2 ore di tram per il barbiere giusto XD. \n\n",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1ll7t0a/miglior_barbiere_di_torino/"
    },
    {
        "id": "1lk5ab9",
        "author": "Murky_Giraffe8700",
        "title": "Fino a quando Torino continuerà a fingere che questo livello di “decoro” sia accettabile?",
        "content": "Sinceramente, non capisco come siamo arrivati a questo punto...  \n  \nA meno che non vivi in centro o nelle vicinanze, Torino sta diventando semplicemente invivibile.   \n  \nBasta allontanarsi un po' verso la periferia ed è come essere in un altro mondo: Borgo Vittoria, Barriera di Milano, San Salvario, ecc.; sembrano luoghi completamente diversi, dove il degrado è impossibile da ignorare.  \n\nSto cercando casa in questi giorni, e fa impressione vedere come si stiano creando delle vere e proprie *no-go zones*. Devi già restringere la ricerca per budget e trasporti, ora pure per sicurezza. Parti della città che una volta erano vivibili oggi ti fanno pensare: 'lì meglio non andarci di sera'.\n\nL'altro giorno sono andato in Barriera a trovare degli amici e lo dico chiaramente: non sembrava nemmeno l'Italia. Sporcizia ovunque, abbandono, una sensazione di pericolo costante. Come si fa a vivere lì senza sentirsi in pericolo?   \n  \nla cosa peggiore è che non parlo solo per me. Ogni volta che la mia ragazza torna a casa la sera, c’è sempre qualcuno che la molesta, la ferma, le dice qualcosa. Non è un caso isolato, succede regolarmente. Non è normale dover vivere con questa costante sensazione di minaccia solo per rientrare a casa propria.  \n  \nSono sempre stato a favore dell'apertura, dell'integrazione e dei diritti. Ma non si tratta più di questo.  \n  \nSi tratta di una città che si sta lasciando andare completamente e nessuno sembra voler dire niente. O peggio, c'è chi fa finta che tutto vada bene. Lo sappiamo tutti dove stanno a spacciare: San Salvario, sotto la farmacia all’angolo fino a corso Regina, certe vie della Barriera… ma la polizia? Niente. Ogni tanto mandano l’esercito per fare scena, poi spariscono e tornano tutti come prima. È diventata una farsa  \n  \n**Mi chiedo:** chi governa questa città e si rende conto del disastro in cui è finita? C'è ancora qualcuno che crede nel concetto di decoro urbano? O dobbiamo rassegnarci al fatto che Torino diventerà sempre più sporca, insicura e degradata?   \n  \nNon sto parlando del passato, so bene che Torino non è mai stata perfetta. Ma adesso ci sono zone che sembrano letteralmente da terzo mondo: gente che si buca o fuma crack in pieno giorno, parchi abbandonati, sporcizia ovunque, gruppi che ti guardano con ostilità. È diventato normale sentirsi fuori posto nella propria città.  \n  \nE sì, lo so già: questo post verrà sommerso di downvotes da parte di quelli che amano raccontarsi che “va tutto bene”, che è colpa della percezione o che sto facendo allarmismo. Ma questa è la realtà, quella che viviamo ogni giorno fuori dai salotti radical chic. Non voglio vivere in un’anarchia urbana dove tutto è tollerato “per principio”, mentre la città si disintegra.",
        "upvotes": 182,
        "comments": 194,
        "media": null,
        "permalink": "/r/torino/comments/1lk5ab9/fino_a_quando_torino_continuerà_a_fingere_che/"
    },
    {
        "id": "1lkumob",
        "author": "whos_there1234",
        "title": "cerco amici a torino",
        "content": "Amicizie a Torino Sono un ragazzo di 23 anni, sono appena arrivato a Torino e vorrei allargare la mia cerchia di amici. Mi piace andare in bici, andare al cinema, giocare ai videogiochi e uscire con gli amici per un drink. Se ci sono gruppi, fatemelo sapere ✌🏻",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lkumob/cerco_amici_a_torino/"
    },
    {
        "id": "1lkhvnj",
        "author": "Rude-Green3601",
        "title": "BLACK OUT IN S RITA",
        "content": "anche voi senza corrente?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lkhvnj/black_out_in_s_rita/"
    }
]