[
    {
        "id": "1gwj4n3",
        "author": "ThePianoLessonAMA",
        "title": "Hi, /r/movies! I am Malcolm Washington, director and co-writer of 'THE PIANO LESSON', starring Samuel L. Jackson, John David Washington &amp; Danielle Deadwyler. It will be released on Netflix tomorrow— Ask me anything!",
        "content": "",
        "upvotes": 12,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ggeqp7uu5a2e1.jpeg?auto=webp&amp;s=9268aa985f3b12b6467a944b05f5a56dd9daca98"
        },
        "permalink": "/r/movies/comments/1gwj4n3/hi_rmovies_i_am_malcolm_washington_director_and/"
    },
    {
        "id": "1gwfrt8",
        "author": "MarvelsGrantMan136",
        "title": "First Image from Guillermo del Toro's 'Frankenstein'",
        "content": "",
        "upvotes": 4269,
        "comments": 477,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9nda9nxq692e1.jpeg?auto=webp&amp;s=97273598062b530256b11a5289d425036e1a9502"
        },
        "permalink": "/r/movies/comments/1gwfrt8/first_image_from_guillermo_del_toros_frankenstein/"
    },
    {
        "id": "1gw2qxh",
        "author": "MarvelsGrantMan136",
        "title": "Robert Pattinson Reteaming With Christopher Nolan for ‘Oppenheimer’ Filmmaker’s Latest Film",
        "content": "",
        "upvotes": 7219,
        "comments": 669,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6LNRTVRU2pQTS2C60a7Cyw6jQo1m9dkl8ctqQz6XWlI.jpg?auto=webp&amp;s=59489e010131364f16633209ddc7175e5dc6715a"
        },
        "permalink": "/r/movies/comments/1gw2qxh/robert_pattinson_reteaming_with_christopher_nolan/"
    },
    {
        "id": "1gwfw9t",
        "author": "JonasKahnwald11",
        "title": "First image of Anne Hathaway from David Lowery's 'Mother Mary'",
        "content": "",
        "upvotes": 550,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k7zxj78u792e1.jpeg?auto=webp&amp;s=aa9dc6b8e033a02066edde8da518a5a637d3c6da"
        },
        "permalink": "/r/movies/comments/1gwfw9t/first_image_of_anne_hathaway_from_david_lowerys/"
    },
    {
        "id": "1gvxlc7",
        "author": "JannTosh50",
        "title": "National Treasure: How a Da Vinci Code Ripoff Outlived and Surpassed the Real Thing",
        "content": "",
        "upvotes": 4439,
        "comments": 462,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4p-QkN1aIB_XtIHJIZBoXpMosF7KZLVVo2fgiXYZb4Q.jpg?auto=webp&amp;s=1f73a4ed5bff6aff9ebdef0c140060240c329efd"
        },
        "permalink": "/r/movies/comments/1gvxlc7/national_treasure_how_a_da_vinci_code_ripoff/"
    },
    {
        "id": "1gw4zvo",
        "author": "Sonia341",
        "title": "‘Mortal Kombat 2’ Rated “R” for “Strong Bloody Violence and Gore”",
        "content": "",
        "upvotes": 1185,
        "comments": 240,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XemLhOgWbzR3maZNz9nLY2PB5Prv2306n0RfTE6X6OI.jpg?auto=webp&amp;s=ef81d453d796a9e4d726a5bbfdd9f3e326925b72"
        },
        "permalink": "/r/movies/comments/1gw4zvo/mortal_kombat_2_rated_r_for_strong_bloody/"
    },
    {
        "id": "1gwfdxn",
        "author": "Midnight-Noir",
        "title": "Tom Hardy should have played more characters like in Inception",
        "content": "Tom Hardy is widely known for portraying unconventional characters. Many of his roles share traits such as being outsiders, eccentric individuals, morally ambiguous figures or characters with distinctive, sometimes really strange accents. However, there are only a few instances where his characters come across as relatively grounded and \"normal\" — *Dunkirk* and *Locke* come  to mind.\n\nI think what stands out about his role in *Inception* is how it breaks away from his usual typecasting. As Eames, he exudes charm, charisma, and a sense of humor, embodying a suave, almost James Bond-like figure. The performance highlights his range, showing that he can effortlessly step into a role that is polished, witty, and magnetic — a stark contrast to the brooding intensity he is often associated with.\n\nIt’s surprising that he hasn’t taken on more roles like this, where his natural charm and comedic timing could truly shine. In fact, I feel that his tendency to play characters with similar traits has started to feel a bit repetitive in recent years. Would his career have been even more exciting if he had balanced his darker, complex characters with more roles like the one in *Inception*?",
        "upvotes": 145,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1gwfdxn/tom_hardy_should_have_played_more_characters_like/"
    },
    {
        "id": "1gvv0qn",
        "author": "Adventurous_Judge493",
        "title": "‘Nosferatu’ Rated “R” for Bloody Violence and “Graphic Nudity”",
        "content": "",
        "upvotes": 4736,
        "comments": 418,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VlpmvAU3X40WBY1xmSDELIeFkyEX2soRFVYYRqFJl7w.jpg?auto=webp&amp;s=31cf56f5dffa29d54cb9d9217749f997f010d0fa"
        },
        "permalink": "/r/movies/comments/1gvv0qn/nosferatu_rated_r_for_bloody_violence_and_graphic/"
    },
    {
        "id": "1gvrno4",
        "author": "indiewire",
        "title": "Why Does Hollywood Hate Marketing Musicals as Musicals?",
        "content": "",
        "upvotes": 7891,
        "comments": 1758,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Dk7z4Je0barYFN-cstLXiyLKu4CbeGbemFN-KPBihfU.jpg?auto=webp&amp;s=f3fcdc71e9ea161bf5e8ef167c9a3c466ca28e02"
        },
        "permalink": "/r/movies/comments/1gvrno4/why_does_hollywood_hate_marketing_musicals_as/"
    },
    {
        "id": "1gw8ml7",
        "author": "Fackinsaxy",
        "title": "In Labyrinth (1986) Jennifer Connolly's question would not solve the 2 door riddle, right?",
        "content": "I'm pretty sure i'm correct but i could just be dumb lol. In the film, there is a scene with the 2 door riddle (2 doors and 2 guards, one guard only tells the truth and the other only tells lies, you get one question posed to one guard to determine which door leads to the castle). Jennifer Connolly points at one door and asks one guard \"Answer yes or no - would he (the other guard) tell me that this door leads to the castle?\" Making it a yes or no question while referring to one of the doors specifically in this way would NOT work, right? As far as i can tell, the question needs to be \"Which door would the other guard tell me leads to the castle?\"",
        "upvotes": 496,
        "comments": 164,
        "media": null,
        "permalink": "/r/movies/comments/1gw8ml7/in_labyrinth_1986_jennifer_connollys_question/"
    },
    {
        "id": "1gwghd5",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Wallace &amp; Gromit: Vengeance Most Fowl'",
        "content": "",
        "upvotes": 99,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3edl2gj1d92e1.jpeg?auto=webp&amp;s=9cd417d40e4e0c42c72d5adab20d3d8ef5266f9b"
        },
        "permalink": "/r/movies/comments/1gwghd5/new_poster_for_wallace_gromit_vengeance_most_fowl/"
    },
    {
        "id": "1gwfpd6",
        "author": "MarvelsGrantMan136",
        "title": "Wallace &amp; Gromit: Vengeance Most Fowl | Official Trailer | Netflix",
        "content": "",
        "upvotes": 82,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ioBoVvtj3qjwYp0PeDUaclFxmwv12aXpwtozgyDdHNc.jpg?auto=webp&amp;s=4d2afd2ab98007e29c15f33752e11c9b02d51cee"
        },
        "permalink": "/r/movies/comments/1gwfpd6/wallace_gromit_vengeance_most_fowl_official/"
    },
    {
        "id": "1gwil34",
        "author": "Comic_Book_Reader",
        "title": "The Bad Guys 2 | Official Trailer",
        "content": "",
        "upvotes": 31,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zDpCBuLePnXotNe-DF2wQ-E38MYQJJVGAy77U0r1ZoI.jpg?auto=webp&amp;s=7941f748b36296e39c2bf6ee73228136fc055fc0"
        },
        "permalink": "/r/movies/comments/1gwil34/the_bad_guys_2_official_trailer/"
    },
    {
        "id": "1gvveub",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Robert Eggers' 'Nosferatu'",
        "content": "",
        "upvotes": 1752,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/df9g5qgjg32e1.jpeg?auto=webp&amp;s=037d33bea0b2128f76bac8d4c68bf5e67cf68ae8"
        },
        "permalink": "/r/movies/comments/1gvveub/new_poster_for_robert_eggers_nosferatu/"
    },
    {
        "id": "1gw6ww7",
        "author": "cmaia1503",
        "title": "‘Scream 7’: Isabel May Is Set To Play Sidney Prescott’s Daughter In Pic",
        "content": "",
        "upvotes": 290,
        "comments": 135,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oP37l-6zO3Yn6PsGcI-ZlS2E7hY-UilQkofRZXRaJLo.jpg?auto=webp&amp;s=686a6fa215d253cc067faeffbb68336ad508e7a0"
        },
        "permalink": "/r/movies/comments/1gw6ww7/scream_7_isabel_may_is_set_to_play_sidney/"
    },
    {
        "id": "1gwc3yy",
        "author": "mackimus",
        "title": "Is there a movie in a series that you find yourself skipping?",
        "content": "I was sitting here going through some movies that I enjoy watching and came across the Mission Impossible series. I tend to, not always, but skip the second. It really doesn't add to any of the others in the series and I recall watching it the first time wondering if it would kill the series all together. \n\nI also think of any third movie in an X-Men series. They just tend to be bad. Every so often I'll watch it again thinking, maybe this time it won't be so....Oh, oh no, no it is. This isn't what I want.",
        "upvotes": 89,
        "comments": 504,
        "media": null,
        "permalink": "/r/movies/comments/1gwc3yy/is_there_a_movie_in_a_series_that_you_find/"
    },
    {
        "id": "1gwh5jb",
        "author": "Comic_Book_Reader",
        "title": "Parthenope | Official Trailer HD | A24",
        "content": "",
        "upvotes": 36,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IL5dSCaDQu3CmpzlPj7-NT_L70mXLQs_ISXhKegn-X4.jpg?auto=webp&amp;s=4bc6b96e63af26f3c06339336417f4912391e80a"
        },
        "permalink": "/r/movies/comments/1gwh5jb/parthenope_official_trailer_hd_a24/"
    },
    {
        "id": "1gw8lpg",
        "author": "ChrisEvansFan",
        "title": "The highlight of Furiosa: A Mad Max saga is Praetorian Jack",
        "content": "I just recently watched the films and I have to say that the film really has a lot of strong performances from Chris Hemsworth to Anya Taylor Joy. But I wasnt expecting Tom Burke to provide the emotional core of the film. I didnt expect to “fall in love” with his character in just a few minutes of screen time. The chemistry between Praetorian Jack and Furiosa felt organic and not forced and it was entertaining to watch. We get to see a glimpse of Furiosa’s mentor and that was interesting.\n\nTom Burke was so familiar but I cant put on where I saw him before. Google said that he was in the BBC Three Musketeers and that is when it finally clicked. Hope we see more of him. He kinda looks a bit like Diego Luna too. ",
        "upvotes": 148,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1gw8lpg/the_highlight_of_furiosa_a_mad_max_saga_is/"
    },
    {
        "id": "1gwgsw5",
        "author": "herequeerandgreat",
        "title": "20 fun facts about the muppet christmas carol.",
        "content": "with only a few days left before thanksgiving, christmas is coming closer and closer. we all have our christmas traditions. and one christmas tradition is watching christmas movies. and one of the movies that i like to pop into the DVD player every christmas season is 1992's the muppet christmas carol. the muppet christmas carol is not only considered to be the only muppet movie that could rival the muppet movie for the title of the best muppet movie but is also considered one of the best adaptations of charles dickin's novel with many going so far as to call it THE best. while i don't think it's the best adaptation(my personal favorite is the alastair sims version in case you were curious), i do still think it's quite great and i have it to thank for introducing me to one of the best stories ever written.\n\nthe film has quite a bit of interesting trivia surrounding it and i thought it would be fun to post some of them onto this sub to hopefully give you all a newfound appreciation for this holiday classic.\n\n20: this was the first muppet project to feature gonzo and rizzo as a duo. since then, the two have been considered inseparable.\n\n19: many of the extras in the street scenes are puppeteers. look closely and you can just about see the muppets some of them are walking with.\n\n18: the voice of the ghost of christmas past was performed by jessica fox. if that name sounds familiar, she plays enid on the worst witch and nancy on hollyoaks. this was her film debut. \n\n17: this is actually not the first time that the muppets have done a christmas carol. several years prior, a Muppet based adaptation of a christmas carol was done in the form of a comic in muppet magazine. like in muppet christmas carol, kermit is bob crachit, miss piggy is his wife, and robin is tiny tim. \n\n16: in exchange for fetching the poulterer, scrooge offers bean bunny first a shilling, then raises it to 5 shillings. in the original novel, and most adaptations, scrooge first offers the boy a shilling, then raises it to half a crown. half a crown is worth 2 shillings and 6 pence. a crown is 5 shillings. bean bunny made out with double what most versions of his character do.\n\n15: in the DVD commentary, the filmmakers relaid a funny story from a test screening. during the montage at the end of the film, scrooge gives the bookkeepers some coal to keep warm. a few children in the audience asked what the bookkeepers had done wrong to deserve coal. it had completely slipped their minds that santa gives naughty children coal.\n\n14: speaking of the ending, when scrooge meets the charity men out on the streets, they are standing in front of a tavern with a sign that says \"grape tavern\". this may not seem noteworthy except for the fact that grape tavern is not only a real tavern but it's the oldest tavern in london. it was erected in 1583 and was visited by the likes of william shakespeare and charles dickins.\n\n13: during the \"with a thankful heart\" musical number at the end, pay very close attention to the shops in the background. there's one shop named statler and waldorf's, an obvious reference to the famous muppet hecklers. however, there's another shop with the name micklewhite's. this is a reference to michael caine's real name, maurice micklewhite.\n\n12: rowlf the dog has a brief appearance in the film but does not speak. although kermit was jim henson's signature character, rowlf was his favorite to perform and the character that henson felt the closest to. following henson's death, rowlf did not have a speaking appearance for a decade. it was only in the 2000s that bill baretta took over as rowlf's primary performer.\n\n11: prior to this film, it was an unofficial tradition for theatrical muppet movies to feature cameos by characters from sesame street. however, after disney acquired the rights to the muppets, this tradition stopped due to rights issues. this was the first muppet movie in which characters from sesame street do not appear. however, there are appearances by characters from fraggle rock. keep your eyes peeled for mudwell the mudbunny, sprocket, and wander mcmooch.\n\n10: there is an extra verse of \"marley and marley\" at the end of the song. it is absent from the film but is featured on the official soundtrack. it goes as follows. \"We're Marley and Marley, And now it's time to part (doot doot) To go back where they keep our kind, The wretched and the heartless The news we've shared has got you scared We're glad that we got through So make amends (and make some friends!) The future's up to you.\"\n\n9: the original idea for the film was for it to be a parody of a christmas carol rather then a straight adaptation. however, screenwriter jerry juhl convinced the muppeteers to go with a straight adaptation. similarly, the original plan was for the 3 ghosts to be portrayed by muppets. christmas past would have been played by miss piggy, christmas present would have been played by scooter, and christmas yet to come would have been played by gonzo, who's signature nose would have sitcking out of the black hood. eventually, the decision was made to create original puppets to play those characters. miss piggy ended up playing miss crachit, gonzo ended up being the narrator, and scooter was absent.\n\n8: the ghost of christmas past was created by making a special puppet that was operated in a tank of water and then greenscreened into the movie. this gave the spirit the appearance of floating. \n\n7: numerous actors were considered for the role of Ebenezer scrooge. among the actors considered were peter o toole, george carlin, ron moody, and david warner. if warner had been cast, it would have been his second time acting in an adaptation of a christmas carol, having previously played the role of bob crachit in the george C scott adaptation. jack lemmon was also offered the role but, after saying that he'd rather play kermit instead, he was deemed crazy. bob hoskins was also considered but was deemed too short. michael caine got the role instead.\n\n6: before production began, michael caine told brian henson that, even though he was acting in a muppet movie, he planned to play the role of scrooge completely straight as if he was acting with the royal shakespeare company. henson gave caine his blessing. and it ended up paying off since caine's performance is often considered to be one of the best things about the movie and many consider him to be among the best scrooge's. despite his commitment to playing the role straight, caine still had lots of fun on the set and he considers muppet christmas carol to be among his favorite movies he's been involved with.\n\n5: this film was the first major muppet project after the death of jim henson as well as the first major muppet project with steve whitmare as kermit. the film was dedicated to both henson and richard hunt, a muppeteer who had died of aids earlier in the year.\n\n4: it's difficult to talk about the movie without mentioning the fact that \"when love is gone\", the song sung by scrooge's ex fiance belle, was cut from the theatrical cut due to being deemed too sad for children. the last minute decision resulted in an extremely jarring edit where scrooge and rizzo's reactions seem disproportionate to what was shown. the number was restored on the VHS, laserdisc, and first DVD release. however, it remains cut from most TV airings, the blu ray release, and the disney+ plus, although it is available as a bonus feature on disney+. \n\n3: the film was originally planned to be a TV special before being changed to a theatrical release. despite solid critical reviews, the film opened in sixth place during the 1992 holiday box office. many attribute this to the film facing competition from home alone 2 lost in new york and Aladdin. \n\n2: there were two songs that were cut from the movie but do appear on the soundtrack. the first is \"room in your heart\" which is sung by bunsen honeydew and beaker as the charity workers. the second is \"chairman of the board\" which is sung by sam the eagle as scrooge's headmaster. both songs were cut before production began and the only evidence of their existence is their appearance on the soundtrack.\n\n1: despite being a largely faithful adaptation of a christmas carol, there are some very noticeable differences. in this film, jacob marley is split into two characters named jacob and robert marley. the characters of fan and ignorance and want are also absent. the crachits also have a second daughter named bellina, who is exclusive to this film.",
        "upvotes": 27,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1gwgsw5/20_fun_facts_about_the_muppet_christmas_carol/"
    },
    {
        "id": "1gvs4hg",
        "author": "Bitter_Owl1947",
        "title": "Is Whiplash musically accurate?",
        "content": "Deeply enjoy this movie but I am not as musically inclined as the characters in this movie, so I was wondering -- Is JK Simmon's character right when he goes on his rants? Is Miles Teller off tempo? Is that trombone guy out of tune in the beginning? Or am I as the average viewer with no musical background, just fooled into believing I'm not capable of hearing the subtle mistakes and thereby tricked into believing JK is correct when he actually isn't? Because that changes his character. Is he just yelling and intimidating because he thinks it'll make them better even though they're already flawless? Or does he hear imperfections?",
        "upvotes": 1572,
        "comments": 486,
        "media": null,
        "permalink": "/r/movies/comments/1gvs4hg/is_whiplash_musically_accurate/"
    },
    {
        "id": "1gwe52b",
        "author": "MustyMustacheMan",
        "title": "Anyone else remember this scene in Demolition Man, or am I losing it?",
        "content": "Hey there,\n\nI think I’m having my very own Mandela Effect right now.\n\nWe rewatched Demolition Man yesterday, and I could’ve sworn that, back in the 90s, when they defrost the Italian Stallion, they lower him into an orange/red liquid to reheat or bring him back to life after cutting him out of the ice. But in the version we watched, he just lays there. I searched the web for it, but the only clips I found were the same as what we saw on Blu-ray.\n\nAm I mixing up movies, or was this scene cut?\n\nThanks for the help.",
        "upvotes": 28,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1gwe52b/anyone_else_remember_this_scene_in_demolition_man/"
    },
    {
        "id": "1gvqi1f",
        "author": "johntentaquake",
        "title": "15 Years of Fantastic Mr. Fox and the Quest for Affirmation",
        "content": "",
        "upvotes": 1427,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Jm_M1EkFh9JHDITgi85SH0Lr9LYHecW0mVj-r9Ztg10.jpg?auto=webp&amp;s=3c043c083a8e79d000fba4ec771d3a12bf736255"
        },
        "permalink": "/r/movies/comments/1gvqi1f/15_years_of_fantastic_mr_fox_and_the_quest_for/"
    },
    {
        "id": "1gvu7d9",
        "author": "BunyipPouch",
        "title": "'Succession' Star Alan Ruck Joins Marc Maron's Dark-Comedy Drama 'In Memoriam' - The story of a veteran Hollywood actor (Maron) who becomes obsessed with securing a spot in the Academy Awards’ “In Memoriam” montage after receiving a terminal cancer diagnosis",
        "content": "",
        "upvotes": 786,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L9Ntf5AEzjK_iaMEflEr8z8rLzjziQRPPIUdox8Uxlg.jpg?auto=webp&amp;s=20ffbe37c1ed896a77fc46509035ea3d9980bbdb"
        },
        "permalink": "/r/movies/comments/1gvu7d9/succession_star_alan_ruck_joins_marc_marons/"
    },
    {
        "id": "1gw87gx",
        "author": "Kind_Mastodon_1585",
        "title": "‘Night Is Not Eternal’ Review: Nanfu Wang’s HBO Doc Is a Sharp, Timely Examination of the Fight Against Fascism\n",
        "content": "",
        "upvotes": 67,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RQ3Ve-0TL7DbywDnMVINzHZPGoRaDmwcpkvRJzMjozw.jpg?auto=webp&amp;s=a4a51abe1618b5e8a2fe871d89289587a3d00fc5"
        },
        "permalink": "/r/movies/comments/1gw87gx/night_is_not_eternal_review_nanfu_wangs_hbo_doc/"
    },
    {
        "id": "1gvtcy6",
        "author": "TheMirrorUS",
        "title": "Allan Svensson, beloved Disney and Pixar star, dead at 73 after cancer battle",
        "content": "",
        "upvotes": 559,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vE0nSOmXbr8Ie_Wz85KLG_3LigojlbLTaEtiRE8g8BU.jpg?auto=webp&amp;s=e02274588a3b488d1dbd1ad0e8cd5623ccbdc992"
        },
        "permalink": "/r/movies/comments/1gvtcy6/allan_svensson_beloved_disney_and_pixar_star_dead/"
    },
    {
        "id": "1gwev8d",
        "author": "TodaysRedditor",
        "title": "The Army of Darkness(1992) alternate ending?",
        "content": "Hey all,\nI recently watched the Army of Darkness on a streaming service and the ending was different from what I remember seeing on VHS back in the day.\n\nIn this version, when Ash takes the drops, he goes to sleep and then wakes up and is back at work. Then he gets attacked by a witch there.\n\nThe ending I remember is that when he starts taking the drops, there is a rock tumbling sound that distracts him and he takes one drop too many, making him sleep too long. When he wakes up, the world has clearly suffered an apocalypse or nuclear war or something. And then he screams \"I slept too long!\" The End. \n\nDoes anyone else remember that second ending?",
        "upvotes": 13,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1gwev8d/the_army_of_darkness1992_alternate_ending/"
    },
    {
        "id": "1gvyobn",
        "author": "jcheese27",
        "title": "Baseketball is the best Sports Satire ever.",
        "content": "Some day coop, I'm gonna be a big sports star\n\nNo Shade to Dodgeball, but Baseketball has the title.\n\n* Matt and trey wrote a great script that doesn't really punch down at all and ages well. Upon rewatch - each scene seemed not just to be funny but compelling. All the way through the end with the Malakalaka board and i find myself actually getting teared up when Coop gets the replacement Lazy boy from the kid.\n* The team gimmicks are amazing.\n* A movie of its era but still feels relevant - the soundtrack is silly and the house band is Reel Big Fish - Cuz ska was having \"a moment\"\n* Watching the first scene with the voiceover about how sports suck now cutting to coop peeing in the bushes is actually great... especially with the one football player jumping around that stuff has obly gotten more prevalent.\n* The idea of the players moving around so much creating instability for the sport is *an ideal* that feels lost nowadays... Kinda like how we root for the Scabs but the whole movie is antiplayer empowerment... but they come together anyway\n* The invention of the game and the psyche-outs keep the game fun\n* Al michaels and bob Costa's are fucking hilarious in this.\n* Jenny McCarthy is in her bag\n* Ernest Borgnine is in his bag\n* Robert Vaughn feels born to play these types of characters\n* The Thematic teams are kinda hilarious\n* The thematic cheerleaders are : D\n* The hospital scene is hilarious. them drinking at the bar with the kid. Fantastic.\n* honestly it feels anything that didn't age well (it all did minus all the lil bitch jokes somewhat) all counterbalances with the Coop/doug Kiss at the malakalaka board\n* Also the \"Sports Scenes\" are fun to watch\n\nIf you don't go to bat for this movie - \"Your mother is a terrible cook\"\n\n  \nEdit: i forgot the \"massive Egos' scene and the car drive song.\n\nDouble edit - they didn't write it - David zucker and co did",
        "upvotes": 271,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1gvyobn/baseketball_is_the_best_sports_satire_ever/"
    },
    {
        "id": "1gw6hqa",
        "author": "Myrandall",
        "title": "How 3 words completely changed a character",
        "content": "",
        "upvotes": 54,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MpZbwPIH97439mRhluzl-bUuqxUOW6C-H5GipTTUv-8.jpg?auto=webp&amp;s=1470f50befaa1d6a153c3a83d1fb962b4b607154"
        },
        "permalink": "/r/movies/comments/1gw6hqa/how_3_words_completely_changed_a_character/"
    },
    {
        "id": "1gw7o0v",
        "author": "Sonia341",
        "title": "‘George A. Romero’s Resident Evil’ Documentary Releasing in January 2025",
        "content": "",
        "upvotes": 41,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m7SI5le1MuSxLxNvlwa6bsmCcBCSh11D2U5aIIrnogo.jpg?auto=webp&amp;s=58d0765129d303f9ebaeb382c6229a8847b4d7d1"
        },
        "permalink": "/r/movies/comments/1gw7o0v/george_a_romeros_resident_evil_documentary/"
    },
    {
        "id": "1gwjdoo",
        "author": "cmaia1503",
        "title": "Jesse Eisenberg Sets Next Directorial Effort, A Musical Comedy To Star Julianne Moore &amp; Paul Giamatti",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5vnYKFkFg2pdV87YVYDq_qajpCTxHvnUGhtV37VTx04.jpg?auto=webp&amp;s=5f0552963274dab8576ffe3e685d708b401e86b5"
        },
        "permalink": "/r/movies/comments/1gwjdoo/jesse_eisenberg_sets_next_directorial_effort_a/"
    },
    {
        "id": "1gwfwwd",
        "author": "AporiaParadox",
        "title": "Movie franchises with confusing timelines",
        "content": "The timeline in which movies come out and the actors age doesn't always match the in-universe passage of time, which can sometimes create continuity problems if the writers aren't paying attention or decide to ignore it for the sake of the story they want to tell. This is especially an issue with franchises with lots of prequels, time-skips, time travel, and reboots.\n\nThe X-Men movie franchise to me is the most infamous example. At first it was relatively straightforward, the first 3 movies are set at some point indeterminate the near future (the first movie came out in 2000), but then the prequels came out and time travel was introduced into the mix, and things became more convoluted, not helped by many contradictions and plot holes. The Deadpool movies naturally made fun of the whole thing while also making things even more convoluted.\n\nThen there's stuff like Fast and the Furious 3 retroactively being stated to take place between the 6th and 7th movie, because they wanted a character who was in that movie who died to still be around in later movies (only for that character to later be brought back to life anyway). This leads to the weirdness of a movie made in 2006 actually being set in 2014, so the models of cars and other technology portrayed seem very out of date in hindsight.\n\nSo what other movie series have confusing timeline issues?",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1gwfwwd/movie_franchises_with_confusing_timelines/"
    }
]