[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 492,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ijvfht",
        "author": "Internal_Deer_5324",
        "title": "Stop making documentaries about serial killers.",
        "content": "Making these documentaries is only giving what these murderer what they want… to be famous. They want to be immortalized by these terrible terrible acts, and these documentaries do exactly that. Please stop fulfilling the hopes of these wretched and vile transgressors.",
        "upvotes": 906,
        "comments": 165,
        "media": null,
        "permalink": "/r/netflix/comments/1ijvfht/stop_making_documentaries_about_serial_killers/"
    },
    {
        "id": "1ik3far",
        "author": "dailystar_news",
        "title": "Netflix star's mum brutally slaughtered in France as 'burglary goes wrong'",
        "content": "",
        "upvotes": 183,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1ik3far/netflix_stars_mum_brutally_slaughtered_in_france/"
    },
    {
        "id": "1ikbzs2",
        "author": "Dabomblol1231",
        "title": "Why doesn't Netflix see that shows that don't receive Stranger Things ratings can still be used as a way to grow their content library instead of just canceling them?",
        "content": "It seems pretty short-sighted to cancel shows just because they don’t pull in massive ratings like Stranger Things. With almost every major media company now running their own streaming service and fighting for subscribers, it’s more important than ever to have a variety of good content. Keeping shows with solid writing, even if they’re not huge hits, could help in the long run by pulling in niche audiences, keeping loyal fans around, and making the platform look better overall. Instead of only chasing big, instant successes, streaming companies should think about the long-term value of having a mix of different shows that keep people watching and stop them from canceling their subscriptions.\n\n",
        "upvotes": 32,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1ikbzs2/why_doesnt_netflix_see_that_shows_that_dont/"
    },
    {
        "id": "1iki5at",
        "author": "okaybhaii",
        "title": "What a lively movie! Isn't it? ✨",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/drp72vo3evhe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iki5at/what_a_lively_movie_isnt_it/"
    },
    {
        "id": "1ik59xa",
        "author": "valentaain",
        "title": "Anyone else totally obsessed with Psych?",
        "content": "A few months ago I was browsing through the homepage on my Netflix prolife and I found out *Psych*. It was and old show whit eight seasons, so I didn´t hit play in that moment... but something later tolde me to give it a try and I watched first episode.\n\nHonestly I think it is a super fun and really fast-paced show, really hilarious! It has a bit of everyting! I loved all the characters and it became an obsession to me. I0m currently finishing season 7 and every time I watc an episode I feel like I'm close to the end, that's make me feel sad :(\n\nIf you haven't watched it yet, I totally recommend it! And if you have, what did you think? Did you get as obsessed as I did?\n\nPS: I'm not really good writing in English so sorry If there is anything that is bad written ;)\n\nhttps://preview.redd.it/z254xtih4she1.png?width=718&amp;format=png&amp;auto=webp&amp;s=3536771552c5955d46c5a8f193b7f5a073a92f8b\n\n  \n",
        "upvotes": 41,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1ik59xa/anyone_else_totally_obsessed_with_psych/"
    },
    {
        "id": "1ijv5ef",
        "author": "Somethingman_121224",
        "title": "Streaming Giant Netflix Is Looking To Secure F1 Broadcasting Rights",
        "content": "",
        "upvotes": 152,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1ijv5ef/streaming_giant_netflix_is_looking_to_secure_f1/"
    },
    {
        "id": "1ijv56g",
        "author": "Whobitmyname",
        "title": "‘Dungeons &amp; Dragons: Honor Among Thieves’ Releases on Netflix on February 26.",
        "content": "",
        "upvotes": 150,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ijv56g/dungeons_dragons_honor_among_thieves_releases_on/"
    },
    {
        "id": "1ikfgv9",
        "author": "pocketfullofprose",
        "title": "Dark Forest Show?",
        "content": "A couple of years ago or so I got into a show about a small-town female detective with a few severed fingers from a traumatic incident in the dark woods in their town. Her trauma unfolds as other teenagers have traumatic events in the woods. I don't remember the title ... And I think it wasn't in English? Anyone remember anything like that?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ikfgv9/dark_forest_show/"
    },
    {
        "id": "1ikceyt",
        "author": "medinah66",
        "title": "Documentaries about the fall of a powerful man?",
        "content": "I've had this weird fascination with how men in positions of power get knocked off their pedestal. I just finished \"Madoff: The Monster of Wall Street\" and really loved it, so I'm looking for documentaries that are similar. Thanks in advance. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ikceyt/documentaries_about_the_fall_of_a_powerful_man/"
    },
    {
        "id": "1ikif7q",
        "author": "MusicInTheAir55",
        "title": "Subtitles suddenly oversized, cant watch any shows",
        "content": "Suddenly my subtitles are oversized, taking up much of the screen making shows unwatchable. \n\nhttps://preview.redd.it/anaz1yj6hvhe1.png?width=1762&amp;format=png&amp;auto=webp&amp;s=5ba5d9683b81f1bf9e755e7a4252c12083830f5c\n\nI have tried changing the subtitle size to small (was originally medium), but it made no difference. The problem appears on all titles that I have tested. \n\nWatching Netflix on Google Chrome Version 133.0.6943.59 (Official Build) (64-bit)  \nWindows 10 Pro",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikif7q/subtitles_suddenly_oversized_cant_watch_any_shows/"
    },
    {
        "id": "1ik6e6p",
        "author": "indiewire",
        "title": "Best New Movies Streaming on Netflix in February 2025",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ik6e6p/best_new_movies_streaming_on_netflix_in_february/"
    },
    {
        "id": "1ikgqs9",
        "author": "theRetr0",
        "title": "netflix philippines most titles suddenly disappeared",
        "content": "last night everything was fine now this morning im trying to watch the anime i downloaded and suddenly its not available i check the home page and even the kdrama and anime series and some movie titles on netflix has been gone can somebody check if this the case on some people ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikgqs9/netflix_philippines_most_titles_suddenly/"
    },
    {
        "id": "1ikeukb",
        "author": "aidanmansfield75",
        "title": "Snootworld",
        "content": "Hey guys, I was thinking about David Lynch's tragic recent passing and thinking about his unmade animated project called snootworld which he was trying to get out with Netflix. What exactly did we know about it? What was the animation style? What was the plot? Was it for children or adults? What were the exact details we knew?\nIf someone could make a list of what the project was supposed to be it would be endlessly interesting to read\nThanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikeukb/snootworld/"
    },
    {
        "id": "1ikbz3v",
        "author": "duffmanenthusiast",
        "title": "House MD Glitchy",
        "content": "Why is House MD so glitchy? It often skips over minutes and sometimes has a green screen when I unpause. This has never happened to me before. I'm assuming it's either because of my device or because of the way it was recorded to Netflix. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikbz3v/house_md_glitchy/"
    },
    {
        "id": "1ik9e1i",
        "author": "vickec07",
        "title": "Nothing loads around midnight",
        "content": "When i try to watch a show it just loads forever, the ui works and i can search for stuff but no media loads, not even trailers! I've only tried on the mobile app so far.\n\nIs this just for me?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ik9e1i/nothing_loads_around_midnight/"
    },
    {
        "id": "1ik8t22",
        "author": "missylyssy3210",
        "title": "New &amp; old All American cast thoughts?",
        "content": "What are your thoughts on the new cast and some of the old ones returning in the storylines they have in the next episodes",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ik8t22/new_old_all_american_cast_thoughts/"
    },
    {
        "id": "1ik27tm",
        "author": "Mary_Ellen_Katz",
        "title": "My shows keep automatically lowering their visual quality.",
        "content": "I watch netflix in a browser while I play games sometimes. I've noticed when I do this the quality of my show tanks in visual quality. Starting at 1080p, and shriving up to as low as 480p. I've tried to get it to stop via the settings, but I can't seem to do it. Anyone got any ideas?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ik27tm/my_shows_keep_automatically_lowering_their_visual/"
    },
    {
        "id": "1ijygkh",
        "author": "Miserable-Penalty-54",
        "title": "Barbarians",
        "content": "Hi everyone, I have a question about a netflix show that I really liked, barbarians.\nI finished the first two seasons in no time and the final episode left me dangling and I would like to know if there is going to be a New season.\nI've recently read on the web that the series has been \"renewed\" (source: rotten tomatoes, an article from 2 weeks ago), please let me know anything.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ijygkh/barbarians/"
    },
    {
        "id": "1ijjysf",
        "author": "IshaanM8",
        "title": "Device not part of household on PC",
        "content": "# Your device is not part of the Netflix Household for this account is now happening on PC as well..\n\n  \nIt was good while it lasted as you could still use it as before on the laptop / desktop but the same issue that was happening on the phone, is now happening on PC.",
        "upvotes": 24,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1ijjysf/device_not_part_of_household_on_pc/"
    },
    {
        "id": "1ijt9jj",
        "author": "peoplemagazine",
        "title": "Little House on the Prairie's Dean Butler Addresses Differences in Netflix Reboot, Reveals Why It Will 'Never' Be Like the OG Series",
        "content": "",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ijt9jj/little_house_on_the_prairies_dean_butler/"
    },
    {
        "id": "1ik0t2q",
        "author": "HenkDeVries6",
        "title": "How to filter to only show Dolby Vision?",
        "content": "Is there a way to filter the Netflix library so only titles with 4K UHD Dolby Vision will show up? Is there a '4K Dolby Only' category? \n\nThanks in advance! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ik0t2q/how_to_filter_to_only_show_dolby_vision/"
    },
    {
        "id": "1ij3kyz",
        "author": "gbnewsonline",
        "title": "Netflix price rise coming to UK",
        "content": "",
        "upvotes": 133,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1ij3kyz/netflix_price_rise_coming_to_uk/"
    },
    {
        "id": "1ika7cu",
        "author": "DefinitionLate7630",
        "title": "What Is Belle Gibson’s DSM Diagnosis? Differential?",
        "content": "I know this is a true story, but I’m oblivious to this case; and I’m only on season 1,episode 2 of “Apple Cider Vinegar “ on Netflix. \n\nIs anyone else watching and also curious what possible diagnoses character (and real person) Belle Gibson might struggle with? \nMunchausen’s Syndrome w/other psychopathies-but which ones?  \n\nI’m currently watching without researching anything about the TRUE story. If you’re watching and wanna throw some idea’s &amp; theories at me, I’m gonna periodically check-in here.  \n\nHappy Netflixing!\nK",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ika7cu/what_is_belle_gibsons_dsm_diagnosis_differential/"
    },
    {
        "id": "1ijs6ks",
        "author": "FirTrader",
        "title": "My favorite show",
        "content": "I feel that “Black Mirror” has so much character creation and story to fit into each episode, that every second and every detail , of every scene, matters.  I know it is often dark, and has its fair share of gore, but I sure do love the series.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ijs6ks/my_favorite_show/"
    },
    {
        "id": "1ijk6lm",
        "author": "dragon-elbow-coal",
        "title": "Scooby-Doo! Mystery Incorporated on Netflix is NOT a prequel to Scooby-Doo, Where Are You!",
        "content": "I keep seeing on this sub that Scooby-Doo! Mystery Incorporated (SDMI) is a prequel to Scooby-Doo, Where Are You! (SDWAY), but I struggle to see how that could be the case. While the ending does reset Crystal Cove to a timeline where there was no influence from the Evil Entity—complete with the gang driving off into the sunset with a 1960s Hanna-Barbera-style laugh track—several inconsistencies prevent this from leading directly into the events of SDWAY.  \n\nFirst off, canonically, Coolsville has always been the gang’s origin. This has been consistent in nearly every Scooby-Doo movie and series until SDMI. Secondly, SDMI features a museum displaying the costumes of unmasked villains from SDWAY, suggesting that SDWAY already exists within the SDMI universe. Additionally, Fred and Daphne appear visibly shaken when they see a synthetic replica of Scrappy-Doo in the same museum, a direct reference to Scooby-Doo (2002).  \n\nFor SDMI to lead into SDWAY, the gang would have had to lose their memories—just like the other residents of Crystal Cove—which clearly does not happen. When they leave town for college, they still remember all their past cases, despite those events technically never having taken place in the new timeline. This means that the individuals who would have become villains in SDWAY lived different lives and never donned their infamous disguises.  \n\nIf anything, the ending of SDMI erases the events of SDWAY rather than setting them up. This would suggest that SDWAY is actually a prequel to SDMI, with the most likely sequel being What’s New, Scooby-Doo? (WNSD). However, due to the timeline alterations in SDMI, I’d rather view it as a standalone, non-canon series—or possibly part of a Scooby-Doo multiverse. Since Scooby-Doo is technically part of the DC Universe, the latter isn't entirely out of the question.  \n\nWhat are your thoughts? ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ijk6lm/scoobydoo_mystery_incorporated_on_netflix_is_not/"
    },
    {
        "id": "1ik394i",
        "author": "ChainBoring",
        "title": "low quality",
        "content": "why are specific movies in lower quality ?   \ni was watching squid game and i had no quality difference between my phone and my pc, but when i went to watch fast &amp; furious, the movie looked really blurry, almost like 480p on pc, but perfectly HD on phone, does anyone know why ? (i tried all of the fast &amp; furious saga and got the same results)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ik394i/low_quality/"
    },
    {
        "id": "1ijujs5",
        "author": "mynotell",
        "title": "netflix household wifi and lan",
        "content": "i have 2 devices:\n- tv connected via wifi in bedroom\n- pc connected via lan in gaming room\n\n\nboth use the same router\n\nstill netflix tells me, that one device doesnt belong to my household - wtf? they are literally 5 meter apart\n\n\nany way to fix that?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ijujs5/netflix_household_wifi_and_lan/"
    },
    {
        "id": "1iiz9pz",
        "author": "StarKCaitlin",
        "title": "Ben Affleck to Replace Matt Damon in Netflix Thriller ‘Animals,’ Gillian Anderson Joins Cast",
        "content": "",
        "upvotes": 115,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1iiz9pz/ben_affleck_to_replace_matt_damon_in_netflix/"
    },
    {
        "id": "1ik1bia",
        "author": "DFTS-ILLusionz",
        "title": "Unable to reset entire shows on smart tv.",
        "content": "\nLong story short - ADD A RESET OPTION MORONS. forcing users to log in to your website to reset shows on their phones and tvs is just stupid. \n\nMy autistic 2 yr old is obsessed with teletubbies and can’t watch the show without me going in and manually resetting every episode individually. Also he’s screaming while I’m doing this because he’s too young to understand why I keep changing the episodes and why the credits are up instead of the opening song. \n\nThe end credits screens are a laggy mess, there’s so many things loading at once, it will auto kick the curser to the rating options, and lag until the next episode timer runs out, making it impossible to click “watch credits” and then “reset episode” and then “next episode.”\nIt will literally just sit at the thumbs and wait for the next episode.. got the best internet.. new tv.. new router.. hardline to the tv.. it’s NETFLIX fault. Add a reset option you morons. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ik1bia/unable_to_reset_entire_shows_on_smart_tv/"
    },
    {
        "id": "1ijvxdl",
        "author": "Djordje101",
        "title": "Is it common for screen to glitch for couple of seconds while watching something",
        "content": "I was watching dexter recently (first season) and the screen happend to glitch rarely on tv, i rewind it in case if it is me but no it isn’t. It is like the video format is that way. So i wanna ask is this common with some other shows.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijvxdl/is_it_common_for_screen_to_glitch_for_couple_of/"
    }
]