[
    {
        "id": "1ixasl0",
        "author": "BunyipPouch",
        "title": "Join us Thursday 2/27 at 3 PM ET for a live AMA/Q&amp;A with Osgood Perkins, director of 'The Monkey' and 'Longlegs' here on /r/movies.",
        "content": "",
        "upvotes": 35,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s2e253bf35le1.png?auto=webp&amp;s=ab67d655eef98e61b877e9c8290ec0435d680697"
        },
        "permalink": "/r/movies/comments/1ixasl0/join_us_thursday_227_at_3_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1ixfgaj",
        "author": "SanderSo47",
        "title": "February 21-23 Box Office Recap: Despite repeating at #1, 'Captain America: Brave New World' collapses 68.3%, the third worst second weeekend drop in the MCU. Meanwhile, 'The Monkey' opens with $14 million, the second best debut in Neon's history.",
        "content": "https://preview.redd.it/xec8micb16le1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=cc9aaf2ff9ae07e359ef5b9d59ed8b9fd2eb6025\n\nWell, the inevitable happened. ***Captain America: Brave New World*** was still on the top spot, but it had one of the worst MCU second weekend drops. Neon decided to release ***The Monkey***, and it deliver their second biggest debut ever. The other newcomer was Zachary Levi's ***The Unbreakable Boy***, which unsurprisingly bombed.\n\nThe Top 10 earned a combined $71.1 million this weekend. That's up 38.6% from last year, when ***Bob Marley: One Love*** repeated atop.\n\nRepeating in the top spot, ***Captain America: Brave New World*** added $28.1 million this weekend. That represents a brutal 68.3% drop from its opening weekend. That's the third worst drop in the MCU, behind ***Ant-Man and The Wasp: Quantumania*** (69.9%) and ***The Marvels*** (78.1%). This drop is insane, considering there wasn't much competition this weekend. But it's a sign that its weak word of mouth is already spreading.\n\nThrough ten days, the film has made $141.1 million. Its opening weekend was $18 million behind ***Quantumania***, and now its numbers are $26 million behind. That gap is only gonna get wider. $200 million is dead for this film, and it could also miss $190 million at this point. That's gotta hurt.\n\nDebuting in second place, Neon's ***The Monkey*** earned $14 million in 3,200 theaters. This is Neon's second biggest debut ever, just behind ***Longlegs*** ($22.4 million). Kinda crazy to think Osgood Perkins now has the top 2 debuts for Neon. It's also the best horror debut of 2025 so far.\n\nAll in all, this is a great start. Neon mounted a very successful marketing campaign, which was reportedly relying on digital ads. While horror titles often cost $40+ million to market, Neon kept things simple: they spent just $10 million in prints and advertising. A sign that a film doesn't need to spend a lot on marketing to open this high. Neon also emphasized the connections to ***Longlegs***, which was a smart call, and also highlighting Stephen King's involvement. Reviews were also good enough (78%) to convince others in giving this a chance.\n\nAccording to Neon, 58% of the audience was male, and 65% was 25 and over. They gave it a very middling \"C+\" on CinemaScore, which is also the same score for ***Longlegs***. That's not a death sentence for a horror tho; generally, these titles land in the C range. There's a lack of horror till ***The Woman in the Yard*** in late March. It won't hit ***Longlegs***' domestic total, but it should still hit $40 million, which is a big win for Neon.\n\nSony's ***Paddington in Peru*** added $6.5 million this weekend. That's a 49% drop, which is steeper than both prior films. Through ten days, the film has amassed $25.2 million and it's probably gonna miss $40 million if it continues dropping like this.\n\nDreamWorks' ***Dog Man*** dropped 40%, adding $5.8 million this weekend. That's still quite rough for an animated title. The film's domestic total stands at $78.7 million, and it looks like $100 million might be out of reach.\n\nIn fifth place, ***Ne Zha 2*** fell 59%, adding $3 million this weekend. Through ten days, the film has earned $14.8 million, but again, this market is not truly important for the film.\n\n***Heart Eyes*** had a boost last week thanks to Valentine's Day, but that's pretty much over. The film collapsed 73% this weekend, earning $2.7 million. The film has made $26.6 million, and it won't make it much further than $30 million.\n\n***Mufasa: The Lion King*** dropped 40%, adding $2.5 million this weekend. The film has made $245.4 million so far.\n\nIn eighth place, Lionsgate's ***The Unbreakable Boy*** debuted in 1,687 theaters, where it flopped with just $2.3 million this weekend. That's not a surprise, given how long it took the film to escape development hell; this was filmed back in 2020. Even with an \"A\" on CinemaScore, it's unlikely it lasts long in theaters. Another L for Zachary Levi.\n\nThe Indian film ***Chhaava*** added $1.5 million this weekend, which was just a 21% drop. The film has made $4.8 million so far.\n\nRounding up the Top 10 was Sony's ***One of Them Days***, which dropped 53%, grossing $1.3 million this weekend. With a $45.9 million domestic total, the film has now amassed a 4x multiplier. Truly impressive.\n\n***Love Hurts*** indeed. The film collapsed 74%, earning just $1.1 million this weekend. The film has earned a meager $14.5 million, and it doesn't have much gas left in the tank.\n\nQuiver Distribution released Martin Campbell's action thriller ***Cleaner*** in 378 theaters, and unsurprisingly, it flopped with $403,560. It will disappear quickly.\n\n#**OVERSEAS**\n\n***Captain America: Brave New World*** added $35.3 million this weekend, for a $289.5 million worldwide total. That's a steep 60%, and its numbers are $75 million behind ***Quantumania*** through the same point. The best markets are the UK ($16.7M), China ($13.5M), Mexico ($10.7M), Korea ($9.1M) and France ($8.9M). Without any other markets left, it looks like the film will struggle to hit $400 million worldwide. That's flop territory.\n\n***Bridget Jones: Mad About the Boy*** has now hit $72 million overseas. The best markets are the UK ($34.5M), Australia ($6M), Poland ($4.2M), Netherlands ($3.3M) and Spain ($1.9M). And it still has some big markets left.\n\n***Paddington in Peru*** added $7.7 million this weekend, and the film has crossed $150 million worldwide.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Nosferatu* | Dec/25 | Focus Features | $21,652,560 | $95,608,235 | $178,719,280 | $50M\n*Wolf Man* | Jan/17 | Universal | $10,897,495 | $20,707,280 | $34,383,593 | $25M\n\n- It was time for ***Nosferatu*** to turn off the lights in the Krusty Krab. The film has closed with a fantastic $95 million domestically and $178 million worldwide, easily becoming Robert Eggers' highest film. Just wonderful. Wonderful all around. Focus wants to stay in business with him, which is why they greenlit ***Werwulf*** for Christmas Day 2026.\n\n- Hey, we were just talking werewolves, what a coincidence. Universal/Blumhouse's ***Wolf Man*** has closed with a terrible $20.7 million domestically and just $34.3 million worldwide. That's a pathetic 1.90x multiplier, and it's crazy to believe it only made it to just four weeks in theaters. Blumhouse is known for printing money, but this was the rare theatrical flop. Leigh Whannell was unable to replicate the success of ***The Invisible Man*** here. The final nail in the coffin: ***The Invisible Man*** made more in its opening weekend ($28.2 million) than what ***Wolf Man*** did in its domestic lifetime. Ouch.\n\n#**THIS WEEKEND**\n\nWith the Oscars on Sunday, there's just one single wide release this weekend. And it may struggle to hit $10 million.\n\nIt's Focus Features' ***Last Breath***, which stars Woody Harrelson, Simu Liu, Finn Cole, and Cliff Curtis. The film is a remake of the 2019 documentary and tells the story of seasoned deep-sea divers who battle the raging elements to rescue a crewmate who's trapped hundreds of feet below the ocean's surface.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 354,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A9QzcjSZaTPiIXwP8dAtrb5ofcWvyvcYd0Ui4eP8wJ4.png?auto=webp&amp;s=c46a54072f88611f60e2bad440b61c27c23980d8"
        },
        "permalink": "/r/movies/comments/1ixfgaj/february_2123_box_office_recap_despite_repeating/"
    },
    {
        "id": "1ixoffx",
        "author": "PlayaSlayaX",
        "title": "Lucasfilm Boss Kathleen Kennedy Expected to Retire",
        "content": "",
        "upvotes": 1830,
        "comments": 666,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aEkhpSB9EXl92YshKa4I3BiZDnCjtC368TivE6pVy2o.jpg?auto=webp&amp;s=47ebfad2f6485529f7a699bb940db6c1c1fe3633"
        },
        "permalink": "/r/movies/comments/1ixoffx/lucasfilm_boss_kathleen_kennedy_expected_to_retire/"
    },
    {
        "id": "1ix8nls",
        "author": "MarvelsGrantMan136",
        "title": "First Image from Travis Knight's 'Masters of the Universe' Movie Starring Nicholas Galitzine as He-Man",
        "content": "",
        "upvotes": 6712,
        "comments": 923,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gsk2kry0o4le1.jpeg?auto=webp&amp;s=9c172a9a91be561b385160f47f3a627cedcf3f84"
        },
        "permalink": "/r/movies/comments/1ix8nls/first_image_from_travis_knights_masters_of_the/"
    },
    {
        "id": "1ixikpz",
        "author": "Clownshoes2022",
        "title": "Spielberg's Overlapping Dialogue Trick – Jurassic Park, Saving Private Ryan, and More",
        "content": "I’ve noticed a neat little trick Steven Spielberg uses in his movies, starting with *Jurassic Park*. There's a scene where Alan Grant is having raptors explained to him, while in the background, John Hammond is having a separate conversation. Both conversations are audible, but as the audience, you naturally focus on Grant’s, which is more relevant to the plot. This layering of dialogue makes the world feel more lived-in, like we’re overhearing real people rather than just following a scripted exchange.\n\nIn *Saving Private Ryan*, that moment with the translator, Upham, works similarly. His nervous, clumsy energy contrasts with Captain Miller’s (Hanks) composed discussion, reinforcing their dynamic. The overlapping dialogue makes it feel like you’re eavesdropping rather than being spoon-fed exposition, adding a level of realism that pulls you deeper into the scene.\n\nSpielberg does this in *Jaws*, too—think about Brody, Hooper, and Quint talking over each other on the boat. The chaotic energy makes their interactions feel natural and unfiltered, pulling us deeper into their world.\n\nIt’s such a clever way to enhance immersion without drawing attention to itself. Has anyone else noticed this in his other films? Would love to hear more examples!",
        "upvotes": 1603,
        "comments": 189,
        "media": null,
        "permalink": "/r/movies/comments/1ixikpz/spielbergs_overlapping_dialogue_trick_jurassic/"
    },
    {
        "id": "1ixl6v9",
        "author": "StumblinThroughLife",
        "title": "Old movies with dangerous “special effects” that weren’t special effects",
        "content": "Anyone ever watch an old movie (pre-60s) and wonder how they did that cool special effect but then you google it and find out it wasn’t an effect? They actually did that super dangerous thing, people got sent to the hospital, a crew person died, and the actors got cancer some years later, then you’re just like, oh 😳\n\nI can think of a couple like people actually trapped in a burning building, lots of real “almost hit by a train” scenes, the famous asbestos used as snow. What else you got?",
        "upvotes": 270,
        "comments": 341,
        "media": null,
        "permalink": "/r/movies/comments/1ixl6v9/old_movies_with_dangerous_special_effects_that/"
    },
    {
        "id": "1ixc42c",
        "author": "MatthewDM111",
        "title": "I rewatched Children of Men last night. The ceasefire scene is so intense and emotional. I can't think of comparable scenes in other movies. Would love to hear some suggestions.",
        "content": "https://youtu.be/YBzWTIexszQ?feature=shared\n\nThese scene is just so well done. The intensity of urban warfare contrasted with the innocence of an infant's cry is surreal.  And the reaction of everyone from the bystanders, to the revolutionaries, to the soldiers is all very human and an eerily similar bewilderment. Every time I watch it I get chills.",
        "upvotes": 671,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VC8EekPgIo34ex2_MN0nxG8Mr7JgpeLhaq8lF7jWW88.jpg?auto=webp&amp;s=31d0f0c0dc3f4e6074d2353d8e502641d83f7baa"
        },
        "permalink": "/r/movies/comments/1ixc42c/i_rewatched_children_of_men_last_night_the/"
    },
    {
        "id": "1ix52m0",
        "author": "uponthecityofzephon",
        "title": "Are there any movies about professional assassins who are NOT betrayed and targeted by their own organization?",
        "content": "Just from memory, the following features assassins betrayed by their own kind, and forced to fight against their own agency.\n\nImportant caveat, I'm only listing movies in which the assassin is the protagonist, not movies where the primary focus is on stopping an assassination (Day of the Jackal, etc.)\n\nGhost Dog (1999)\n\nJason Bourne (2002- plus however many sequels)\n\nKill Bill (2003-2004)\n\nMr. and Mrs. Smith (2005)\n\nHitman (2007)\n\nWanted (2008)\n\nIn Bruges (2008)\n\nThe American (2010)\n\nJohn Wick (2014 plus sequels)\n\nPolar (2019)\n\nGunpowder Milkshake (2021)\n\nThe Gray Man (2022)\n\nThe Killer (2023)\n\nHit Man (2023- not even an actual assassin, but he still gets betrayed by his superiors)",
        "upvotes": 1070,
        "comments": 473,
        "media": null,
        "permalink": "/r/movies/comments/1ix52m0/are_there_any_movies_about_professional_assassins/"
    },
    {
        "id": "1iwxk44",
        "author": "Robemilak",
        "title": "First official poster for Ron Howard’s upcoming survival thriller, EDEN. The film stars Sydney Sweeney, Ana de Armas, Vanessa Kirby, Jude Law and Daniel Brühl.",
        "content": "",
        "upvotes": 3979,
        "comments": 525,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8vcqdbt5v1le1.jpeg?auto=webp&amp;s=eb748636ce95f1e746bdb425d54affb4391df4ab"
        },
        "permalink": "/r/movies/comments/1iwxk44/first_official_poster_for_ron_howards_upcoming/"
    },
    {
        "id": "1ix9cmc",
        "author": "sidroy81",
        "title": "SE7EN &amp; How 35mm Scans Lie to You",
        "content": "",
        "upvotes": 475,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OsTN8bjtFQIH6zYxbj7NYkdFhlq07mW1VFXj3HXLXvo.jpg?auto=webp&amp;s=618af278d5e68d9ad1b452f4be7d1c6c6974aa01"
        },
        "permalink": "/r/movies/comments/1ix9cmc/se7en_how_35mm_scans_lie_to_you/"
    },
    {
        "id": "1ixpk10",
        "author": "nuttybudd",
        "title": "The opening scene in Cliffhanger (1993), a harrowing scene that was shocking for people who thought it would just be a run-of-the-mill \"action hero saves everyone\" movie with Sly Stallone.",
        "content": "",
        "upvotes": 43,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yLRWS7TJt6T21bf8MjcfrQMOH4-zkcivcRDTqcnAmCI.jpg?auto=webp&amp;s=e0e4129267899c9bcc12dfd93acc3c157f0a9019"
        },
        "permalink": "/r/movies/comments/1ixpk10/the_opening_scene_in_cliffhanger_1993_a_harrowing/"
    },
    {
        "id": "1ixbd85",
        "author": "NoCulture3505",
        "title": "J.K. Simmons Reteams With Brad Pitt &amp; David Ayer For Paramount’s ‘Heart Of The Beast’",
        "content": "",
        "upvotes": 292,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sPvSy9Ulg-46o2Al8G1TbBPnlC1w7V-Tm-BLpaIYJcU.jpg?auto=webp&amp;s=b23ce7f644566a36317690c403c0a1348eb93e54"
        },
        "permalink": "/r/movies/comments/1ixbd85/jk_simmons_reteams_with_brad_pitt_david_ayer_for/"
    },
    {
        "id": "1ixbvh1",
        "author": "Laurie_Barrynox",
        "title": "\"Unforgiven\" (1992) - What is your assessment on Sheriff Bill Daggett (Gene Hackman): a guy trying his best to keep the peace or a sadist who took delight in torture?",
        "content": "I was pleased when Gene Hackman won the Academy Award because  Bill Daggett isn't a easy character because of his complexity as an amoral character, he's someone who's trying to end the problem by not bringing justice against the men who scarred a local prostitute, because he's afraid of the impact it will degenerate, yet the more he insists on going after the vigilantes the prostitutes pay for, the more cruel and psychotic he becomes, getting to the point you just realize he's a bad guy. \n\nYes, you do see Bill is problematic early on, when he shuts down Alice (Frances Fisher), and he gets worse and worse. The glee he gets from torturing English Bob (Richard Harris) and Ned Logan (Morgan Freeman) is where you truly see the monster he is. \n\nIt's also curious how Will Munny (Clint Eastwood) is the former murderer who is reformed and is currently a widowed family man who has enough empathy to comfort Delilah (Anna Thomson), the victim of the slashing, whereas Bill Dagger, the law of the land, is sparing criminals and killing anyone who tries to avenge the victim of a knife attack.",
        "upvotes": 210,
        "comments": 114,
        "media": null,
        "permalink": "/r/movies/comments/1ixbvh1/unforgiven_1992_what_is_your_assessment_on/"
    },
    {
        "id": "1ixea7k",
        "author": "MiserableSnow",
        "title": "Revelations | Official Teaser | Netflix (from the director of Train to Busan)",
        "content": "",
        "upvotes": 99,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aUN1aQETSt0cLfLseJSpP5jMxC6512afnWBl8F5kDOs.jpg?auto=webp&amp;s=fa271cbd1b8ff992c739fa6a3251cb846c8c0e10"
        },
        "permalink": "/r/movies/comments/1ixea7k/revelations_official_teaser_netflix_from_the/"
    },
    {
        "id": "1ixixt9",
        "author": "Neat_Attitude_1644",
        "title": "Yesteryears doom and gloom that now seem innocent and nostalgic.",
        "content": "Rewatched The Net the other day and going to rewatch Enemy of the State tonight.\n\nIt’s a broad subject but anyway, what seemed totally out there movie (or tvseries) wise back in the day that now seems quaint?\n\nBlack mirror is up there but fairly new. I liked the Xfiles episode “Kill Switch” (yes I’m old). But let’s try and stick to movies \n\n\n\n",
        "upvotes": 43,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1ixixt9/yesteryears_doom_and_gloom_that_now_seem_innocent/"
    },
    {
        "id": "1ix8ea3",
        "author": "NoCulture3505",
        "title": "Eddie Redmayne, Tessa Thompson And Patsy Ferran To Star In Charlie Kaufman’s Next Film ‘Later The War’",
        "content": "",
        "upvotes": 125,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IsdS-fDMbRVbFd0VwZ25yjYmLzOBZSkRZZq4tB0BMWk.jpg?auto=webp&amp;s=1c901a42172738091fb1c2357d63f1a4c95592c5"
        },
        "permalink": "/r/movies/comments/1ix8ea3/eddie_redmayne_tessa_thompson_and_patsy_ferran_to/"
    },
    {
        "id": "1ixc7s2",
        "author": "NephewChaps",
        "title": "What is your favorite movie poster?",
        "content": "Not necessarily your favorite movie poster, but the poster you think it's overall the best for whatever reason you choose\n\nMine particularly is the [Pulp Fiction one](https://acdn-us.mitiendanube.com/stores/593/401/products/c0029-pulp-fiction-1994-041-842ad43995838e781e15096674148549-1024-1024.jpg). So damn iconic, no wonder I have it framed in my bedroom\n\nWhat is yours?",
        "upvotes": 68,
        "comments": 157,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wjVxByyiPQoVZOkx2p94VOJezhCBO1qEyBy4sXf5gBI.jpg?auto=webp&amp;s=be55da85cd5c3da03e425fc899a05430d8acc734"
        },
        "permalink": "/r/movies/comments/1ixc7s2/what_is_your_favorite_movie_poster/"
    },
    {
        "id": "1iwv076",
        "author": "JJLong5",
        "title": "Kristen Bell Sings “Do You Want to be an Actor?” | The 31st Annual Screen Actors Guild Awards",
        "content": "",
        "upvotes": 876,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vHQLJ3ziy59hpMsYSfo1KawAtFsGBbfcSeOC5wVvYpg.jpg?auto=webp&amp;s=e732e357d6b9ba6e12f7673227b09d61ba0d8c48"
        },
        "permalink": "/r/movies/comments/1iwv076/kristen_bell_sings_do_you_want_to_be_an_actor_the/"
    },
    {
        "id": "1ixhmtv",
        "author": "aureum_pelagic",
        "title": "Movies like The Adventures of Baron Munchausen",
        "content": "Love the style, can't find much else like it. I've watched The Fall, didn't like The Imaginarium of Doctor Parnassus even if it does the look, and I'm sure there's a lot of movies that sort of have that same 'old-strange' feel I'm just not aware of.\nWhile the 90's Robin Williams Toys film is on the backlog and a fine suggestion, this is more something along the lines of... if you took a museum, had a photo spree along it, and used all those images to make something entirely new and unabashedly weird. Yes, Night at the Museum is peak fiction. ",
        "upvotes": 27,
        "comments": 55,
        "media": null,
        "permalink": "/r/movies/comments/1ixhmtv/movies_like_the_adventures_of_baron_munchausen/"
    },
    {
        "id": "1iwsao9",
        "author": "no_longer_huhmann",
        "title": "2025 SAG Awards Winners List: Timothée Chalamet and Demi Moore Win Top Prizes",
        "content": "",
        "upvotes": 1258,
        "comments": 224,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Sz_HvQw61TwGQxHIOlRArmwSToHGpU5hcbWi4gZVn5c.jpg?auto=webp&amp;s=f9c325082a29447464865e1d3ff5d2bc76596ca5"
        },
        "permalink": "/r/movies/comments/1iwsao9/2025_sag_awards_winners_list_timothée_chalamet/"
    },
    {
        "id": "1ix4uro",
        "author": "dulldyldyl",
        "title": "Watched Threads (1984) last night.",
        "content": "I typically enjoy watching uncomfortable movies, but Threads was on another level. This was one of the few times I found myself just waiting for it to end—not because it was bad, but because it was that bleak and overwhelming. The sheer hopelessness, the raw depiction of nuclear devastation, and the complete collapse of society make it one of the most unsettling films I’ve ever seen.\n\nAnd yet… I loved it. It’s rare for a movie to hit that hard and leave me feeling awful for days afterward, but Threads absolutely nailed it. It’s easily one of the most effective and terrifying pieces of media I’ve ever sat through.\n\nAnyway, going to watch some uplifting movies this week, I need something positive to cleanse my palate. Feel free to suggest something.",
        "upvotes": 115,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1ix4uro/watched_threads_1984_last_night/"
    },
    {
        "id": "1iwqr0j",
        "author": "no_longer_huhmann",
        "title": "VFX Giant MPC and Parent Company Technicolor May Shut Down Amid ‘Severe Financial Challenges’",
        "content": "",
        "upvotes": 1078,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gU8J1pecKcnVuF-GbCBUYti2xDCTNotxW2uGZTzTRsw.jpg?auto=webp&amp;s=68f25e47309aa7185d1aa171f90a9a0fad6e0938"
        },
        "permalink": "/r/movies/comments/1iwqr0j/vfx_giant_mpc_and_parent_company_technicolor_may/"
    },
    {
        "id": "1ix5il3",
        "author": "Blames_Jake",
        "title": "Mike and Jay Talk About The King Tide",
        "content": "",
        "upvotes": 75,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BLFeLq2BcDdD4RB0LTA4AxP5TjRtMrM2JiIoWm7uufQ.jpg?auto=webp&amp;s=2a717eef646db531acb6790285ceec5a78b24375"
        },
        "permalink": "/r/movies/comments/1ix5il3/mike_and_jay_talk_about_the_king_tide/"
    },
    {
        "id": "1ixngz2",
        "author": "Living_Technician522",
        "title": "Coverup 1980’s",
        "content": "There was a documentary in the eighties called coverup about the Iran contra affair and I can’t seem to find it anywhere. I saw it at a theater in Berkeley ca in 1988 and have not been able to find it since. Any clues would be great. I know this film is one of the things that broke the scandal wide open. ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ixngz2/coverup_1980s/"
    },
    {
        "id": "1iwzzkl",
        "author": "Life_Of_Smiley",
        "title": "Films about male struggles",
        "content": "I teach High School English and I am about to do a short unit on Film Analysis. I am open to suggestions on movies that are appealing to G11/12 students and, since most of my class are male, I would like to hear suggestions on films that address male struggles, males as cannon fodder, etc. Any ideas? TIA",
        "upvotes": 145,
        "comments": 574,
        "media": null,
        "permalink": "/r/movies/comments/1iwzzkl/films_about_male_struggles/"
    },
    {
        "id": "1iwhl87",
        "author": "indiewire",
        "title": "Martin Scorsese Petitions to Save Rome’s Cultural Venues — Including 50 Movie Theaters",
        "content": "",
        "upvotes": 2753,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-GUD5bHXhB73Ehnhhv2y80_HVCxzMUTsxvgYHkbnoL4.jpg?auto=webp&amp;s=3aafaae5f3751ddb8ad7a4b63b36a2afe57c896b"
        },
        "permalink": "/r/movies/comments/1iwhl87/martin_scorsese_petitions_to_save_romes_cultural/"
    },
    {
        "id": "1ixb3il",
        "author": "precita",
        "title": "What do you consider an \"old movie\" nowadays?",
        "content": "So somehow, we're now in the far flung future of 2025. Back when I was a kid, an \"old movie\" typically meant a black and white movie from the 30's, 40's, 50's, etc. Even 60's and early 70's movies seemed \"old\" back then when we were in the 90's.\n\nHowever, we're now....somehow, in the far flung future of 2025. That means 80's movies are now over 40 years old and 90's movies are over 30 years old. For a teen growing up today, a movie that came out in 2005 like Batman Begins would be considered \"the old Batman movie.\"\n\nSo what do you consider an old movie these days?",
        "upvotes": 29,
        "comments": 149,
        "media": null,
        "permalink": "/r/movies/comments/1ixb3il/what_do_you_consider_an_old_movie_nowadays/"
    },
    {
        "id": "1ixcz0k",
        "author": "BunyipPouch",
        "title": "Join us Tuesday 2/25 at 5:00 PM ET for a live AMA/Q&amp;A with Jeremy Lalonde and Matthew Dressel, the director and writer of 'Daniel's Gotta Die' - After his father's death, Daniel’s plan to reconnect with his family hits a snag when he discovers they all want to kill him to claim the inheritance.",
        "content": "",
        "upvotes": 17,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ru2xgvnwi5le1.jpeg?auto=webp&amp;s=7203ea21e566ed3a9681a02a38fd8d95d7493fbb"
        },
        "permalink": "/r/movies/comments/1ixcz0k/join_us_tuesday_225_at_500_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1iwofgw",
        "author": "Kyas13",
        "title": "Which actor or actress has the most onscreen kills across all of their projects?",
        "content": "I was watching The Matrix lobby scene and thought, wow, considering John Wick,Keanu has killed a lot of people in his movies. I’m curious what other actors might fit that description.  And I am specifying “onscreen” kills to try and limit answers like thanos or blowing up Alderaan.   I also want to limit the scope to only include movies and not TV shows.  Or perhaps you can answer with only tv shows.  And not movies…………………………………………………",
        "upvotes": 660,
        "comments": 611,
        "media": null,
        "permalink": "/r/movies/comments/1iwofgw/which_actor_or_actress_has_the_most_onscreen/"
    },
    {
        "id": "1iwt8gy",
        "author": "CorpseGirl-UwU",
        "title": "What is the worst movie that you love?",
        "content": "I love a lot of so bad it's good movies like Neil Breen's stuff, The Room, etc. but for this question I would have to go with Freddy Got Fingered. I have a bad movie night pretty often where I invite all my friends over to come drink and watch bad movies and we've watched FGF multiple times over the years, it always gets the best reactions lol.\n\nEdit: if any of y'all are in DFW and interested in coming to a future bad movie night let ya girl know! I'm about to head to bed but it's been nice talking about bad movies with y'all :) ",
        "upvotes": 287,
        "comments": 1339,
        "media": null,
        "permalink": "/r/movies/comments/1iwt8gy/what_is_the_worst_movie_that_you_love/"
    },
    {
        "id": "1ix4y0u",
        "author": "PreparationNorth2426",
        "title": "Riddick: Furya - what’s the status?",
        "content": "Does anyone have any idea as to the current status of this project? Despite some social media activity from Vin Diesel back in August 2024 that indicated filming had begun, complete with a couple of set photos, there seems to be remarkably little information out there about this one.\n\nThere’s very minimal crew information available out there across any area of the production, no cast has been announced beyond Diesel, and the general vibe I get is that it’s either a very, very small independent production or that some sort of finance issue delayed the project after a short period of time.\n\nI’d be curious to know if anyone has any thoughts?\n\n",
        "upvotes": 29,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1ix4y0u/riddick_furya_whats_the_status/"
    },
    {
        "id": "1ixla09",
        "author": "violetkiwii",
        "title": "Looking for older bee venom documentary/documentary-series",
        "content": "\nIt was probably around 2000-2009, I had seen this docu (probably on PBS) that was about people with neurological disorders (multiple sclerosis?) being treated with bee venom from live stings. I tried to google it and I find some docs but I feel like the dates are too recent as I’m sure I saw this doc as a teen. Maybe I’m wrong. What I can definitively remember is a woman who looked to be in her home and visited by a doctor was being stung by a bee that was held in tweezers/tongs. Multiple bees per session. Camera captured the stingers being stuck in her skin, released from the bees. \nEvery few years I think of this scene and wish I knew the name of it. \nCan you help me find its name? Thanks in advance!\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ixla09/looking_for_older_bee_venom/"
    }
]