[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 505,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jxgd7w",
        "author": "Legitimate_Ad3625",
        "title": "‘They’ve Completely Got It Wrong’: Stephen Graham Speaks Out on Deliberate Misreadings of Adolescence",
        "content": "",
        "upvotes": 91,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1jxgd7w/theyve_completely_got_it_wrong_stephen_graham/"
    },
    {
        "id": "1jxv6dj",
        "author": "dcrad91",
        "title": "Just got an ad on ad free sub",
        "content": "Just had an uber eats ad pop up on my ad free sub of netflix that I've had for YEARS. Makes me never wanna use uber eats too. \n\n  \nAnyone else get any recently? ",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jxv6dj/just_got_an_ad_on_ad_free_sub/"
    },
    {
        "id": "1jx7q7s",
        "author": "starcityguy",
        "title": "Just finished Adolescence",
        "content": "Really was not sure what to make of the show at first.  Told my friend after two episodes it’s either the dullest thing I have seen or it’s brilliant.  I just wasn’t sure which, but I kept watching.  \n\nMidway through episode 4 it hit me that I was watching something closer to a play than a tv show.  A play with four acts.  Each act presented in one take.  And I decided it’s brilliant.  Not for everyone, but the end of episode 4 clinched it for me.  ",
        "upvotes": 276,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1jx7q7s/just_finished_adolescence/"
    },
    {
        "id": "1jxll0f",
        "author": "ThatLady0402",
        "title": "The Residence/I identified the murderer for a reason that was never mentioned!",
        "content": "SPOILER\n\nWhen everyone was finally allowed to leave the White House and Cordelia was walking through the crowd, everyone looked angry and gave her either a dirty look or at least an unhappy one. Of course they did, they were all tired and pissed that she’d kept them there so long. Only one person gave her a smile. That was the moment I put my money on the person.\n\nI waited for this to be part of the big reveal, but it never came!! \n\nAnyone else pick up on that too?",
        "upvotes": 22,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jxll0f/the_residencei_identified_the_murderer_for_a/"
    },
    {
        "id": "1jy3brb",
        "author": "cigaretteagent",
        "title": "Wtf is the home Wi-Fi nonsense with Netflix India",
        "content": "Guys watching Netflix India. Did you get a message about how you have 14 days to “verify your home Wi-Fi” or something? They’re getting very greedy. what is the point of me paying for 4 devices if they restrict my usage to one household. Like what sorta fucked up rule is this? They really think 4 family members will sit in 4 different rooms and watch crap on their platform? I’m so pissed off. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jy3brb/wtf_is_the_home_wifi_nonsense_with_netflix_india/"
    },
    {
        "id": "1jy31dr",
        "author": "stormy_kaktus",
        "title": "On my profile it says “There is a problem connecting to Netflix.”",
        "content": "This only happens on my profile and not my moms or brothers. \nFor some context; I am out of the country so I can’t use another device to check if it’s bugging on that one too. I’m on iPhone if that helps ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jy31dr/on_my_profile_it_says_there_is_a_problem/"
    },
    {
        "id": "1jy2mtk",
        "author": "FirTrader",
        "title": "Best Show",
        "content": "I am ecstatic that Black Mirror released all of the season 7 episodes at once. Totally loving life, right now, as i’ve only finished 3 episodes. So far, the creators have done a great job of keeping this series fresh, interesting, and on-par with its incredible, previous seasons. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jy2mtk/best_show/"
    },
    {
        "id": "1jxp5fe",
        "author": "DaGroke",
        "title": "Just watched Million Dollar Secret — confused by the ending (spoilers)",
        "content": "Already posted this but it got removed for some reason.\n\nI just finished watching *Million Dollar Secret*, and the ending totally threw me off. Maybe I’m overthinking it, but I’d love someone to help clear it up.\n\nAt the end, only **Sam**, **Cara**, and **Correy** are left.  \n**Sam** doesn’t get to move any boxes, so she’s not important for this part.\n\n**Correy** thinks **Cara** has the money, but he wants to trick her into thinking he believes **Sam** has it.  \nSo when it's Correy’s turn to move the money, he moves it into **his own box**, thinking he successfully tricked Cara.\n\nThen it's **Cara’s** turn, and somehow she guesses correctly, moves the money back into **her** box, and wins.\n\nHere’s where I’m confused:\n\nIf Correy really thought he tricked Cara into thinking **he thought Sam had the money**, then he should’ve moved the money into **Sam’s box**. That way, if Cara believed the trick, she would’ve swapped **Correy’s** and **Sam’s** boxes — and Correy would end up with the money -- thinking she kept the money for herself (or she could have not moved the boxes at all). But instead, Correy moved the money into **his own box**, which only works if Cara *doesn’t* fall for the trick. So... mistake?\n\nBut Cara’s move doesn’t make perfect sense either.\n\nIf she truly thought Correy took the money from her, then logically, he would have put it into **Sam’s box**, she should’ve swapped **Sam’s** and **Correy’s** boxes — giving Correy the money.  \nInstead, she swapped **her** and **Correy’s** boxes, which happened to be the right move — but only if she thought Correy had the money in *his* box, not Sam’s.\n\nSo it seems like:\n\n* **Correy made a logic mistake** (he didn’t follow through with his own bluff properly).\n* **Cara may have made a mistake or just guessed right**, which canceled out Correy’s mistake and gave her the win.\n\nMy question is: how did *both* of them mess this up? These are smart people, and I get one of them making a mistake under pressure — but both? Were they overthinking it? Or was it possibly staged?\n\nIt’s been bothering me, so if I’m missing something or misunderstood their logic, please tell me.\n\n**TL;DR:**  \nCorrey tried to trick Cara but didn’t follow through on his own bluff properly. Cara made a move that only worked if Correy made a mistake — which he did. Somehow both of them made bad moves, but Cara still won. Did they both mess up, or was it staged?",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jxp5fe/just_watched_million_dollar_secret_confused_by/"
    },
    {
        "id": "1jxy7d9",
        "author": "Ok-Comfort-1700",
        "title": "What is that melody/song?",
        "content": "Does anybody know the name of the song/melody that plays during episode 7 of the “Greatest Events of WW2 in Color” between 25:40-28:02?  It’s very heroic and beautiful and they also play it around the end of the first episode, too.  But I can’t find it online and Shazam can’t read it.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jxy7d9/what_is_that_melodysong/"
    },
    {
        "id": "1jxpyoy",
        "author": "Optimal_Plum_1240",
        "title": "Need help finding title of a series",
        "content": "I remember watching it on netflix a couple years ago.\n\n\\- Its not in english but i feel like its european kinda sounded like polish but im not sure\n\n\\- Main character was a teenage boy in school\n\n\\- Something about a door in the ground leading to some other place\n\n\\- I think there was a girl later on\n\n\\- I think it was something about different dimensions which the door can lead to\n\nPlease help me find it.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jxpyoy/need_help_finding_title_of_a_series/"
    },
    {
        "id": "1jxj6q9",
        "author": "Ok-Data-7672",
        "title": "What are some German films on Netflix you would recommend I watch?",
        "content": "Hi everyone! I'm looking for German films—romantic, thriller, or adventure—that were released in the past two decades and truly left an impression on you. Any favorites you’d recommend? I’d really appreciate your suggestions. Thanks in advance!",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jxj6q9/what_are_some_german_films_on_netflix_you_would/"
    },
    {
        "id": "1jy0bng",
        "author": "3ndy_Man",
        "title": "Hello, new to this subreddit. While watching All Quiet on the Western Front, the subtitles caught me off guard. In these two scenes, Paul Bäumer ( The one carrying a person behind his back ) is shouting \"Sanitäter\" which means \"Doctor/Medic\", but as you can see, the subtitles are quite longer.",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jy0bng/hello_new_to_this_subreddit_while_watching_all/"
    },
    {
        "id": "1jxcj0i",
        "author": "Due-Beginning-1443",
        "title": "Is that Pop a baloon some kind of joke?",
        "content": "Who are these men, I hoped it will be some kind of cool dating show but these men are horrible. Outfits, attitude. Women are constantly joking around and I feel like no one is really serious - it’s not funny, it’s not entertaining. ",
        "upvotes": 16,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jxcj0i/is_that_pop_a_baloon_some_kind_of_joke/"
    },
    {
        "id": "1jxe066",
        "author": "HotAd4795",
        "title": "Million Dollar Secret",
        "content": "I just finished watching Million Dollar Secret, it was honestly one of the best reality games shows I’ve watched in a while, however, in the finale I thought Corey made a huge mistake when swapping the boxes. Let me explain…\n\nHe was right about convincing Cara that he swapped with Sam but if he wanted to follow through with that plan he should have swapped Cara and Sam’s boxes not his and Cara’s. He would then need Cara to swap Sam and his box  (thinking that they were both empty and she still has the million) for him to win. There is no situation where he would have won after swapping his box with either of them. If he swapped with Sam, Cara would have swapped them back leaving Sam the winner and if he swapped with Cara she would have taken it back. Therefore the odds were very heavily stacked against him and he messed up massively.",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jxe066/million_dollar_secret/"
    },
    {
        "id": "1jxrwow",
        "author": "roskylator",
        "title": "(sea beast) On what irl monarch they based on",
        "content": "Today i watch the sea beast and i have question. The queen have very simmilar appierience to Elizabeth I Tudor. And i am certain that the king is also based on real king but i am not sure witch one.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxrwow/sea_beast_on_what_irl_monarch_they_based_on/"
    },
    {
        "id": "1jwnkaz",
        "author": "dailystar_news",
        "title": "Adolescence series two in talks as Brad Pitt gets involved",
        "content": "",
        "upvotes": 412,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1jwnkaz/adolescence_series_two_in_talks_as_brad_pitt_gets/"
    },
    {
        "id": "1jxq54u",
        "author": "PugletQueen",
        "title": "Questions about TV show Mo",
        "content": " I think I have missed something in watching so maybe you can help.\n\nSo do olive thefts just stop after mexico situation.\n-How do they have money and nice place when no one working proper job?\n-What happen to chien and Dante.  Does Dante just leave him alone?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxq54u/questions_about_tv_show_mo/"
    },
    {
        "id": "1jxcmu4",
        "author": "prisongovernor",
        "title": "Olivia Colman to star in Netflix’s Pride and Prejudice written by Dolly Alderton",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxcmu4/olivia_colman_to_star_in_netflixs_pride_and/"
    },
    {
        "id": "1jxou1p",
        "author": "JekkeyTheReal",
        "title": "Flickering issues with pc app and edge",
        "content": "(win11)\n\nhaving issues with the netflix app and edge  \nwith hardware accel enabled my screen keeps flickering every few seconds with it disabled it doesnt flicker but image looks 720p\n\nrtx 2060, latest driver, gpu and monitor are hdcp ready\n\nchanging refresh rate or res does nothing (1440p 165hz and tried 1080p60)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxou1p/flickering_issues_with_pc_app_and_edge/"
    },
    {
        "id": "1jxt4tx",
        "author": "starlightskater",
        "title": "Netflix profiles vs streaming?",
        "content": "Thinking of springing for Standard that allows five profiles and two simultaneous streams. Does Netflix care what location those screens are streaming from? What's the thing about adding an extra person for $8.99? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jxt4tx/netflix_profiles_vs_streaming/"
    },
    {
        "id": "1jxlr9m",
        "author": "ThrowAwayAAHHAAAAAA",
        "title": "Even though I am back in my household the message won’t leave me alone!!!",
        "content": "I returned to my household after weeks of not being here and the message still keeps popping up…? Like Hello??? What else am I supposed to do? Move in with the router and become one with the signal?  ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jxlr9m/even_though_i_am_back_in_my_household_the_message/"
    },
    {
        "id": "1jwua7q",
        "author": "shimikobop",
        "title": "BAD INFLUENCE documentary",
        "content": "\nI just finished the documentary about Piper Rockelle and the ex SQUAD. I feel bad for Piper. She’s such a beautiful, talented little girl. She has so much potential but looking through her socials, it seems like she’s really manipulated by her mother and she believes that everyone who left her is the bad guy. She’s also been really acting inappropriately whilst being a minor. She had so many boyfriends and she doesn’t even delete the contents she made with them (ex bfs)\n\nI think her mom taking advantage of her would similarly lead to her like Sky Bri whose mom is very much supportive on her “career”. Piper also hangs out with OF creators like Sophie Rain which looks like foreshadowing of what she will choose to become when she turns legal age.\n\nLooking forward to her response to all the allegations when she turns 18. ",
        "upvotes": 69,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1jwua7q/bad_influence_documentary/"
    },
    {
        "id": "1jxau76",
        "author": "RedHeadRedeemed",
        "title": "My husband cried at Love on the Spectrum Season 3",
        "content": "So I have been with my husband almost a decade and I have only seen the man cry *once*. But she started watching Love on the Spectrum Season 3 and (spoilers) when Abbey sang her song to David my husband straight started CRYING y'all. Not sobs, but tears in his eyes, having to wipe his eyes and sniffling. He said it was the sweetest shit he has ever heard. This man didn't even cry at the birth of his own KID. The entire season we enjoyed watching; cheering for the couples we enjoyed. But he said the show is \"the most wholesome show he has ever seen\". Cheers to the people directing and on this show for making a man cry at the emotions of this show ❤️",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jxau76/my_husband_cried_at_love_on_the_spectrum_season_3/"
    },
    {
        "id": "1jxhw9w",
        "author": "Top-Three-USA",
        "title": "Finn Wolfhard Opens Up About the Emotional Complexity of ‘Stranger Things’ Ending: ‘I’m Happy, but I’m Also Very Confused’",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxhw9w/finn_wolfhard_opens_up_about_the_emotional/"
    },
    {
        "id": "1jx1nc5",
        "author": "ImaginativeHobbyist",
        "title": "\"Black Mirror\" Season 7 Posters by The Imaginative Hobbyist (Me)",
        "content": "",
        "upvotes": 16,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jx1nc5/black_mirror_season_7_posters_by_the_imaginative/"
    },
    {
        "id": "1jxg6ah",
        "author": "IrishStarUS",
        "title": "Netflix announces thrilling new drama from Dawson’s Creek star and fans 'can't wait'",
        "content": "",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jxg6ah/netflix_announces_thrilling_new_drama_from/"
    },
    {
        "id": "1jxfu0n",
        "author": "Jumpy-Beginning3686",
        "title": "Cobra kai",
        "content": "After watching the full cobra kai final season I need to change my negative review ; the last 3 episodes were on point ; closed the series perfectly. \n\nIn all it was a good tv series I do think they stretched it out a bit too much and at times ie the barcelona tournament part of s6 was dreadful. \n\nThe nostalgia,  humour and character were solid ; apart from Terry Silver his character is ridiculous and he had too much of a part . Would have been better just bringing him in for a few episodes ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jxfu0n/cobra_kai/"
    },
    {
        "id": "1jxdvh0",
        "author": "yumyumchacha",
        "title": "How to Sell Drugs Online: Season 4 | Review, 5 things I liked &amp; disliked",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxdvh0/how_to_sell_drugs_online_season_4_review_5_things/"
    },
    {
        "id": "1jxde3f",
        "author": "Sound_User",
        "title": "Downloading for offline.",
        "content": "Netflix says I can download because I have stuff downloaded on another device. \n\nDo they want me to fix my old phone to uninstall netflix? \n\nMy post is too short. So I would like to also ask is netflix just trying to get me to cancel? They already made it hard for me to watch with my mobile router.... ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jxde3f/downloading_for_offline/"
    },
    {
        "id": "1jx2ykt",
        "author": "BeeOk4748",
        "title": "How to disable play next on Netflix Tv?",
        "content": "Recently, it’s been bothering me a lot that autoplay of netflix just ends the episode immediately. Back then it didn’t bother me that much since I could just play back to the episode when Netflix was playing an episode in 20 seconds, but now it just outright ends the episode immediately, and sometimes I just wanted to watch the last part of that episode either for an outro I really like or a sneak peak or extra scene at the very end of that episode. I tried searching on how to turn it off, but nothing that I found was for a tv that had a different format. Can someone help me me please?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jx2ykt/how_to_disable_play_next_on_netflix_tv/"
    }
]