[
    {
        "id": "1h79rz4",
        "author": "Y2K-AMA",
        "title": "Hi /r/movies! I am Kyle Mooney, co-writer/director of Y2K, the new A24 movie in theaters Dec 6! Ask me anything!",
        "content": "",
        "upvotes": 2297,
        "comments": 654,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/42zmwq9ad15e1.png?auto=webp&amp;s=b1f3a7c349d03bf320df1ff0fd857c63048d5ebb"
        },
        "permalink": "/r/movies/comments/1h79rz4/hi_rmovies_i_am_kyle_mooney_cowriterdirector_of/"
    },
    {
        "id": "1h7ri90",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Y2K / Werewolves / The Return / Nutcrackers)",
        "content": "# Newly Released Movies\n\n[Y2K](https://old.reddit.com/r/movies/comments/1h7rhq7/official_discussion_y2k_spoilers/?)\n\n[Werewolves](https://old.reddit.com/r/movies/comments/1h7rhry/official_discussion_werewolves_spoilers/?)\n\n[The Return](https://old.reddit.com/r/movies/comments/1h7rht7/official_discussion_the_return_spoilers/?)\n\n___\n\n# Streaming Releases\n\n[Nutcrackers](https://old.reddit.com/r/movies/comments/1h7rhu2/official_discussion_nutcrackers_spoilers/?)\n\n___\n\n# Still in Theaters\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)",
        "upvotes": 24,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h7ri90/official_discussion_megathread_y2k_werewolves_the/"
    },
    {
        "id": "1h8y1pp",
        "author": "MarvelsGrantMan136",
        "title": "Hans Zimmer’s Score for ‘Dune: Part Two’ is Officially Ineligible for the Oscars and BAFTAS",
        "content": "",
        "upvotes": 9535,
        "comments": 428,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vy0PpyYTwPtsN0qiZSJq28qLp5EtfBhStKU1CG82lMg.jpg?auto=webp&amp;s=4e9d3d0e73884ebf881eb935403654c389d6b24c"
        },
        "permalink": "/r/movies/comments/1h8y1pp/hans_zimmers_score_for_dune_part_two_is/"
    },
    {
        "id": "1h95qyl",
        "author": "MarvelsGrantMan136",
        "title": "Dorothy’s Ruby Slippers from 1939’s ‘The Wizard of Oz’ Sell for Staggering $28 Million at Auction",
        "content": "",
        "upvotes": 2019,
        "comments": 148,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rlY6aEK2ts4mUaf8N3umdUKHbgJupZqBoqY9BEF1UkQ.jpg?auto=webp&amp;s=3505affcbed902c16c4ae7bd944be7469b2912b2"
        },
        "permalink": "/r/movies/comments/1h95qyl/dorothys_ruby_slippers_from_1939s_the_wizard_of/"
    },
    {
        "id": "1h97ijj",
        "author": "Adventurous-Peak-853",
        "title": "Godzilla Minus One",
        "content": "I just got around to seeing this movie. For dubbed movies I know I need to make sure I can pay full attention and with kids I just never got to this one. \n\nBut my god it was incredible. I had heard good things but it still exceeded my expectations. Visuals, fantastic. Story, even better. The pacing was damn near perfect as far as I'm concerned. And considering it was a Godzilla movie I found myself incredibly moved by the characters, none of whom were one-dimensional characatures.\n\nI hate when movies are too optimistic and I thought this walked the line perfectly between tragedy and fortune.\n\nJust wanted to dole out some praise for this film and a wish that more western/American films were of this quality. \n\nA+ guys.",
        "upvotes": 492,
        "comments": 131,
        "media": null,
        "permalink": "/r/movies/comments/1h97ijj/godzilla_minus_one/"
    },
    {
        "id": "1h91w5u",
        "author": "KriibusLoL",
        "title": "\"Hammering the door shut\" in The Hateful Eight is one of my all time favorite bits in any movie. Any other movies with comedic bits as a side story that get more ridiculous as the movies goes on?",
        "content": "Recently watched The Hateful Eight for the 3rd time now and one of my favorite comedic bits of all time is everyone trying to hammer the door shut while getting into Minnie's haberdashery.\n\nIt just gets more and more chaotic and silly as the movie goes on. First Kurt Russell's character struggling to keep the door shut while being handcuffed to his prisoner and getting yelled at by random strangers. Then Walton Goggins character goes through the same thing 20 minutes later, the massive struggle of one board not being strong enough to hold, everyone staring at them judging and shouting to really nail it in. OB accidentally hits the wooden board instead of the nail and saying \"jesus christ, that door is a son of a whore\" as the wooden board breaks in two. Then 15 minutes later the mexican character hitting his head against the lamp while trying to nail the door for the third time now and we see how fucked up the door boards are because everybody keeps trying to really nail it in. \n\nOf course later on we learn why the door was broken in the first place but I really enjoy these small side bits to the main story that makes it feel more authentic. Are there any other movies with bits that get more ridiculous as the story goes on?",
        "upvotes": 947,
        "comments": 213,
        "media": null,
        "permalink": "/r/movies/comments/1h91w5u/hammering_the_door_shut_in_the_hateful_eight_is/"
    },
    {
        "id": "1h8t30b",
        "author": "MarvelsGrantMan136",
        "title": "28 Years Later | Official Teaser",
        "content": "",
        "upvotes": 3165,
        "comments": 558,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F_0HMxvQC8X4BfJYQH7rYHApU2CykIaG1ctO2xGnACk.jpg?auto=webp&amp;s=2105c32fa3af20d7f4f18e971dfbe5e1618ce547"
        },
        "permalink": "/r/movies/comments/1h8t30b/28_years_later_official_teaser/"
    },
    {
        "id": "1h8x5a9",
        "author": "magikarpcatcher",
        "title": "Netflix Sets January Premiere For Mockumentary Special ‘Cunk On Life’",
        "content": "",
        "upvotes": 875,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hIhnt-r9FgFha-g7oP6P4hUCQuV2ZQP2Ckjw-N93CsE.jpg?auto=webp&amp;s=9983a5e7265a710ea86f1b86b7ffef38740dfaf1"
        },
        "permalink": "/r/movies/comments/1h8x5a9/netflix_sets_january_premiere_for_mockumentary/"
    },
    {
        "id": "1h8wgt3",
        "author": "MarvelsGrantMan136",
        "title": "Steve Mensch Dies In Plane Crash: President Of Tyler Perry Studios Was 62\n",
        "content": "",
        "upvotes": 964,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Nydfs3HPv_jz37d6X7wd7vLj6zArREjgEg42ZIjfm-A.jpg?auto=webp&amp;s=04f21242c00c0dce1e0f47998964cb9f92de2c08"
        },
        "permalink": "/r/movies/comments/1h8wgt3/steve_mensch_dies_in_plane_crash_president_of/"
    },
    {
        "id": "1h9bzre",
        "author": "Yet_Another_Guy_1123",
        "title": "Should long movies have intermissions?",
        "content": "I recently watched Wicked. It's a great movie, check it out if you got the time. But it is 2 hours and 40 minutes long. A 10-minute intermission would be cool. It would allow the audience to get up, get some more popcorn, and use the washroom. That being said; not all movies need one. If the movie is just 90 minutes long, an intermission would not make any sense. So only movies that are longer than 120 minutes (might) need one.\n\nBut what is your thoughts on it? Should studios put an intermission in movies or not?",
        "upvotes": 88,
        "comments": 134,
        "media": null,
        "permalink": "/r/movies/comments/1h9bzre/should_long_movies_have_intermissions/"
    },
    {
        "id": "1h90zoc",
        "author": "indiewire",
        "title": "The 53 Sexiest Movies of the 21st Century",
        "content": "",
        "upvotes": 406,
        "comments": 168,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jPEDIAgJ-p7YbHyWw58lICjMOBhMh39KZUCQUcGSgGY.jpg?auto=webp&amp;s=3b66bedbc618f8e007e1164f159e150cb70d8905"
        },
        "permalink": "/r/movies/comments/1h90zoc/the_53_sexiest_movies_of_the_21st_century/"
    },
    {
        "id": "1h8yo6p",
        "author": "Strawb3rryviolette",
        "title": "Movies you think are really depressing and don't feel comfortable watching again? ",
        "content": "My pick would definitely have to be Leaving Las Vegas, truly one of the most depressing movies i've ever seen and i can't explain why because i can take a lot and love depressing movies and heavy themes but i'm just not comfortable watching it again.\n\nAnother one would definitely have to be Clean, Shaven with Peter Greene. It's just so eerie and the way it realistically portrays mental illness/schizophrenia and the loneliness and isolation that comes with it is so depressing, it made me so uncomfortable.",
        "upvotes": 484,
        "comments": 1219,
        "media": null,
        "permalink": "/r/movies/comments/1h8yo6p/movies_you_think_are_really_depressing_and_dont/"
    },
    {
        "id": "1h9d4e7",
        "author": "Jack-Cremation",
        "title": "Christopher Reeve  IS Superman! ",
        "content": "I’m old and realize that!  I’m having a good time on Saturday night.  I’m watching the special on HBO and it’s a good documentary on Reeve’s. It’s very unfortunate what happened to him but he killed it as Superman. Had the look, played the nerd Clark Kent perfectly and nailed it as Superman. He was perfect for the 80’s and I’m thankful for us who got to experience it new in the 80’s.  \n\nIf I’m wrong let me know. I understand so don’t sweat it. If y’all older folks understand show me love!!!",
        "upvotes": 35,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1h9d4e7/christopher_reeve_is_superman/"
    },
    {
        "id": "1h8jbbc",
        "author": "WorldsBestWrestling",
        "title": "We all took the DVD boom era for granted",
        "content": "",
        "upvotes": 6117,
        "comments": 584,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lx4p1TNHGnwLZkHSANXrXL6tPJrRBqyx8Xshj_VT84Q.jpg?auto=webp&amp;s=f305d3a590f6023194718a5334567ea1d8402282"
        },
        "permalink": "/r/movies/comments/1h8jbbc/we_all_took_the_dvd_boom_era_for_granted/"
    },
    {
        "id": "1h8yhw2",
        "author": "KillerCroc1234567",
        "title": "The Gorge | Official Trailer",
        "content": "",
        "upvotes": 339,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BKKSW9GiWisKfpPaMMOA5fRt_KUA_1bHO2VZgzeMQfE.jpg?auto=webp&amp;s=17ae6cce490e9d7f1f4f40ffdcadb229cbe8f115"
        },
        "permalink": "/r/movies/comments/1h8yhw2/the_gorge_official_trailer/"
    },
    {
        "id": "1h8xhqo",
        "author": "Odd_Advance_6438",
        "title": "Why does Jared Leto keep getting picked up by directors? I think he’s had good performances in the past, but is it really worth putting up with him?",
        "content": "Like, I think he’s a more talented actor than people give him credit for. I feel like a lot of the criticism of his ability comes from people who have only seen Morbius and Suicide Squad\n\nBut it’s well known that he seems like a huge pain in the ass. His method thing seems really annoying for his costars, and also just wastes a lot of time. Leto seems to have a lot of confidence in his formula, not realizing most of the roles that made him famous were just relatively normal dudes. Now he wants to prove himself as some kind of “eccentric method genius!”\n\nAfter a while, why would producers and directors still want to pick him up? Especially if his movies haven’t been very successful recently.\n\nAlso, I know David Ayer seemed to like his weird process, which I suppose makes sense considering Ayer got along with Shia Labeouf very well. However, what I find funny is when you look at the behind the scenes for the Suicide Squad, the cast seemed legitimately very close. There’s a lot of nice pictures with them… the one caveat being that Leto is usually not in any of those pictures",
        "upvotes": 372,
        "comments": 249,
        "media": null,
        "permalink": "/r/movies/comments/1h8xhqo/why_does_jared_leto_keep_getting_picked_up_by/"
    },
    {
        "id": "1h8tb6j",
        "author": "Puzzled-Tap8042",
        "title": "Trent Reznor and Atticus Ross scored director Luca Guadagnino’s new A24 movie, Queer. The Nine Inch Nails musicians have now released their official soundtrack album via Milan Records\n",
        "content": "",
        "upvotes": 524,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vS7DaRVwmqYgXPJji3Ba1smTBWbsgeTLVaA4ytNtJag.jpg?auto=webp&amp;s=1978e947c3cf00b71e025d38a489ea23d02073a8"
        },
        "permalink": "/r/movies/comments/1h8tb6j/trent_reznor_and_atticus_ross_scored_director/"
    },
    {
        "id": "1h97r1h",
        "author": "Fishboy9123",
        "title": "If you were stuck on a desert island and only had one actor / actresses body of work to watch, who would you pick? ",
        "content": "If you were stuck on a desert island and only had one actor / actresses body of work to watch, who would you pick?I say Jennifer  Aniston, but is stand to be corrected.  Friends is always great to put on in the background.  She's been in a bunch of rom coms and horrible bosses is one of my faves.  She is lacking on the action genre though.  Anyone got a better idea?",
        "upvotes": 46,
        "comments": 229,
        "media": null,
        "permalink": "/r/movies/comments/1h97r1h/if_you_were_stuck_on_a_desert_island_and_only_had/"
    },
    {
        "id": "1h98oxw",
        "author": "AshIsGroovy",
        "title": "Review: ‘The Girl with the Needle’ is a Chilling Iron Maiden of a Film",
        "content": "",
        "upvotes": 37,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UAITHhiF0jARbmmmFBqkvKjjQE2JpXpV1Qf9zF4cFtM.jpg?auto=webp&amp;s=9f5feb348f75ef7aa5588107ca13c8f8dbbca6a3"
        },
        "permalink": "/r/movies/comments/1h98oxw/review_the_girl_with_the_needle_is_a_chilling/"
    },
    {
        "id": "1h8r31d",
        "author": "jblanch3",
        "title": "Uwe Boll's Assault on Wall Street",
        "content": "Ever since the assassination of the United Health Care CEO this past week, I haven't been able to get this movie out of my mind and I saw it many years ago.  It's about a guy whose wife gets sick, their health insurance reaches their limit and he tries to cash in on his pension from the military, but most of it was put into stocks and this film's setting was the 2008-2009 Wall Street crash.  The wife feels guilty, commits suicide and the husband goes off the edge and starts going on a killing spree against stock brokers and CEOs.  \n\nIt's directed by Uwe Boll (Of course, yes, that Uwe Boll) but as far as his movies go, I don't remember this one being half bad.  I remember Dominic Purcell from Prison Break as the husband and John Heard as the main antagonist.  I see it's on Tubi, I might rewatch it this weekend.\n\nUpdate:  Wild to see that this made it to the front page of the sub, thanks all!",
        "upvotes": 456,
        "comments": 189,
        "media": null,
        "permalink": "/r/movies/comments/1h8r31d/uwe_bolls_assault_on_wall_street/"
    },
    {
        "id": "1h9e5tp",
        "author": "DamnThatsInsaneLol",
        "title": "Tim Burton Is ‘Sure There Will Be’ Another Johnny Depp Collaboration, but Rules Out Sequels for ‘Edward Scissorhands’ &amp; ‘Nightmare Before Christmas’",
        "content": "",
        "upvotes": 8,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/baF_CT2vd1_SVjeo3QMW27zmCS6Zj4sMyBtxJ6jig_U.jpg?auto=webp&amp;s=ff1011fcf9d7bf53e60bc20792d04fa665921ad1"
        },
        "permalink": "/r/movies/comments/1h9e5tp/tim_burton_is_sure_there_will_be_another_johnny/"
    },
    {
        "id": "1h99o5n",
        "author": "cleopatraandcaesar63",
        "title": "Gulliver's Travels with Jack Black it doesn't even manage to be a fun parody of Jonathan Swift's book,",
        "content": "Based on the 18th century novel of the same name, this update sees a slacker mailroom clerk being transported to the land of Lilliput (yes, this is the original name of the mythical land in the novel) after messing up a travel assignment to the Bermuda Triangle. There, the giant (or Beast, as he is affectionately known to the locals), he becomes a hero to the little people, fighting villains and matchmaking a peasant and a princess. When a battle with a petty general goes awry, the roly poly backs out and cowers in fear.\n\nWhat is in place is the usual numbed down and logic deprived script which will not bother the casual viewer. What's more, since this movie is targeted at the family crowds, there is no need to sophisticate things. Hence, the filmmakers have every reason to throw in mindless pop culture references, ranging from Star Wars' Darth Vader and Luke Skywalker to Titanic's Jack and Rose. \n\nthe film gives us  two woozy love interests and a multitude of over-the-top jesters (also guised in the form of kings and generals). The overall story has whittled down to the bare minimum of Liliputs and conflicting kingdoms, but apart from the that the connection is non-existent. Despite some expensive looking special effects quality is a non-ingredient, instead reaching to gutter levels for humour and placing all the weight of carrying the movie on Black's antics.",
        "upvotes": 16,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1h99o5n/gullivers_travels_with_jack_black_it_doesnt_even/"
    },
    {
        "id": "1h9cv90",
        "author": "pistolplc",
        "title": "Staple gun gag in Christmas Vacation",
        "content": "I’d like to just take a moment to appreciate the staple gun gag in Christmas Vacation. There are so many more obvious comedic aspects to the whole “Christmas lights” arc, and this one is so subtle and understated, but it’s genuinely genius. It’s literally the worst and most ridiculous thing to use. The idea of putting any staples into your siding and shingles, let alone thousands, is so absurd, yet it barely even registers as a joke. AND HOW IS HE GOING TO REMOVE THE LIGHTS? Just rip them out like he’s pull-starting an outboard? It’s so stupid and wonderful. One of my favorite undersold comedy bits. \n\nAny other similar subtle/background gags that deserve extra appreciation?\n\n",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1h9cv90/staple_gun_gag_in_christmas_vacation/"
    },
    {
        "id": "1h93dvv",
        "author": "Impossible_Werewolf8",
        "title": "Favorite movie by european country: Sweden",
        "content": "Hello there!\n\nYesterday, I've asked you for your favorite movie set in Spain. It's interesting, because more than 100 comments later, in a way, we have a \"fpreign-but-not-so-foreign\" winner here: Internationally, ***El labertino del fauno*** (engl.: *Pan's Labyrinth)* is likely to be the best-known film on our list so far.\n\nBut [our official letterboxd list ](https://letterboxd.com/lalunallena/list/reddits-favourite-movie-by-european-country/share/N58XneSCnjHwwiJw/detail/)immediately calls for the next movie. We now move on to the next euorpean country with S, namely **Sweden**. Just like yesterday, there are only two rules to follow today:\n\n* It's about where the movie is set plot-wise and not about where the movie was filmed. In case of historical movies, it's important that the bigger part of the movie takes place in a geogprahical territory, that is part of the given country today. Sometimes, especially when it's really hard to find any movie, it is also fine if only a certain part of the film is set in the respective country - but it has to be a large part.\n* Winner movie is the movie with the most upvotes (minus the given downvotes) after 24 hours. Therefore, it's important that you only mention one movie per comment and that you check up if your movie was mentioned in an earlier comment before you suggest it.\n\nI'm really looking forward to your film suggestions!\n\n&gt;Day 44: Spain - El labertino del fauno (engl.: Pan's Labyrinth)\n\n&gt;Day 43: Slovenia - Moj ata, socialistični kulak (engl.: My dad, the socialist kulak)\n\n&gt;Day 42: Slovakia - Obchod na Korze (engl.: The Shop on Main Street)\n\n&gt;Day 41: Serbia - Balkanski špijun (engl.: Balkan Spy)\n\n&gt;Day 40: San Marino - Lo Sconosciuto di San Marino (engl.: Unknown Men of San Marino)\n\n&gt;Day 39: Russia - Сталкер (engl.: Stalker)\n\n&gt;Day 38: Romania - 4 luni, 3 săptămâni și 2 zile (engl.: 4 Months, 3 Weeks and 2 Days)\n\n&gt;Day 37: Portugal - Capitão Falcão (engl.: The Portuguese Falcon)\n\n&gt;Day 36: Poland - Krótki film o zabijaniu (engl.: A Short Film About Killing)\n\n&gt;Day 35: Norway - Flåklypa Grand Prix (engl.: Pinchcliffe Grand Prix)\n\n&gt;Day 34: North Macedonia - Нема да бидеш сама (engl.: You Won’t Be Alone)\n\n&gt;Day 33: Netherlands - Zwartboek (engl.: Black Book)\n\n&gt;Day 32: Montenegro - Igla Ispod Praga (engl.: The Black Pin)\n\n&gt;Day 31: Monaco - La fille de Monaco (engl.: The Girl from Monaco)\n\n&gt;Day 30: Moldova - Carbon\n\n&gt;Day 29: Malta - Luzzu\n\n&gt;Day 28: Luxembourg - Läif a Séil (engl.: The Last Ashes)\n\n&gt;Day 27: Lithuania -Vaikai iš Amerikos viešbučio (engl.: The Children from the Hotel America)\n\n&gt;Day 26: Liechtenstein - Kinder der Berge\n\n&gt;Day 25: Latvia - Kriminālās ekselences fonds (engl.: The Foundation of Criminal Excellence)\n\n&gt;Day 24: Kosovo - Zgjoi (engl.: Hive)\n\n&gt;Day 23: Italy - Nuovo Cinema Paradiso (engl.: Cinema Paradiso)\n\n&gt;Day 22: Ireland - The Wind That Shakes the Barley\n\n&gt;Day 21: Iceland - Englar Alheimsins (engl.: Angels of the Universe)\n\n&gt;Day 20: Hungary - Sátántangó\n\n&gt;Day 19: Greece - Κυνόδοντας (engl.: Dogtooth)\n\n&gt;Day 18: Germany - Das Leben der Anderen (engl.: The Lives of Others)\n\n&gt;Day 17: Georgia - ცისფერი მთები ანუ დაუჯერებელი ამბავი (engl.: Blue Mountains)\n\n&gt;Day 16: France - La Haine\n\n&gt;Day 15: Finland - Mies vailla menneisyyttä (engl.: The Man Without a Past)\n\n&gt;Day 14: Estonia - Vehkleja (engl.: The Fencer)\n\n&gt;Day 13: Denmark - Jagten (engl.: The Hunt)\n\n&gt;Day 12: Czechia - Spalovač mrtvol (engl.: The Cremator)\n\n&gt;Day 11: Cyprus - Smuggling Hendrix\n\n&gt;Day 10: Croatia - Kako je počeo rat na mome otoku (engl.: How the War Started on My Island)\n\n&gt;Day 9: Bulgaria - Източни пиесиИзточни пиеси (engl.: Eastern Plays)\n\n&gt;Day 8: Bosnia and Herzegovina - Ničija zemlja (engl.: No Man's Land)\n\n&gt;Day 7: Belgium - In Bruges\n\n&gt;Day 6: Belarus - Иди и смотри (engl.: Come and See)\n\n&gt;Day 5: Azerbaijan - Yuxu (engl.: The Dream)\n\n&gt;Day 4: Austria - Funny Games\n\n&gt;Day 3: Armenia - Նռան գույնը (engl.: The Color of Pomegranates)\n\n&gt;Day 2: Andorra - El fred que crema (engl.: The Burning Cold)\n\n&gt;Day 1: Albania - Lulekuqët mbi Mure (engl.: Red Poppies on Walls)",
        "upvotes": 27,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jDGM4vmL8dGUfU2QeTEP1GJiB20Upc7gie089IBWF2w.jpg?auto=webp&amp;s=4d8dec2293dd383684c787452f1c2ac30560ac75"
        },
        "permalink": "/r/movies/comments/1h93dvv/favorite_movie_by_european_country_sweden/"
    },
    {
        "id": "1h8mbes",
        "author": "chantosjr",
        "title": "The Best Movies of 2024, According to John Waters",
        "content": "",
        "upvotes": 522,
        "comments": 281,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WwTSUW9wCTsNl8pRxXgCSCa2WScP_jR5bqsn09Un8mo.jpg?auto=webp&amp;s=94546c6737c3c84421fd64223da6fbed31357540"
        },
        "permalink": "/r/movies/comments/1h8mbes/the_best_movies_of_2024_according_to_john_waters/"
    },
    {
        "id": "1h8zgx2",
        "author": "Wintertime13",
        "title": "The Hateful Eight",
        "content": "Nearly ten years have passed since this movie premiered. How has time been to it in your opinion- good/bad? Have you re watched it?\n\nI’m rewatching it tonight after seeing it all those years ago and I’m wondering how my experience is going to be. I remember thinking it was one of the weaker Quentin Tarantino movies back then. ",
        "upvotes": 49,
        "comments": 191,
        "media": null,
        "permalink": "/r/movies/comments/1h8zgx2/the_hateful_eight/"
    },
    {
        "id": "1h8qtqe",
        "author": "nubnub4455",
        "title": "Is there a term for when a sequel kills characters in order to maintain continuity with the next chronological entries?",
        "content": "I've seen very little talk about this trope but I've noticed it in quite a bit of media (Star Wars Rogue One (entire cast), Halo Reach (video game, entire cast), Young Sheldon (TV Show, George Cooper)). I know in some situations writing this into the story of the prequel is basically required but I was just wondering if there was a name or term for it.",
        "upvotes": 163,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1h8qtqe/is_there_a_term_for_when_a_sequel_kills/"
    },
    {
        "id": "1h9dbvu",
        "author": "Reasonable-Back7792",
        "title": "Moulin Rouge Diamond Heart ornament ",
        "content": "Hey guys, Moulin Rouge! has always been one of my all time favorite movies. At about 18-19 mins in when satine is dancing with zigler and talking about meeting with the Duke, Zidler is waving around a giant diamond heart ornament. I have ALWAYS wanted to find it online (obviously probably not real diamonds) but can't seem to find anything like it!!! \nI search \"heart shaped diamond moulin rouge!\" And things similar and it wither only talks about the giant diamond necklace from the Duke or the lyrics to sparking diamond. Anyone have any other information that could help or know where to find it??? ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1h9dbvu/moulin_rouge_diamond_heart_ornament/"
    },
    {
        "id": "1h8z5ky",
        "author": "indiewire",
        "title": "Trent Reznor on Lip-Syncing for David Lynch and Why Nine Inch Nails’ Name Was Slightly Changed for ‘Twin Peaks’ — Interview",
        "content": "",
        "upvotes": 32,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HHSdNCoatfr2Mfl3NCEEhCH1dAOsR4W82LU9kuEFKqk.jpg?auto=webp&amp;s=98070a154330ed1f63096fad2883ce4ae081ecfa"
        },
        "permalink": "/r/movies/comments/1h8z5ky/trent_reznor_on_lipsyncing_for_david_lynch_and/"
    },
    {
        "id": "1h95rdn",
        "author": "Puzzled-Tap8042",
        "title": "European Film Award Winners: Jacques Audiard’s ‘Emilia Pérez’ Takes Best Film ",
        "content": "",
        "upvotes": 13,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ck7ejMLTdrrCOhpFkixmgnNOCtNpGmd1E3d-bkINWpQ.jpg?auto=webp&amp;s=1c67c37999e932f550663bb8387ce77174207b2f"
        },
        "permalink": "/r/movies/comments/1h95rdn/european_film_award_winners_jacques_audiards/"
    },
    {
        "id": "1h97ukt",
        "author": "VanceDevlin",
        "title": "Lee",
        "content": "I thoroughly enjoyed it. I know at this point we have a million WWII movies but this one was fresh for me. Lee Miller is someone I learned about while watching Civil War. I got curious and found Lee. \n\nSamberg was really good. After watching Brooklyn 99 ten times over I found his new role was well done. He actually did very well in a serious role. Im very impressed. \n\nWinslet, also, was amazing as Lee. I dont know how true to form she was regarding Lee. I havent yet read Lee's biography. What I do know is Winslet represents a strong woman to me and I think she lived up to that in Lee. \n\nWhat do you giys think about the movie? ",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1h97ukt/lee/"
    },
    {
        "id": "1h90b45",
        "author": "BunyipPouch",
        "title": "Jacques Audiard Wins Best Director Prize at European Film Awards for ‘Emilia Pérez’ - His previous films include 'A Prophet', 'The Sisters Brothers', 'Dheepan', and 'Rust and Bone'.",
        "content": "",
        "upvotes": 25,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qT-VsY-oVhZn0SLjwGWMCT2oAfllKdaZXELIRnyF988.jpg?auto=webp&amp;s=b75e1a2326c93363c70416d1ade8a39dab2820b5"
        },
        "permalink": "/r/movies/comments/1h90b45/jacques_audiard_wins_best_director_prize_at/"
    }
]