[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 43,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kzfh7m",
        "author": "WhatevUsayStnCldStvA",
        "title": "Deadly American Marriage. Molly shouldn’t even be in this",
        "content": "I cannot believe how angry this documentary is making me. She comes off as a manipulative psycho. It seems clear she came into his life to steal these kids and he was catching onto it. Those recordings just proved that. She was purposely going against what he asked and wanted constantly. He called her out. And she played dumb and innocent. He even said in the recording that she was trying to separate him from his kids. He was 💯 percent correct on this. \n\nI can't believe the two of them were even in this documentary. Unless every person who watches it gets that same disgusting reaction to her that I do, then maybe this helps more in the court of public opinion.\n\nI still have 26 min left. I just can't believe they won an appeal. ",
        "upvotes": 192,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1kzfh7m/deadly_american_marriage_molly_shouldnt_even_be/"
    },
    {
        "id": "1kzfb3h",
        "author": "Semtex7",
        "title": "If Netflix rolled the new layout for you - report it, don’t just take that crap",
        "content": "If you are one of the unlucky bastards they are beta testing the new layout for the TV app you already understand the title. Don’t just struggle with it, it is pointless. It is not usable. You see more titles on your phone than a freaking 84in TV. It makes NO SENSE. You have to scroll till your life is half over to go through a decent amount of titles. No upcoming titles anymore.\n\n\nReport it so it never stays. They are looking for feedback ",
        "upvotes": 84,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1kzfb3h/if_netflix_rolled_the_new_layout_for_you_report/"
    },
    {
        "id": "1kyrn8k",
        "author": "gracieb_1",
        "title": "streaming not working?",
        "content": "can’t watch netflix on any devices (tv, ipad, phone, computer, etc). it’s not our account or our wifi. is anyone else having this issue? we’ve troubleshot multiple times and contacted support, but they say that it’s not showing any issues.",
        "upvotes": 1332,
        "comments": 1053,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrn8k/streaming_not_working/"
    },
    {
        "id": "1kyri1s",
        "author": "Alextheseal_42",
        "title": "Can’t watch anymore episodes of Dept Q??",
        "content": "So I started watching Dept Q today (in the US) where all episodes are supposed to be available as of today. Get to the end of episode two and it won’t continue, saying I cannot watch it anymore. When I go to look up the series all that’s there is the trailer. What????\n\nEdit: glad to know I’m not alone but still sucks. I can watch other stuff on Netflix but seems like many others can’t. Ahhh technology. 🤦🏻‍♀️ ",
        "upvotes": 472,
        "comments": 831,
        "media": null,
        "permalink": "/r/netflix/comments/1kyri1s/cant_watch_anymore_episodes_of_dept_q/"
    },
    {
        "id": "1kz2kjz",
        "author": "GoatRawFirePeak",
        "title": "Lost in Starlight",
        "content": "Came out today! This is the first korean animated film i’ve seen - looked like a shinkai film.\n\nBit of a slice of life feel, but romance and scifi heads will love this. Music was amazing. ",
        "upvotes": 30,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1kz2kjz/lost_in_starlight/"
    },
    {
        "id": "1kzg3qt",
        "author": "codec3",
        "title": "The new Netflix interface on my tv:",
        "content": "It only shows 4 line items, the large preview window and 3 thumbnails in a row.\n\nSo somebody at Netflix said “hey! I got a great idea! Let’s make it so our subscribers can only see a maximum of 4 selections on their screen! Isn’t that a great idea! Pat me on the back I did a good thing! Now they can spend 4x as much time on Netflix looking for something to watch! Now THAT’S customer retention! Give me a bonus!”\n\nProbably not and it’s a horrible idea. Max lets me view 5, Disney is 12 thumbnails, starz is 16 and my tv Home Screen is 8. With Netflix I can only view 4 items on a 100” screen? Horrible UI this app just gets not better and better. Rant over, carry on.🤯",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kzg3qt/the_new_netflix_interface_on_my_tv/"
    },
    {
        "id": "1kyevkp",
        "author": "jerkoff1610",
        "title": "Anyone else tired of the four-year-long wait between seasons of Stranger Things, where kids don't look like kids anymore?",
        "content": "They all look so different now! Weren't they supposed to be 16-17 in season 5??\n\nAlso, correct me if I'm wrong, but isn't Erica, who btw just graduated high school and is an adult now, supposed to be THIRTEEN in season 5????\n\nApparently, they have pushed the release date for season 5 to 2026. This is just crazyyy!!!  \n",
        "upvotes": 1015,
        "comments": 220,
        "media": null,
        "permalink": "/r/netflix/comments/1kyevkp/anyone_else_tired_of_the_fouryearlong_wait/"
    },
    {
        "id": "1kzhspn",
        "author": "meltingsunz",
        "title": "Will there be a season 3 of Dinner Time Live?",
        "content": "Does anyone know if Dinner Time Live with David Chang will be renewed? It's interesting to see all the different food creations on the show while interviewing people at the same time.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kzhspn/will_there_be_a_season_3_of_dinner_time_live/"
    },
    {
        "id": "1kzanu7",
        "author": "Pingu201010",
        "title": "Young adult show or movie recommendations?",
        "content": "I want all the cringy teeny stuff. I have prime, Netflix, Disney and paramount+ so anything on those🩵\n\nI recently binged motorheads on prime and absolutely loved that so I really just want any of your recommendations but below is a list of things I’ve already watched and enjoyed:\n\nThe summer I turned pretty\nMotorheads \nXo kitty \nAll the boys I loved before\nKissing booth \nMy fault / your fault \nYour classics (hunger games, twilight, divergent etc)\nSweet magnolias \nBridgerton / Queen Charlotte\nGinny &amp; Georgia\nShadow hunters\nVampire diaries \nThe originals\nGossip girl (obvs)\nMy life with the Walter boys\nNever have I ever\nRiverdale (although gave up once they all started singing)\nOne of us is lying\nAfter\n\n\n\n\n",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kzanu7/young_adult_show_or_movie_recommendations/"
    },
    {
        "id": "1kzlda4",
        "author": "cinnamon_millhouse",
        "title": "How to Cancel Extra Member Slot on Netflix?",
        "content": "I've been subscribed to Netflix since January this year, and last month I noticed that it is billing me higher than what I've paid before. At first I thought it was just the tax. But then there's an alert window saying that I've added an extra member, and that no one is using that slot. I'm pretty sure that I never clicked or opted to add an extra member. But how come netflix is billing me for it without consent? Could you help me how do I revoke this so that I won't be charged further, and am I eligible for a refund? Have anyone experienced something like this? Thank you.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kzlda4/how_to_cancel_extra_member_slot_on_netflix/"
    },
    {
        "id": "1kzlcnz",
        "author": "EastonLikesMovies",
        "title": "Will Netflix release the trailers on YouTube right after they premiere on TUDUM?",
        "content": "I really want to live stream my reaction to the event, but I don't want to get a copyright strike. I think the solution to that is just looking at the trailers Netflix puts out on YouTube or Twitter. Will they upload the trailers right after they premiere on TUDUM or after the event itself?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kzlcnz/will_netflix_release_the_trailers_on_youtube/"
    },
    {
        "id": "1kyrvmj",
        "author": "ZirfyGaming2727",
        "title": "Error Code 2-0, \"This title is not available to watch instantly. Please try another title.\"",
        "content": "It's on an Apple TV. I've already restarted Netflix, restarted the TV, and all that hullabaloo. It still gives me the same answer. Somebody please help me, I just wanna watch Vinland Saga. \n\nWhy does technology hate me so\n\nEdit: They fixed it",
        "upvotes": 81,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrvmj/error_code_20_this_title_is_not_available_to/"
    },
    {
        "id": "1kzf8jb",
        "author": "3riyi0",
        "title": "Finding a series",
        "content": "I used to watch a show back in like 2018 with my cousin and I never got the name of it but I remember one scene that may identify it 🙏 It was a thriller show that followed a group of college? aged people and a large part of the plot was the fact that they could travel through different worlds. \n\nOkay getting to the scene I remember, One of the main characters caused? one of the girls (blonde) to end her existence, the scene then changed to one of her being on a ladder in her parents backyard surrounded by floating mirrors. \n\nPlease if anyone can help respond to this post 🙏🙏",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kzf8jb/finding_a_series/"
    },
    {
        "id": "1kzj4t0",
        "author": "Historical-Rub-1747",
        "title": "Recommend good Netflix series",
        "content": "I've already watched vikings &amp; Banshee &amp; Dark, Insatiable , and now I don't know what to watch.\nI love fantasy series, time mobility, adventures, crime and action, except for one type, which is horror, I can't watch it ",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kzj4t0/recommend_good_netflix_series/"
    },
    {
        "id": "1kzioej",
        "author": "anandasheela5",
        "title": "Netflix shows where the main character finds their voice and embraces their true self?",
        "content": "Looking for series where the protagonist is encouraged to be their authentic self and gradually finds their voice, emotionally, creatively, or otherwise. Open to any genre, as long as the arc feels genuine ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kzioej/netflix_shows_where_the_main_character_finds/"
    },
    {
        "id": "1kzfxnc",
        "author": "FloatLikeaWish",
        "title": "Sneaky Links Netflix Reviw",
        "content": "Okay just finished this show: even though it’s trash reality, surprised how some of the characters grew on me ? Some of these people are definitely characters\n\n1.\t⁠Kelsey and Colt is how imagine Hailey Bieber was like with Justin Beiber irl with his on and off vibe w Selena. Girl is not a girls girls and was willing to be second choice/ be the at the back burner knowing he was messing with someone else, lack of self respect on both Angelique and Kelsey. I liked how Nicole v and Avery handled the Manny situation when they realized they were being played, even though things worked out w Manny and Avery later on it was still much more dignified and considerate of all parties involved and those two were girls girl through and through. She is like 23 and Cole is 31 so I’ll give her brownie points for being young and naive .\n2.\t⁠Angelique way too possessive/ invested way too soon ignoring the red flags through and through. She does seem to have repressed trauma with that sort of thing, so I hope she heals if she really wants a real commitment. I see a bit of myself in her in previous relationships, it’s like u wanna project ur potential of the relationship or of the person and try to control the narrative, but ultimately u gotta see things for what it is and not project through rose colored emotional glasses. It’s a cannon event\n3.\t⁠Cole is actually such an airhead?? Everything this man says is so dumb same with Brandon? These men literally have no personality, depth to discipline to be  actual relationship material. They truly are classics sneaky link surface level fling sort of dudes that seem to have stunted their growth. How is Cole like 31 but gives the vibe, intelligence and maturity of like a literal 18 year old. How does anyone find that to be remotely intellectually stimulating or attractive. Again good for a fuck but to be thinking of building a future w men like this you’d losing ur mind like Angelique was trying to be. The lack of control when it comes to lust and being so easily swayed also, just icky. It’s honestly like watching highschoolers but it’s crazy how so many men are actually like this. Ageing but not really. Brandon seemed like he was trying to come around in the end, but it felt performative so he doesn’t get booted off the show. He has wandering eyes and I just see him going through his roster in real life and some highkey commitment issues due to his parents marriages.\n4.\t⁠Kesley was one of my favs, she seemed very party girl chaotic energy at first but girl has genuine depth to her and smarter than she seemed. Stood on business and I love that for her. She was playful, classy and nice and was not doing Angelique like things when she peeped Brandon’s red flags. Loved that for her.\n5.\t⁠Loved Nicole V. Girl knows what she wants and u gotta respect her for handling herself with class and being honest. Nicole S. Was also just being real and I think girlie found a real man irl so happy for her. Zoe was a girls girl through and through handled all the situations with sm respect. Loved Avery such a genuine sweet girl through and through.\n6.\t⁠Idk if I fw Manny he still seems performative and the way he treated samira in the end was super harsh  and cold, I wouldn’t be surprised if he does the same to Avery, which would be sad because she is truly the sweetest girl on the show.\n7.\t⁠hot take but I think Zoe should’ve chosen Corinthian he’s the only dude that seemed like a gentleman, like Travis was cool and all but did he even tell her he was making moves w Nicole S. on the low early on? I feel like Zoe and Corinthian had a fresh start and it seemed like Travis got possessive / competitive out of nowhere when he saw another man interested in her.\n8.\t⁠Lulu and colt could’ve had some potential/ fresh start  since he already made a mess going back and forth w Angelique and Kelsey and disrespected them both. But either way girl dodged a bullet and she’s a whole decade younger. I just see a whole lot of lust on the show not too many genuine connections but that’s reality tv.\n9.\t⁠Colts mom instant ick. Girl teach ur son to be modest and heal or grow some brain cells.\n10.\t⁠I do think Manny and Avery’s moms were both super sweet and supportive that was wholesome\n11.\t⁠i thought Logan would get jumped at but surprisingly no one did, im guessing he’s either not that well off or emotionally closed off that’s why no one did? Just a guess. He did seem like he had red flags for how he got with Nicole. I’m happy for their friendship and I guess he was genuine. That long haired dude. He had an interesting sense of humor but definitely a hard no. It just gives dating up sneaky link sort of personality fr. That basketball player guy was just there I guess",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kzfxnc/sneaky_links_netflix_reviw/"
    },
    {
        "id": "1kzfr1i",
        "author": "what-is-it-",
        "title": "What does everyone think of the F1 Academy series?",
        "content": "How is everyone liking the new series following the F1 Academy of 2024? \nI love Drive to Survive but I might love this one even more. The drivers stories are so real, they are all such interesting characters and they seem to lift each other up more than they’re competing with one another. What do you guys think?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kzfr1i/what_does_everyone_think_of_the_f1_academy_series/"
    },
    {
        "id": "1kzfigq",
        "author": "emergency-bee-212",
        "title": "Cobra Kai Q&amp;A Event in Los Angeles on 6/10!",
        "content": "https://preview.redd.it/bthvaxz1iz3f1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=1d39abe513dd7d713ebe29331fc27739fb3f8579\n\n[https://grammymuseum.org/event/celebrating-the-music-of-cobra-kai/](https://grammymuseum.org/event/celebrating-the-music-of-cobra-kai/)\n\n  \nCelebrating the Music of Cobra Kai \n\nTuesday, June 10, 2025\n\n7:30 PM - 9:00 PM  \nGRAMMY Museum L.A. Live (800 W Olympic Blvd, Los Angeles, CA 90015, USA)\n\nWith:\n\n* Creators/ Executive Producers/ Directors Josh Heald, Jon Hurwitz, and Hayden Schlossberg\n* Composers Leo Birenberg and Zach Robinson\n* Actor/Executive Producer Ralph Macchio",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kzfigq/cobra_kai_qa_event_in_los_angeles_on_610/"
    },
    {
        "id": "1kyowd1",
        "author": "jerkoff1610",
        "title": "How Netflix got James Lewis to finally speak about the Tylenol murders in new doc",
        "content": "Netflix released a new doc called Cold Case: The Tylenol Murders. It's about the 1982 case where seven people died after taking cyanide-laced Tylenol in the Chicago area. It's still unsolved, but the wild part is they got James Lewis, the only official suspect for decades, to finally talk on camera before he died. He was never charged for the murders, but did serve time for sending a ransom letter. He had refused every major interview, but he agreed to do this one. They gave him the space to talk about his side of the story.\n\nIt is sooo strange how no one thought about approaching him like this before. And if they did, why didn't he talk? It's so bizzare. ",
        "upvotes": 56,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kyowd1/how_netflix_got_james_lewis_to_finally_speak/"
    },
    {
        "id": "1kynijb",
        "author": "ComradeRedsky",
        "title": "Ozark years later.",
        "content": "Way behind the times here I've just started Ozark, meant to start it during lockdown however watched breaking bad and narcos Mexico instead, some people put me off Ozark however I'm loving the characters and the slow build up of the story. Anyone  watched it, any views,,, don't tell me the ending of course..",
        "upvotes": 66,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1kynijb/ozark_years_later/"
    },
    {
        "id": "1kyrq24",
        "author": "BizzyM",
        "title": "Everybody's Live with John Mulaney has gone missing.",
        "content": "I couldn't watch it live last night, so I'm trying to watch it tonight and the whole series is gone.  It's missing from my Continue Watching.  it's missing from My List.  And I can't find it in search.",
        "upvotes": 21,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrq24/everybodys_live_with_john_mulaney_has_gone_missing/"
    },
    {
        "id": "1kza335",
        "author": "spasticnapjerk",
        "title": "Dept Q EP 1 Timeline?",
        "content": "So their first case is about Merritt, who has been missing for four years after leaving her disabled brother on a ferry?\n\nI thought her story line was in the present, right up to the end.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kza335/dept_q_ep_1_timeline/"
    },
    {
        "id": "1kz9plr",
        "author": "Wyldstallyn80",
        "title": "Layout",
        "content": "Has anyone else’s layout/homepage changed. It looks horrendous now. It’s almost as bad as Disney + now to navigate. What’s happened to all the categories etc 😡",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kz9plr/layout/"
    },
    {
        "id": "1kyr6et",
        "author": "VixenSunburst",
        "title": "Netflix TV UI has changed - anyone else??",
        "content": "I personally hate it, things are too big and rounded now for no reason. Makes things much harder to look at, actually.\n\nMy phone's Netflix hasn't changed. If there is a way to revert it on TV, it'd be great to know. In the meantime I suppose I'll check to turn off auto-update on my phone. ",
        "upvotes": 20,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1kyr6et/netflix_tv_ui_has_changed_anyone_else/"
    },
    {
        "id": "1kz96yd",
        "author": "Realistic_Library309",
        "title": "Watched true beauty again after 3 years",
        "content": "Not a k drama fan but I really love that one drama which is true beauty . I watched it again after 3 years. It felt like I am watching it for the first time. Missing previous 2 days when I was just lost in that drama. Everything is feeling empty after finishing it .\n Can someone suggest more dramas like true beauty. It can be korean or anything.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kz96yd/watched_true_beauty_again_after_3_years/"
    },
    {
        "id": "1kyuleb",
        "author": "Tudorrosewiththorns",
        "title": "What show had an awesome first season then went off the rails?",
        "content": "I love The Chilling adventures of Sabrinas first season. It was god tier vibes and I loved it but everything after that was cringe AF. \n\nNo I haven't watched Riverdale and didn't know anything about it. It clearly wasn't my cup of tea. ",
        "upvotes": 10,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1kyuleb/what_show_had_an_awesome_first_season_then_went/"
    },
    {
        "id": "1ky84ax",
        "author": "theipaper",
        "title": "Dept Q is the best police procedural Netflix has ever made",
        "content": "",
        "upvotes": 170,
        "comments": 247,
        "media": null,
        "permalink": "/r/netflix/comments/1ky84ax/dept_q_is_the_best_police_procedural_netflix_has/"
    },
    {
        "id": "1kzbaw7",
        "author": "TheBigPig29",
        "title": "Household restrictions on mobile",
        "content": "For a little bit of background, I’m a college student and I use my girlfriend’s (mom’s) account. \n\nI’ve been aware of Netflix’s household rules, and they didn’t really affect me until a few months of me being in my dorm. Cool, whatever, I just watched on my laptop/used other streaming services, but it was still rather inconvenient. \n\nNow, I’m back home for the summer and I can’t use Netflix on my laptop or even my phone. This is really upsetting, is there a solution?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kzbaw7/household_restrictions_on_mobile/"
    },
    {
        "id": "1kz4jzz",
        "author": "Spare_Blacksmith_816",
        "title": "Theater movies streamed on Netflix vs other services",
        "content": "Is there any analysis on which streaming service shows the most theater released movies?  Seems like Netflix is more and more about their own productions and we see fewer and fewer streams of Theater movies.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kz4jzz/theater_movies_streamed_on_netflix_vs_other/"
    },
    {
        "id": "1kytw3g",
        "author": "Sudden_Pop_2279",
        "title": "ALL OF US ARE DEAD Season 2 Reportedly Begins Filming This Summer",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kytw3g/all_of_us_are_dead_season_2_reportedly_begins/"
    }
]