[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 23,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1khxz5i",
        "author": "PastinaInBrodo",
        "title": "Perché quando piove usano i pullman vecchi?",
        "content": "Qualcun'altro ha notato che spesso nei giorni di pioggia ci sono in giro più pullman vecchi? Quello blu e grigi come quello nell'immagine per intenderci, un motivo logistico o per lavarli a basso prezzo?",
        "upvotes": 28,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h9vua4fxtlze1.jpeg?auto=webp&amp;s=6b1d584b4664b1df7be7059d91fcb3c731ae8b29"
        },
        "permalink": "/r/torino/comments/1khxz5i/perché_quando_piove_usano_i_pullman_vecchi/"
    },
    {
        "id": "1ki3e6o",
        "author": "mougly97",
        "title": "AA meetings Torino",
        "content": "I'm a 28-years old Finnish woman and I'll be visiting Turin for 10 days this month. I've been sober for 4 months and the longest period I've been without an AA meeting is three days. \n\nI used to live in Turin so I understand Italian perfectly but I speak it very poorly because it has been 10 years since I moved back to Finland.\n\nI checked and there are atleast six different AA groups in Turin, but I was wondering if anyone could give me some advice on where to go or how to handle the language barrier? Feel free to dm me if you're an AA member and willing to talk about this.\n\nThe people at my home group advised me to do my speech in English or even Finnish just as long as I go and attend a meeting but I'm feeling anxious about it.",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ki3e6o/aa_meetings_torino/"
    },
    {
        "id": "1kicsas",
        "author": "InternationalPlant77",
        "title": "Arte povera artists resources in Turin",
        "content": "Hi, I am an Australian artist and coming to Turin on Sunday / Monday / Tuesday to view and research Arte povera artist style.\n\nI particularly enjoy Boetti and Gillardi.\n\nCan anybody recommend places, sites, museums or galleries that are good to check out whilst in Turin.\n\nThanks ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kicsas/arte_povera_artists_resources_in_turin/"
    },
    {
        "id": "1kid3fi",
        "author": "IlKayMosca",
        "title": "Miglior pizzerie in centro/zone centrali",
        "content": "Ciao a tutti, nelle prossime settimane te verranno i miei genitori a Torino e vorrei portarli a mangiare un'ottima pizza. Sapete dirmi, secondo voi, le migliori pizzerie intorno al centro? Purtroppo vivo qui da pochi mesi e sono riuscito a provarne poche",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kid3fi/miglior_pizzerie_in_centrozone_centrali/"
    },
    {
        "id": "1ki29z4",
        "author": "lastflowers_",
        "title": "Corsi gratuiti - nuove amizie",
        "content": "Ciao a tutti, sono una ragazza che abita poco fuori città. Mi piacerebbe sapere se a Torino ci sono dei corsi, di vario genere, gratuiti o a poco prezzo. \nCorsi, ad esempio, di fotografia, pittura, ricamo e quant’altro. \n\nSarebbe una buona occasione per fare nuove amicizie e imparare qualcosa di nuovo!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ki29z4/corsi_gratuiti_nuove_amizie/"
    },
    {
        "id": "1khuz9r",
        "author": "Rand_0m_",
        "title": "Campi da calcio",
        "content": "come da titolo,  qualcuno sa darmi gli indirizzi di campi da calcio (gratuiti) a Torino? va bene ovunque ci sia una fermata della metro nelle vicinanze. terra o sintetico basta ci sia una porta per allenarsi.\ngrazie in anticipo 😄",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1khuz9r/campi_da_calcio/"
    },
    {
        "id": "1khmtca",
        "author": "CryingAlwaysCrying",
        "title": "Interruzioni di corrente? Succede anche a voi?",
        "content": "Negli ultimi giorni, la corrente salta di notte (verso l’1–3), senza alcun carico acceso: niente condizionatore, niente stufette, solo il frigo.\n\nPensavo fosse un problema mio, ma anche altri in zona (e in quartieri diversi: San Salvario, Aurora, Cit Turin) hanno avuto lo stesso a mie amici.\n\nSuccede anche a voi? Qualcuno sa cosa sta succedendo?",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1khmtca/interruzioni_di_corrente_succede_anche_a_voi/"
    },
    {
        "id": "1khlma7",
        "author": "Noctis996",
        "title": "Traffico Torino",
        "content": "Ciao a tutti, da due settimane sto vedendo che la mattina all’entrata e uscita  di Torino trovo veramente un sacco di traffico. Alle 17 quando esco da lavoro sulla strada dove c’è mondo juve c’è addirittura la coda. Cosa è successo ? C’è qualche strada che è bloccata ?",
        "upvotes": 6,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1khlma7/traffico_torino/"
    },
    {
        "id": "1khwrmm",
        "author": "Expensive-Paint-9490",
        "title": "Liutai per chitarra elettrica a TO",
        "content": "Devo fare un paio di lavori sulla mia chitarra: sostituire i tasti e cambiare l'elettronica. Conoscete dei bravi liutai a Torino? Non mi consigliate Umberto Mari perché mi feci fare un cambio tasti e fu davvero pessimo.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1khwrmm/liutai_per_chitarra_elettrica_a_to/"
    },
    {
        "id": "1kgzuww",
        "author": "blunathan",
        "title": "Il cielo su Torino...",
        "content": "pioggia ne abbiamo?",
        "upvotes": 136,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ake8tbrdmdze1.jpeg?auto=webp&amp;s=7506a77b6c3150daff51322cfafb00407556aad7"
        },
        "permalink": "/r/torino/comments/1kgzuww/il_cielo_su_torino/"
    },
    {
        "id": "1khl8iy",
        "author": "davves12",
        "title": "Palestra decente?",
        "content": "Ciao, dopo anni di inattività vorrei tornare a fare allenamento in palestra. Mi interessa sala pesi e al più qualche attrezzo cardio, dei corsi, diete, bevande energetiche non me ne faccio nulla.\n\nLe più economiche e più attrezzate mi sembra siano le orange e fit active, avete dei feedback o ci sono altre a buon prezzo?\n\nGrazie!",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1khl8iy/palestra_decente/"
    },
    {
        "id": "1khait5",
        "author": "DirectInteraction825",
        "title": "Run Club",
        "content": "Ciao, \n\nSono nuovo a Torino (M25) e sto facendo un po’ fatica ad ambientarmi. Ho pensato a modi per conoscere persone nuove al di fuori del lavoro, e dato che corro, mi sono detto, perché no?\n\nCerco un run club di gente della mia età che vada a correre in settimana o nel weekend in zona Parco del Valentino. Se conoscete gruppi in cui ci si può iscrivere e dove si conosce gente, scrivetemi pure, grazie :) ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1khait5/run_club/"
    },
    {
        "id": "1khoukj",
        "author": "A_random_person--1",
        "title": "muslim students in Turin university",
        "content": "\nI am a Muslim hijabi and I wish to study medicine in Turin. Is there a big Muslim community there? are there a lot of halal food options? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1khoukj/muslim_students_in_turin_university/"
    },
    {
        "id": "1kgyqqj",
        "author": "Rexam14",
        "title": "Scuola guida per patente moto",
        "content": "Ciao! Vorrei prendere la patente A per la moto. Attualmente possiedo la patente B per l’auto. Avete qualche consiglio su una buona scuola guida a cui affidarsi? Magari una con cui vi siete trovati bene?",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kgyqqj/scuola_guida_per_patente_moto/"
    },
    {
        "id": "1kh3n9v",
        "author": "love-yourshelf",
        "title": "Corso iaido",
        "content": "Salve a tutti/e,\nconoscete per caso una palestra o un dojo che abbiano attualmente un corso di iaido attivo su Torino? Va bene anche prima provincia, purché ne valga la pena, chiaramente. \nNella maggior parte dei casi, cercando online si trovano info datate - ed essendo un'arte marziale un po' più di nicchia, vorrei evitare di sbattermi inutilmente. \nGrazie mille in anticipo!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kh3n9v/corso_iaido/"
    },
    {
        "id": "1kg7n1o",
        "author": "Powerful-Branch-6956",
        "title": "Amiche a Torino",
        "content": "Ciao! 😊  \nSono una ragazza di 33 anni, vivo a Torino e sto cercando nuove amiche con cui condividere passioni come viaggiare, shopping, fare aperitivi e un po’ di sport (all’aperto o in palestra, va tutto bene!).\n\nLavoro in smart working in un ambiente prevalentemente maschile, quindi sento il bisogno di creare nuove amicizie al femminile principalmente — un gruppo di ragazze con cui chiacchierare, uscire, scoprire nuovi posti e organizzare qualcosa di carino insieme nel tempo libero.\n\nSe anche tu ti trovi in una situazione simile o semplicemente hai voglia di ampliare il tuo giro di amiche, scrivimi nei commenti o in privato! 🌸",
        "upvotes": 17,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1kg7n1o/amiche_a_torino/"
    },
    {
        "id": "1kg78sc",
        "author": "Mental_Outcome8769",
        "title": "Dove comprare latte in bottiglie di vetro?",
        "content": "Domanda insolita, ma provo a chiedere.\n\nCome da titolo, voglio comprare latte in bottiglie di vetro ma non sono riuscito a trovarne.  \nQualcuno sa dove posso trovarne?  \nMagari in zona San Salvario. Grazie!",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1kg78sc/dove_comprare_latte_in_bottiglie_di_vetro/"
    },
    {
        "id": "1kg78uk",
        "author": "sunurban_trn",
        "title": "Fotografo per ritratti business",
        "content": "Ciao a tutti, qualcuno di voi conosce un fotografo/a specializzato nei ritratti per professionisti (foto Linkedin e affini per intenderci)? Se non si può pubblicizzare nel post, scrivetemi in DM per favore. Mi servirebbe anche un'idea del prezzo! Grazie mille",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kg78uk/fotografo_per_ritratti_business/"
    },
    {
        "id": "1kg6a36",
        "author": "juulu",
        "title": "Meetup - Animation/3D/CGI/VFX",
        "content": "Is anyone interested in a Meetup for Animation/3D/CGI/VFX here in Torino? I'm looking to expand my network and meet similar professionals in the industry for casual meetups and industry conversation. \n\nOr maybe someone knows of existing meetups or communities based around these industries? \n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kg6a36/meetup_animation3dcgivfx/"
    },
    {
        "id": "1kfzblg",
        "author": "Putrid-Image-9719",
        "title": "Conoscere gente a Torino",
        "content": "Scusate sapete un qualche locale per conoscere gente a Torino possibilmente del sesso opposto e non over 40? (Si sono un ragazzo di 29 anni che ancora spera di trovare l anima gemella 😅)",
        "upvotes": 4,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1kfzblg/conoscere_gente_a_torino/"
    },
    {
        "id": "1kfl5bm",
        "author": "BoudoirdiVeronica",
        "title": "Turin. We signed a rental agreement proposal, paid the agency €2250 — and got rejected. Is this normal?",
        "content": "Hi everyone,\nMy husband and I are foreigners in Italy — we don’t have a work contract here, but we do have savings and a stable business. Recently, we found an apartment in Turin through an agency. Everything seemed to be going well until the landlord’s “secretary” stepped in — and today we were suddenly rejected, despite multiple reassurances. Here’s what happened:\n\nI initially sent the agency our application, documents, and a detailed explanation of our situation. The agent passed everything to the landlord — an elderly man. He said everything looked fine and invited us to meet.\n\nMy husband traveled first — 8 hours by bus from Trieste — to meet with the agent and the landlord. He explained everything again and handed over our documents.\n\nAfter that meeting, the landlord asked specifically for me (his wife) to come as well — he wanted to meet both of us in person.\nSo I traveled from Trieste too, leaving our child and our dog behind to keep things simple. This was the second meeting — again with the agent, and then with the landlord. Everything went well. The landlord himself signed the proposta di locazione (rental intention), we paid the agency €2250, discussed the move-in date, and were told we’d receive the contract soon.\n\nA few days later, the agent contacted us saying the landlord’s secretary was requesting additional proof of income in Italy. We once again explained everything in detail and sent full documentation about our business and savings.\n\nThe agent and the landlord both got back to us again and reassured us that everything was fine — we’d sign the contract, and we would pay six months’ rent in advance. The landlord even offered us a 4+4 contract, although we were prepared to sign a simple 1-year renewable contract.\n\nBut today — 5 days later — the agent suddenly called to say we’d been rejected. The reason? The secretary wants “classic guarantees” and “doesn’t like foreigners.”\nMeanwhile, the landlord himself, according to the agent, was fine with us.\n\nSo now we’re left with wasted time, effort, and stress — even though the agency has promised to refund the €2250.\nBut we’ve lost the apartment, travel expenses, and several opportunities we declined while waiting for this contract.\n\nIs this normal practice in Italy? Has anyone experienced something similar?\nTo us, it feels completely unfair and unethical.\n",
        "upvotes": 23,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1kfl5bm/turin_we_signed_a_rental_agreement_proposal_paid/"
    },
    {
        "id": "1kfhfry",
        "author": "black90sfurniture",
        "title": "Problema con gli attraversamenti ciclabili a Torino",
        "content": "Ciao a tutti, vado in bici tutti i giorni a Torino e c’è una cosa che mi fa impazzire: quando uso gli *a*ttraversamenti ciclabili (quelli accanto o insieme a quelli pedonali, con il semaforo), mi capita spesso che le macchine che svoltano a destra, non si fermano o addirittura mi vengono incontro come se niente fosse.\n\nNon è che non mi vedono, eh. Io vado piano, loro anche, ci incrociamo con lo sguardo... ma invece di fermarsi o rallentare per farmi passare, continuano dritte verso di me, fino quasi a toccarmi. Di solito rallento per sicurezza, e alla fine si fermano a pochi centimetri da me. Altre volte manco si fermano e io attraverso lo stesso, perché ho il verde e non ho intenzione di farmi intimidire.\n\nSecondo me molti non capiscono che ci sono attraversamenti anche per i ciclisti e pensano che, se sei in bici e non sei sceso per usare le strisce, non hai la precedenza, e quindi se ne fregano. Usano questa “scusa” per farti sentire in torto, come dire: “è colpa tua se ti investo, io avevo il diritto di passare”.\n\nA parte che *anche se fosse solo un attraversamento pedonale*, non è che uno può puntarti la macchina addosso e consapevolmente mettere in pericolo una persona... ma questa cosa a me capita anche 4-5 volte a settimana.\n\nCapita anche a voi? Ne avete mai parlato con qualcuno che guida così? Io spesso non ho le forze di fermarmi a discutere perché sono troppo incazzato.\n\n  \n",
        "upvotes": 29,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1kfhfry/problema_con_gli_attraversamenti_ciclabili_a/"
    },
    {
        "id": "1kfarjk",
        "author": "blunathan",
        "title": "Turin Metro 4K 60fps - First-Person Experience! 🚇🇮🇹 (LIVE HD WALLPAPER) ...",
        "content": "Amanti dei live wallpaper e di Torino, questo è per voi! Ho filmato il tragitto della metro (Bengasi-Porta Susa) in alta qualità (4K 60fps) dalla posizione davanti. Potrebbe essere il vostro prossimo sfondo animato? Meglio farne una versione accelerata? Dategli un'occhiata! 👀",
        "upvotes": 42,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3sAKUBeYPTh7Uujj2YdheS1vzs-DiUTHVJDmZxQYaOI.jpg?auto=webp&amp;s=68da6468b830dd5a6500b55bb4bb37aea340c64c"
        },
        "permalink": "/r/torino/comments/1kfarjk/turin_metro_4k_60fps_firstperson_experience_live/"
    },
    {
        "id": "1kfjy8c",
        "author": "TheAnt89",
        "title": "Making new friends in Torino",
        "content": "Hi everyone,\n\n29M looking to make new friends in Turin.\nUp until a year and a half ago, I had a great group of expat friends who unfortunately have all moved back to their own countries.\n\nI’d love to meet new people to hang out. I’m into sports (football, basketball, and I’ve recently taken up running). I enjoy a pint down the pub and trying new foods.\n\nIf you’re also in the same situation, send me a DM!\n\nThanks\n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kfjy8c/making_new_friends_in_torino/"
    },
    {
        "id": "1kg5nb6",
        "author": "circ99",
        "title": "Circoncisione",
        "content": "Ciao! Qualcuno di voi è circonciso o deve farla? Avete consigli su Torino?\nIo 26 anni",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1kg5nb6/circoncisione/"
    },
    {
        "id": "1kfimku",
        "author": "alextheangeldragon",
        "title": "Elicottero",
        "content": "Perché c'era un elicottero che volava basso sopra la dora nell'area di Aurora/Barriera, continuava ad abbassarsi sopra ai tetti come se stasse per atterrare e poi solo si rialzava..\nAdesso è volato via verso le montagne",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1kfimku/elicottero/"
    },
    {
        "id": "1kfc6sg",
        "author": "Neugierde_0815",
        "title": "What to do in Torino?",
        "content": "Me and my Friends will visit torino this Weekend (Age between 35 - 40 female). Where to eat and where to party?",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1kfc6sg/what_to_do_in_torino/"
    },
    {
        "id": "1kf6uyx",
        "author": "davves12",
        "title": "Nuove amicizie introvabili",
        "content": "Ciao a tutti, sono un ragazzo di 29 anni che si è trasferito a Torino 5 anni fa. Da allora, complici vari motivi tra cui il mio carattere introverso e vari fattori, non sono riuscito a crearmi nessuna amicizia in questa città. \n\nPossibile che sia così difficile instaurare un rapporto in questa città o il problema sono io (anche se non sono l'unico a quanto leggo)? Mi farebbe piacere conoscere persone con interessi simili e creare un gruppo per uscire e divertirsi insieme!",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1kf6uyx/nuove_amicizie_introvabili/"
    },
    {
        "id": "1kfcsmr",
        "author": "Comfortable_Let_4923",
        "title": "Meetup Torino",
        "content": "Ciao,\n\nEsiste qualche gruppo whatsapp/ig per fare amicizie a torino?\nHo 29 anni e mi sono appena trasferito in città",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kfcsmr/meetup_torino/"
    },
    {
        "id": "1kf4qsn",
        "author": "Royal_Lime6493",
        "title": "MeetUp",
        "content": "(In realtà se anche hai qualche anno in più va bene 👍🏻)",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5dgbcg5powye1.jpeg?auto=webp&amp;s=9305712af1b8146f881616215d1b4d1126aa014b"
        },
        "permalink": "/r/torino/comments/1kf4qsn/meetup/"
    }
]