[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 501,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jf1wbf",
        "author": "seethatocean",
        "title": "Adolescence made me angry",
        "content": "As a mother of a teenage daughter, Adolescence made me angry.\n\nI mean, it was impossible to feel any sympathy for Jaimie after seeing the video evidence.\n\nI find it ridiculous that people are making excuses for Jamie and blaming online toxicity for his actions. As if he is a victim..\n\nLike - I don't care whether your son was born like this, or became an anti-women terrorist because you allowed him to watch inappropriate online content , or you yourself radicalized him - he doesn't get a right to kill teenage girl and then play the victim card. \nHe needs to be locked away in jail as per whatever law decides. \n\nWe need to perhaps revisit our laws in various countries where underage criminals get away with almost anything. \n\nDo we show the same consideration to religious islamic terrorists and to black youth? Do we say - oh come on, they are just being radicalized online, let's not blame them. \n\nBut if it is a white straight boy, then the sympathy floodgates open up huh. \n\nI also wonder if people's reactions would be different if the victim was another boy- a white straight boy - instead of Katie. Then everyone would have said that Jamie was a criminal and not blamed the victim maybe.\n",
        "upvotes": 309,
        "comments": 206,
        "media": null,
        "permalink": "/r/netflix/comments/1jf1wbf/adolescence_made_me_angry/"
    },
    {
        "id": "1jfcmxr",
        "author": "Inspired_Owl",
        "title": "Adolescence",
        "content": "What a masterpiece, I was sobbing at the end. \n\nFirst of all, my sympathy goes out to the family, especially the father. It was really eye opening to what goes on online and how it can affect people, especially young people. I’m 18 and had no idea about ‘incel’ or ‘exploding pill’, it was terrifying seeing what content anyone can access. \n\nI couldn’t take my eyes of the screen, 4 hours straight I was on the edge of my seat. \n\nI honestly think this is a good programme for anyone raising kids to watch. It was very eye opening.\n\nAnd the acting. Holy shit, I had to remind myself often that it was a to show and not a documentary. Hats off to everyone who worked on the programme.",
        "upvotes": 32,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jfcmxr/adolescence/"
    },
    {
        "id": "1jeot1i",
        "author": "flannel_flower",
        "title": "Why are so many missing the point of Adolescence?",
        "content": "There’s a lot of articles on Facebook about the new series Adolescence and the vast majority of people seem to have completely missed the point of the series and the message it’s trying to convey?                                                                   You have people asking whether Jamie really killed Katie, saying that it was left on a cliff hanger and there will be a series 2, that it was about bullying or knife crime. The series is clearly about toxic masculinity and how young boys are being brain washed by Andrew Tate and the likes. Jamie couldn’t handle being rejected by a “flat-chested” girl who was weak and vulnerable after her topless photos were circulated. He thought he was entitled to her, that he deserved her. She did ridicule him online with her comments on his Instagram which was a contributing factor but it really did come down to Jamie thinking he was entitled to Katie.",
        "upvotes": 934,
        "comments": 344,
        "media": null,
        "permalink": "/r/netflix/comments/1jeot1i/why_are_so_many_missing_the_point_of_adolescence/"
    },
    {
        "id": "1jf78nv",
        "author": "sidroy81",
        "title": "Anurag Kashyap rips 'dishonest, morally corrupt' Netflix India, says they would 'never make' something like Adolescence",
        "content": "",
        "upvotes": 30,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jf78nv/anurag_kashyap_rips_dishonest_morally_corrupt/"
    },
    {
        "id": "1jezg16",
        "author": "Grogman2024",
        "title": "Jamie’s crime in Adolescence",
        "content": "How is there so many people asking whether or not Jamie did it when he was very clearly caught on camera stabbing Katie. I’ve even seen a lot of people saying in the video you only see Jamie pushing her when you very clearly see more than that? Just very confused overall haha",
        "upvotes": 79,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1jezg16/jamies_crime_in_adolescence/"
    },
    {
        "id": "1jewkoh",
        "author": "gnshgtr",
        "title": "Netflix Director Arrested for $11 Million Fraud, Spent $2.4 million on five Rolls-Royces and one Ferrari",
        "content": "",
        "upvotes": 88,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1jewkoh/netflix_director_arrested_for_11_million_fraud/"
    },
    {
        "id": "1jf55fy",
        "author": "Longjumping_Land_977",
        "title": "How many times Adolescence filmed each one-shot episode and the mistakes the show kept in",
        "content": "",
        "upvotes": 22,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jf55fy/how_many_times_adolescence_filmed_each_oneshot/"
    },
    {
        "id": "1jf1cvl",
        "author": "lllIIIIIlllIIIII",
        "title": "Netflix show update Making a Murderer &amp; the Steven Avery case: Hidden phone call reveals the State knew about human remains being found off the property ~2 miles away.",
        "content": "[https://www.youtube.com/watch?v=liBllQYkG5w&amp;list=PLufnCEJ69\\_etoI1fUbfEHdZoPJJeiztw1&amp;index=40](https://www.youtube.com/watch?v=liBllQYkG5w&amp;list=PLufnCEJ69_etoI1fUbfEHdZoPJJeiztw1&amp;index=40)\n\nin 2018, on social media, Jerry Buting (Avery's defense lawyer in 2007) proclaimed this is the first he ever heard of this audio, and that the state knew they had found human remains in the 2 quarries adjacent to the Avery property.  (One of those properties was owned the Manitowoc County. Bones found on property owned by Manitowoc County not revealed to the defense)\n\n***Some context:***\n\n1. State of Wisconsin found Human remains on top of soil near Avery's trailer. They claimed that its where the bones were burned and cremated before even testing the burn pit soil for such evidence.\n2. State also found 4 locations (and at least some burn sites) in the quarry (piles 1-4 on map below)\n3. State wrote detailed report about the bones by Avery's trailer, and told the media, public, defense, and courts about them all the time.\n4. State didn't write any reports about the human remains in piles 1-4, didn't tell the media, public, defense, nor courts about them at all.\n5. The state forensic anthropologist examined these bones from piles 1-4 nearly a half year later, was told they were from the Avery property, and she included these bones in her summary a month before trial using the evidence numbers only and no description of where they originated from. Thus, Avery's defense team had no idea she included human remains found in the quarry in her final last minute report. Hell, she was unaware either.\n6. In court, the state claimed \"nobody knows what those are\" when referring to the quarry remains. A lie.\n\nIn short, the defense was misled about the human evidence, and they were arguing the quarry was the real crime scene. If the State had told the defense about ALL of the human remains, the defense's case would have been 100x stronger given they would be able to present human remains being found far away from their clients residence. After all, Avery wouldn't burn the body in the quarry then bring back evidence by his house to incriminate himself. No jury would buy that and the state knew that. They HAD to confine the crime scene as a whole to the Avery yard.\n\nThe kicker is the state didn't end up finding any evidence in Avery's burn pit proving a primary burn location, and their own expert testified that in her opinion, if it WASNT the primary burn location ,then she would have found other small, brittle bone fragments from other locations. (They did find exactly that, but she wasn't made aware of that when the evidence was turned over to her for examination).\n\nThose remains stashed in buckets for 6 months and never disclosed to the defense in a manner they could use. Defense claimed that area was crime scene at trial w/out this info.\n\nAnd for visual reference piles 1,2,3,4 are what the phone call is referencing, with piles 2 &amp; 3 being located on the Manitowoc County quarry (same county which was being sued by Avery for framing him in 1985). Just look how far away and huge the crib\n\nhttps://preview.redd.it/di0ai89pynpe1.png?width=2664&amp;format=png&amp;auto=webp&amp;s=dd8429946c0fbc869f6afa2629d14d82c454351c\n\nEnd Result:\n\nThis map was presented by Avery's lawyer to the court in 2018/2019. The court ruled it was barred from being used because Avery once filed his own pro se (on his own, and without a lawyer) motion years before Making a Murderer came out, and the court punished Avery for not bringing this unknown information up earlier (even though the phone call wasn't released via FOIA until 2018.\n\n...This audio and Jerry Buting's admission he was never given it was not filed in court, however. Nor was it shown in Making a Murderer part 2, which was released prior to this phone call being made public.",
        "upvotes": 34,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jf1cvl/netflix_show_update_making_a_murderer_the_steven/"
    },
    {
        "id": "1jfjtm5",
        "author": "Robemilak",
        "title": "Netflix’s Ted Sarandos Isn’t Done Disrupting Hollywood: On Winning the Streaming Wars, a Marvel ‘Fistfight’ and Defending Meghan Markle",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfjtm5/netflixs_ted_sarandos_isnt_done_disrupting/"
    },
    {
        "id": "1jfix2l",
        "author": "yakultbiss",
        "title": "What should I watch?",
        "content": "Recently have had more free time than usual so was wondering what I should watch. Any and all Recs are appreciated! I like drama, thriller/psychological, sitcoms, and honestly most shows.",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jfix2l/what_should_i_watch/"
    },
    {
        "id": "1jf154t",
        "author": "TheMirrorUS",
        "title": "Hollywood director charged with swindling Netflix out of $11M for unfinished sci-fi series",
        "content": "",
        "upvotes": 24,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jf154t/hollywood_director_charged_with_swindling_netflix/"
    },
    {
        "id": "1jfg2yo",
        "author": "Legitimate-Hotel-990",
        "title": "Netflix says that it will be removed from my device (samsung TV) on april 17",
        "content": "why though\n\nMy dad says it's just because he needs to update payment or whatever but when I searched it up people say it's because Netflix just decided to stop updating for some specific models, like older ones i think idk. I might sound really dumb right now but I actually do not know.\n\nnetflix what 💔",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jfg2yo/netflix_says_that_it_will_be_removed_from_my/"
    },
    {
        "id": "1jfjzqq",
        "author": "electricgodlew",
        "title": "Adolescence.. How did they do that shot?!",
        "content": "Like many of you I have recently watched adolescence on Netflix and thoroughly enjoyed it, but that's not the point of this post. There was some fantastic shots that would have been very difficult to perform, like the kid jumping out the window and the over the town - through the air shot in episode 2. Very cool but can probably be easily explained. \n\nHowever.. I need a media guru to tell me how a certain shot was done that I just CANNOT figure out. \n\nThe very start of episode 4 we see Stephen Graham in his shed then closes the door. The camera then side pans and appears to pass through a window pane of the shed. My natural assumption was \"Oh they've got a half built shed and the camera man walked out from a separate door or an open space\". But then the camera pans behind him and points up the garden path with a FULLY BUILT SHED! I just can't fathom how they did this in the continuous shot. If anyone has any explanation I would be very grateful and I apologise in advance if this is obvious to some!\n\nSpoiler tag added just incase... ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jfjzqq/adolescence_how_did_they_do_that_shot/"
    },
    {
        "id": "1jf514b",
        "author": "S4v1r1enCh0r4k",
        "title": "Erin Doherty says starring opposite newcomer Owen Cooper in ‘Adolescence’ reignited her love of acting",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jf514b/erin_doherty_says_starring_opposite_newcomer_owen/"
    },
    {
        "id": "1jedgsd",
        "author": "S4v1r1enCh0r4k",
        "title": "‘Adolescence’ Becomes Netflix’s Most-Watched Show of the Week",
        "content": "",
        "upvotes": 478,
        "comments": 151,
        "media": null,
        "permalink": "/r/netflix/comments/1jedgsd/adolescence_becomes_netflixs_mostwatched_show_of/"
    },
    {
        "id": "1jfha7z",
        "author": "Sensitive_War2107",
        "title": "On My Block Help!",
        "content": "I am looking to know which episode a scene took place. Its the scene where Jamal, Monse, Ruby and his Abuelita (Grandma) are dancing in a room surrounded by money. Can someone please tell me the episode and specifically the time as well. Thank you!\n\nI found a gif of it here but still can't find the episode and time. https://www.buzzfeed.com/shylawatson/on-my-block-season-2-recap",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfha7z/on_my_block_help/"
    },
    {
        "id": "1jfh4n9",
        "author": "JoshieGN",
        "title": "Beautiful Scene",
        "content": "Season 13 Episode 10 - Mac Finds his Pride\n\nFor those who don’t know:\n\nThis show is a comedy about the worst “everyday” people imaginable - it’s excellent\n\nEvery episode has the main characters somehow try and win in life, nearly always at the expense of others - including each other\n\nAs viewers, we see them all as somewhat inhuman.\n\n**Spoiler Warning for Below**\n\nNever had we had an episode where any of the gang show a serious delicate, vulnerable or intimate side - which js where this scene is a diamond in the rough\n\nMac has just told his dad, who dislikes him for putting him in jail many seasons ago, that he’s gay. Dad seems indifferent to it. Meant to be funny.\n\nBut then we get this scene, where the music is an original score, where the lighting is poignant, where it doesn’t feel like it was ad-libbed or quickly thrown together.\n\nWe get something raw and meaningful and an honest statement about the LGBT+ experience.\n\nThe choreography is incredible, the connection between Mac and this unknown dancer is palpable (her character in the show I mean - she is Kylie Shea, a ballerina in real life), and Mac actually got to “use [his] body!”\n\nIt stuck with me and really meant a lot\n\nI hope it does/ did for you too\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfh4n9/beautiful_scene/"
    },
    {
        "id": "1jffcsu",
        "author": "Remote-Breakfast3339",
        "title": "Arab show?",
        "content": "\n\nHey I’m looking for the name of this Kuwaiti drama I watched more then 5 years ago where this man had two families and left his first family because the new life did some sort of black magic. I remember one of the kids was a deaf boy who grew up to have a successful business. And in the new family they had a daughter who was an influencer. I can’t for the life of me remember the title if anyone has any leads please let me know ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jffcsu/arab_show/"
    },
    {
        "id": "1jfdqis",
        "author": "rehapeda",
        "title": "Zero Day Evan Green detainment by Mullen without a lawyer",
        "content": "Could they really have kept him there indefinitely without a lawyer? Otieno said he had no right to a lawyer because they were a \"special council\", but as far as I've ever heard, detainment by government requires a lawyer if the detainee asks for one.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jfdqis/zero_day_evan_green_detainment_by_mullen_without/"
    },
    {
        "id": "1jf4pw6",
        "author": "SpecificAwkward7258",
        "title": "I can watch The Recruit on my tablet but not my Chromecast?",
        "content": "I was browsing Netflix on my tablet last night. I'll note that my data was coming from our wifi network which is connected to our Starlink dish. While scrolling across the \"Recommended for me\" I saw \"The Recruit\" which a friend told me I should watch. Easiest thing to do was to watch a couple of minutes, then stop it and watch on my TV which is using my Chromecast to stream. (which is also connected to our Starlink dish)\n\nI did this but it didn't come up on \"Continue watching\" so I used the voice search asking for \"The Recruit\" and it brought me to a page about the series and then a link to \"Netflix shows like The Recruit\" but not the actual show. So then I said into the voice command \"Watch The Recruit on Netflix\" to which it replied \"The Recruit is not available on Netflix\" WTH??\n\nSo I went back to my tablet, it wasn't listed in my \"Keep watching\" so I did a search (typed in) and found it and started watching it again. I watched about 15 minutes then went back to my TV, it still wasn't listed in my Continue watching list so I did a voice search and again it told me that The Recruit is not available on Netflix. Once more, WTH?\n\nUpon backing out of the menu, lo and behold, now it's in my Continue watching list.  \n\nAnybody else ever had this happen to them?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jf4pw6/i_can_watch_the_recruit_on_my_tablet_but_not_my/"
    },
    {
        "id": "1jfbr20",
        "author": "Efficient_Attorney37",
        "title": "Saying I already have an account but won’t let me log in",
        "content": "So I’m trying to get Netflix and go to sign up it said took me to the log in page and said i already have an acc so I clicked “forgot password” and put my email in just for it to say i don’t have an acc. Tf is going on😭 pls help.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfbr20/saying_i_already_have_an_account_but_wont_let_me/"
    },
    {
        "id": "1jfaewh",
        "author": "peachtree875",
        "title": "\"not part of your household\" problem on Xbox?",
        "content": "Hello,\n\nI'm having problems with netflix but only with Xbox. It won't let us watch and says not part of household. I know we do confuse things as we have 2 different WiFi (one is an extender thingy but it means we have 2 diff WiFi passwords for each of them. Can't be helped, old house means the WiFi is pretty bad (plus we also dont live in a fttp area so we don't have super fast internet, and also live in the sticks in Scotland) so this is currently our best option. I'm really losing patience with it now as I can watch it on my phone on the same network as the Xbox but not on it. I've followed their problem solving guide but no luck. We had it come up before that it's not part of the netflix household and fixed it easily, but now it's just permanently like this. Is there a way around it? If not then I'm likely going to cancel netflix, I just wanna lie in bed and watch stuff but Netflix wants me to jump through a bloody obstacle course worth of hoops before that can happen! The hassle is NOT worth it at all. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jfaewh/not_part_of_your_household_problem_on_xbox/"
    },
    {
        "id": "1jfg9d2",
        "author": "Comfortable-Garbage4",
        "title": "Netflix it's time to bring back WKRP!",
        "content": "The show kept the highest viewer ratings its entire run both times it only ended due to budget issues. In the age of reboots, remakes and continuations this would be a perfect series to bring life into again. Netflix it's time to bring it back given up vote if you agree! \n\nhttps://preview.redd.it/9bnfr35horpe1.png?width=1000&amp;format=png&amp;auto=webp&amp;s=2093bc1d62789e69c4ada212d073eae23f6c12e1\n\n  \n",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jfg9d2/netflix_its_time_to_bring_back_wkrp/"
    },
    {
        "id": "1jebdhw",
        "author": "Greedy_Safety_4674",
        "title": "WATCH Adolescence!",
        "content": "Just finished Adolescence and wow. I’m not going to get into a long psychological analysis here. But, uh…let’s just say, I’m deeply disturbed by this show. I never thought I’d find a 13 year old scary. \n\nAfter ep. 3: hide your kids, hide your husband, and hide your wives (mm, the husbands may be safe though given his pathology).",
        "upvotes": 139,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1jebdhw/watch_adolescence/"
    },
    {
        "id": "1jey95y",
        "author": "MysteriousDelay6266",
        "title": "The Diamond Heist | Official Trailer | Netflix | April 16",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jey95y/the_diamond_heist_official_trailer_netflix_april/"
    },
    {
        "id": "1jf5y6t",
        "author": "onions-make-me-cry",
        "title": "Where do the Remind Me reminders go?",
        "content": "When you can see what's up and coming to be released on Netflix, there's a part to mark REMIND ME so you will theoretically get reminded when the show or movie debuts. But I've never been able to figure out where the reminders are going? Does anyone know? That feature just don't work for me.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jf5y6t/where_do_the_remind_me_reminders_go/"
    },
    {
        "id": "1jfgxwx",
        "author": "chask0ing",
        "title": "Points I think are important to take away from adolescence",
        "content": "I think every party in adolescence is both a victim and a participant in the horrific crime in different ways. There are a lot of parties involved, and if even one of them had done a better job, this could have been prevented—from Jaime himself to his friends, his parents, Katie, the fucked-up incel and manosphere indoctrination, and the school.\n\nI think we can all agree that the main point of the show is to find ways to prevent something like this from happening by understanding where people messed up. But I’ve already seen a lot of people talk about most of those aspects, so I want to mention two points that I think are very important to take from the show. I haven’t seen enough people discussing them, and I hope I can spark that conversation.\n\nParenting:\n\nI think people don't understand how difficult and important parenting is and don’t fully grasp the responsibility that comes with it.\n\nOne thing I feel is especially important (and something Jaime’s parents, along with many others, failed at) is that parents should be invested and spend more time understanding and immersing themselves in their kid's generational culture. They need to be able to talk to their kids in a language they both understand—one that reflects their experiences, phases, and thoughts within their own culture.\n\nThis helps parents recognize how significant each phase or thought is and how it could impact their child. I know this takes a lot of effort, but I genuinely believe that if you’re not willing or able to put in that effort, then please, just rethink your decision to have kids until you feel ready.\n\nRejection:\n\nI don't think many girls realize the amount of power they hold in these situations. They quite literally have the ability to make a boy's day—or even his entire week—feel like heaven or turn it into misery.\n\nThe first step is for girls to recognize just how much power they have and learn to use it wisely. For example, there’s a difference between a normal, kind rejection (sorry, but I'm not interested) and a harsh rejection (\"yuck,\" \"eww, nooo\", \"I'm not that desperate\" etc). We should encourage the former, especially in situations where a guy is approaching respectfully. Being kind doesn’t take away from a woman’s strength or freedom.\n\nConstant harsh rejections can either cause a person to internalize the pain—leading to extremely low self-esteem, low confidence, depression, suicidal thoughts, or even outright suicide if the guy is too deep in the rot—or it can cause them to externalize the pain and harm the person or others. I think as a society, we want to reduce both, and kind rejections are essential to achieving that.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jfgxwx/points_i_think_are_important_to_take_away_from/"
    },
    {
        "id": "1jf07ta",
        "author": "Somethingman_121224",
        "title": "Austrian Hit Crime Thriller 'Woman of the Dead' Is Back on Netflix with Season 2, Trailer Available",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jf07ta/austrian_hit_crime_thriller_woman_of_the_dead_is/"
    },
    {
        "id": "1jezy7g",
        "author": "ggroover97",
        "title": "Netflix’s Ted Sarandos Isn’t Done Disrupting Hollywood: On Winning the Streaming Wars, a Marvel ‘Fistfight’ and Defending Meghan Markle",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jezy7g/netflixs_ted_sarandos_isnt_done_disrupting/"
    },
    {
        "id": "1jfaasn",
        "author": "KitchenBeneficial302",
        "title": "Boo-Zsa-Boo and Banana is coming to Netflix in May 2025!",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5nqkqndi7qpe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jfaasn/boozsaboo_and_banana_is_coming_to_netflix_in_may/"
    }
]