[
    {
        "id": "1kb0pio",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Jenny Jue - Wednesday 4/30 at 8:00 PM ET - Casting Director ('Inglorious Basterds', 'Snowpiercer', 'Okja', 'The Wedding Banquet', 'No One Will Save You', 'The Legend of Aang: The Last Airbender')",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/idxosi2vmuxe1.png?auto=webp&amp;s=edc76c120dd1d673d206c8528c8415536b10b030"
        },
        "permalink": "/r/movies/comments/1kb0pio/amaqa_announcement_jenny_jue_wednesday_430_at_800/"
    },
    {
        "id": "1k79rk2",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Accountant 2 / The Legend of Ochi / Until Dawn) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Love &amp; Basketball](https://old.reddit.com/r/movies/comments/1k79oaq/official_throwback_discussion_love_basketball/?)\n\n[The Virgin Suicides](https://old.reddit.com/r/movies/comments/1k79och/official_throwback_discussion_the_virgin_suicides/?)\n\n[U-571](https://old.reddit.com/r/movies/comments/1k79oe1/official_throwback_discussion_u571_spoilers/?)\n\n# Still in Theaters\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n**I'm a bit behind on streaming releases so here's a bunch of them from the last few weeks**\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)\n\n[G20](https://old.reddit.com/r/movies/comments/1k7zfzp/official_discussion_g20_spoilers/?)\n\n[2073](https://old.reddit.com/r/movies/comments/1k7zg0y/official_discussion_2073_spoilers/?)\n\n[Holland](https://old.reddit.com/r/movies/comments/1k7zg30/official_discussion_holland_spoilers/?)",
        "upvotes": 28,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1k79rk2/official_discussion_megathread_the_accountant_2/"
    },
    {
        "id": "1kasuaw",
        "author": "RobotiSC",
        "title": "Official Poster for 'Now You See Me: Now You Don't'",
        "content": "",
        "upvotes": 12788,
        "comments": 1659,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nqonufbu0txe1.png?auto=webp&amp;s=e88c525aae436e1cf58e2f07ba0f34e197388347"
        },
        "permalink": "/r/movies/comments/1kasuaw/official_poster_for_now_you_see_me_now_you_dont/"
    },
    {
        "id": "1kb0d0q",
        "author": "BostonNewEngland",
        "title": "Oscars’ New Rule Requiring Voters to Watch All Nominees, but Academy Members Already Found Loopholes",
        "content": "",
        "upvotes": 2187,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rHHTLDZekkPOW3u9Vr7CC6QkkA6ZO3gRjRzglc9bpWQ.jpg?auto=webp&amp;s=849a84143a386d9dee2d7d71095ab92a98443288"
        },
        "permalink": "/r/movies/comments/1kb0d0q/oscars_new_rule_requiring_voters_to_watch_all/"
    },
    {
        "id": "1kankcc",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Zach Cregger’s ‘Weapons’",
        "content": "",
        "upvotes": 10156,
        "comments": 662,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mqb9dknxwrxe1.jpeg?auto=webp&amp;s=ac2aa0bd14014b0146aeabf6dd36398428adfb1d"
        },
        "permalink": "/r/movies/comments/1kankcc/official_poster_for_zach_creggers_weapons/"
    },
    {
        "id": "1kb0rp8",
        "author": "Xano74",
        "title": "I finally saw the Conan The Barbarian movies and they were nothing like I expected",
        "content": "I recently bought Mortal Kombat 1 on sale with all the DLC and was trying to figure out who to play.\n\nI decided to go in reverse order on the character select menu which made me choose Conan first. I knew very little about the movies or character other than Arnold plays him\n\nSo after playing Conan I really started enjoying him and decided I needed to see where he came from.\n\nMy expectations were that Conan The Barbarian and Destroyer were just dumb 80s action movies and there would be a lot of violence and bravado without much substance.\n\nBoy was I wrong. Instead I found its an Epic Dark Fantasy movie with awesome music, tons of camp, and a great performance by the late James Earl Jones.\n\nBoth movies reminded me of a DnD campaign. I did not expect the movies to be so nerdy in the fantasy element. I was expecting Expendables level of dumb but instead I got Lord of the Rings movie before Lord of the Rings.\n\nI liked how the movies did little to explain things or even hype up certain moments. There's a part in Conan 1 where Conan gets crucified. Any other movie would have a super hyped up, dark and depression lead up to him getting tortured, etc.\n\nIn the actual movie, James Earl Jones says \"crucify him\" and it immediately just jumps to Conan on a tree with 0 build up.\n\nSimilarly Conan somehow sneaks into the enemy stronghold at the end with absolutely no fighting any guards and gets all the way to Thulsa Doom to kill him with 0 explanation. \n\nIt doesn't feel the need to baby the audience and I like that.\n\nConan 2 felt more like a standard fantasy adventure until the end. I did not expect the final battle to be against a giant fish monster god.\n\nMy wife and I ended up really enjoying the movies and I can tell why they are cult classics. \n\nI really enjoyed all the side Characters. Valeria was badass. Subotai was a total bro helping Conan after just meeting him. Malak made a good comedy relief while being super helpful in key moments. Zulu was a badass and had some awesome goofy facial expressions throughout.\n\nI'm glad I decided to finally watch these cult classics. Is the 2010 reboot with Jason Mamoa any good?",
        "upvotes": 1122,
        "comments": 364,
        "media": null,
        "permalink": "/r/movies/comments/1kb0rp8/i_finally_saw_the_conan_the_barbarian_movies_and/"
    },
    {
        "id": "1kay4l0",
        "author": "RayoftheRaver",
        "title": "What is the greatest one single word line in movie history and why?",
        "content": "Answers must be one single word line that makes not only a scene but a whole movie. Think Ceaser's, \"NO!\" from Planet of the Apes, \"Rosebud\" in Citizen Kane.\n\nIt's not just the word, it's the emotion, the effect on not just the characters but the audience too!\n\nRepeated singular words don't count, like \"Toga! Toga! Toga!\" from National Lampoon's Animal House.",
        "upvotes": 1045,
        "comments": 1404,
        "media": null,
        "permalink": "/r/movies/comments/1kay4l0/what_is_the_greatest_one_single_word_line_in/"
    },
    {
        "id": "1kan9yo",
        "author": "MarvelsGrantMan136",
        "title": "THE SMASHING MACHINE | Official Trailer | A24",
        "content": "",
        "upvotes": 3623,
        "comments": 975,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4BgTQ9qV4JFRu5KADyJOfgh9bGouvi8G7QHnv40A2t8.jpg?auto=webp&amp;s=5c94c63a3ae9ce3aaf497b834f3b4c1263f78f4d"
        },
        "permalink": "/r/movies/comments/1kan9yo/the_smashing_machine_official_trailer_a24/"
    },
    {
        "id": "1kamq1u",
        "author": "MarvelsGrantMan136",
        "title": "First Images from Darren Aronofsky’s ‘Caught Stealing’ - A former baseball player (Austin Butler) finds himself immersed in criminality in New York in the 1990s.",
        "content": "",
        "upvotes": 3462,
        "comments": 467,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f9b2z3kqprxe1.jpeg?auto=webp&amp;s=ec3feb231d7424668b09add551d9370b8f515e99"
        },
        "permalink": "/r/movies/comments/1kamq1u/first_images_from_darren_aronofskys_caught/"
    },
    {
        "id": "1kb07uh",
        "author": "mrnicegy26",
        "title": "Steven Spielberg Calls ‘The Godfather’ the ‘Greatest American Film Ever Made’ at Francis Ford Coppola AFI Life Achievement Award Ceremony",
        "content": "",
        "upvotes": 538,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qk-20cMHAxHAlhFwLV4rVXrPSBqFP0-jb1LWQJjlPCQ.jpg?auto=webp&amp;s=61e543754c28b74ad7c3059ff06b6d006fc764cd"
        },
        "permalink": "/r/movies/comments/1kb07uh/steven_spielberg_calls_the_godfather_the_greatest/"
    },
    {
        "id": "1karhhy",
        "author": "ChiefLeef22",
        "title": "'Thunderbolts*' - Review Thread",
        "content": "Director: Jake Schreier\n\nCast: Florence Pugh, David Harbour, Sebastian Stan, Wyatt Russell, Hannah John-Kamen, Lewis Pullman, Julia Louis-Dreyfus\n\n*Ensnared in a death trap, an unconventional team of antiheroes -- Yelena Belova, Bucky Barnes, Red Guardian, Ghost, Taskmaster and John Walker -- embarks on a dangerous mission that forces them to confront the darkest corners of their pasts.*\n\nRotten Tomatoes: [89%](https://www.rottentomatoes.com/m/thunderbolts)\n\nMetacritic: [69/100](https://www.metacritic.com/movie/thunderbolts/)\n\nSome Reviews:\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/thunderbolts-review-marvel-movie-1235119020/) \\-  B-\n\n&gt;It’s a force strong enough to bond a group of enemies into the world’s greatest team of superheroes, and to malform decent people into indiscriminate murderers. It’s a force strong enough to cohere a string of spandex-clad blockbusters into one of the defining cultural phenomena of the 21st century, and — just maybe — a force strong enough to save that series of blockbusters from collapsing under its own weight in the face of certain Doom. Time will tell. The good news for the MCU is that “Thunderbolts\\*” buys them some more of it, and at a much-needed discount.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/thunderbolts-review-marvel-the-new-avengers-1236381303/)\n\n&gt;However frivolous it may sound, Schreier’s scrappy ensemble effort is anything but a one-off (and considering its almost $200 million budget, not so scrappy either). It may star six characters you either forgot about or couldn’t name if your life depended on it, but going forward, you’ll be expected to know who they are and could be quizzed on events that happen in “Thunderbolts” at any time — starting with the asterisk that appears after the title, and the explanation which rewards opening-weekend audiences with spoiling for everyone who catches up with it late.\n\n[Empire - John Nugent](https://www.empireonline.com/movies/reviews/thunderbolts/) \\- 3/5\n\n&gt;It doesn’t always land, but it dares to be different, from the title to the team-up. Fresh and thoughtful in a way recent Marvel efforts haven’t always managed.\n\n[IGN - Clint Gage](https://www.ign.com/articles/thunderbolts-review-marvel-sebastian-stan-florence-pugh-david-harbour?utm_source=threads,twitter) \\- 7/10\n\n&gt;Thunderbolts\\* is the most solid the sacred timeline has felt in a little while, providing an adventure befitting its overlooked title characters. While it very capably dabbles in a darker tone – touching on the mental health of heroes and villains alike – the filmmakers struggle to balance that dabbling with a snappy, comedic energy. While the movie as a whole left me feeling like it was a downer on the balance, it’s at least the good kind of downer, filled with characters I’m looking forward to seeing again.\n\n[SlashFilm - BJ Colangelo](https://www.slashfilm.com/1846662/marvel-thunderbolts-movie-review/) \\- 7/10\n\n&gt;\"Thunderbolts\\*\" is exactly the type of movie the MCU needs right now, but after a losing streak of less-than-stellar performances, I fear that audiences won't turn out for the second-string players, which will only send the message to the powers at be to go back to the boring, safe, well of familiarity. But I hope I'm wrong. I hope that \"Thunderbolts\\*\" overperforms at the box office and helps usher in a new era of Marvel movies that allows actors to act, stakes to be raised by putting characters in tangible environments instead of CGI hellscapes, characters that force us to flex our empathy muscles, and Florence Pugh leading the way.\n\n[Collider - Ross Bonaime](https://collider.com/thunderbolts-review-mcu/) \\- 8/10\n\n&gt;*Thunderbolts\\** might not be the mightiest hero that the MCU needs, but **it feels like this cinematic universe is taking a step forward in an already convoluted world.** This isn’t necessarily a huge sea change, but it shows that even this deep in, Marvel can tell smarter, more emotional stories without forsaking fun, action, and big explosions. It’s the sort of level that more superhero films should be at, and shows exciting promise for where these movies could go (especially with *Fantastic Four* coming in just a few months). And even though the film does at times feel like it's setting up for future projects, it never feels burdened by this, but rather, like we're seeing the natural progression of where these characters' stories should lead. *Thunderbolts\\** is a pleasant surprise in the MCU; it only took a team-up of Marvel’s unlikeliest superheroes to bring it out in them.\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/04/thunderbolts-review-marvels-fun-supporting-avengers-1236379893/)\n\n&gt;Director Jack Schreier who was imported from the Netflix limited series *Beef,* is more interested in the “human” elements here than a lot of fancy CGI trickery Marvel has been so fond of in the past, and so there is much to uncover as this group of anti-heroes, not seeing themselves as “heroes” at all, deal with issues of trust, betrayal, and just who they really are. It is a smart and amusing script by Eric Pearson and Joanna Calo an origin story inspired of course by the 1997 comic but quite different and one that could go to intriguing places in future installments and the already announced new editions of the Avengers franchise.\n\n[Independent (UK) - Clarisse Loughrey](https://www.the-independent.com/arts-entertainment/films/reviews/thunderbolts-review-marvel-florence-pugh-b2740716.html) \\- 4/5\n\n&gt;*Thunderbolts\\** does feel different to what’s come before, not because of those indie credentials, but because it’s the first of its kind to seem genuinely self-aware. We’re repeatedly told that, now the Avengers are gone, the world is lacking in heroes and it’s becoming increasingly clear the old systems don’t work anymore. These are statements that apply equally to Marvel’s frustrated inability to build a new roster post-*Endgame*, since they refuse to stick by anything that isn’t a box office smash (RIP the Eternals), and to the general, hopeless state of our world. *Thunderbolts\\**, in that odd way, might actually then be the ultimate Marvel film for now.\n\n[TIMES (UK) - Kevin Maher](https://www.thetimes.com/culture/film/article/thunderbolts-review-marvel-florence-pugh-c9rldc6f7) \\- 4/5\n\n&gt;In the end the most radical element of this revamped Marvel entry is its suggestion that the problems of the world can’t be solved by a super-powered punch to the face, but by a heartfelt group hug. Sappy and saccharine, perhaps.",
        "upvotes": 1430,
        "comments": 580,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2p435Urc_QX6k6fnrVNCUiW1KUdpQNemSPb479VFOD4.jpg?auto=webp&amp;s=03dde806cb87c02355cc42346ff3ee962b26cbd4"
        },
        "permalink": "/r/movies/comments/1karhhy/thunderbolts_review_thread/"
    },
    {
        "id": "1katz7y",
        "author": "WobblingWomble",
        "title": "Robin Hood Men in Tights : Craziest experience I had with a movie",
        "content": "Ok, the title may sound like an overstatement, but hear me out.\n\nI was 15/16yo at the time, got dengue fever, which wasn't a pleasant experience. I got a high fever, nausea, and sometimes hallucinations. \n\nAnyway, I was sick, couldn't sleep because of the fever, so I just randomly turned my TV on and saw the title, 'Robin Hood'. I thought it was Kevin Costner's Robin Hood, I didn't read the 'Men in Tights' part.\n\nSo for the next two hours, I was laughing despite the pain and was confused about what was going on. I never used drugs, but that movie gave me an experience of what it feels like to be high. For the next 10 years or so, I thought that movie was some kind of fever dream, until I saw a clip of it on YouTube. \"Wait, so that wasn't a dream??!! THAT'S AN ACTUAL MOVIE??!!\"\n\nHighly recommended, an absolute 20/10. 12 Angry Men? Goodfellas? Get outta here.  \n\n\nhttps://preview.redd.it/4cayam3w8txe1.png?width=220&amp;format=png&amp;auto=webp&amp;s=15c670e7a58604435840e97a0cb3928f9f531e1e\n\n",
        "upvotes": 1025,
        "comments": 207,
        "media": null,
        "permalink": "/r/movies/comments/1katz7y/robin_hood_men_in_tights_craziest_experience_i/"
    },
    {
        "id": "1kasv3r",
        "author": "RobotiSC",
        "title": "Now You See Me: Now You Don’t - Official Trailer",
        "content": "",
        "upvotes": 807,
        "comments": 600,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YcQbdEvkefxBJp7ZQJRwWLD3HFJ898J32V8Xcnp8il8.jpg?auto=webp&amp;s=056826283bed41fdb315c9d7b7ac1838454f2477"
        },
        "permalink": "/r/movies/comments/1kasv3r/now_you_see_me_now_you_dont_official_trailer/"
    },
    {
        "id": "1kb7nn1",
        "author": "BunyipPouch",
        "title": "First Poster for Horror-Thriller 'Dangerous Animals' - A surfer is abducted by a shark-obsessed serial killer and held captive on his boat, she must figure out how to escape before he carries out a ritualistic feeding to the sharks below.",
        "content": "",
        "upvotes": 89,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oucmlu14dwxe1.jpeg?auto=webp&amp;s=07562f52f2e4f66891dfea5375545d208bd68033"
        },
        "permalink": "/r/movies/comments/1kb7nn1/first_poster_for_horrorthriller_dangerous_animals/"
    },
    {
        "id": "1kao9n5",
        "author": "semafornews",
        "title": "Why ‘Margin Call’ remains Wall Street’s favorite movie — and the best indictment of it",
        "content": "",
        "upvotes": 1192,
        "comments": 212,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cu7OJzo9xZGYF4VMdpgvFBM5rwbJ3Rba1bWP-cH5NwQ.jpg?auto=webp&amp;s=c39e3da87530276478a9641378fbdb4d2b1769db"
        },
        "permalink": "/r/movies/comments/1kao9n5/why_margin_call_remains_wall_streets_favorite/"
    },
    {
        "id": "1kanpqt",
        "author": "MarvelsGrantMan136",
        "title": "Weapons | Official Trailer",
        "content": "",
        "upvotes": 1056,
        "comments": 277,
        "media": null,
        "permalink": "/r/movies/comments/1kanpqt/weapons_official_trailer/"
    },
    {
        "id": "1kau1hf",
        "author": "SafeBodybuilder7191",
        "title": "Charli xcx to Star in and Produce ‘Audition’ Director Takashi Miike’s Next Film",
        "content": "",
        "upvotes": 351,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/he9KlfxZCMM1-q3z1ZSHv7Q_u4QderjKU2WtLGWo97U.jpg?auto=webp&amp;s=2150560c8f943128e36039999d475d338d5e8034"
        },
        "permalink": "/r/movies/comments/1kau1hf/charli_xcx_to_star_in_and_produce_audition/"
    },
    {
        "id": "1karljn",
        "author": "Task_Force-191",
        "title": "BROKEBACK MOUNTAIN - 20th Anniversary Release Official Trailer - Only in Theaters this June",
        "content": "",
        "upvotes": 417,
        "comments": 152,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mMORtFmQiCu3IZdF3aIkZpw1R35oVbR1BMUvORhXpkk.jpg?auto=webp&amp;s=ce389e9f43829db33ed88364396468f20391ba86"
        },
        "permalink": "/r/movies/comments/1karljn/brokeback_mountain_20th_anniversary_release/"
    },
    {
        "id": "1kao7gu",
        "author": "KillerCroc1234567",
        "title": "New Poster for “Bring Her Back”",
        "content": "",
        "upvotes": 580,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/takxznv92sxe1.jpeg?auto=webp&amp;s=c3e2d2e8f3e507789845e20632529653ee5584ca"
        },
        "permalink": "/r/movies/comments/1kao7gu/new_poster_for_bring_her_back/"
    },
    {
        "id": "1kb12rw",
        "author": "RoyaleWhiskey",
        "title": "Who is your most hated character with the least amount of screen time?",
        "content": "I was rewatching Forrest Gump and the actor who played Wesley does an amazing job at being an asshole. In about two minutes of screentime during the black panther party scene I already hate him. \n\nI hate his haircut, his attitude, his voice, he calls Forest a \"baby killer\", and he slaps Jenny. No redeeming qualities whatsoever. ",
        "upvotes": 107,
        "comments": 132,
        "media": null,
        "permalink": "/r/movies/comments/1kb12rw/who_is_your_most_hated_character_with_the_least/"
    },
    {
        "id": "1kanrhz",
        "author": "indiewire",
        "title": "Kathy Bates Tells Director Rob Reiner She Regrets Toning Down Misery Violence",
        "content": "",
        "upvotes": 585,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A42Dr4NIa_A8GRUv9PWtkPIOBKqFPAVSUjovYrZoQws.jpg?auto=webp&amp;s=9a84e195e12336368b4b2a2fb2cc0666cb0c0425"
        },
        "permalink": "/r/movies/comments/1kanrhz/kathy_bates_tells_director_rob_reiner_she_regrets/"
    },
    {
        "id": "1kat0zm",
        "author": "Amaruq93",
        "title": "Cora Sue Collins, celebrated child actress at MGM in the 1930s, has passed away at 98",
        "content": "",
        "upvotes": 213,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3HnWRrr83X3USBFpMIOkBZ3YECSNQaAcErBMYDRQTqI.jpg?auto=webp&amp;s=b1054d0f8481f12eea3e0f6733cfd09c9bdb293e"
        },
        "permalink": "/r/movies/comments/1kat0zm/cora_sue_collins_celebrated_child_actress_at_mgm/"
    },
    {
        "id": "1kamklx",
        "author": "Chai_Lijiye",
        "title": "Leonardo DiCaprio Calls Taxi Driver His Favorite Scorsese Film – Scorsese Credits the Film’s Success to Screenwriter Paul Schrader.",
        "content": "",
        "upvotes": 468,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/iaazrbadorxe1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kamklx/leonardo_dicaprio_calls_taxi_driver_his_favorite/"
    },
    {
        "id": "1kawma5",
        "author": "KillerCroc1234567",
        "title": "‘The Two Popes’ Viewership Pops on Netflix Following Francis’ Death",
        "content": "",
        "upvotes": 124,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Era8dPyNa4p5HuEOHUYimStphknBN4Ax4jKOO85e5nQ.jpg?auto=webp&amp;s=cbeb6859acb911554c2162708d122fe9e0af90ee"
        },
        "permalink": "/r/movies/comments/1kawma5/the_two_popes_viewership_pops_on_netflix/"
    },
    {
        "id": "1kbb63n",
        "author": "DamnThatsInsaneLol",
        "title": "Michael B. Jordan Reacts to Tom Cruise Going To See ‘Sinners’: “Nah This Crazy… Thanks for the Love and Support!!!”",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/f9Rh1L5GQBO9HKaNq0RLMOejSfkmjDHfXt6u36EMb24.jpg?auto=webp&amp;s=d491ef3f635c1ffb11a53fe153e725e2ed446981"
        },
        "permalink": "/r/movies/comments/1kbb63n/michael_b_jordan_reacts_to_tom_cruise_going_to/"
    },
    {
        "id": "1kazj6l",
        "author": "DubiousLLM",
        "title": "Netflix is streaming a showcase of Hitchcock’s greatest films this June | The streamer is also teaming up with the Paris Theater in New York City to put on a series of theatrical screenings",
        "content": "",
        "upvotes": 82,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bcktuUH49TznSCkyQozw3frd2rX_67VqRLjeNa0KExg.jpg?auto=webp&amp;s=8a70005f4d161e29bee1db4c77585c46833e0756"
        },
        "permalink": "/r/movies/comments/1kazj6l/netflix_is_streaming_a_showcase_of_hitchcocks/"
    },
    {
        "id": "1kat1kd",
        "author": "NoCulture3505",
        "title": "Andrew Karpen Dies: Bleecker Street Media Founder And CEO Was 59",
        "content": "",
        "upvotes": 189,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XRe0I9QhFOONb3vb0jLBl_YdJA5zgI2iqC-4OjrUUO4.jpg?auto=webp&amp;s=8385b3c4a4be2b5292ba1d68354c9a6f750b4023"
        },
        "permalink": "/r/movies/comments/1kat1kd/andrew_karpen_dies_bleecker_street_media_founder/"
    },
    {
        "id": "1ka4ra4",
        "author": "danielthetemp",
        "title": "New image of David Corenswet and Rachel Brosnahan in James Gunn's 'SUPERMAN'",
        "content": "",
        "upvotes": 8583,
        "comments": 919,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mqie1lg6rmxe1.jpeg?auto=webp&amp;s=d5d4de346a7b4b5c6f85ffd819fe9f75d5c6e8af"
        },
        "permalink": "/r/movies/comments/1ka4ra4/new_image_of_david_corenswet_and_rachel_brosnahan/"
    },
    {
        "id": "1kaz978",
        "author": "bigpig1054",
        "title": "David Lynch on the Quest for the Perfect Milkshake",
        "content": "",
        "upvotes": 58,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qGAqNe3KOHs4ijQBZlgT-zdXwKPIhMNLXpN1tO3JSZM.jpg?auto=webp&amp;s=fd91b0088ac5118eb105d5ed5866357f90804c99"
        },
        "permalink": "/r/movies/comments/1kaz978/david_lynch_on_the_quest_for_the_perfect_milkshake/"
    },
    {
        "id": "1kaz1l8",
        "author": "theatlantic",
        "title": "‘The Legend of Ochi’ Revives an Extinct Kind of Filmmaking",
        "content": "",
        "upvotes": 55,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0sYqgyoLVfYJqrFbELhehS-3hUwVBCNHKK1Wdps_Tv0.jpg?auto=webp&amp;s=b3215d5b2d0193c9c03eee164faaf48a4c53c5a0"
        },
        "permalink": "/r/movies/comments/1kaz1l8/the_legend_of_ochi_revives_an_extinct_kind_of/"
    },
    {
        "id": "1kaxpou",
        "author": "MiserableSnow",
        "title": "Lost in Starlight | Official Teaser | Netflix",
        "content": "",
        "upvotes": 38,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ysgstcBbg4CAG4KgOyxuK-fOjMQidB0VaXSI-MyTmUQ.jpg?auto=webp&amp;s=6d5e52e9b5fad601012c8dd7ff9793e7a426219f"
        },
        "permalink": "/r/movies/comments/1kaxpou/lost_in_starlight_official_teaser_netflix/"
    },
    {
        "id": "1kaq1j4",
        "author": "Comic_Book_Reader",
        "title": "Fear Street: Prom Queen | Official Trailer | Netflix",
        "content": "",
        "upvotes": 97,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OdYlp0Lp_pzoriaDaSWlEIXTPps6OFDbv_G9nKWDU2Y.jpg?auto=webp&amp;s=ad45080ae7fe54e3ec87a91927012ab21aa42ca1"
        },
        "permalink": "/r/movies/comments/1kaq1j4/fear_street_prom_queen_official_trailer_netflix/"
    }
]