[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1p0eu04",
        "author": "DistributinOfWealth",
        "title": "Torino e il problema eterno delle cacche di cane",
        "content": "Perché a Torino ci sono così tante cacche di cane per strada?\n\nCamminare in Borgo Vittoria è impossibile: ogni dieci passi trovi una merda.\n\nNon capisco come sia accettabile che un quartiere debba convivere con questo schifo ogni giorno. Possibile che la gente non riesca a raccogliere ciò che il proprio cane lascia?\n\nVorrei davvero capire: perché siamo messi così male su una cosa tanto semplice?",
        "upvotes": 18,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1p0eu04/torino_e_il_problema_eterno_delle_cacche_di_cane/"
    },
    {
        "id": "1p0chiz",
        "author": "Dariocc",
        "title": "CASE A TORINO",
        "content": "Ciao ragazzi, scusate l'annuncio qui, mi chiedevo come sia possibile che a Torino non fittano a coppie, se non per cifre spropositate (agenzia esclusa). O che comunque la maggior parte delle case sono destinate agli studenti.\nCioè un Barman, lavoratore regolare non potrà mai trasferirsi lì a meno che non frequenti l'università...\nHo vissuto un po' in giro per l'Europa, mai avuto tutti sti problemi",
        "upvotes": 14,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1p0chiz/case_a_torino/"
    },
    {
        "id": "1p08p7b",
        "author": "Few_Willingness_5198",
        "title": "lo sapevate che lo studentato RELIFE è già diventato un albergo 2 stelle?",
        "content": "mancava proprio un ennesimo albergo pubblicizzato tanto dai giornali come studentato e basta.",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p08p7b/lo_sapevate_che_lo_studentato_relife_è_già/"
    },
    {
        "id": "1p0g5xi",
        "author": "Top-Analysis-887",
        "title": "La Sfilata delle Star al TFF: Voi chi vorreste intervistare? e perchè?",
        "content": "Attenzione, amanti del cinema! Mentre l'arrivo di Antonio Banderas per la \"Stella della Mole\" accende i riflettori sul **Torino Film Festival (TFF)**, sappiamo benissimo che la lista degli ospiti d'onore non finisce qui! Il TFF è famoso per portare in città talenti incredibili: registi, attori di culto, e nomi emergenti.\n\nImmaginate di avere in mano un microfono. Se poteste intervistare *chiunque* tra gli ospiti di quest'anno, chi scegliereste? E perchè?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p0g5xi/la_sfilata_delle_star_al_tff_voi_chi_vorreste/"
    },
    {
        "id": "1ozng50",
        "author": "ImpressionOk8195",
        "title": "What do we have in Turin?",
        "content": "",
        "upvotes": 92,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qprjdjlgqu1g1.jpeg?auto=webp&amp;s=8a7412470bef0ee7dca5fa3219294e3f7f6ac325"
        },
        "permalink": "/r/torino/comments/1ozng50/what_do_we_have_in_turin/"
    },
    {
        "id": "1p0cv1a",
        "author": "Financial-Care1663",
        "title": "Dove parcheggiare l'auto per due settimane?",
        "content": "Ciao ragazzi, per le vacanze di natale partirò due settimane e non vorrei lasciare l'auto parcheggiata in strada, soprattutto considerando che sto vicino san salvario e la fauna locale non è il massimo, ci sono dei parcheggi a pagamento ma ragionevoli o ancora meglio gratis come supermercati dove posso lasciarla senza problemi? Preferirei al coperto in caso di grandine. Va bene anche lontano ma comunque raggiungibile coi mezzi\n\nGrazie mille",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1p0cv1a/dove_parcheggiare_lauto_per_due_settimane/"
    },
    {
        "id": "1p0935x",
        "author": "TheShynola",
        "title": "Turin, where would you rather eat? I built something for you. (Updated!)",
        "content": "\n\nHi r/ Torino,\n\nI’ve mapped out Turin’s dining scene in an app I built called Vota. The idea is simple: you see two restaurants side by side, pick the one you prefer, and the ranking updates instantly. The more people vote, the smarter the list becomes.\n\nYou could, for example, compare Del Cambio with Tre Galline - two completely different experiences, but over time, even very different places naturally find their true level in the ranking.\n\nNo fake reviews. No influencers. No ads. No AI-generated text. Just real votes from real people who actually eat here. No Tripadvisor noise, no Google clutter - only simple, honest comparisons.\n\nThe app is free, doesn’t require registration, and collects no personal data.  \nHere’s the iPhone version:  \n[https://apps.apple.com/app/vota-restaurant-ratings/id6744969212](https://apps.apple.com/app/vota-restaurant-ratings/id6744969212)\n\n**And here’s the brand new Android version, which many of you asked for:**  \n[https://play.google.com/store/apps/details?id=org.vota.app](https://play.google.com/store/apps/details?id=org.vota.app)\n\nP.S. I’m currently in Sweden, not here. I don’t collect data, sell anything, or use AI-generated text inside the app. The restaurants above are just examples, chosen with a little help from AI. I’d love to see how you - the people of Turin - would rank your own favorites, from Quadrilatero to San Salvario and beyond. I’m posting in other cities too, just so you know :)",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RQr9WHUs11q3-RU7BWbmmicPPkIxcBmPcQvNqXyGzEc.jpeg?auto=webp&amp;s=6d1d59dae4b735c70fb9bd5ef1dd78f2ef284fdd"
        },
        "permalink": "/r/torino/comments/1p0935x/turin_where_would_you_rather_eat_i_built/"
    },
    {
        "id": "1p07fyq",
        "author": "Portus-Studios",
        "title": "Portus Studios – Looking for a Creative Writer &amp; Video Editor (Turin-based), become part of a new growing team!",
        "content": "**ENG**\n\nHi everyone!  \nI’m building Portus Studios, an indie game studio based in Turin (Italy). We’re first-time developers working on a shoestring budget, so for now these roles are unpaid, but I’m absolutely open to discuss details, expectations, and how things may evolve as the project grows.\n\nI’m currently looking to bring two new collaborators onto the team:\n\n• Creative Writer: to help write the game script, narrative arcs, dialogues, and branching choices.  \n• Video Editor: to prepare short-form video content for our social media (Instagram, X, TikTok, etc.).\n\nA bit about the project:  \nWe’re developing a narrative-driven, open-map, isometric game where choices matter. The story is set in modern Southern Italy, blending crime and horror themes with grounded cultural elements. The goal is to create a story-rich experience shaped directly by the player’s decisions.\n\nWe’re based in Turin, so if you’re local I’d be more than happy to meet up for a coffee and chat.  \nOtherwise, feel free to DM me if you’re interested or want more details.\n\n**ITA**\n\nCiao a tutti!  \nSto costruendo Portus Studios, uno studio indie con sede a Torino. Siamo sviluppatori alle prime armi e stiamo lavorando con un budget molto limitato, quindi al momento queste posizioni sono non retribuite, ma sono assolutamente disponibile a parlarne, chiarire aspettative e spiegare come il progetto potrà evolversi.\n\nAl momento sto cercando due nuove figure da aggiungere al team:\n\n• Creative Writer / Sceneggiatore: per lavorare alla sceneggiatura del gioco, alle linee narrative, ai dialoghi e alle scelte ramificate.  \n• Video Editor: per montare contenuti video da pubblicare sui nostri social (Instagram, X, TikTok, ecc.).\n\nQualche informazione sul gioco:  \nStiamo sviluppando un titolo narrativo, open-map e isometrico, dove le scelte contano davvero. La storia è ambientata nell’Italia meridionale contemporanea, con un mix di crime e horror, radicato nella cultura locale. L’obiettivo è creare un’esperienza narrativa ricca e modellata dalle decisioni del giocatore.\n\nSiamo basati a Torino, quindi se siete in zona mi farebbe piacere incontrarvi per un caffè!  \nIn alternativa, potete tranquillamente scrivermi in DM per saperne di più o per candidarvi.",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h0l7q2eggz1g1.jpeg?auto=webp&amp;s=7d0f7fd69910f9b562518f264bd6bab0251be6b2"
        },
        "permalink": "/r/torino/comments/1p07fyq/portus_studios_looking_for_a_creative_writer/"
    },
    {
        "id": "1p0dlvq",
        "author": "DOG_EGG_06",
        "title": "I'm a university student from Bulgaria and I'm looking for a gym",
        "content": "Does anyone know good gyms around porta susa that don't require a 12 month subscription and I can just pay monthly? And the price isn't something absurd. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p0dlvq/im_a_university_student_from_bulgaria_and_im/"
    },
    {
        "id": "1p0ckp9",
        "author": "Babele_20",
        "title": "Corsi gratuiti Torino",
        "content": "Ciao, cerco qualcuno che ha fatto/ sta facendo corsi gratuiti a Torino per essere inseriti nel mondo del lavoro, a me interessava \"tecnico per lo sviluppo di risorse web\" ma vorrei sentire anche pareri su altri corsi. Qualcuno ne sa qualcosa o mi consiglia qualcosa? Grazie mille",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p0ckp9/corsi_gratuiti_torino/"
    },
    {
        "id": "1p09vwu",
        "author": "hhhowtho-",
        "title": "Scrum Master Role Salary",
        "content": "Hello, how much RAL should it be realistic to ask for a scrum master role in tech for Turin?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p09vwu/scrum_master_role_salary/"
    },
    {
        "id": "1p08rsn",
        "author": "Single-League6820",
        "title": "Spore/grow box",
        "content": "Ciao! Conoscete qualche grow shop/smart shop a Torino sud dove hanno spore o meglio grow box per funghi che consigliate?\n\nGrazieeee \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p08rsn/sporegrow_box/"
    },
    {
        "id": "1p0ejb3",
        "author": "HelloMotoIt",
        "title": "6 7",
        "content": "A Torino si usa? Chiedo, per un amico 🤠",
        "upvotes": 0,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nkxws8g9812g1.png?auto=webp&amp;s=c61d2d45a1645cb2e35aa1420e452be0e5194a1e"
        },
        "permalink": "/r/torino/comments/1p0ejb3/6_7/"
    },
    {
        "id": "1ozrpuo",
        "author": "Intelligent-Bell-120",
        "title": "November 22 . Hard techno . Industrial techno . Hardcore .",
        "content": "se ti piace raving with hard music, dm me for info e ticket ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ozrpuo/november_22_hard_techno_industrial_techno_hardcore/"
    },
    {
        "id": "1ozmjuz",
        "author": "Hashischfarmer",
        "title": "Nuove conoscenze?",
        "content": "Ciao a tutti, ho 25 anni e mi sono trasferito a Torino da 4 mesi. Sebbene conosca gia qualcumo mi piacerebbe ampliare le mie conoscenze e ogni tanto la sera semplicemente passeggiare e conversare con gente nuova. \n\nEcco alcune cose che mi piacciono per vedere se possiamo avere qualcosa in comune: suonare la chitarra acustica, la musica (ascolto dal death metal alla musica classica, dalla trap al jazz avant garde), i concertini intimi, i tatuaggi (tatuo per vivere), disegnare, dipingere, la ganja, gli psichedelici, la natura, i videogiochi (amo i souls), la boxe, la meditazione, i film d'autore, il ramen, la psicologia. \n\nSe qualcuno avesse voglia di fare conoscenza io sono qua :)\n\n\nPersonalmente il mio sogno sarebbe trovare un amico/a con cui farmi le canne mentre giochiamo a Dark Souls, ma non voglio aspettarmi niente e prendere quello che viene ahahah",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ozmjuz/nuove_conoscenze/"
    },
    {
        "id": "1ozqyl4",
        "author": "Confident_Clerk9688",
        "title": "Codice invito palestre Orange",
        "content": "Qualcuno ha un codice invito per la prova gratuita delle palestre Orange ?\nGrazie ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ozqyl4/codice_invito_palestre_orange/"
    },
    {
        "id": "1ozqk8x",
        "author": "Ok-Preference-3176",
        "title": "Solo traveler weekend",
        "content": "Hi im going to Torino on the 28th of November (in 2 weeks) I would like to play some board games and drink some beer and talk to some locals. Is there any place for that?\nAlso if there is any nice boxing clubs to visit? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ozqk8x/solo_traveler_weekend/"
    },
    {
        "id": "1ozvuda",
        "author": "blueseas2015",
        "title": "Rowing Regatta XXVIII Edizione status?",
        "content": "Is there any update if the Rowing Regatta will be held at all this year? It was postponed due to the demonstrations that coincided on 3rd October, but I never heard any further updates about it\n\nCi sono novità sulla possibilità che la \"Rowing Regatta\" si tenga quest'anno? È stata posticipata a causa delle manifestazioni che hanno coinciso con il 3 ottobre, ma non ho mai ricevuto ulteriori aggiornamenti al riguardo.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ozvuda/rowing_regatta_xxviii_edizione_status/"
    },
    {
        "id": "1ozjejp",
        "author": "NicoLibero",
        "title": "Networking cinema e fotografia",
        "content": "Sono torinese di nascita ma vivo fuori da quando ho 8 anni. Lavoro nel mondo del cinema e della fotografia, e a Barcellona abbiamo diversi gruppi whatsapp/account instagram da cui si fa networking e si può trovare gente per montare crew e trovare lavoro. Qualcuno saprebbe se esiste qualcosa di simile su Torino ?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ozjejp/networking_cinema_e_fotografia/"
    },
    {
        "id": "1ozmtaf",
        "author": "Anonymous_77_",
        "title": "Cerco consulenza legale gratuita a Torino",
        "content": "Ciao a tutti, sono uno studente a Torino e sto affrontando una situazione per cui avrei bisogno di un parere legale. Il mio italiano non è ancora perfetto e al momento non posso permettermi un avvocato.\n\nQualcuno conosce servizi di assistenza legale gratuita, sportelli per studenti o posti dove poter parlare con un avvocato senza costi? Ogni informazione è utile.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ozmtaf/cerco_consulenza_legale_gratuita_a_torino/"
    },
    {
        "id": "1oze2u8",
        "author": "LividCricket7631",
        "title": "Pasta all'amatriciana",
        "content": "Hello, I know it's a Roman thing, but I can imagine that some restaurants make it here.\n\nWould anyone here have a couple of addresses to suggest? 🙏😊",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1oze2u8/pasta_allamatriciana/"
    },
    {
        "id": "1ozewvn",
        "author": "maciofitness-8596",
        "title": "Voi pensate sia una notizia vera? \"Energia e gas a Torino: arriva l'utility manager, professionista delle bollette. \"",
        "content": "Stipendi da 25mila a 80mila euro l'anno: energia e gas sono il nuovo Eldorado per i torinesi.   \nTra i lavori dell'immediato futuro c’è quello dell’utility manager, un vero e proprio esperto delle bollette di luce, gas e telefono, che analizza i consumi, monitora le tariffe e consiglia le soluzioni più adatte al cliente.  \n",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ozewvn/voi_pensate_sia_una_notizia_vera_energia_e_gas_a/"
    },
    {
        "id": "1ozb8uo",
        "author": "Virtual_Aide_7330",
        "title": "Com'è via Sondrio?",
        "content": "Ciao ragazzi, sono una ragazza che studia a Palazzo Nuovo, ho trovato una stanza in via  Sondrio? Cosa ne pensate? Com'è a livello di sicurezza e comodità? ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ozb8uo/comè_via_sondrio/"
    },
    {
        "id": "1ozlhwb",
        "author": "WonderfulTitle958",
        "title": "Escursioni a Salbertrand",
        "content": "Ciao a tutti, io ed alcuni miei amici abbiamo intenzione di fare un'escursione a Salbertrand nel fine settimana. Siamo indecisi se arrivare a Rifugio Arlaud oppure optare per un percorso più a valle e che non ci porti ad alta quota, considerato che non abbiamo alcuna attrezzatura adatta come scarponi da neve, bastoni da trekking etc.\n\nPreciso che siamo già andati una volta, ma ad inizio stagione, quando c'era ancora sole e un'ottima temperatura. La domanda sull'attrezzatura nasce dal fatto che il terreno, specie approcciandosi al rifugio, diventa abbastanza scosceso e sdrucciolevole, e durante il ritorno non è stato difficile scivolare.\n\nSapreste darmi consigli sul tipo di percorso che potremmo seguire, e quale attrezzatura riterreste assolutamente necessaria? Grazie\n\n\n\n  \n\n\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ozlhwb/escursioni_a_salbertrand/"
    },
    {
        "id": "1ozekrq",
        "author": "rinorii1",
        "title": "Universita di Torino",
        "content": "Buongiorno, vorrei sapere se è possibile visitare l'Università di Torino durante il fine settimana (sabato o domenica) di giorno. Vorrei visitare la struttura (in particolare il corso di laurea in Lettere). In pratica, vorrei solo visitare le aule e i dintorni.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ozekrq/universita_di_torino/"
    },
    {
        "id": "1ozan2h",
        "author": "BrightMud165",
        "title": "Mi consigliate qualche corso da fare la sera?",
        "content": "E' un periodo che non me la passo bene e sento la necessità di fare qualcos'altro nella vita oltre alla normale routine. Vado già da uno psicologo (se avete qualcuno da consigliare ben venga, ma non è l'oggetto del post). Vorrei fare qualcosa di costruttivo la sera e stavo pensando ad un corso. Ad esempio, anni fa mi è stato abbastanza utile un corso di fotografia. Pensavo ad un corso di cucina (che costa una fucilata) o ad un corso cai (però in questo periodo non trovo nulla). Avete suggerimenti, consigli?",
        "upvotes": 4,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1ozan2h/mi_consigliate_qualche_corso_da_fare_la_sera/"
    },
    {
        "id": "1oyueir",
        "author": "kussent",
        "title": "CERCHIAMO BATTERISTA per una band Metalcore/Sperimentale con Lore a Torino",
        "content": "Sto formando una band seria con influenze metalcore ma sperimentali, con suoni che vanno dall’alt metal/rock, deathcore, deep house, elettronica, fino a sonorità atmosferiche oscure o acustiche, ecc. Con storytelling e un lore profondo.\n\nTutti i brani saranno originali e in inglese; gran parte dei testi è già scritta, manca la composizione musicale.\n\nSiamo un cantante (melodico e scream), un chitarrista a 7 corde, un bassista e stiamo contattando un tastierista, quindi cerchiamo un batterista (età 17–26) motivato e appassionato, disposto a partecipare a un progetto creativo, performativo e sperimentale.\n\nSe sei interessato, scrivimi qui e ne parliamo in privato.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oyueir/cerchiamo_batterista_per_una_band/"
    },
    {
        "id": "1oytllr",
        "author": "silviuzX2",
        "title": "Dove trovare dr.pepper",
        "content": "Come da titolo, domanda un pò strana ma qualcuno sa dove si possa trovare la dr.pepper qui a Torino, che non abbia un costo per lattina ridicolo (non più di 2 euro, di meno è meglio), quindi non ODS store, magari tipo qualche minimarket che la ha, anche in periferia ? Chiedo perchè sono stato da poco a Budapest (lì è venduta ufficialmente ovunque) e me ne sono innamorato",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1oytllr/dove_trovare_drpepper/"
    }
]