[
    {
        "id": "1i3qboh",
        "author": "BunyipPouch",
        "title": "Join us Friday 1/24 at 3 PM ET for a live AMA/Q&amp;A with Brady Corbet, director of A24's 'The Brutalist'. It stars Adrien Brody, Felicity Jones, and Guy Pearce. The 3h35 epic-drama was recently nominated for 7 Golden Globes and is releasing nationwide next week.",
        "content": "",
        "upvotes": 71,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zkllw8td9mde1.jpeg?auto=webp&amp;s=e2ff5e06beea46e0088a96cabed5015e2326a2cd"
        },
        "permalink": "/r/movies/comments/1i3qboh/join_us_friday_124_at_3_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1i36zgg",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Wolf Man / One of Them Days / The Last Showgirl / The Brutalist)",
        "content": "# New Theatrical Releases\n\n[Wolf Man](https://old.reddit.com/r/movies/comments/1i36wh1/official_discussion_wolf_man_spoilers/?)\n\n[One of Them Days](https://old.reddit.com/r/movies/comments/1i36wmw/official_discussion_one_of_them_days_spoilers/?)\n\n[The Last Showgirl](https://old.reddit.com/r/movies/comments/1i36wob/official_discussion_the_last_showgirl_spoilers/?)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n# Streaming Releases\n\n[Wallace &amp; Gromit: Vengeance Most Fowl](https://old.reddit.com/r/movies/comments/1hsvowt/official_discussion_wallace_gromit_vengeance_most/?)\n\n# Still in Theaters\n\n[Den of Thieves 2: Pantera](https://old.reddit.com/r/movies/comments/1hxuwnk/official_discussion_den_of_thieves_2_pantera/?)\n\n[Better Man](https://old.reddit.com/r/movies/comments/1hxuwpf/official_discussion_better_man_spoilers/?)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)",
        "upvotes": 27,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1i36zgg/official_discussion_megathread_wolf_man_one_of/"
    },
    {
        "id": "1i4zal1",
        "author": "BunyipPouch",
        "title": "Poster for Amazon's 'This Is The Tom Green Documentary' - Directed by Tom Green - It follows Green’s early beginnings in Canada to Hollywood stardom and a full-circle return from L.A. to a rural farm in Canada.",
        "content": "",
        "upvotes": 808,
        "comments": 170,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tf6nymsnkyde1.jpeg?auto=webp&amp;s=0fa43af55c8395934fedfb5e89ef160294383a49"
        },
        "permalink": "/r/movies/comments/1i4zal1/poster_for_amazons_this_is_the_tom_green/"
    },
    {
        "id": "1i523bl",
        "author": "MarvelsGrantMan136",
        "title": "‘Moana 2’ Passes $1 Billion Globally",
        "content": "",
        "upvotes": 125,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nqnzC5tMGea2KEcZQ8qqRPc-vfyFufSvcbAZeZhnOF0.jpg?auto=webp&amp;s=733db49829f67b2691a27cf0ea42c331cbf00ea0"
        },
        "permalink": "/r/movies/comments/1i523bl/moana_2_passes_1_billion_globally/"
    },
    {
        "id": "1i4lei3",
        "author": "BunyipPouch",
        "title": "Questlove To Direct ‘SNL’ Music Documentary For NBC - Titled ’50 Years of SNL Music’, the three-hour special will feature untold stories behind the culture-defining, groundbreaking and newsmaking musical performances, sketches and cameos of the past 50 years of SNL.",
        "content": "",
        "upvotes": 1249,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qGBSc_yp6KfKdtMoETgT0FcIOmMpGl1hQOPeajly04g.jpg?auto=webp&amp;s=541ad19e1ae9ec2193eb29febc7e8a3b50a31296"
        },
        "permalink": "/r/movies/comments/1i4lei3/questlove_to_direct_snl_music_documentary_for_nbc/"
    },
    {
        "id": "1i51czy",
        "author": "Ok-Competition-1814",
        "title": "Characters who are supposed to be athletes but are really bad at it\n",
        "content": "I'm thinking of Taron Egerton who is introduced in Carry-On as a former track star. Trouble is, he runs like it’s his first day with new legs. Unnatural arm swing, duck feet, it’s a mess. What are some other characters who fit this bill? I imagine the gold standard is still Tim Robbins pitching in Bull Durham. ",
        "upvotes": 72,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1i51czy/characters_who_are_supposed_to_be_athletes_but/"
    },
    {
        "id": "1i48xc8",
        "author": "bigdicks415",
        "title": "Why are there literally hundreds of WW2 Nazi movies, but only a handful of ones about the Japanese?",
        "content": "I feel like there are probably more WW2 Nazi movies than any other genre. by comparison I can only think of may be 5 or 6 about the Japanese .\n\nWhy such the disparity?\n\nFor one it's a bit disingenuous and disrespectful to portray WW2 as a purely European conflict.  And from a strictly entertainment standpoint, you could write up a million different scripts that would put Private Ryan to shame.\n\nAlso, the few movies I have seen about Japanese in WW2 tend to portray them as noble warriors when in reality they were every bit as evil and diabolical as the Nazis, and committed some of the worst atrocities of the last hundred years.  \n\nTheir treatment of POWs was also probably the worst fates suffered during any US military war. They would literally mass execute captured soldiers and sailors, often by beheading....\n\nWhy is there no Inglorious Bastards Japanese version to date?",
        "upvotes": 5079,
        "comments": 1797,
        "media": null,
        "permalink": "/r/movies/comments/1i48xc8/why_are_there_literally_hundreds_of_ww2_nazi/"
    },
    {
        "id": "1i4i4kr",
        "author": "Mst3Kgf",
        "title": "Among \"The Sandlot's\" many virtues, I really like how it doesn't go the \"underdog team comes together to win championship\" approach so prominent in the 90s. Indeed, it gleefully subverts that.",
        "content": "The 90s especially liked using that storyline in kids sports movies, in no small part thanks to the success of \"The Mighty Ducks.\" But \"The Sandlot\" has none of that, as the whole point of the titular baseball field is that the gang of friends who use it have an endless game that they play themselves with no organization save their own. There is no championship to win, it's just kids having fun. And while there is the subplot with the snobby Little League team midway through the film, it's just one of several episodes in the film's storyline and the film gleefully subverts the \"championship game\" by having it be a completely one-sided affair where the gang crushes the Little Leaguers (in no small part due to Ham's trash talking behind the plate). It's another way \"The Sandlot\" is such an endearing classic. Championship games are not nearly as important as saving the Baby Ruth ball from the Beast.",
        "upvotes": 1155,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1i4i4kr/among_the_sandlots_many_virtues_i_really_like_how/"
    },
    {
        "id": "1i4prm0",
        "author": "bjclements",
        "title": "What movie had a terrible trailer but ended being very good?",
        "content": "What movie had a terrible trailer but ended up being surprisingly good? One that comes to mind is Speak No Evil (2024). Its trailer was so obnoxious it practically became a meme, yet the movie itself turned out to be awesome. What are some other examples of films with misleading or off-putting trailers that defied expectations?",
        "upvotes": 329,
        "comments": 496,
        "media": null,
        "permalink": "/r/movies/comments/1i4prm0/what_movie_had_a_terrible_trailer_but_ended_being/"
    },
    {
        "id": "1i4jutn",
        "author": "onlysortofintothis",
        "title": "Just realizing Road Trip is based on The Odyssey",
        "content": "I saw a Road Trip poster and just realized it's a college-movie version of The Odyssey.\n\nIt's been awhile so there may be more connections, but:\n\n- Tom Green tells the story to a bunch of students, like a Greek storyteller\n\n- The main guy is trying to get to Ithaca (Odysseus' kingdom he's trying to return to)\n\n- His Queen had suitors trying to get her attention, and the main guy is worried about his girlfriend and other men\n\n- All the hijinks on the trip are humorous parallels to all the obstacles Odysseus and his men encountered\n\nMaybe I'm the only person that cares and likes making these connections, but thought I'd share just in case :)\n\nEDIT: Some people have corrected some details in comments, which is fair because it's been 20+ years since I've watched it. But the motifs are still there :)",
        "upvotes": 628,
        "comments": 121,
        "media": null,
        "permalink": "/r/movies/comments/1i4jutn/just_realizing_road_trip_is_based_on_the_odyssey/"
    },
    {
        "id": "1i49k2s",
        "author": "BunyipPouch",
        "title": "‘Strange Darling’ Distributor Sues Over Box Office Underperformance - They claim that the indie horror hit would have made roughly $10 million more at the box office had Spellbinder, its marketing partner, lived up to its end of the deal.",
        "content": "",
        "upvotes": 2271,
        "comments": 243,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4VQ-2F8n7eMIu0HrwP00CqykyPqnkOjlou1zYzQ35JA.jpg?auto=webp&amp;s=d1357ee18a26e748647560fb668fc1e6836b74d1"
        },
        "permalink": "/r/movies/comments/1i49k2s/strange_darling_distributor_sues_over_box_office/"
    },
    {
        "id": "1i4foyg",
        "author": "Bennett1984",
        "title": "Desperado, Die Hard with a Vengeance, GoldenEye, and the Essential Action Movies of 1995",
        "content": "",
        "upvotes": 933,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/91C1_InowkLo80JJhdDlP7-dbF1gv96lbu3HPrQUQWI.jpg?auto=webp&amp;s=2ee53c943a7c3ddb77fa5843826f176154e31ed1"
        },
        "permalink": "/r/movies/comments/1i4foyg/desperado_die_hard_with_a_vengeance_goldeneye_and/"
    },
    {
        "id": "1i4fcoz",
        "author": "Phyliinx",
        "title": "The humanity in Die Hard and Lethal Weapon surprised me.",
        "content": "I was born way past the old days of action movies. I grew up on fast cuts and shaky cams before John Wick came to end them all. \n\nWhen I watched Arnold Schwarzenegger movies like Predator or Commando, where he is basically a machine dressed up to kill, I thought that is how every old action movie works. Explosions, cool one liners and fearless heroes. \n\nThis is why Die Hard and Lethal Weapon surprised me quite a bit. John McClane is not one of those indestructible heroes. He does not shoot with infinite ammunition. Yes, he does some pretty wild stuff, like jumping from rooftops, but there is also a side of him that makes him very interesting. A touch humanity that is caught when he talks to the police officer or his wife. I like that very much. \n\nThe same goes for Lethal Weapon. I thought this would be a buddy comedy series with more style than substance. But one of Mel Gibson's early scenes in the franchise revolves around him sticking a gun into his mouth during a night full of grief and suicidal thoughts. And the aging part of the team has a whole family to care for.\n\nNow yes, Lethal Weapon is a fun buddy cop comedy series. But the heroes have backgrounds, souls and feelings that are not left alone between explosions.\n\nThis is why those two movie franchises (I have only seen the first two Die Hards so far) surprised me with some unexpected depth.\n\n\nEdit: It's cool to see all the discussions, conversations and dialogues my post spawned. I am also very thankful for all your recommendations, such as First Blood, The Last Boy Scout and Total Recall.",
        "upvotes": 978,
        "comments": 316,
        "media": null,
        "permalink": "/r/movies/comments/1i4fcoz/the_humanity_in_die_hard_and_lethal_weapon/"
    },
    {
        "id": "1i4nhm5",
        "author": "NeonBuckaroo",
        "title": "Existential crisis after watching Lost in Translation ",
        "content": "Don’t know why it took me so long to get round to watching this for the first time. Profoundly moving film. Could watch it on repeat. Bill Murray was transformative - I’ve never seen a “smile” used as such a powerful plot device before.\n\nThe taxi ride home with “Sometimes” by MBV - enchanting.\n\nI’m sat here now looking at flights to Japan, thinking of all the places I haven’t been and all the connections I haven’t made - a movie everyone should watch before it’s too late for them to shake things up in their lives. \n\nWhat does everyone think of it? ",
        "upvotes": 186,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1i4nhm5/existential_crisis_after_watching_lost_in/"
    },
    {
        "id": "1i4zo6c",
        "author": "Pyro-Bird",
        "title": "‘Waves’ Leads Czech Lion Award Nominations After Homeland Commercial Success and Oscar Shortlist Mention",
        "content": "",
        "upvotes": 17,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MIV7impZBqVapFK0Wpj1gxbAeWN1sQSsLhK1nBVjCy8.jpg?auto=webp&amp;s=af99a2041630bade0dd3d80b07f8531ca8f0b4a9"
        },
        "permalink": "/r/movies/comments/1i4zo6c/waves_leads_czech_lion_award_nominations_after/"
    },
    {
        "id": "1i512z5",
        "author": "evilsir",
        "title": "What's A Sequel That Made You Rethink Your Opinion of The Original?",
        "content": "For me, it's Smile 2. I went into it with some hesitation because i remember definitely not caring very much  for the original, but I am a sucker for horror movies. Long story short, i really liked Smile 2 an awful lot &gt;!especially  the ending, which was super insane and unexpected.!&lt;\n\nSo I rewatched the original Smile and was pleasantly surprised that my attitude towards it had changed quite a bit.\n\nso like i asked, which sequel have you seen that changed your mind about the original?",
        "upvotes": 14,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1i512z5/whats_a_sequel_that_made_you_rethink_your_opinion/"
    },
    {
        "id": "1i4hito",
        "author": "cyPersimmon9",
        "title": "An awesome tribute to David Lynch",
        "content": "",
        "upvotes": 377,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7AjibPjcQwmHTAFOV1ES0iBqhLdQGRSzO3sRZa-vl0o.jpg?auto=webp&amp;s=5c984bb12497787d39fcf0bc420793cb543cf125"
        },
        "permalink": "/r/movies/comments/1i4hito/an_awesome_tribute_to_david_lynch/"
    },
    {
        "id": "1i524jr",
        "author": "indiewire",
        "title": "‘The Straight Story’ May Lack David Lynch’s Signature Darkness, but It Led to His Eerie Masterworks",
        "content": "",
        "upvotes": 10,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8oSlGnaWfNHrx1juBn90GfdMzJs7YQ4FXAoD-Nn495o.jpg?auto=webp&amp;s=6b803b81804787d2c8b8119b3ba31934d3265af2"
        },
        "permalink": "/r/movies/comments/1i524jr/the_straight_story_may_lack_david_lynchs/"
    },
    {
        "id": "1i51uxt",
        "author": "SuplexCity-Mayor",
        "title": "Steven Spielberg playing Donkey Kong in 1982",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EpC5VaSJU_rdlmgROj03gWXYJN4lt6RRVa0DO75LsxM.jpg?auto=webp&amp;s=d9132b852a74d6a71b3b9b1a3540b4c0fbad5bb1"
        },
        "permalink": "/r/movies/comments/1i51uxt/steven_spielberg_playing_donkey_kong_in_1982/"
    },
    {
        "id": "1i4eprc",
        "author": "youcannotrelate",
        "title": "The moment you realised an actor was a star?",
        "content": "Can you point to a specific scene in a movie where you realised an actor was going to be a star? Or a scene with an established actor where you realised why they're a star? For me personally,  its the final stand up scene from The King Of Conedy. Now its no secret that Rob Deniro is a star but after  watching Goodfellas(which he was excellent in), Raging Bull, Taxi Driver and Casino it was great to see Deniro take on a more \"lighthearted\" role. The way he seems nervous through his line delivery and body language, the way he swings his arms around while the audience laughs. It's a beautiful performance overall and i'd show it to anyone who claims he has no range",
        "upvotes": 403,
        "comments": 1339,
        "media": null,
        "permalink": "/r/movies/comments/1i4eprc/the_moment_you_realised_an_actor_was_a_star/"
    },
    {
        "id": "1i51yul",
        "author": "tnick771",
        "title": "Was 2000-09 an exceptional decade for movies?",
        "content": "I’ve been rewatching a lot of movies from that time period and I’m curious if it’s my nostalgia for when I was growing up making me think it was truly an exceptional span, or if there was something magical happening. \n\nTo briefly summarize: \n\n* 2000: Gladiator, Memento, Crouching Tiger, Hidden Dragon, Almost Famous, American Psycho, The Patriot, O Brother, Where Art Thou?\n* 2001: The Lord of the Rings: The Fellowship of the Ring, Harry Potter and the Sorcerer’s Stone, Shrek, A Beautiful Mind, Donnie Darko, Spirited Away, The Royal Tenenbaums\n* 2002: The Lord of the Rings: The Two Towers, Harry Potter and the Chamber of Secrets, Spider-Man, The Bourne Identity, Catch Me If You Can, Signs, City of God\n* 2003: The Lord of the Rings: The Return of the King, Finding Nemo, Pirates of the Caribbean: The Curse of the Black Pearl, Kill Bill: Vol. 1, Lost in Translation, X2: X-Men United, The Last Samurai\n* 2004: Eternal Sunshine of the Spotless Mind, The Incredibles, Harry Potter and the Prisoner of Azkaban, Spider-Man 2, Mean Girls, The Aviator, Shaun of the Dead\n* 2005: Batman Begins, Harry Potter and the Goblet of Fire, Pride &amp; Prejudice, Brokeback Mountain, Sin City, The Chronicles of Narnia: The Lion, the Witch and the Wardrobe, Walk the Line\n* 2006: The Departed, Pan’s Labyrinth, Casino Royale, The Prestige, Children of Men, Little Miss Sunshine, Borat\n* 2007: No Country for Old Men, There Will Be Blood, Ratatouille, Harry Potter and the Order of the Phoenix, The Bourne Ultimatum, Superbad, Zodiac\n* 2008: The Dark Knight, Iron Man, WALL-E, Slumdog Millionaire, The Curious Case of Benjamin Button, Twilight, In Bruges\n* 2009: Avatar, Inglourious Basterds, The Hangover, Up, The Hurt Locker, Zombieland, District 9\n\nI mean just look at 2007..!\n\nHowever, I suspect if you pick any 10-year span in modern movie history you can come up with a similarly impressive list?\n\nOn the contrary – it was also the golden age of CGI and brought two of the most successful film franchises in history – Lord of the Rings and Harry Potter – to the screen. \n\nCurious what other opinions are. ",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1i51yul/was_200009_an_exceptional_decade_for_movies/"
    },
    {
        "id": "1i4j3mn",
        "author": "Puzzled-Tap8042",
        "title": "Claire van Kampen Dies: Composer, Playwright, Behind-The-Scenes Multitasker &amp; Wife/Collaborator Of Mark Rylance Was 71\n",
        "content": "",
        "upvotes": 170,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/X7yPb7b1jIDqtfEwj9TyS6bzOG7Wzkl4fK3GRtKrtQ8.jpg?auto=webp&amp;s=15eb94bbabc51b2568c8293c02d8ff8b1b42d7df"
        },
        "permalink": "/r/movies/comments/1i4j3mn/claire_van_kampen_dies_composer_playwright/"
    },
    {
        "id": "1i4jgzt",
        "author": "keepfighting90",
        "title": "Den of Thieves (2018) is basically Heat for meatheads - but a really fun movie nonetheless",
        "content": "Watched Den of Thieves, starring Gerard Butler, Pablo Schreiber and O'Shea Jackson Jr, recently on an international flight. This is basically Heat's baby brother, where Heat is the sophisticated, mature older brother and Den of Thieves is the loud, brash, and dumb younger sibling. For DoT ostensibly is almost a greatest hits cover of Heat - a group of bank robbers ripping off joints in LA, and a band of cops gunning for them. But whereas Heat was more concerned with the innate complexities of the process, method and consequence of playing cops and robbers, DoT harbours no such lofty pretensions - it's more visceral and in your face, and more concerned with slick, in-the-moment action. \n\nThat's really both the movie's strengths and weakness. Cause there really isn't much going on narratively speaking - there are some bank robber dudes, they are macho, tough and badass. There are some mildly corrupt cops, who are also macho, tough and badass. These two badass squads face off against each other a few times, and some people die. And that's about it. There's not much in the way of character development or thematic depth. The writing is very often corny and melodramatic. There's nothing particularly surprising about anything that happens.\n\nWith that being said - this is still a pretty damn entertaining movie. The action set pieces are well-directed and choreographed, with a good sense of space and geography. The climactic shootout is especially intense (even though parts of it stretches belief a bit too much). It's generally pretty well-paced too. \n\nThe performances are a big selling point as well. Gerard Butler is absolutely delightful as a greasy, douchey pillar of toxic masculinity. He really commits here (but when does he not?) and chews the scenery like no one's business. The guy may end up in a lot of stinkers, but you can never say he doesn't give it his all.\n\nPablo Schreiber is pretty damn good too, and really brings a lot of color to a character that could've been boring and one-note otherwise. The dude just has some insane screen presence. Both 50 Cent and Baby Ice Cube were solid as well. \n\nSo yeah all in all Den of Thieves is a solid heist thriller. Just know what to expect going in and you may be pleasantly surprised.",
        "upvotes": 159,
        "comments": 67,
        "media": null,
        "permalink": "/r/movies/comments/1i4jgzt/den_of_thieves_2018_is_basically_heat_for/"
    },
    {
        "id": "1i4mj36",
        "author": "indiewire",
        "title": "9 Things You Didn’t Know About David Lynch's ‘Mulholland Drive’",
        "content": "",
        "upvotes": 89,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U7-8iO9bnOqfnCQxUe_ZFCOvNVcc39JEp0k8XDqnWQQ.jpg?auto=webp&amp;s=536c90c493a22876a0673f9b42c9ef5a146252c6"
        },
        "permalink": "/r/movies/comments/1i4mj36/9_things_you_didnt_know_about_david_lynchs/"
    },
    {
        "id": "1i4prbh",
        "author": "Odd_Variation_1514",
        "title": "Any recommendations for funny horror movies?",
        "content": "My husband and I watch only horror movies pretty much, but we like the light-hearted ones that don't take themselves too seriously. We also like anthologies &amp; Indie movies. \nP.S. we've already seen the \"Scary Movie\" movies lol.. we've also seen almost every movie by Full Moon Pictures. (HIGHLY RECOMMENDED if you're into this kind of genre)\nAny recommendations? ",
        "upvotes": 56,
        "comments": 256,
        "media": null,
        "permalink": "/r/movies/comments/1i4prbh/any_recommendations_for_funny_horror_movies/"
    },
    {
        "id": "1i4ix2t",
        "author": "Lionel_Hislop",
        "title": "What are your thoughts on \"Mortal Kombat\" (1995)?",
        "content": "I am surprised Robin Shou didn't become a big martial arts star. He was good as Liu Kang and I thought he pulled off his fight scenes. \n\nI also enjoyed Linden Ashby as Johnny Cage and I was bummed what they did with Johnny in the sequel but then again, the sequel sucked balls, so Ashby was smart to pass on that. \n\nI don't like what they did with Sonya Blade. I feel they nerfed her in this movie. I don't mind Bridgette Wilson, even if she was miscast (Sandra Hess looked more apt but Wilson was a better actress). And I hated that they rushed out her arc with Kano and then had her as a damsel in distress. \n\nTalisa Soto as Kitana was HORRIBLE and Christophe Lambert is just abysmal as Lord Raiden (but still miles better than whatever James Remar was doing in the sequel). \n\nI did enjoy Cary Hiroyuki Taka as Shang Tsung. And the movie had the ideal setting for the story to unfold.",
        "upvotes": 136,
        "comments": 257,
        "media": null,
        "permalink": "/r/movies/comments/1i4ix2t/what_are_your_thoughts_on_mortal_kombat_1995/"
    },
    {
        "id": "1i4xz7t",
        "author": "AporiaParadox",
        "title": "Good and bad ways to remind audiences watching a sequel of what happened before, or even inform new audiences who didn't see any of the previous installments",
        "content": "So I recently re-watched Superman II (the original theatrical cut), and I was reminded of just how awkward the recap sequence at the start of the movie is. It just shows a bunch of clips from the previous movie, often with little rhyme or reason, not really explaining plot points in any detail, just scenes of Superman flying around and saving people. Aside from once again showing the scene of Zod and his henchmen being sent to the Phantom Zone, I don't think that recap was necessary, the movie itself at the start quickly establishes everything you know about Superman and his cast, Otis in prison even gives blatant exposition dialogue of the crimes Luthor committed last movie (something the recap didn't even make that clear). \n\nOne could also argue that the recap is for the benefit of people who didn't see the first movie and Superman II is the first Superman movie they've ever seen (which in the days before widespread home video releases was probably quite common), but again, the recap didn't even do a good job as a recap. \n\nThis got me thinking about how other movies deal with catching audiences up to speed or informing potential new audiences of what happened last time. \"Recaps\" like this seemed to be quite common in sequels back in the day, such as Back to the Future (where the recaps did a much better job at catching people up, especially since those films are very interconnected since they take place right after the other), but they are quite rare nowadays. Another common recap method is to show images or artistic interpretations of the events of the previous movie during the opening credits, such as in Spider-Man 2, although these usually work less like recaps and seem more of an artistic choice.\n\nNow we usually we just get some scenes at the begining that establish who the returning characters are, what their deal is, and their relationship with each other. If anything that happened before is relevant, this is explained. This is usually also integrated into exposition of what has happened in between the movies off-screen that we need to know. The MCU is actually quite good at this, even though there's dozens of interconnected movies and TV shows, you don't actually need to see all of them to understand what's going on.\n\nIt probably helps that thanks to the internet, people can just look up summaries of what happened last time on their own.\n\nSo what do you think are good ways to \"recap\" the previous movie to new and returning audiences and what are bad ways?",
        "upvotes": 9,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1i4xz7t/good_and_bad_ways_to_remind_audiences_watching_a/"
    },
    {
        "id": "1i508r7",
        "author": "JoshJ444",
        "title": "Drop (2025) Trailer in theatres.",
        "content": "Hi everyone! Christopher Landon has a new movie called Drop releasing in April, and I saw a trailer for it before I saw Wolf Man. \n\nThe trailer is nowhere to be found online, and I’ve heard 0 pieces of news reporting this. But I did see the first trailer for Drop before Wolf Man, and was wondering if anyone else saw it too?\n\nI think it looks bonkers, but in a good way. ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1i508r7/drop_2025_trailer_in_theatres/"
    },
    {
        "id": "1i51hoi",
        "author": "MarcoManatee",
        "title": "What characters accomplishments, struggles, or internal dialogue resonated with you on a personal level?",
        "content": "This can be movies, shows or books. As the title says, what character had moments or arcs that resonated with you personally? \n\nFor me it has to be Rand Al Thor from wheel of time. When thrust into a leadership role, he took the weight of every decision, win and loss to heart. He’s a perfectionist and never wants to let anyone down.\n\nHis internal dialogue struggling with what he perceives as failures struck me more than anything I’ve read, and &gt;!his moment of clarity on dragonmount!&lt; legitimately made me look at life in a different view. ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1i51hoi/what_characters_accomplishments_struggles_or/"
    },
    {
        "id": "1i4dpe9",
        "author": "kchoze",
        "title": "Last Action Hero and \"being ahead of its time\" as an explanation for failure",
        "content": "Coming across many people commenting on Last Action Hero and even articles on the subject all agreeing that its \"failure\" was because it was \"ahead of its time\" and audiences just didn't get it at the time, I think I need to rant about this, without trying to antagonize anyone.\n\nFirst, a few examples of articles claiming it was \"ahead of its time\", usually because of its introduction of meta-humor and making fun at action movie tropes.\n\n[https://uproxx.com/movies/last-action-hero-2020-rewatch/](https://uproxx.com/movies/last-action-hero-2020-rewatch/)\n\n[https://gamerant.com/last-action-hero-arnold-schwarzenegger-meta-action-comedy-ahead-of-its-time/](https://gamerant.com/last-action-hero-arnold-schwarzenegger-meta-action-comedy-ahead-of-its-time/)\n\n[https://silverscreenanalysis.com/last-action-hero-1993-review/](https://silverscreenanalysis.com/last-action-hero-1993-review/)\n\n[https://filmstories.co.uk/features/last-action-hero-revisiting-arnold-schwarzeneggers-meta-action-thriller/](https://filmstories.co.uk/features/last-action-hero-revisiting-arnold-schwarzeneggers-meta-action-thriller/)\n\n[https://screenrant.com/arnold-schwarzenegger-last-action-hero-deserve-more-love/](https://screenrant.com/arnold-schwarzenegger-last-action-hero-deserve-more-love/)\n\nI think that suffices to prove I'm not just swinging at strawmen.\n\n# Meta humor and spoofs have been around since forever\n\nA lot of the arguments for the \"ahead of its time\" claim is that audiences weren't ready yet for meta-humor and mocking the tropes of existing genres. To echo Colonel Hunter Gathers from The Venture Bros: the day the first movie finished production in Hollywood, the first movie spoof started production to mock movie tropes established by the first movie. This even goes back further than movie-making, I've heard some Greek theater plays in Ancient Greece made fun of Greek theater tropes. Shakespeare's A Midsummer Night's Dream was built on meta-humor to make audiences laugh at the tropes of plays of the time.\n\nEven looking just at the 20 years prior to the Last Action Hero, we see a lot of comedies built on spoofing established genres:\n\n* Blazing Saddles, 1974, spoofed Westerns\n* Airplane, 1980, spoofed disaster movies\n* The Naked Gun, 1988, spoofed police drama/action movies\n* Hot Shots, 1991, spoofed military action movies\n\nI'm probably missing many here, this list is not exhaustive. So movie audiences were not unfamiliar with meta-humor or comedy at all, and many such movies had a lot of success.\n\n# The Action Movie genre LAH spoofed was not that old\n\nThere may not have been many movies that spoofed the specific action movie genre that Last Action Hero did before, but that's because it was really an 80s phenomenon that was really started and codified by the release of Commando and Rambo II, both in 1985, that set the tropes that became the genre. The unstoppable hero that shrugs off explosions and bullets, the focus on spectacle, fire fights and explosions, killing dozens of henchmen in every action scene, the one-liners, the paper-thin plot, the good guys always winning in the end, etc...\n\nSure there were elements of each in other movies (James Bond movies, for instance, which got their own spoofs way earlier), but the hyper-focus on mindless entertainment and spectacle was really established in the mid-80s. It then became a juggernaut of the late 80s, but by the early 90s, the juggernaut was tired and audiences were getting bored with it, with people craving something a bit more in addition to the action movie. The focus on action scenes remained, but to attract and keep people's attention, more needed to be done, whether it be drama, sci-fi... or comedy.\n\n# The Last Action Hero was perfectly on time\n\nFar from being ahead of its time, the Last Action Hero is accompanied by many movies released in the same time frame that all added meta-humor and poked fun at the same action movie genre. 1993, the year LAH was released, also saw the release of:\n\n* Hot Shots Part Deux, which was a direct spoof of Rambo II and like movies\n* Loaded Weapon 1, a direct spoof of Lethal Weapons\n* Demolition Man, another action movie by Stallone that tried to refresh the formula by being self-aware and poking fun at Action Movie tropes while offering its own take on it\n\nSo 1993 was actually a great year for any movie that tried to use meta-humor and poke fun at Action Movie tropes, and many movies actually did, some of them highly regarded today and viewed as major successes in their genre.\n\nIn fact, Schwarzenegger would hit big with True Lies in 1994, another action movie that included a bit of meta-humor and poked fun at its genre, though not as overtly as LAH.\n\nAnd yet, Last Action Hero flopped, didn't it? Why did it? Or rather...\n\n# Did Last Action Hero actually flop?\n\nPeople love denouncing blockbuster movies as flops, and when they do, they get tons of nomination for worst picture in events like the Razzies, because beating on the unpopular kid is a well-known pastime. But in many instances, these \"flops\" and \"bombs\" actually earn very respectable numbers. Take Waterworld, seen as a box office bomb even if it was the 10th highest grossing movie of 1995 and beat many movies that are seen as great successes.\n\nSo how did Last Action Hero actually do at the box office? Let's look only at the domestic American box office, it was the 23rd highest-grossing movie of the year and earned 50 million dollars. That's a respectable haul for 1993.\n\nIn comparison, the same year, Demolition Man did 58 million, Rookie of the Year did 52 million, Disney's the Three Musketeers did 48 million, The Nightmare Before Christmas did 50 million. All of these are considerate moderate to big box office successes, and certainly not flops.\n\nSo Last Action Hero actually did fine at the box office, what gave the impression it did worse than it did is that expectations were sky-high. Schwarzenegger was a huge star with Terminator 2 having done incredibly in 1991 and Arnold having no major release in 1992, people felt they were due for something big and special.\n\nThe budget for Last Action Hero was also massive. How massive? It was 20 million dollars higher than Jurassic Park's.\n\nThat massive.\n\nAnd worst of all, it was released one week after Jurassic Park hit and became a cultural phenomenon, every kid at the time only spoke of dinosaurs. I know, I lived through it. And then comes this movie that is marketed as an action movie when it's a movie that spends more time spoofing action movies than being one. Many good movies have suffered from not meeting expectations set by their marketing campaigns, see Drive for example, an excellent movie that suffered from being sold as nonstop action by its marketing team, which it certainly was not, attracting the wrong audience and repelling the correct one.\n\nStill, it did okay, not great, but okay, it did find its audience and a lot of people found it a fun movie. Sure, the critics gave it a mediocre reception, but that's not atypical for action movies of the kind spoofed by LAH. And quite frankly, as fun and entertaining as it is, did it really deserve to be one of the best movies of 1993? I think not, without giving anyone the background and the reputation of it, showing it to people and saying it was the 23rd highest grossing movie of 1993 would probably result in them saying \"eh, about right\", not \"THAT low?\" or \"THAT high?\".\n\n# Conclusion\n\nSo, did Last Action Hero flop because its mix of meta-humor and comedy with action was \"ahead of its time\" and misunderstood by 1993 audiences? Certainly not. 1993 audiences were just fine with meta-humor and got comedy just fine, thank you very much. People haven't gotten smarter since then, and though meta-humor has become more common, too common even, that's not because people didn't \"get it\". In fact, the movie didn't even do that badly and got decent interest from audiences that were getting a bit over the whole mindless action movie genre. It just didn't meet expectations set by its massive budget and its marketing campaign, and represented a huge step back for Arnold Schwarzenegger's career. But when you peak, you have only one way to go: down.\n\n  \nIt's not just Last Action Hero, there's a trend of people that tend to explain the relative underperformance of past movies as them simply having been \"ahead of their time\", as if past audiences were somehow less sophisticated or less able to understand or enjoy the movies made at the time. Though it may occasionally be the case, in most instances movies that are ACTUALLY ahead of their time do great. \n\nStar Wars was ahead of its time. \n\nJurassic Park was ahead of its time. \n\nThe Matrix was ahead of its time. \n\nTerminator 2 was ahead of its time. \n\nMovies that are ahead of their times usually do great. Movies that are and somehow fail or flop usually do so not because of an unsophisticated audience, but of poor marketing, unfortunate release timing or poor editing choices (looking at you, Blade Runner).",
        "upvotes": 249,
        "comments": 165,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_NBYWIUQqoAQPDgwiOo6kLUBpm1lAgnpJMIOPc98wqE.jpg?auto=webp&amp;s=f86f41d00d13056821ceb559ae920dd1aa5836c1"
        },
        "permalink": "/r/movies/comments/1i4dpe9/last_action_hero_and_being_ahead_of_its_time_as/"
    },
    {
        "id": "1i4jvdr",
        "author": "Chocolateandcurious",
        "title": "Nicholas Cage…",
        "content": "Hi everyone, I’m sorry, this might be a bit of a strange question. Is Nicolas Cage a genius actor?! Over a decade ago, I remember watching one of his movies with some friends, a few mins in, we all laughed at how awful his acting was, and I think I’ve skipped nearly every movie of his since. It certainly didn’t help that everyone I know feels the same.  I just finished watching the unbearable weight of massive talent and it just felt… brilliant.  Was it supposed to be?? Is this a whole genre of acting or is this his thing? Are all his movies like this? Gonna be honest, I’m a lil high right now, so don’t laugh at me if I’m reading too much into this. \n\n\nEdit 1:  I’m watching another one ya’ll. I’m sorry maybe I really am higher than I thought, coz is this man MAKING A MOVIE OF HIS ENTIRE LIFE? why do I get this impression? It would be insanely genius, yet even in the real world, there is this theme of life inspiring art and art inspiring life. And this strangely powerful play on chaos and sanity? \n\nAm I going crazy or what 😭😅😄😄\n\n\nEdit 2: I’m pretty sure he’s doing it on purpose now. There is so much depth here… why have people been lying about this man for so long? Why? \n\n\nEdit 3: Why do I feel like his entire life as we watch it unfold is the real movie, and the movies he plays are a part of the main plot. ",
        "upvotes": 100,
        "comments": 485,
        "media": null,
        "permalink": "/r/movies/comments/1i4jvdr/nicholas_cage/"
    },
    {
        "id": "1i51chy",
        "author": "primalpalate",
        "title": "The Bad Shepherd (2024) ",
        "content": "Director: Geo Santini\n\nCast: Christos Kalabogias, Scotty Tovar, Justin Tate, Brett Zimmerman, Geo Santini\n\nPlot: (copied from IMDb) A group of friends on a hunting trip accidentally run over a woman carrying a bag of money. Their loyalty is put to the test when a strange man comes knocking.\n\nI just finished watching the movie (it just came out on Hulu this past weekend) and did my usual “movie title Reddit” google search to see what others thought about the movie but there were none, so here I am. \n\nWithout spoilers, I thought the movie was okay for a psychological thriller. I have a theory on who the mysterious man, Sidney, really was. The movie had some religious undertones as two of the main characters were named John and Paul, along with the concept of morality was prevalent throughout the movie. Thoughts?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1i51chy/the_bad_shepherd_2024/"
    }
]