[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1jgasa0",
        "author": "aranor01",
        "title": "Calendario pedalate Easy Riders",
        "content": "Info: https://bikepride.net",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jgasa0/calendario_pedalate_easy_riders/"
    },
    {
        "id": "1jgawch",
        "author": "DPPenjoyer18",
        "title": "Possibile trasferimento a Torino per lavoro, consigli sulla città?",
        "content": "Salve a tutti. Sono un quasi 30enne che probabilmente dovrà trasferirsi dal sud a Torino per iniziare un nuovo lavoro e volevo chiedere qualche consiglio sulla città, le zone più tranquille in cui vivere, dove poter trovare case in affitto ma in generale qualsiasi consiglio per un lavoratore alla sua prima esperienza in un’altra città.\n\nGrazie a tutti",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jgawch/possibile_trasferimento_a_torino_per_lavoro/"
    },
    {
        "id": "1jfxxhe",
        "author": "Extra_Fly3851",
        "title": "Negozio percussioni",
        "content": "Ciaoo a tutti !\nSapete indicarmi un negozio che venda percussioni ( in particolare mi servirebbe un tamburo da marcia ) su Torino e vicinanze che sia onesto e magari che vende anche usato ? Grazie !!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jfxxhe/negozio_percussioni/"
    },
    {
        "id": "1jg18w7",
        "author": "Geralt_of_Bals",
        "title": "First time visiting Torino, question about approaching bars, bakeries and restaurants",
        "content": "Hi Torino, me and my gf will be visiting this beautiful city soon and surely I researched the places to visit and where to eat at. However, I am uncertain on how to approach bars and bakeries in Italy, do you wait to be seated, do you order at the bar and than take it to a table? Please help.\n\n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jg18w7/first_time_visiting_torino_question_about/"
    },
    {
        "id": "1jftq0m",
        "author": "ShamefulDumbster",
        "title": "About the TOPoliTO Scholarship",
        "content": "I want to pursue a English taught Mechanical Engineering Bachelor's Program. I have a 1490 SAT and based on the information I have this score exempts me from the admission test. But the scholarship requires the admission test , does my SAT score exempts this test too?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jftq0m/about_the_topolito_scholarship/"
    },
    {
        "id": "1jfz2te",
        "author": "Impressive_Lynx_7938",
        "title": "Non so che fare questo weekend",
        "content": "Avevo già pianificato tutto, ma purtroppo questo weekend piove … qualcuno ha qualche suggerimento su attività, eventi o esperienze da fare ?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jfz2te/non_so_che_fare_questo_weekend/"
    },
    {
        "id": "1jfnbs2",
        "author": "Begghi16",
        "title": "AAA OTTICO CERCASI",
        "content": "Sono stato abbandonato (si fa per dire) dal mio ottico storico che è andato in pensione. Chi mi consiglia un buon ottico diciamo tra piazza statuto e inizio Grugliasco?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jfnbs2/aaa_ottico_cercasi/"
    },
    {
        "id": "1jfnblc",
        "author": "ClassicGift6771",
        "title": "How long to get PDS card after fingerprinting appointment?",
        "content": "Hi\n\nSo I'm a international student here in Torino and I just had my Questura appointment for my permesso di soggiorno. How long after the appointment is it currently taking to go pick up the actual card? I read around other sub reddits and it varies a lot. Some cities are a few weeks others are over a year.\n\nPeople that recently received their first PDS how long did you wait after the Questura appointment to get your permesso di soggiorno?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jfnblc/how_long_to_get_pds_card_after_fingerprinting/"
    },
    {
        "id": "1jfkb5v",
        "author": "Mean-Bandicoot-7246",
        "title": "Veterinario per gatto in Santa Rita",
        "content": "Ciao! Sto cercando un veterinario per il mio gatto in zona Santa Rita. Avete dei consigli?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jfkb5v/veterinario_per_gatto_in_santa_rita/"
    },
    {
        "id": "1jfj0ap",
        "author": "nessunoste",
        "title": "Pareri scuola elementare Convitto Umberto I",
        "content": "Ciao a tutti. \nL'hanno prossimo dovrò scegliere la scuola elementare a cui iscrivere mio figlio.\nPer motivi geografici ci sarebbe abbastanza comodo il Convitto Umberto I (quello che affaccia su via Garibaldi).\nHo raccolto pareri contrastanti in merito.\nQualcuno ha una esperienza diretta?\nGrazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jfj0ap/pareri_scuola_elementare_convitto_umberto_i/"
    },
    {
        "id": "1jf52ps",
        "author": "mirageoflower",
        "title": "Bus 52 molto spesso in anticipo?",
        "content": "Ciao a tutti, non so se sono io che sto perdendo qualche colpo o se effettivamente è così quindi chiedo qua: sbaglio o è da un po' che il 52 è quasi sempre in anticipo? \n\nIn particolare l'ho notato perchè ogni volta che devo prenderlo (fermata Breglio, direzione Val Salice - Piazzale Adua) devo stare attenta a farmi trovare in fermata almeno 10 minuti prima dell'orario previsto, altrimenti rischio di perderlo. Come oggi: secondo Moovit, Maps etc doveva arrivare in fermata alle 14:29, ma alle 14:25 me lo sono vista passare davanti. Idem un'altra volta ma di sera, fermata Carlo Alberto direzione Borgo Vittoria - Via Scialoja, orario di arrivo previsto in fermata 22:38 eppure alle 22:33 mi sono dovuta fare gli ultimi 200 metri in sprint sennò ciaone. In compenso quando lo devo prendere a Garibaldi, sempre direzione Borgo Vittoria, sembra che l'attesa non finisca mai — e ovviamente non mancano le volte in cui non passa proprio. Non parlo poi delle ore di punta, in cui indovinare quando passerà il prossimo 52 è facile quanto indovinare la data del Giudizio Universale. Amica dice che secondo lei non è un anticipo ma è l'autobus prima che è in estremo ritardo: io sono fermamente convinta che invece ci sia un anticipo cronico.\n\nImmagino già i commenti (\"Gli autobus a Torino sono sempre in ritardo e quando sono in anticipo ti lamenti pure?\" — che tra parentesi, siccome vengo da un paesino del basso Appennino tosco-emiliano dove i mezzi pubblici praticamente non esistono, per me la GTT con tutti i suoi problemi funziona anche abbastanza bene), ma sono dell'opinione che un anticipo superiore a 5 minuti sia uguale ad un ritardo superiore a 5 minuti in termini di disagio. Inoltre, ho il sospetto che questo anticipo cronico sia dovuto a un qualche problema di tabelle orarie: basterebbe semplicemente che aggiornassero gli orari di Moovit, Maps etcetera.",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jf52ps/bus_52_molto_spesso_in_anticipo/"
    },
    {
        "id": "1jewbzk",
        "author": "Effective_Cry9435",
        "title": "cerco amiche torino-piemonte",
        "content": "ciao! sono una ragazza di quasi 30 anni che, dopo qualche anno fuori regione, è ritornata a vivere in Piemonte e che frequenta Torino anche per studio ... ci sono vari eventi ed attività a cui vorrei partecipare a Torino e dintorni assieme a nuove amicizie :) ",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1jewbzk/cerco_amiche_torinopiemonte/"
    },
    {
        "id": "1jf66tk",
        "author": "oamatre",
        "title": "Barber in Torino",
        "content": "Ciao guys, I’m in Torino for the next 4 months and I’m looking for a good barber after being hugely disappointed by one recommended me by a local. I’m very picky and I’m looking for one who will take time with my hair and pay attention to details and what I ask. I don’t mind paying 30-50 euros for a really good cut. If you have a recommendation please let me know because I’m really pissed off at the last one :( ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jf66tk/barber_in_torino/"
    },
    {
        "id": "1jf5i2v",
        "author": "LIB8RATO",
        "title": "Best internet service",
        "content": "Which is the best internet service provider for home usage ? High speed, fast installation. Hassle free payment. Thank you",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jf5i2v/best_internet_service/"
    },
    {
        "id": "1jf01r5",
        "author": "DelayApprehensive968",
        "title": "Toy shops/retro toys in Turin",
        "content": "Hello, are there any toy shops in Turin that stock Transformer toys?? Ideally retro but new is fine too.. thanks in advance!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jf01r5/toy_shopsretro_toys_in_turin/"
    },
    {
        "id": "1jeux9f",
        "author": "Salvo_nesca",
        "title": "Voglio fare una maratona",
        "content": "Ciao a tutti, sono un ragazzo che si allena a pallacanestro 2 volte a settimana e ora voglio partecipare alla maratona di Torino del 23 novembre. Quello che voglio chiedervi è se è fattibile con questo margine di tempo, io mi allenerei tre volte a settimana per la corsa, l’unico mio dubbio è se non sto chiedendo troppo e quindi puntare alla mezza maratona. ",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1jeux9f/voglio_fare_una_maratona/"
    },
    {
        "id": "1jexyw8",
        "author": "Bright_Prize_9209",
        "title": "Gruppo uscite tra ragazzE",
        "content": "Ciao a tutte!  \nVivo a Torino da qualche anno per studiare al Politecnico e per lavoro, ma non ho ancora avuto l'opportunità di conoscere molte ragazze.   \n  \nMi piacerebbe fare nuove amicizie e organizzare uscite solo tra ragazze (locali, discoteche o anche solo cazzeggiare in giro).   \n  \nC'è qualcuna che sarebbe interessata a prendere un aperitivo? Magari ne esce un bel gruppo girls only",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1jexyw8/gruppo_uscite_tra_ragazze/"
    },
    {
        "id": "1je0r9h",
        "author": "__simson_",
        "title": "Dai non siamo messi così male",
        "content": "",
        "upvotes": 79,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/22oia4hn9goe1.jpeg?auto=webp&amp;s=96268f0f0f23ece3a9b116fe27a49ed6f88b5591"
        },
        "permalink": "/r/torino/comments/1je0r9h/dai_non_siamo_messi_così_male/"
    },
    {
        "id": "1jdy61c",
        "author": "Odd_Afternoon6508",
        "title": "I had the best time in Turin!",
        "content": "Last week I stayed in Turin with a friend for 5 days and it was so much fun and it was one of the best trips of my life! I’ve travelled a lot in Europe but this was the best one. \n\nThe people are very friendly, lots of people asked me where I am from, cause I don’t look local, had a lot of chitchat, people helped me with directions, the food was amazing. Nobody tried to scam me in restaurants. I also met a girl from Politechnic of Torino, who was teaching a class in english I believe, and I think I fell in love, I still think about her sometimes haha. It was a surreal experience :)\n\nOh and I really enjoyed the La Taverna Dei Mercanti restaurant, really delicious meat :)",
        "upvotes": 84,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jdy61c/i_had_the_best_time_in_turin/"
    },
    {
        "id": "1jejpec",
        "author": "mario_grondaia",
        "title": "Cercasi parrucchiere affidabile",
        "content": "Come da titolo si accettano consigli, preferibilmente budget intorno ai 20€ e facilmente raggiungibili con la metro che sto al capolinea di bengasi. Come potete immaginare qui in zona sono tutti barbieri cinesi/arabi che fanno solo tagli da maranza, non cerco nulla di particolare solo un parrucchiere che abbia esperienza per dare una scorciata mantenendo il giusto volume",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jejpec/cercasi_parrucchiere_affidabile/"
    },
    {
        "id": "1je2gc8",
        "author": "Icywindshard",
        "title": "Vorrei fare nuove amicizie a Torino",
        "content": "Ciao a tutti, vorrei poter dire di essermi trasferito da poco ma in realtà sono qui da 7 anni, e non sono ancora riuscito a farmi delle amicizie. Colpevole il fatto di essere molto bravo a passare il tempo da solo, ma mi piacerebbe cambiare un po’.\nSono un ragazzo di 25 anni, faccio palestra e arti marziali (non sono un fissato che parla solo di quello giuro) mi piace anche l’arte, il cinema e i videogiochi. \nMi andrebbero bene sia gruppi già formati che singoli ragazzi che come me fanno un po’ fatica a relazionarsi, sia maschi che femmine.\nSpero non risulti un post da disperati (un pochino lo è) ma se qualcuno avesse piacere commenti pure ",
        "upvotes": 12,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1je2gc8/vorrei_fare_nuove_amicizie_a_torino/"
    },
    {
        "id": "1jei2n3",
        "author": "Distinct_Location910",
        "title": "circolo di tennis economico vicino al Po con abbonamento estivo flat",
        "content": "Ciao a tutti,\nsto cercando un circolo di tennis vicino al fiume Po a Torino che sia abbordabile e magari offra una soluzione tipo abbonamento estivo a tariffa fissa. L’ideale sarebbe pagare una volta sola e poter giocare quanto voglio con altri soci durante l’estate, senza costi extra per prenotare i campi.  \nHo già chiesto ad Amici del Fiume e al CUS Torino, ma finora mi hanno dtto che qui non funziona proprio così: si paga una quota per diventare soci e poi un extra ogni volta che prenoti. Qualcuno conosce un circolo che fa eccezione? Magari con una formula “flat” per l’estate? Inoltre, molti circoli non hanno siti con info chiare sui prezzi e al momento non ho tempo di contattarli uno per uno. Voi che ne sapete? Qualcuno conosce più o meno i costi dei circoli vicino al Po? Ho avuto l’impressione che presentarsi di persona sia meglio, ma intanto ogni suggerimento è ben accetto, grazie mille!  \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jei2n3/circolo_di_tennis_economico_vicino_al_po_con/"
    },
    {
        "id": "1je3pj0",
        "author": "No_Investment5013",
        "title": "Dubbi sul Circolo dei lettori",
        "content": "Ciao a tutti!\nOggi sono andato al circolo dei lettori per informarmi sui vari eventi che ospita, ma avrei qualche domanda:\nEsistono dei club di lettura a cui si può partecipare liberamente o per farne parte è necessaria la tessera? L’accesso alle sale come lettore è riservato solo ai possessori della tessera io leggo?\n",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1je3pj0/dubbi_sul_circolo_dei_lettori/"
    },
    {
        "id": "1jdzuzj",
        "author": "ConsistentLook8198",
        "title": "Parchi per allenarsi",
        "content": "Ciao! Ci sono parchi attrezzati a Torino possibilmente raggiungibili con la metro o in 15 minuti in bici da porta Susa? \nMi accontento di poco, un paio di sbarre e dei blocchi per fare step e squat bulgari\n",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1jdzuzj/parchi_per_allenarsi/"
    },
    {
        "id": "1jdqkf6",
        "author": "Mission_Cancel1042",
        "title": "Corsia riservata su Corso Sommeiller: per me un'ottima idea. Per voi?",
        "content": "Premessa: cerco commenti ragionati, quindi prima di sparare scemenze siete pregati di leggere e riflettere. L'idea è quella di dare uno spunto di riflessione e di capire anche punti di vista differenti dal mio, quindi argomentate, come proverò a fare io qua sotto, e cercate di mantenere una discussione civile.\n\nIn questi giorni si è discusso parecchio della nuova corsia riservata su Corso Sommeiller, che secondo molti avrebbe dovuto paralizzare il traffico di mezza città. In questo casino si è inserita La Stampa con articoli del tutto avversi all'opera, **come aveva fatto col progetto Rete '82**, contribuendo al suo abbandono e lasciando il trasporto pubblico torinese è nelle condizioni in cui è...\n\nIo ho cercato di raccogliere qualche informazione in più ed ho scoperto che l'ultimo tratto del cavalcavia era riservato ai mezzi pubblici fin dal 2014 (fonte: street view). Ovviamente prima che mettessero la telecamera non la rispettava nessuno, adesso invece sono partite le proteste. A questo punto la corsia riservata è stata estesa a tutto il corso, e sembra il finimondo a giudicare dagli articoli di giornale e dai commenti sui vari social.  \nDunque ho ragionato: la capacità \"generale\" di una strada è determinata dal punto in cui la capacità \"localizzata\" è minore, quindi rispetto a prima dove c'erano due corsie su tutto il cavalcavia ed una sola in uscita non cambia nulla. Si è però eliminato l'imbuto, che costringeva a rallentare chi era già sulla corsia giusta, fluidificando il traffico. Se ne evince che la capacità non solo non è diminuita, ma probabilmente addirittura aumentata di poco.\n\nAlla luce di ciò, mi pare di intuire che le lamentele non siano tanto riferite alla corsia riservata in sé, ma al fatto di doverla rispettare, dato che la telecamera controllerà, oppure all'affidarsi a ciò che dicono gli altri senza riflettere. Trovo a favore di questa tesi le testimonianze di conoscenti che tra ieri e oggi sono passati all'ora di punta: mi hanno detto di una situazione di traffico, ma non così disperata da bloccare San Salvario, come prevedeva qualcuno.\n\nTra le contro-argomentazioni più diffuse si trova chi dice che il tram passa poco di frequente, per cui la corsia riservata sarebbe inutile. A questi vorrei dire che il 16, all'ora di punta, dovrebbe passare ogni 9 minuti con parecchi passeggeri a bordo (come faceva notare u/nickname1917), che altrimenti sarebbero in macchina a creare altro traffico. Passaggi che adesso saranno più regolari, avendo eliminato uno dei punti in cui si perdeva più tempo. Infine non ci si può lamentare di come i trasporti pubblici facciano pena se poi ci si oppone a qualsiasi tentativo di migliorarli. Inoltre bisogna ricordare che la corsia riservata è utilizzabile anche dai mezzi di soccorso (e dai taxi?).\n\nDetto ciò, pensavo a quali potrebbero delle possibili soluzioni per aumentare la capacità del cavalcavia, e ho individuato due interventi che a mio parere, da esterno al settore, potrebbero aver senso:\n\n* Aggiungere una corsia per la svolta a destra in Via Sacchi alla fine del cavalcavia, allargandolo nella zona vuota al confine col dopolavoro ferroviario. Potrebbe richiede espropri e di sicuro bisognerebbe mettere mano a parte dell'incrocio.\n* Spostare la sede tranviaria su Corso Sommeiller al centro della carreggiata almeno fino all'incrocio con Corso Re Umberto, dove c'è più spazio per far passare il tram sul lato della carreggiata. Ciò sposterebbe l'interferenza tra tram e auto che fanno dritte ad un incrocio con più spazio per far fluire il traffico che prosegue dritto col tram. Potrebbe anche essere un'occasione per mettere mano ad uno dei tratti di strada più brutti della città ([idea fatta la volo, coi parcheggi e marciapiedi ristretto per la corsia per girare in corrispondenza degli incroci e fermate del tram in corrispondenza delle alberate](https://streetmix.net/-/2902550)). Ancora meglio se si spostassero i binari al centro fino a Piazza Sabotino, dove ci sarebbe tutto lo spazio per architettare una soluzione adatta.\n\nQuesto è quanto, sono curioso di sentire i vostri punti di vista e eventuali idee per risolvere la questione, possibilmente senza rimuovere la corsia riservata!  \nScusate per il Wall of text, notte!",
        "upvotes": 16,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1yZlewq1qVR-f2HCrYslmHqgAT98qjRfdbIXQBKFfBA.jpg?auto=webp&amp;s=3b2655b089b8aeba11de59db8e34f1859e5b8b2c"
        },
        "permalink": "/r/torino/comments/1jdqkf6/corsia_riservata_su_corso_sommeiller_per_me/"
    },
    {
        "id": "1je1o98",
        "author": "Loken246",
        "title": "Ci sono supermercati all'ingrosso a Torino città dove posso comprare prodotti all'ingrosso?",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1je1o98/ci_sono_supermercati_allingrosso_a_torino_città/"
    },
    {
        "id": "1je07pj",
        "author": "Meac0",
        "title": "Consigli negozi vestiti uomo per ufficio e/o casual.",
        "content": "Ciao a tutti! Sto cercando un negozio (o più di uno) a Torino dove poter trovare vestiti da uomo belli e di buona qualità, senza dover vendere un rene per un pezzo di plastica con un logo sopra. Qualcuno ha consigli su posti dove si possa fare shopping senza rimorsi economici? Grazie in anticipo!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1je07pj/consigli_negozi_vestiti_uomo_per_ufficio_eo_casual/"
    },
    {
        "id": "1jdoq1t",
        "author": "RevolutionaryLog3631",
        "title": "Perchè la Benzina costa molto meno subito dopo l'aeroporto di Caselle?",
        "content": "Intendo ai 2 distributori vicini al McDonald di San Maurizio Q8 e Economy.\n\n  \nOggi 1,64 la SP mentre altrove minimo 1.75!",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jdoq1t/perchè_la_benzina_costa_molto_meno_subito_dopo/"
    },
    {
        "id": "1jdl0ce",
        "author": "Outrageous_Corgi6611",
        "title": "Vivere al piano terra a Torino",
        "content": "Ciao a tutti, in questo periodo sono alla ricerca di un appartamento in affitto a Torino, e dei tre che ho visitato finora uno in particolare mi è piaciuto molto: spazioso, ben arredato, in un'ottima posizione per me e a un prezzo bene o male abbordabile.\n\nUnico contro: è al piano terra, con porta **non blindata** che dà direttamente sulla strada (fortunatamente una laterale non troppo trafficata). Nell'appartamento ci sono anche altre finestre, che però danno su una corte interna quindi non mi preoccupano.\n\nSecondo voi, com'è in termini di sicurezza vivere al piano terra in una città come Torino? Vedete criticità (sia in termini di sicurezza che altro) o mi sto facendo pare inutili? La zona sarebbe tra Cit Turin e Quadrilatero, quindi (penso) abbastanza sicura in generale.\n\nGrazie in anticipo per le vostre risposte!\n\nEDIT: grazie a tutti per le risposte! Nel profondo speravo che le mie paure fossero ingiustificate, ma leggendo i vostri commenti mi sono convinto che non ne vale la pena, quindi ho deciso di lasciar perdere",
        "upvotes": 7,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1jdl0ce/vivere_al_piano_terra_a_torino/"
    },
    {
        "id": "1jdowor",
        "author": "dkroods",
        "title": "Come controllare quando ci saranno scioperi!🚇🚍",
        "content": "Ciao tutti!  \nQuando usate [**Take It Easy TO**](https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app&amp;pcampaignid=web_share), fate attenzione al **cerchio blu pulsante** nell’app! Se lo vedete, significa che è previsto uno sciopero che potrebbe influenzare i trasporti.\n\n[Take It Easy TO](https://preview.redd.it/kywgk6yembpe1.png?width=438&amp;format=png&amp;auto=webp&amp;s=e6226f522e0552e3cd0f2491acd2c10d37c7329e)\n\nControllate i dettagli e organizzatevi in anticipo per evitare disagi! 🚇🚍\n\n**Il team di Take It Easy TO** 🚀",
        "upvotes": 3,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nnQwOdFPDhG66upzOUX8tpygSBrrCbAym8Jn9SOS4gI.jpg?auto=webp&amp;s=44e52737a24a4ce0d5f7adb7f20f5ea1e5f986e6"
        },
        "permalink": "/r/torino/comments/1jdowor/come_controllare_quando_ci_saranno_scioperi/"
    }
]