[
    {
        "id": "1mthrxd",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 20,
        "comments": 1222,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mthrxd/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1muv1um",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Real Madrid vs Osasuna, La Liga, Match 1",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1muv1um)",
        "upvotes": 170,
        "comments": 422,
        "media": null,
        "permalink": "/r/realmadrid/comments/1muv1um/post_match_thread_real_madrid_vs_osasuna_la_liga/"
    },
    {
        "id": "1mx5abt",
        "author": "No-Independent2522",
        "title": "When I saw Trent and Carrera in starting XI",
        "content": "",
        "upvotes": 110,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9w4jfkqbfkkf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mx5abt/when_i_saw_trent_and_carrera_in_starting_xi/"
    },
    {
        "id": "1mxa9h7",
        "author": "EngLitIsLit",
        "title": "Arda finally getting his water 😅",
        "content": "",
        "upvotes": 53,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5vnvm6prelkf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mxa9h7/arda_finally_getting_his_water/"
    },
    {
        "id": "1mx2pgs",
        "author": "Kuttoosan47",
        "title": "I think the diamond midfield could be the way to go whenever facing a low block like Osasuna. Or worst case, Arsenal/Atleti",
        "content": "\nLet me explain, One glaring problem I noticed against Osasuna is how useless trent x Brahim was. Brahim isn't good enough and  against a low block, Trents best method of delivering crosses, was utterly useless as the box had just one of our players in at the maximum.\n\nAlso, in this formation Ideally I would have Bellingham at at the top of the diamond with CVT as the supporting cast. In the current situation, My pick would be Gonzalo for that AM position and of course Arda as that LCM. Vini and K10 would be the front two.  \n\nWhy think this would be particularly useful against low blocks is because as there are no actual wingers, the full backs primarily occupy the flanks and are in pole crossing position. Now, the reason I chose Gonzalo at head of the diamond as a replacement to Jude is because of their competence in the air.  Whenever the full backs are in crossing position, Gonzalo is in prime position to make a run in for a high cross. Now, a cross doesn't necessarily have to be a high cross. This is where Arda and Valverde come in. One trait of Fede that I've seen become rarely utilised is his runs into the box, a well executed to through ball to Fede near the edge of the box or even inside it makes it the perfect opportunity for him to deliver a powerful low cross with 3 forwards to connect. Arda is excellent at picking out players from the vicinity of the box and with Gonzalo being a genuine goal threat along side Vini, that is also a good opportunity for him to initiate the movement of the ball through the middle if the fullbacks are being closed down tighter. Valverde is the wildcard in this setup here, as he can get often overlooked even though he is a good shooter. Vini and Mbappe are not good arially but that doesn't mean they're threats when it comes to crosses, which is why cross and inshallah would not be a bad option. Also this drags defenders away from Valverde and Arda who are good shooters themselves.\n\n\nAlso another part of this I want to mention is that when defending Valverde stays wide and possibly high considering how strong the opponent left side attack is. He's a strong and Fast player who will assist better in counter attacks. But then again Fede is often someone that can handle a more defensive role while still being quick enough to be part of the counter\n\n\nWhat do you guys think about it?",
        "upvotes": 45,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mx2pgs/i_think_the_diamond_midfield_could_be_the_way_to/"
    },
    {
        "id": "1mxa4lc",
        "author": "chunchunmaru1129",
        "title": "I think you guys are just overreacting from the recent match",
        "content": "Okay first of all our best player Jude is out with a injury and I think without Jude our midfield just doesn't work that well.\n\nThis is how I see it Jude brings in both attacking threat in the box cause of his height and also helps defensively which allows Guler who is the best passer among our midfielders and has the best vision to perform better and which by extension and something's telling me Valverde isn't completely fit either.\n\nWe are missing Camavinga who is also out with a injury. \n\nAnd Huijsen is just so chill man bros long balls is a thing of beauty.\n\nWhen our injured players will be back from injury I think our team will strength will be increased significantly.\n\nJust trust Xabi's process man give the guy some time.\n\nMbappe and Vini also pressed in the recent match. \n\nAnd most importantly that opposition teams literally parked bus so hard they had 8-9 players in their box.",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mxa4lc/i_think_you_guys_are_just_overreacting_from_the/"
    },
    {
        "id": "1mws9km",
        "author": "deez-nuts-are_nuts",
        "title": "What's your favorite ucl winning kits ?",
        "content": "",
        "upvotes": 151,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mws9km/whats_your_favorite_ucl_winning_kits/"
    },
    {
        "id": "1mwrwyd",
        "author": "Leung_GW",
        "title": "Does anyone hope an El clasico UCL final never happens ?",
        "content": "I can definitely imagine the bragging rights if Madrid were to win a hypothetical clasico UCL final but I can also imagine the absolute heartache if the club were to lose against their arch rivals. \n\nAlso watching that game would be so stressful, I feel like my heart would be racing for 90 mins straight. \n\nWhat do you all think ?",
        "upvotes": 92,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mwrwyd/does_anyone_hope_an_el_clasico_ucl_final_never/"
    },
    {
        "id": "1mw1pvp",
        "author": "Shelly_Beats23",
        "title": "Why is vini just standing there watching mbappe run by himself",
        "content": "",
        "upvotes": 2308,
        "comments": 369,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xdnu00bkzakf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mw1pvp/why_is_vini_just_standing_there_watching_mbappe/"
    },
    {
        "id": "1mwnoc4",
        "author": "Apprehensive-Salt714",
        "title": "Munuera Montero's Instagram page proves he's a Barcelona fan",
        "content": "Wasn't sure where to post this since other football subs are full of Barca fanboys. I was scrolling through Munuera's IG and noticed his posts that have more slides of players and stadium/atmosphere in it were Barca games. It shows him having a good time with their players or staff vs other posts where he looks more \"professional\" or it's just him in the frame. He'll rarely post pics with players from other teams and when he does it'll show him maybe arguing with them or showing a yellow or something, not smiling in admiration like he does with Barca. He also has more posts of him refereeing Barca games than any other teams. How is this allowed? He's obviously not trying to hide his bias in games either, he shouldn't be allowed to ref games for his favorite team or their direct opponents.",
        "upvotes": 67,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mwnoc4/munuera_monteros_instagram_page_proves_hes_a/"
    },
    {
        "id": "1mxb1eg",
        "author": "Smoosa_Champagne",
        "title": "Real Madrid fans, why did you choose this club and when?",
        "content": "I wanted to ask fellow Madridistas here, what made you start supporting Real Madrid and at what point in your life did it happen?\n\nWas it because of a player, a specific match, family influence, or just the history of the club? And how long have you been following them?\n\nWould love to read your stories.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mxb1eg/real_madrid_fans_why_did_you_choose_this_club_and/"
    },
    {
        "id": "1mxa0hc",
        "author": "cmon_guyz_im_trying",
        "title": "Buying VIP to a Match",
        "content": "Hello all!\n\nI will be going to Spain for my honeymoon in November and will be trying to catch the Madrid/Valencia fixture while I'm there. I have been looking into tickets but I'm a bit confused by their website and the process of purchasing. I am wondering if anyone here has purchased tickets through their official website or through a second part vendor and how that process went.\n\nWhen I look at the website, the game is red (as are all of them except for the one coming up on the 30th). Some of those games, when you click into the game to purchase hospitality/VIP tickets have some available but many have none available. I emailed their help and was told tickets would come available but no indication of what kind and when.\n\nBasically just looking for guidance from someone that has purchased tickets for a match on the best way to make sure I get some and don't miss out!\n\nThanks for your help!\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mxa0hc/buying_vip_to_a_match/"
    },
    {
        "id": "1mw3cxn",
        "author": "amungus45",
        "title": "Real Madrid and Champions League",
        "content": "",
        "upvotes": 338,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l3vjya1ehbkf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mw3cxn/real_madrid_and_champions_league/"
    },
    {
        "id": "1mvs90b",
        "author": "No-Independent2522",
        "title": "Carreras gets his jersey signed by all his teammates after Bernabeu debut",
        "content": "",
        "upvotes": 1636,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/otf6p5mvu8kf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mvs90b/carreras_gets_his_jersey_signed_by_all_his/"
    },
    {
        "id": "1mwah60",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against Bayern | Friendly",
        "content": "",
        "upvotes": 59,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lmuoabwhgdkf1.jpeg?auto=webp&amp;s=984e0e57382fa350436e73a7010e59d83b4da2fd"
        },
        "permalink": "/r/realmadrid/comments/1mwah60/fem_our_starting_xi_against_bayern_friendly/"
    },
    {
        "id": "1mvu5h4",
        "author": "senorrandom007",
        "title": "Just a healthy reminder",
        "content": "",
        "upvotes": 639,
        "comments": 53,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4xisvg9g89kf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mvu5h4/just_a_healthy_reminder/"
    },
    {
        "id": "1mvts0w",
        "author": "FergieBall_FC",
        "title": "@Squawka: Álvaro Carreras was the only player in LaLiga to make 50+ passes into the final third in GW1. ➡️",
        "content": "",
        "upvotes": 498,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9hqm2syg59kf1.jpeg?auto=webp&amp;s=0064631cced48b3cea7f73f20f15c1e8bc620994"
        },
        "permalink": "/r/realmadrid/comments/1mvts0w/squawka_álvaro_carreras_was_the_only_player_in/"
    },
    {
        "id": "1mvgg2p",
        "author": "No-Independent2522",
        "title": "Huijsen completed more than 15 long balls against Osasuna",
        "content": "",
        "upvotes": 674,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rlbjdatfq6kf1.jpeg?auto=webp&amp;s=e41ce38bf6f7b0dfe0e7babcff9529a2e8e2d81e"
        },
        "permalink": "/r/realmadrid/comments/1mvgg2p/huijsen_completed_more_than_15_long_balls_against/"
    },
    {
        "id": "1mvleii",
        "author": "TheFeatherDiaries",
        "title": "Franco Mastantuono lively DEBUT vs Osasuna",
        "content": "",
        "upvotes": 325,
        "comments": 62,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/a4hns32am7kf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mvleii/franco_mastantuono_lively_debut_vs_osasuna/"
    },
    {
        "id": "1mvjdaa",
        "author": "TheFeatherDiaries",
        "title": "This is XABI-Ball 😍 😍",
        "content": "",
        "upvotes": 350,
        "comments": 138,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hz8r68yz87kf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mvjdaa/this_is_xabiball/"
    },
    {
        "id": "1mvlkzu",
        "author": "xggq",
        "title": "Mbappe vs 3 Osasuna players",
        "content": "",
        "upvotes": 271,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4h7hj8edn7kf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mvlkzu/mbappe_vs_3_osasuna_players/"
    },
    {
        "id": "1mvs9or",
        "author": "eneskaraboga",
        "title": "Can we stop daily Rodrygo posts saying the same thing over and over again?",
        "content": "One second search would give you 10s of different Rodrygo posts all saying the same thing. He is skilled, we are stupid if we sell him, why he was benched etc. Do you not think Xabi is already thinking about this? I mean do you believe him reading these and think to himself 'Yeah Reddit guys saying Rodyrgo should not be benched, I better play him?'\n\nI don't understand the point of everyday new posts popping off, asking the same questions, giving the same advice. Let it be, let it go. \n\nHe had every chance last year while the most talents were rotting on the bench no matter how good they were. Rodrygo may be a skilled player but it is obvious he is not considered. No matter how many new posts you create, it won't change. ",
        "upvotes": 88,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mvs9or/can_we_stop_daily_rodrygo_posts_saying_the_same/"
    },
    {
        "id": "1mv88ds",
        "author": "ivar_theB",
        "title": "Nice play from mbappe but…",
        "content": "I dont know about u guys but a hated the passe choice he did at the end, there was plenty of Space on the center and left side to have a good attack… \n\nvery desapointed for the behavior dribbling 3 players is good but doin it to open up the play and speed up the attack is even better\n\nGood game anyway from KM10\n",
        "upvotes": 1092,
        "comments": 120,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rpp53804o4kf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mv88ds/nice_play_from_mbappe_but/"
    },
    {
        "id": "1mvkj8k",
        "author": "Effective_Captain611",
        "title": "MATCH REVIEW [vs. Osasuna - LaLiga] ⚪✨",
        "content": "⚪✨ Madrid kick off LaLiga with a 1–0 win over Osasuna!\n\nMbappé’s penalty made the difference, but it was far from smooth sailing in Xabi Alonso’s debut on the touchline. Huijsen shone with composure beyond his years, Militão’s return was encouraging, and Arda showed glimpses of magic. But against Osasuna’s deep block, Madrid often ran out of ideas.\n\nWe’ve broken down every performance, player by player.\n\nWho impressed you most tonight? And what would your rating for Xabi be?\n\nFeel free to follow MadridNoir on Instagram for more!",
        "upvotes": 151,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mvkj8k/match_review_vs_osasuna_laliga/"
    },
    {
        "id": "1mwd176",
        "author": "ManuMora98",
        "title": "[Fem] Bayern 3 - [1] Real Madrid | Naomie Feller 37'",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kgVjCy8JmXU6iNItTFm47RKuYVvc9mgrqsTh_R2-XoQ.jpeg?auto=webp&amp;s=8f0b4f1cae920fedbba07b2aff0dc5dac71fd2e4"
        },
        "permalink": "/r/realmadrid/comments/1mwd176/fem_bayern_3_1_real_madrid_naomie_feller_37/"
    },
    {
        "id": "1mvltew",
        "author": "hijazist",
        "title": "The overreaction is insane",
        "content": "Even for RM fan standards. What’s going on?? Guys this is the first game of the season with very little preparation time. Room for improvement, absolutely, but this is the first game for Pete’s. We endured years of high blood pressure matches that we either won last minute or lost/tied. At least here we were in full control of the match.\n\nHere are some things to take away from the match:\n\n- We got 3 points against a very stubborn opponent with basically 8 men defense\n\n- No injuries and long term injured players are back in full force. Militao &amp; Carvajal looked great out there.\n\n- Depth in the squad like we’ve never had. People also aren’t playing out of position. Everyone in their favorite spot.\n\n- Super solid defense with barely any mistakes. No highway spaces like before. Huijsen and Tchou were great. Trent needs to gel in better but Carreras looked very promising and I see a Marcelo spark in him.\n\n- Much faster ball recovery and press.\n\n- Balls to sub Vini for Garcia. This is a huge point for Xabi… no one is protected from being subbed or rotated.\n\n- Rotate all players. Again, this is something we really lacked. This will keep our players fresh for the long season.\n\n- Trust in youngsters. Not just for the last 5 minutes. ",
        "upvotes": 68,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mvltew/the_overreaction_is_insane/"
    },
    {
        "id": "1muvbv0",
        "author": "Ready_Ad_1353",
        "title": "Mbappe is the Man of the Match",
        "content": "",
        "upvotes": 1355,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0owp5g8jl1kf1.jpeg?auto=webp&amp;s=4c281ed919019727f4a74e7ab57596030631163c"
        },
        "permalink": "/r/realmadrid/comments/1muvbv0/mbappe_is_the_man_of_the_match/"
    },
    {
        "id": "1mvbx9o",
        "author": "Dull_Party_7885",
        "title": "Chill out, it was the first game",
        "content": "It's fine guys, they parked their whole damned stadium on that pitch, its fine. We played pretty well for a team that was literally facing 10 men in the box, I was surprised the goalkeeper, coach, substitutes and staff didnt join in the box too, they should have come as well. Anyway, all I'm saying is, we created good chances, we had shots on target, Mbappe was great, Franco was good, Hujsen is looking great, Vini is still just average, but atleast thats better than being trash. I'm not saying don't panic, I'm saying don't panic FOR NOW. We can criticise after 6-7 games. We played quite well for a team that had such high defensive pressure. Our plays will just get better, we got this. Hala Madrid!",
        "upvotes": 80,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mvbx9o/chill_out_it_was_the_first_game/"
    },
    {
        "id": "1mvbdtz",
        "author": "Omkarop_06",
        "title": "Mastantuono on the Right Wing.",
        "content": "Brahim is not a starter. Rodrygo seems to be out of plans for now. Valverde seems good at the Midfield. Arda too. Mastantuono looks like a player with the perfect profile we need at RW. He is a good dribbler, a Risk taker, a Run maker, helps defensively and overall is able to dictate the game on his wing. \n\nYes it's too early to give him the starting position. But who else if no Brahim and Rodrygo? ",
        "upvotes": 71,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mvbdtz/mastantuono_on_the_right_wing/"
    },
    {
        "id": "1mvalz9",
        "author": "Smoosa_Champagne",
        "title": "Plastic Real Madrid fans are overreacting after just one game!",
        "content": "Some fans have already started crying after Matchday 1. They are saying things like “we cannot play proper football,” “Xabi is just playing Ancelotti-ball,” “we haven’t improved,” “we lack this and that.”\n\nThe same happened with Mbappé last year. At the start, he missed easy passes, missed penalties, even looked like he couldn’t handle pressure. People wanted him sold, saying he was destroying the team. But he kept working, kept improving, and in the end he won the Pichichi. Those same fans went silent.\n\nNow it’s the same story with Xabi and the team. These plastic fans don’t want to wait. They just want to bash players and push their own agenda. One bad pass, one slow game, and they start crying.\n\nAt the end of the day, it’s new players, a new system, new tactics, and a new manager. You all want to judge everything after just three weeks of training? We all know the biggest danger in the league is losing points. That’s what matters most. Beautiful football is nice, but points win us the league.\n\nYes, we are lacking in some areas like the final third. And yes, the coach is experimenting in his early days. But that’s part of the process. Let them breathe, give them time, and trust the project.\n\nIn Real Madrid, I believe.\nHala Madrid.\n",
        "upvotes": 71,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mvalz9/plastic_real_madrid_fans_are_overreacting_after/"
    },
    {
        "id": "1murz10",
        "author": "No-Independent2522",
        "title": "The new interior corridor in Bernabeu",
        "content": "",
        "upvotes": 1041,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8g3xehcmz0kf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1murz10/the_new_interior_corridor_in_bernabeu/"
    },
    {
        "id": "1mv80tp",
        "author": "ColdAd3682",
        "title": "Fede Valverde looked weird last night",
        "content": "Is it just me or anyone else noticed that Fede looked really out of role last night. He looked really weird off the ball like I don’t know how to clearly say it. I feel like he wasn’t given a particular clear role or any instructions yesterday. He played in a kinda like a 10 position for the first half. Where he was really like nullified. He was on the ball more in the second half. I feel like his best position is on the right hand side of the midfield with Guler operating in the centre. Yesterday I felt like he was one player with the least impact for the team with Trent . This is not a criticism at any point by the way I know how much he means to us we all absolutely adore him. But last night felt kinda weird.",
        "upvotes": 100,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mv80tp/fede_valverde_looked_weird_last_night/"
    }
]