[
    {
        "id": "1quu150",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Juvenil 'A’ - Olympique de Marseille U19 | UEFA Youth League, Round of 32",
        "content": "#FT: JUVENIL A 5:2 OM\n\n&amp;#x200B;\n\n#UEFA YOUTH LEAGUE \n\n&amp;#x200B;\n\n**Scorers/replays:**\n\n1:0 Thiago Pitarch 17'\n\n1:1 Mohamed Baradji 25'\n\n2:1 Anis Doubal (own goal) 27'\n\n2:2 Tadjidine Mmadi (penalty) 42'\n\n3:2 Dani Yáñez (penalty) 53'\n\n4:2 Diego Martínez 'Beto' 80'\n\n5:2 Adri Pérez 90'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n⚽ 17' - GOLLLLLL DEL JUVENIL A - Arnu steals the ball from their defensive midfielder, and quickly plays it to Thiago at the edge of the box. He takes a few quick touches to create space, and then cuts his shot across, low into the far corner\n\n⚽ 25' - goal for OM - Illia punches away a free kick poorly, then their player takes a shot and it hits the post - the ball bounces to Baradji, who takes a little touch, and Joan Martínez can't clear it off the line in time (and even then it would've bounced back into the net again), what a crazy and unfortunate goal\n\n⚽ 27' - GOLLLLLL DEL JUVENIL A - and right in the next attack, Fortea advances on the right wing - his powerful and low cross gets deflected into the near corner by Marseille's Doubal! \n\n42' - penalty for OM after a foul by Rivas \n\n⚽ 42' - Mmadi converts\n\nHT - half time in a very open match where most dangerous situations ended up being goals on both ends - the goals we conceded were entirely avoidable, and the team needs to pay special attention to defending set-pieces better or preventing them from happening in the first place\n\n46' - 2nd half underway \n\n51' - penalty for Juvenil A after Yáñez gets tripped in the box! \n\n⚽ 53' - GOLLLLLL DEL JUVENIL A - Yáñez takes it himself and converts! \n\n🔄 59' - Rivas and Cestero off for Valde and Beto \n\n🔄 71' - Yáñez off for Gabri Valero\n\n⚽ 80' - GOLLLLLL DEL JUVENIL A - golazo de Beto! free kick from around 20 metres out, and Diego Martínez strikes it right into the top corner on the goalkeeper's side of the goal! \n\n🔄 83' - last subs, Ciria and Arnu off for Adri Pérez and Jacobo\n\n⚽ 90' - GOLLLLL DEL JUVENIL A - and the cherry on top, after a dribble by Gabri Valero, he crosses the ball low into the box - it gets deflected towards the far post by the defender, where Adri appears to head it into the net\n\nFT - a calm and controlled second half by the team makes the match end with a comfortable scoreline - they had OM under control defensively much more than in the first half and pounced in the decisive moments in attack. We will get to know the opponents in the Round of 16 and the possible path through the rest of the tournament on Friday\n\n&amp;#x200B;\n\n**Kickoff:** 16:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee:** Sam Barrott (ENG) \n\n**Competition:** UEFA Youth League, Round of 32\n\n**Viewing options:** [RMTV/RM PLAY](https://play.realmadrid.com/home)\n\n&amp;#x200B;\n\n**Juvenil A XI (4-3-3):** Illia Voloshyn - Diego Aguado, Mario Rivas (59' Victor Valdepeñas 'Valde'), Joan Martínez, Jesús Fortea - Jorge Cestero (Diego Martínez 'Beto'), Carlos Díez, Thiago Pitarch - Alexis Ciria (83' Adri Pérez), Adrián Arnuncio ‘Arnu’ (83'' Jacobo Ortega), Dani Yáñez (71' Gabri Valero)\n\nBench: Álvaro González (GK), Melvin Ukpeigbe, Álvaro Lezcano, Pol Durán. \n\nCoach: Álvaro López\n",
        "upvotes": 10,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wUOMl6hwPl_tsdwHAtAtno0xMvZE8h1UdSt0wFAsSbg.jpeg?auto=webp&amp;s=da678670992586a213164525827e56adb279d53a"
        },
        "permalink": "/r/realmadrid/comments/1quu150/match_thread_real_madrid_juvenil_a_olympique_de/"
    },
    {
        "id": "1qts1ud",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 11,
        "comments": 1680,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qts1ud/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qycdcr",
        "author": "o6ohunter",
        "title": "Mbappè not looking too happy during training",
        "content": "",
        "upvotes": 353,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g9n8qp8fe2ig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qycdcr/mbappè_not_looking_too_happy_during_training/"
    },
    {
        "id": "1qyg1u9",
        "author": "No-Independent2522",
        "title": "[Official] Barcelona hereby announces that today it has formally notified the European Super League Company and the clubs involved of its withdrawal from the European Super League project",
        "content": "",
        "upvotes": 100,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kpxAZLDii9ymH4gHXpqnlC5goT95hamgRC9Pz6X0yN8.jpeg?auto=webp&amp;s=d071a4af5ce4c43f8ca37854f047132304f9116f"
        },
        "permalink": "/r/realmadrid/comments/1qyg1u9/official_barcelona_hereby_announces_that_today_it/"
    },
    {
        "id": "1qyfjhy",
        "author": "DANKWINGS",
        "title": "25/26: Vinicius Junior V Kylian Mbappe's defensive actions this season",
        "content": "I think this warrants a healthy discussion. \n\nI'm personally of the opinion that Mbappe tracking back is also very much to do with him playing as a CF. Because of the fact he is in this position, I feel he has a lot more area to cover or \"walk around in.\" \n\nBecause of this, I feel like he makes less runs back. When I watched him as a LW at the start and early years of his career, he did actually contribute a little defensively. \n\nThis makes me want to see Vini left, Garcia CF and Mbappe right more than ever. When Mbappe has to work harder for his goals, a lot of his 'bad' qualities may automatically disappear. ",
        "upvotes": 42,
        "comments": 85,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qyfjhy/2526_vinicius_junior_v_kylian_mbappes_defensive/"
    },
    {
        "id": "1qy9fdy",
        "author": "Sparrow_tora_999",
        "title": "Direct Free Kick Goals",
        "content": "Most free-kicks scored for Real Madrid since 2009: \n1. Cristiano Ronaldo (33) \n2. Gareth Bale (4) \n3. Mesut Özil and James Rodriguez (3)\n4. Kylian Mbappé, Alaba, Rodrygo and Fede Valverde (2).\n\nSince Cristiano Ronaldo left Real Madrid, the team has missed a reliable free-kick scorer.During his 9 years at the club, Real Madrid averaged 6.1 free kicks per season. That figure has dropped to 1.6 per season since he left. Now, there is a “power vacuum” and only a few players stand out, and all of their output is far from Ronaldo’s.\n\nWho should be RM's free kick taker now?",
        "upvotes": 91,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qy9fdy/direct_free_kick_goals/"
    },
    {
        "id": "1qyawgw",
        "author": "Ghioxs",
        "title": "Why Toni Kroos was the greatest midfielder",
        "content": "Hello everyone, I know this title will have many in doubts, but let me explain. In this story I want to show you some of the numbers of Toni Kroos, which no one see's. I would say, Kroos forces the game being played like he wants it. I will go through different statistics and give you also some comparable other players stats as well. The values inside the tables are all rounded just for readability, but this doesn't change anything for the facts!\n\n1. Pass volume &amp; accuracy (2017 - 2023)\n\n* **Pass volume** = total attempted passes\n* **Pass accuracy** = percentage of successful passes\n\n|Name|Passing Volume|Passing Accuracy|\n|:-|:-|:-|\n|Sergio Busqusts|18.300|90|\n|Toni Kroos|18.700|90|\n|Joshua Kimmich|19.800|85|\n|Rodri|20.000|92|\n\nThey are the top 4, the best of the best and what can see? Toni Kroos is not number 1, but don't stop reading yet!\n\n2. Ball contacts before losing the ball\n\n* **Touches per ball loss** = how many touches a player makes before losing the ball\n* **Minutes played** = total minutes played (2017–2023)\n\n|Name|Minutes Played|Touches per ball loss|\n|:-|:-|:-|\n|Joshua Kimmich|23.300|57|\n|Rodri|23.500|67|\n|Sergio Busquets|23.000|78|\n|Toni Kroos|20.800|95|\n\nThis metrics doesn't look to relevant, but it gives us one important information. No matter what game situation you're in - you could pass to Kroos and he could calm the situation for you. In average Toni Kroos losses the ball after touching it 95 times before. However this could bring up the idea, he is just playing safe and doesn't take risks. Wrong!\n\n3. Progressions per ball loss\n\n* **Progressions per ball loss** = how many forward/progressive actions a player makes before losing the ball\n* **Minutes played** = total minutes played (2017–2023)\n\n|Name|Minutes Played|Progressions per ball lose|\n|:-|:-|:-|\n|Joshua Kimmich|23.300|12|\n|Rodri|23.500|12|\n|Sergio Busquets|23.000|15|\n|Toni Kroos|20.800|23|\n\nThis table shows us, that Toni Kroos is not just a player that hides, has a lot of touches and doesn't do anything with it. He is still creating more progression than any of his competitors with having also a comfortable lead. However progression doesn't always mean dangerous, that's what we will look at next.\n\n4. Passes into final third\n\n* **Passes into final third** = number of passes played into the attacking third\n* **Minutes played** = total Champions League minutes (2017–2023)\n\n|Name|Minutes Played|Passes into final third|\n|:-|:-|:-|\n|Luka Modric|5.700|500|\n|Rodri|5.000|510|\n|Joshua Kimmich|7.500|660|\n|Toni Kroos|5.800|740|\n\nDespite him being the safest midfielder of all time, he is also the most dangerous creator of all time - since UCL 2003. While we were waiting for Cristiano, Vini Jr. and everyone else scoring goals, Kroos was the one directing the game into the dangerous zones. He didn't wait for the moment, he created it - for more than a decade.\n\nTaken together, the data shows why Toni Kroos was indispensable to Real Madrid’s success: with unmatched passing accuracy, ball security, progression efficiency, and elite volume of passes into the final third, he consistently controlled games while advancing play with minimal risk—turning dominance in possession into sustained attacking pressure.\n\nIn case you've read everything, please tell me your opinion and have a great day!",
        "upvotes": 36,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qyawgw/why_toni_kroos_was_the_greatest_midfielder/"
    },
    {
        "id": "1qya7ys",
        "author": "cargo-culture",
        "title": "RM needs a deep restructuring",
        "content": "This Real Madrid doesn’t work. That I think we can all agree on. Then I hear some blaming Vini, some Mbappe, others remembering Kroos and Luka and many looking at Florentino. How divided we are as fans is a reflection of how complex are Madrid’s problems.\n\nSo here’s my hot take:\n\nMadrid and Florentino haven’t outgrown the phase where they can just buy players and simply trust top world talent with a people manager. It worked with the generation of CR7, Modric, Kroos, Ramos, etc. It didn’t with the galacticos, and now it’s not working again.\n\nIn today’s world, with state owned clubs and both money and talent pouring into the Premier League, this approach is much harder - we just can’t compete financially or as the attractive top league we were 10 years ago, and it’s starting to show. \n\nWe can’t easily buy top talent like we did before. Zidane was signed in months, CR7 didn’t take much longer. Now we are relying on our legacy more than ever before and waiting years for contracts to expire to sign top talent. Instead of signing what is needed, when it’s needed. You can’t build a team like that.\n\nReal Madrid needs to pivot into becoming a team that wins by playing football collectively, a team that has a long term manager with a long term strategy - from the youth squad to the senior squad. The pay to win strategy just doesn’t work for us anymore.\n\nMadrid needs a deep restructuring or we risk becoming the next Manchester United. \n\nWhat do you guys think? \n\nCan Madrid continue to win long-term with the same model (and president) that both gave us the galacticos disaster but later brought us 6 Champions Leagues? ",
        "upvotes": 22,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qya7ys/rm_needs_a_deep_restructuring/"
    },
    {
        "id": "1qyidiw",
        "author": "InspectorExact3836",
        "title": "NFL Youtube channel posted video of Behind the scenes of preparing for game in Bernabeu, has some nice videos of Bernabeu, a good watch. Wonder why doesn’t Madrid post such type of content for maybe like an El Clasico or a big UCL match",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MiQBOfumgwKQY5M9H7UUovKpQqaWxnqsthrvSTwUrJY.jpeg?auto=webp&amp;s=76a5be3d47686a159bb03a57866d2aa0e54f6ab1"
        },
        "permalink": "/r/realmadrid/comments/1qyidiw/nfl_youtube_channel_posted_video_of_behind_the/"
    },
    {
        "id": "1qyfehw",
        "author": "RoronoraTheExplora",
        "title": "We won the UCL the year before last",
        "content": "Based off the discourse in this subreddit, I’m not sure if people are aware, but we did win the Champions League in 2024. To give this some context: this is the 70th rendition of the UCL. Assuming we don’t win this year, we will have won the UCL about once every 5 years. The second winningest club, AC Milan, will have won once every 10. Barca has not made it to the UCL final in over a decade. There are currently 17 players on our roster who have won the UCL with Real Madrid. They did not win due to coincidence.\n\nWe had a bad year last year due to the departure of some major players, and the addition of a new major component who has been more challenging to adapt to. This year we had a coach who, for whatever reason, did not work out. I think that the pessimism and dooming that has become so common is unfair to the current players, many of who have been instrumental in winning us 2 UCLs, a feat any other club would go crazy for. Unfair to the leadership of the club who for a decade and a half have been overseeing the most successful era in the history not of this club, but of this sport. And unfair to Arbeloa, a coach who was very successful during his stint in the youth teams, a man who sided with CR7 and Mourinho during a tumultuous time that ended up defining the next decade, and a new figure for the club who should be met with excitement and optimism but is instead greeted with bitterness due to feelings about the exit of his predecesor.\n\nI still believe that the leadership of this club which has been so successful knows what they are doing. I believe that the players who have won us more in the last 5 years than most do in their whole careers will win for us again. While I am saddened by how Xabi’s stint turned out, I believe in Arbeloa as a man and as a manager. Above all, I believe in Real Madrid’s ability to come back when everything is stacked against us and all but Madridistas have lost hope. ",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qyfehw/we_won_the_ucl_the_year_before_last/"
    },
    {
        "id": "1qxxowi",
        "author": "nogokeo",
        "title": "Raúl #7 𝐸𝑙 𝐴́𝑛𝑔𝑒𝑙 𝑑𝑒 𝑀𝑎𝑑𝑟𝑖𝑑 2002 Centenary Season",
        "content": "",
        "upvotes": 58,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxxowi/raúl_7_𝐸𝑙_𝐴𝑛𝑔𝑒𝑙_𝑑𝑒_𝑀𝑎𝑑𝑟𝑖𝑑_2002_centenary_season/"
    },
    {
        "id": "1qxc4qx",
        "author": "laman-78",
        "title": "1% of Vini Jrs Stats",
        "content": "",
        "upvotes": 608,
        "comments": 209,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxc4qx/1_of_vini_jrs_stats/"
    },
    {
        "id": "1qxyuex",
        "author": "Galego_ACB",
        "title": "ACB paid tribute to Walter Szczerbiak on the 50th anniversary of his scoring record of 65 points in the Spanish league with Real Madrid (and in an era with no threes)",
        "content": "",
        "upvotes": 30,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxyuex/acb_paid_tribute_to_walter_szczerbiak_on_the_50th/"
    },
    {
        "id": "1qxm9z7",
        "author": "Constant-Gas8234",
        "title": "Where can i find a hi-res photo of this",
        "content": "Yooh hi i was asking where i could get a high quality photo of this screenshot i took while watching the real madrid documentary of the champions league final where u can see vini walking out and the cameraman gets the shot from behind i have been looking for it for ages now but i cant seem to find it online.thanks",
        "upvotes": 75,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vxxtfr23iwhg1.jpeg?auto=webp&amp;s=867fa423aec8b85017dbf8fcd4f6303b5f29c3f1"
        },
        "permalink": "/r/realmadrid/comments/1qxm9z7/where_can_i_find_a_hires_photo_of_this/"
    },
    {
        "id": "1qxfue1",
        "author": "johnmason125",
        "title": "The contradiction between transfers and the reality of football",
        "content": "Football is a very short lived sport. Managers nowadays barely last more than two seasons, after two losses in a row it´s crisis, what happened the season before doesn´t really count, what could potentially happen in two years after also doesn\\`t.  Real Madrid is probably the pinnacle of that.\n\nOn the other side more and more big clubs are signing project players. Players who obviously have talent, but who are still raw and who still need a bit of time. So Real Madrid signed the likes of Vinicius, Rodrygo, Reinier, Endrick, Mastantuono, Camavinga, Hujisen. Man City signed the likes of Khusanov, Victor Reis, Doku, Savinho. Chelsea signed so many like talented 20 year olds, they are basically hoarding talent.\n\nNow this works as long as there is an experienced core of players around kind of leading them. So Real Madrid were fine when the likes of Kroos, Modric, a fit version of Carvajal, Benzema...were still around. It actually looked like they got the transition spot on. Man City were fine when they still had De Bruyne, Walker, the peak versions of Ruben Dias and Rodri leading the team. \n\nProblems start when the experienced core of players is starting to fail. In Real Madrid´s case the current experienced core of players age wise (apart from Courtois) is Carvajal, Alaba, Rüdiger, Mendy, maybe Ceballos. 4 players who have had massive injury issues and one player who has never really been more than a squad player. After that you have the likes of Militao and Trent, who have also had big injury problems this season. The oldest outfield player who is actually playing is Valverde at 27. \n\n3 of Real Madrid´s back four currently are Carreras, Hujisen and Asencio. I´m happy all three of them are at the club, I think they could all have good careers at the club but they probably shouldn´t be starting together at this point in their career. \n\nCompare that to the Champions League winning sides of Real Madrid in the last 15 years. The youngest starting 11 in a final was the la decima starting eleven and the average age was 26.7 years and it would have been older if Xabi Alonso hadn´t been suspended and Pepe had been fit to start. \n\n",
        "upvotes": 38,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxfue1/the_contradiction_between_transfers_and_the/"
    },
    {
        "id": "1qx7jd8",
        "author": "Moreplatesmoregains",
        "title": "Franco mastantono is not good to be starting games ahead of anyone.",
        "content": "I have been focusing on Franco lately and everytime i notice more and more that he is an average player at best, he has potential to be very good but i can’t see anything special about him.. his touches on the ball sometimes are very bad .. decision making is horrendous.. he has given us sometimes glimpses and nice passes but we all know this nothing so special.. we have made a mistake with sending endrick on loan and leaving him , it should have been the opposite. I personally think endrick will do a better job than him on rw or even arda is more dangerous on rw.. he may has the pressing thing better than others and that’s why arbeloa and even xabi likes to start him. But i think this transfer window we should have bought someone a bit better and a natural rw .. i maybe wrong in the future i hope im wrong and he will succeed and be our next Di maria.",
        "upvotes": 144,
        "comments": 88,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qx7jd8/franco_mastantono_is_not_good_to_be_starting/"
    },
    {
        "id": "1qwoj73",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler; Real Madrid’s best in Pintus’ fitness test. Finished FIRST in the demanding physical assessments on Wednesday. He even increases intensity after halftime: +8% sprints and +6% sprint distance compared to first half showing elite recovery, explosiveness, and energy management.",
        "content": "",
        "upvotes": 940,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O2SZFVPZv0GoxxlnSBynhh8-z99C7J-FoEATLEFJ5cs.jpeg?auto=webp&amp;s=7eecb3e76694426aff94b802d999bc231be74e5c"
        },
        "permalink": "/r/realmadrid/comments/1qwoj73/arda_güler_real_madrids_best_in_pintus_fitness/"
    },
    {
        "id": "1qwvmlg",
        "author": "Majestic-Nobody-3178",
        "title": "Casemiro is the only Top-7 League Midfielder with more interceptions than Chema Andres this season. Seems like this guy is a bigger talent than we thought.",
        "content": "",
        "upvotes": 320,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/23570t1tdqhg1.jpeg?auto=webp&amp;s=134a9387870c394adecd6506ea1c6e5a5fb82b9a"
        },
        "permalink": "/r/realmadrid/comments/1qwvmlg/casemiro_is_the_only_top7_league_midfielder_with/"
    },
    {
        "id": "1qwu0bc",
        "author": "ceaguila84",
        "title": "Real Madrid’s Rodrygo to miss Champions League play-off games due to two-match ban",
        "content": "",
        "upvotes": 230,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LrwqQuLFm9mfTHL6Wj8IEDwxy9fRwlASKWfxRmLb3eA.jpeg?auto=webp&amp;s=a765f0dd4e6c4ceed30fb9815941ccf60838e8d0"
        },
        "permalink": "/r/realmadrid/comments/1qwu0bc/real_madrids_rodrygo_to_miss_champions_league/"
    },
    {
        "id": "1qwrcrw",
        "author": "InspectorExact3836",
        "title": "Real Madrid has uploaded all 451 Goals scored by Ronaldo for club on its youtube channel on his 41st birthday",
        "content": "",
        "upvotes": 286,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j0S-q1A6cMxg7OgB-f8LPojvvDV5Jig9iGfaJP5jpt0.jpeg?auto=webp&amp;s=474066fe5f0a73690646195ed1e5bf5be893c5eb"
        },
        "permalink": "/r/realmadrid/comments/1qwrcrw/real_madrid_has_uploaded_all_451_goals_scored_by/"
    },
    {
        "id": "1qya58h",
        "author": "Quirky_Appearance539",
        "title": "Why are Real Madrid not allowed a transition period?",
        "content": "Has last season &amp; even this season till now been optimal? No. Does the squad look unbalanced? 100% but we gotta stop being so reactionary.\n\nREAL MADRID ARE ALLOWED A TRANSITION PERIOD. Same thing happened in 2018 when Ronaldo left &amp; the squad fell of a cliff. It was aged &amp; needed a major revamp. The revamp happened gradually &amp; eventually made history under Carlo.\n\nSo why are we so impatient this time? The squad has major holes mainly in midfield &amp; CB options. New signings haven't been upto the mark. But its okay? Huijsen &amp; Franco are so young? Let them grow? TAA has barely played? Carreras has been fantastic.\n\nEvery club needs a transition period. With 2-3 more signings &amp; this year's signings settling in properly I'm sure this club will be back to the top.\n\nCriticising is totally fine but writing Real Madrid of all clubs off as if their era is over just cause a turbulent few years is completely braindead imo.",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qya58h/why_are_real_madrid_not_allowed_a_transition/"
    },
    {
        "id": "1qx1lc2",
        "author": "redsox490",
        "title": "Real Madrid Femenino lost 4-0 today to Barcelona in the Copa de la Reina quarterfinals.",
        "content": "[https://www.realmadrid.com/en-US/news/football/womens-team/reports/real-madrid-barcelona-clasico-05-02-2026](https://www.realmadrid.com/en-US/news/football/womens-team/reports/real-madrid-barcelona-clasico-05-02-2026)\n\nI feel like I'm one of the only ones on this reddit page to actually care about them. I saw no mention that it was even happening to I thought I would share the news with you all about the loss today.\n\nReal Madrid Femenino have not won a trophy yet. The 2020–21 season was their first season. This was the 22nd meeting of the women's Clásico and Real Madrid has only won once. The matches are very rarely close. Real Madrid has scored 10 goals and given up 77. So as a fan who watches the matches, they are pretty painful to watch to be honest.",
        "upvotes": 77,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yc6jWBIjobAAXLF_Yql6gsiOM9FvKsdZ8_NTxhB642g.jpeg?auto=webp&amp;s=fd65298b33c5f21ae660c6822ff956476c847634"
        },
        "permalink": "/r/realmadrid/comments/1qx1lc2/real_madrid_femenino_lost_40_today_to_barcelona/"
    },
    {
        "id": "1qwo77y",
        "author": "AlekhineAl",
        "title": "Still in awe of this goal. Every player showcasing his best trait.",
        "content": "",
        "upvotes": 311,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6s5u6b052phg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qwo77y/still_in_awe_of_this_goal_every_player_showcasing/"
    },
    {
        "id": "1qwybni",
        "author": "Unique_Sentence_7983",
        "title": "Real Madrid locker room after benfica loss🤣🤣",
        "content": "",
        "upvotes": 66,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5s1oy8pruqhg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qwybni/real_madrid_locker_room_after_benfica_loss/"
    },
    {
        "id": "1qwpejw",
        "author": "asensia-kopfschmerz",
        "title": "[Cadena SER] \"The club believes Xabi Alonso's legacy was a disaster in physical aspect\" Los blancos is betting everything on physical fitness.",
        "content": "",
        "upvotes": 159,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vzydaF2Ft1rm6VXQ7c_jkVpcVFwz9qZeF7E-7ZZmwBc.jpeg?auto=webp&amp;s=ac0816abe35379e3eb7dc0f57a576d31a5677c1d"
        },
        "permalink": "/r/realmadrid/comments/1qwpejw/cadena_ser_the_club_believes_xabi_alonsos_legacy/"
    },
    {
        "id": "1qx1nix",
        "author": "Galego_ACB",
        "title": "Real Madrid lost against Dubai (93-85) in an away game in round 27 of the Euroleague's regular season",
        "content": "",
        "upvotes": 35,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qx1nix/real_madrid_lost_against_dubai_9385_in_an_away/"
    },
    {
        "id": "1qw1adt",
        "author": "soldier101br",
        "title": "Endrick Goal against Laval on Coup de France",
        "content": "",
        "upvotes": 4537,
        "comments": 250,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r30yq9nznjhg1/CMAF_270.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qw1adt/endrick_goal_against_laval_on_coup_de_france/"
    },
    {
        "id": "1qwafcg",
        "author": "soldier101br",
        "title": "Alternative angle of Endrick's Golazo on Coup de France",
        "content": "",
        "upvotes": 1142,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t3zspxjsjlhg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qwafcg/alternative_angle_of_endricks_golazo_on_coup_de/"
    },
    {
        "id": "1qw2xtb",
        "author": "Modo97",
        "title": "Just a reminder: we signed Reinier for €30 million, and he didn’t play a single minute with the first team.",
        "content": "It’s insane how forgotten this transfer is. When people talk about Real Madrid’s worst signings, they mention Hazard, Jovic, Illarramendi, Woodgate, Danilo, Kaka, James, etc — but never Reinier. Not out of ignorance, but because the player is forgotten to that extent.\n\n€30 million for a player who never played a single minute for the first team is embarrassing and almost comical. Easily a top-five worst signing in the club’s history.\n\nAnyways.. he’s still only 24. I hope he manages to find himself again. Maybe he’ll get another chance to play in Europe.",
        "upvotes": 1053,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5tby0jtyyjhg1.jpeg?auto=webp&amp;s=1702ce80c7ba02024ad30a7b200cc9f312ed94f9"
        },
        "permalink": "/r/realmadrid/comments/1qw2xtb/just_a_reminder_we_signed_reinier_for_30_million/"
    },
    {
        "id": "1qw9qgw",
        "author": "Maravilla_23",
        "title": "And this exactly why we need the Special One back at the Bernabeu!",
        "content": "",
        "upvotes": 304,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/umwhqzw2elhg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qw9qgw/and_this_exactly_why_we_need_the_special_one_back/"
    }
]