[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qk7097",
        "author": "cheno103",
        "title": "Netflix bosses feel 'blindsided and horrified' after Queer Eye Karamo Brown claims he was 'bullied' on set",
        "content": "",
        "upvotes": 87,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7097/netflix_bosses_feel_blindsided_and_horrified/"
    },
    {
        "id": "1qk0x2s",
        "author": "salutefanaccount",
        "title": "Harlan Coben",
        "content": "i can’t be the only one who can’t stand Harlan Coben series’. His stories are just written so bad and feel like a parody of well written shows. Idk why netflix continues to follow his ideas. Does anyone else feel this way?",
        "upvotes": 111,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1qk0x2s/harlan_coben/"
    },
    {
        "id": "1qkc5fd",
        "author": "Bobby_Brooklyn5",
        "title": "11.22.63",
        "content": "New to Netflix and surprisingly good.  Time-travel story with a pretty good James Franco and a terrific supporting cast.  Not usually in to this genre or Stephen King but this is a very trippy, engaging story.  Kind of like an episode of The Twilight Zone on steroids.",
        "upvotes": 24,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qkc5fd/112263/"
    },
    {
        "id": "1qk7jfk",
        "author": "kimnabi7",
        "title": "The woman in cabin 10",
        "content": "Attention: spoilers ahead.\n\nAm I the only one who found this movie completely unrealistic? I honestly have no idea how they managed to convince keira knightley to sign on to this story.\n\nFrom the very moment the woman expressed her desire for giving away all her money for charity, it was obvious her husband was going to kill her. Beyond that predictability, the entire plot felt absurdly implausible.\n\nEven if we assume a billionaire could somehow use facial recognition to find a woman who looks exactly like his wife, the execution still makes no sense. Maybe he could have staged a distant public appearance to deceive people but having her pass as his wife up close, in broad daylight, on a boat, surrounded by her friends? Completely unbelievable. Let alone that she just shaved her hair and put on some make-up by herself instead of having a professional MUA do it. And how is a poor Polish woman suddenly able to speak flawless British English and perfectly imitate another person’s voice? That alone defies logic.\n\nThen there’s the ridiculous idea of having her impersonate the wife to sign a contract. A contract involving an inheritance of that magnitude would absolutely require handwriting verification something that’s standard practice. The whole plot feels like it was written by a teenager with no understanding of how the real world works.\n\nExtra minus points for the way women are portrayed as hysterical and foolish in situations like this. An award-winning journalist, in particular, would not react so irrationally upon realizing something deeply suspicious is happening, nor would she make herself such an obvious target.",
        "upvotes": 15,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7jfk/the_woman_in_cabin_10/"
    },
    {
        "id": "1qk86rd",
        "author": "serv0_o",
        "title": "Is there a way to block a show from being advertised to me?",
        "content": "I can’t stand opening the app and seeing Bert Kreischer’s face and naked body. I don’t want to see this Free Bert show plastered on the main page. Is there a way to block it?",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qk86rd/is_there_a_way_to_block_a_show_from_being/"
    },
    {
        "id": "1qk9uop",
        "author": "ponyo_007",
        "title": "adolescence - jamie’s parents",
        "content": "i loved the moment where jamie’s parents are in the car with jamie’s sister explaining their love story.\n\nwhat really struck out was the fact that lisa looked as if she had never heard about the fact that her own dad looked ridiculous at a school dance, with bowling shoes and a crazy wig and then got made fun of during the rest of his school. yet, her mother still decided to date him and then get married. \n\ni believe that this scene is so important when\n\ncompared to episode 3 where jamie has this rather harsh image of his dad - a loving one, yes, but with a certain edge to him.\n\ntheir stories at school can be seen as similar, and yet jamie is convinced that women will never be interested because of certain things he has been told/seen on the internet. ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qk9uop/adolescence_jamies_parents/"
    },
    {
        "id": "1qk7o86",
        "author": "Marceline1995",
        "title": "Any adult animation recommendations?",
        "content": "I have enjoyed watching Haunted Hotel, Chicago Party Aunt, F is for Family, Paradise PD, Carol &amp; the End of the World and Inside Job. I am looking for something in the likes of these shows. Open to any recommendations. Thank you!",
        "upvotes": 6,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7o86/any_adult_animation_recommendations/"
    },
    {
        "id": "1qjk95z",
        "author": "Party-Command-9296",
        "title": "Everyone should watch CLICK once.",
        "content": "I was going crazy thinking about how behind I am in life, and then I randomly watched Click (Adam Sandler) and it genuinely shifted my perspective.\n\nIt looks like a silly comedy, but the message hits way deeper. Made me slow down and rethink what I’m rushing for.",
        "upvotes": 136,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qjk95z/everyone_should_watch_click_once/"
    },
    {
        "id": "1qkb1ed",
        "author": "Used-Can-6979",
        "title": "Skyscraper Live.",
        "content": "Is there really a chance this guy can fall and die in front of everyone? I have a feeling this is gunna end up being kinda boring. It’s tomorrow. I’m just curious who’s gunna watch it.",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qkb1ed/skyscraper_live/"
    },
    {
        "id": "1qju8au",
        "author": "Ok-Evidence8770",
        "title": "Liza Frankenstein(2024) is the best Frankenstein movie I have ever seen in my life",
        "content": "I am happy to see Ted Wheeler from Stranger Things is in it too. It is a combo of 80's and Gothic and I am blown away by the story. Genius work.\n\nMuch better than Frankenstein 2025 ",
        "upvotes": 13,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qju8au/liza_frankenstein2024_is_the_best_frankenstein/"
    },
    {
        "id": "1qjm0tg",
        "author": "BradyPhoenix",
        "title": "Thoughts on the Elizabeth Smart film?",
        "content": "I’ve read and watched so much about this case over the years that nothing in this was really new information to me, but I still thought it was well made and worth the watch. It’s always nice to hear directly from Elizabeth and her family.",
        "upvotes": 46,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1qjm0tg/thoughts_on_the_elizabeth_smart_film/"
    },
    {
        "id": "1qkdtld",
        "author": "ZugTheMegasaurus",
        "title": "Is this functionality missing or am I just dumb?",
        "content": "This is a minor complaint but it's driving me nuts. I have no idea how to describe this succinctly, so forgive my overly-detailed explanation.\n\nI'm watching in a browser. When I select something to watch from the main page, I can click the down arrow to bring up a middle panel with some brief information about it and can select to play from there. After I finish watching, clicking the back arrow in the player brings me back to that panel. \n\nBelow the info about that show is the \"More Like This\" section. If I select something from there, it just goes straight to the player. If I click the back arrow, it goes back to the panel about the first thing I watched, not the one I selected from More Like This. As far as I can tell, there's no way to easily get to a landing page/panel for the second movie/show and I have to either search for the title or go find it in watch history.\n\nObviously it's something I can work around, but I just can't believe that there's no way to get from the player to the info about what you're playing. Other sites with awful UI still manage to do that. Am I just missing something?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qkdtld/is_this_functionality_missing_or_am_i_just_dumb/"
    },
    {
        "id": "1qj4ic6",
        "author": "-deetjay-",
        "title": "Red Dead Redemption passes 3.3m Netflix downloads while paid game struggles past 10k",
        "content": "",
        "upvotes": 279,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1qj4ic6/red_dead_redemption_passes_33m_netflix_downloads/"
    },
    {
        "id": "1qk9llf",
        "author": "Ok-Honeydew75",
        "title": "Missing titles on profile after unauthorized access",
        "content": "I'd like to report a recent issue with the account. For some reason, unauthorized individuals accessed it and managed to change the profile pictures on two profiles, but made no other apparent changes. As soon as we noticed this, we logged out of all active sessions and changed the password.\n\nAfter this, a different problem arose: on my profile, some titles stopped appearing in the catalog. In the Continue Watching section, I had been watching several series and movies such as The Walking Dead, Dr. House, and American Psycho, among others, but now only Daybreak appears.\n\nThese titles no longer appear in Continue Watching or when searching for them on my profile. This is not related to parental controls or profile restrictions, as none are enabled on the account.\n\nWhat’s strange is that this issue only affects my profile; on the other profiles linked to the same account, those same titles appear normally without any problem.\n\nFor context, this account is being used in Chile.\n\nI’d like to know what’s happening, whether this could be related to the unauthorized access, and how to fix it so my profile displays the titles correctly again.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qk9llf/missing_titles_on_profile_after_unauthorized/"
    },
    {
        "id": "1qk91qf",
        "author": "Kendikay1966",
        "title": "I can’t remember the title of the show…",
        "content": "I don’t even remember if it was on Netflix or not but I’m going to hope somebody can help me out with this. It was a show about an underground city because they knew a catastrophic event was going to be happening and the higher-ups/elite folks all decided to create a city underground. I feel like it was called Paradise but I cannot find it on Netflix and I feel like a second season was in the works . Anybody have any ideas on this?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qk91qf/i_cant_remember_the_title_of_the_show/"
    },
    {
        "id": "1qk7jpl",
        "author": "mikep998",
        "title": "‘Star Search’ Star Ratings",
        "content": "I’ve watched both episodes so far and really enjoy it! Huge props to the contestants I’m so nervous for them. The only part I find confusing is how they calculate them down to 1 decimal place. For example: Chrissy 5, Jelly Roll 5, Sarah 4, World 3.7 for a final of 4.2 stars. Huh? Next one is Chrissy 5, Jelly Roll 5, Sarah 4, World 4 for a final of 4.3 stars.\n\nI’m not good math but this makes no sense to me mathematically.. anyone else get it? 🙄",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7jpl/star_search_star_ratings/"
    },
    {
        "id": "1qjl21m",
        "author": "HighOnLove26",
        "title": "His &amp; Hers - question in the description - spoilers.",
        "content": "&gt;!Why in the world was Lexy mad at Anna so much as to try to kill her? It wasn't clear that Anna tried to lure Lexy into the woods, and even if she did, she was the one who saved her! So it's obvious that Anna's intentions for luring Lexy into the woods (assuming she did that) were just to party and nothing else. Furthermore, Lexy suffers only a brief attempt at rape, but Anna is the one who suffers all of it, that too because she tried to save Lexy and was successful at it! How can you be mad at someone who suffers themselves while trying to save you?!&lt;",
        "upvotes": 21,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qjl21m/his_hers_question_in_the_description_spoilers/"
    },
    {
        "id": "1qk6wqn",
        "author": "Mr_Perfectly_UnFine",
        "title": "Undercover Miss Hong or No Tell to Tell?",
        "content": "Is Undercover Miss Hong any good? I love Park Shin-Hye and Go kyung-pyo so I was wondering if it is a good series to start?  Or should I go watch No Tail to Tell first? \n\nIt’s hard cause I am busy at work and can only afford to watch one ongoing series and wait weekly for new episodes and I would probably watch the other eventually",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qk6wqn/undercover_miss_hong_or_no_tell_to_tell/"
    },
    {
        "id": "1qjlnc3",
        "author": "Competitive_Gene_898",
        "title": "Netflix Cancels The Abandons and The Vince Staples Show After One and Two Seasons",
        "content": "",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qjlnc3/netflix_cancels_the_abandons_and_the_vince/"
    },
    {
        "id": "1qjvefw",
        "author": "DeTiff",
        "title": "360p quality and audio delays.",
        "content": "I have quality high in the setting and we supposedly have premium but the quality is literally close to youtube 360p. \n\nI watch on my laptop and it's updated and I checked the connection and it is great so what is the problem? I press play and for 2 seconds it's great and then something clicks the quality drops, then again clicks and drops and at some point the audio starts getting delayed (and I don't mean slightly delayed I mean we hear the speech in the next seen). I dont know what to do.\n\nUpdate: I recorded it and this massive quality drop happens in 2 minutes. I have to refresh the page to get the quality up again.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qjvefw/360p_quality_and_audio_delays/"
    },
    {
        "id": "1qk9vpp",
        "author": "ChinaMilitarySecrets",
        "title": "The Night Agent, I read the book. I do like the TV adaptation. But I think if they want season 4... they should start a storyline arc with new characters. As much as I like Peter Sutherland, the new Night Agent trailer looks so much like an action movie.",
        "content": "The Night Agent, I read the book. I do like the TV adaptation. But I think if they want season 4... they should start a storyline arc with new characters. As much as I like Peter Sutherland, the new Night Agent trailer looks so like an action movie.\n\nEven the controversial tv show \"Dating Naked UK\" had more of a plot than this new The Night Agent trailer for season 3. \n\nI do like Peter Sutherland, but what made the Night Agent a good tv series was the plot... with action scenes only when it serves the plot. \n\n\nThe new season 3 trailer for the Night Agent looks like one big James Bond 007 movie of non stop action scenes. \n\nI like the Night Agent. I want to see it continue for many seasons.  \n\nPlease for season 4... they need to focus on an interesting new exciting plot.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qk9vpp/the_night_agent_i_read_the_book_i_do_like_the_tv/"
    },
    {
        "id": "1qk69ty",
        "author": "Charokol",
        "title": "Can I get original language translation subtitles instead of dubbed audio subtitles?",
        "content": "When I watch a foreign language film or show, I always listen to the original audio with subtitles. But I’m watching \\*Godzilla Minus One\\* right now and figured it would be fun to try it with the dubbed audio for that classic Godzilla feel.\n\nI kept the subtitles on because I figured they would be the subtitles for the original Japanese audio, and I would be able to see where the dubbed dialogue differed from the original. But the English subtitles seem to be matching the English dubbing perfectly, so I don’t think I’m getting the original subtitles.\n\nIs there a way to set Netflix to give me the Japanese-to-English translated subtitles, instead of the subtitles for the dub?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qk69ty/can_i_get_original_language_translation_subtitles/"
    },
    {
        "id": "1qj43us",
        "author": "Mundane_Main_9616",
        "title": "Need calming shows.",
        "content": "I need to find a new show that is slightly funny, with very little drama, but still exciting enough to pay attention to in short bursts. I have ADHD and other issues that keep me from paying good attention to TV. So I really don't want something that I have to pay a lot of attention to to understand. I don't like competition shows because of the drama. I need something chill, to not work myself up. I usually can't find a show and sit in silence and it causes racing thoughts or doom scrolling. Any recommendations would be greatly appreciated. ",
        "upvotes": 76,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1qj43us/need_calming_shows/"
    },
    {
        "id": "1qjzshb",
        "author": "MsAdventuresBus",
        "title": "Free Bert",
        "content": "The show is silly funny, but the actress that steals the show is the girl who his younger daughter, Ila. She is hilarious! She is the perfect sidekick and pulls the show together.",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qjzshb/free_bert/"
    },
    {
        "id": "1qjfmvv",
        "author": "bludhavengabagool",
        "title": "KPop Demon Hunters notches up one more Netflix record before Oscar season kicks into full swing",
        "content": "\"The movie was not just the biggest movie of 2025 for Netflix, but it eclipsed any potential competition from the likes of Happy Gilmore 2 or Guillermo del Toro’s Frankenstein.\" -full article [here](https://www.thepopverse.com/movies-kpop-demon-hunters-dominated-netflix-2025-happy-gilmore-2-frankenstein)",
        "upvotes": 18,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qjfmvv/kpop_demon_hunters_notches_up_one_more_netflix/"
    },
    {
        "id": "1qk7r4c",
        "author": "OnionInteresting4602",
        "title": "Netflix Stock, Potential Mergers, and the Future of the Platform",
        "content": "Netflix stock is nearing an all time low even after major spending on live sports video podcasts and advertising. Are these bets failing to move the needle or is the market reacting to something deeper? Wondering what the watchers on the platform think.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7r4c/netflix_stock_potential_mergers_and_the_future_of/"
    },
    {
        "id": "1qk2kcp",
        "author": "AccurateInflation167",
        "title": "Song Kang Ho and Youn Yuh Jung join 'BEEF' season 2 as power couple",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qk2kcp/song_kang_ho_and_youn_yuh_jung_join_beef_season_2/"
    },
    {
        "id": "1qjm84c",
        "author": "Silent_Regular_2531",
        "title": "SouthLAnd ⚠️🚨 SPOILERS 🚨⚠️",
        "content": "⚠️🚨 SPOILER ALERT!! DONT READ IF YOURE BARELY WATCHING ⚠️🚨They just put it on Netflix and I just binge watched! Such a great show!! I love watching shows that we're done in the 2000's. It'sike a sense of nostalgia. It was greatly done!! The ending is bitter sweet but I think it was a good way to end the show...sad but at least it had an \"ending\" most shows just end and were left hanging. Officer Cooper deserved better! Sammy too!! &amp; Moretta died wayyy too early 🥺 Lucero went through so many close calls!!! So sad how Cooper finally told someone his secret and then they go through hell together... they all deserved so much more!!! I'm still in shock! Still feel so connected to them!! This show literally had me on the edge of my seat!! Any recommendations on a similar show???",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qjm84c/southland_spoilers/"
    }
]