[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1prkawi",
        "author": "imoonmov",
        "title": "Situation in Vanchiglia",
        "content": "When is this gonna finish? \n\nWe cannot even reach our home anymore.",
        "upvotes": 43,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vtijr2yhde8g1.jpeg?auto=webp&amp;s=0fbf53d188cde25cf8b63f4b3db3f3085adbed6c"
        },
        "permalink": "/r/torino/comments/1prkawi/situation_in_vanchiglia/"
    },
    {
        "id": "1prbb3k",
        "author": "jhonny413",
        "title": "Tutti i meccanici sono uguali?",
        "content": "È mai possibile che ogni volta che si ha a che fare con una officina per la riparazione/tagliando per l'auto sia sempre la stessa storia? \nPreventivi fumosi, interventi a volte non richiesti, sovrapprezzi assurdi rispetto alla sostituzione del pezzo in sé, atteggiamenti loschi del tipo: eh c'è da cambiare la cinghia. Ma l'abbiamo fatta l'anno scorso!... Ah allora no ho visto male. \nIo non ne posso più di questi signori, pensano davvero siamo tutti stupidi? \nHo deciso di intraprendere una crociata personale. Convincerò tutti i professionisti a far pagare di più i propri servizi se a richiederglieli è un meccanico. ",
        "upvotes": 19,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1prbb3k/tutti_i_meccanici_sono_uguali/"
    },
    {
        "id": "1pre0tv",
        "author": "andy_lamb",
        "title": "Esperienza al CEMUSS che mi ha lasciato davvero sconvolto 😔",
        "content": "Ciao a tutti, sento il bisogno di condividere questa esperienza perché mi ha davvero segnato. Vi chiedo fin da subito scusa per la lunghezza del messaggio.\n\nQualche mese fa mi sono recato al CEMUSS di Torino per un controllo. Preferisco non rivelare il motivo: la condizione per cui ero lì era molto delicata, fastidiosa e anche piuttosto stigmatizzante. Fin da subito ho percepito poca empatia e totale disinteresse da parte di uno specifico medico. La prima visita con lui sembrava più una lezione per specializzandi che un vero consulto: ero più un caso da osservare che una persona reale, con due specializzandi in stanza senza il mio consenso.\n\nLa terapia proposta non ha funzionato e la situazione è peggiorata. Quando finalmente ho ottenuto un nuovo appuntamento, il medico si è mostrato seccato, superficiale e a tratti accusatorio. Durante la visita, una terza persona è entrata senza chiedere il mio consenso, e il medico le ha dato precedenza nonostante la richiesta non fosse né urgente né pertinente al mio caso. Mi sono sentito vulnerabile, esposto e umiliato (ero nudo sul lettino mentre i due conferivano bellamente). Ha anche pronunciato una frase tra rimprovero e scherno riguardo una mia precedente infezione, facendo in seguito finta che fosse rivolta alla specializzanda e non a me.\n\nVi lascio immaginare il mio stato d'animo una volta uscito di lì. L'atteggiamento antagonizzante mi ha proprio distrutto. Così come l'indifferenza di chi dovrebbe tutelarmi: reclami, richieste di documentazione, accesso agli atti. Tutto inutile. Quando ho chiesto l’accesso agli atti, mi hanno fornito solo una selezione da loro ritenuta “rilevante”, ignorando la mia richiesta completa. L’URP ha svolto un’indagine palesemente di parte e superficiale, sembrava più interessata a proteggere il medico che a risolvere il problema. La risposta stessa legittimava il comportamento del medico. Nessuna risposta dall’Ordine dei Medici né dal Difensore Civico. \n\nVoglio però chiarire una cosa: non ho nulla contro il CEMUSS. Mi sono sempre trovato bene con tutti i professionisti con cui ho avuto a che fare, e nonostante i disservizi, i ritardi e le difficoltà, sono sempre stato indulgente, soprattutto perché so che il centro gestisce un bacino di utenza enorme con pochissime risorse.\n\nLe mie impressioni personali sul medico: credo sia abituato a fare il bello e il cattivo tempo, un lusso consentito dalla sua posizione, dai suoi traguardi professionali, dalla connivenza interna al centro e dalla struttura istituzionale che gli copre le spalle. Addirittura un mio conoscente che ha lavorato negli ambulatori ha cercato di normalizzare questo comportamento dicendo che “negli ambulatori funziona così”.\n\nHo poi la convinzione che la cura che mi ha prescritto fosse scelta soprattutto perché era il modo più veloce per smaltire la coda dei pazienti, con un dispendio minimo di risorse (e denaro) da parte della struttura.\n\nLa sua scarsa professionalità si è manifestata anche in altri modi:\n\nSi è lamentato della disorganizzazione della struttura, scaricando la responsabilità su altri mentre il mio caso era già affidato a lui (e da bravo parac\\*lo ha poi ritrattato tutto nella sua risposta a un mio reclamo formale, arrivando addirittura a spostare tutto il biasimo su di me).\n\nHo notato una certa immaturità: quando gli ho chiesto di adottare un tono più rispettoso, ha subito negato e poi ha chiesto conferma alla specializzanda, che era visibilmente a disagio.\n\nIn risposta al mio reclamo il medico ha praticamente scaricato tutta la colpa su di me. Ha detto che ero “indispettito” perché non avevo ottenuto ciò che volevo, come se stessi facendo i capricci da bambino. Secondo lui ero lì solo per ottenere una cura che accelerasse i tempi di guarigione (peraltro legittima, vista la delicatezza e lo stigma della mia condizione). Ma qui si è dimostrato totalmente disattento: ero lì per un peggioramento della sintomatologia\n\nHa aggiunto altre accuse: sosteneva che io avessi abusato delle visite e che avessi aumentato il carico di lavoro del centro. Tutto falso, visto che per accedere al CEMUSS c’è un triage telefonico obbligatorio che non si può saltare.\n\nAddirittura ha detto: “il paziente non dovrebbe occuparsi della gestione di un servizio che non gli appartiene”. Ma il servizio riguarda anche me: il CEMUSS non è un ente privato o un’associazione indipendente, è un servizio sanitario pubblico gestito dall’ASL, definito sul sito stesso come “uno spazio pubblico e gratuito, aperto a tuttə”.\n\nIn più, la mia condizione può dare origine a recidive, quindi come potrei mai ripresentarmi al CEMUSS senza rischiare di rivivere la stessa esperienza con lo stesso medico?\n\nPurtroppo, alla fine, mi sono dovuto sottoporre a un intervento molto doloroso, che secondo me sarebbe potuto essere evitato se il mio caso fosse stato trattato tempestivamente e adeguatamente.\n\nAlla fine, questa esperienza mi ha lasciato traumatizzato, frustrato e impotente. Ho addirittura iniziato un percorso di psicoterapia.\n\nMa voglio ribadire: non ho nulla contro il centro, il personale è competente e dedito, e so quanto siano oberati di lavoro. Voglio solo condividere questa storia perché certe situazioni spesso restano invisibili, e parlarne può aiutare chi si sente isolato a capire che non è solo.\n\n",
        "upvotes": 11,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1pre0tv/esperienza_al_cemuss_che_mi_ha_lasciato_davvero/"
    },
    {
        "id": "1prp0ar",
        "author": "znpy",
        "title": "un mesetto a torino, in che zona cercare casa?",
        "content": "Ciao!\n\nVorrei passare un mesetto a Torino. La mia idea sarebbe di cercare un appartamento (tipo un bilocale) da affittare per quel mesetto.\n\nQualcuno mi saprebbe indicare una zona tranquilla? Mi basta che non ci sia baccano di notte e di non venire accoltellato mentre torno a casa. Idealmente che abbia un minimo di mezzi pubblici nelle vicinanze :)\n\nGrazie!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1prp0ar/un_mesetto_a_torino_in_che_zona_cercare_casa/"
    },
    {
        "id": "1prd4li",
        "author": "aldeniis",
        "title": "Casa vicino al Pick-Up",
        "content": "Ciao a tutti!\n\nCome da titolo, sto valutando l'idea di trasferirmi in zona Cenisia e volevo capire come rapportarmi all'idea di vivere nell'area circostante alla discoteca Pick-up. \nSi tratterebbe di un appartamento al quarto piano, molto vicino alla discoteca. I miei dubbi riguardano ovviamente il problema rumori e sicuramente quello della sicurezza: non voglio perdere il sonno e vorrei evitare che la mia ragazza tornando da un sabato sera si possa trovare in situazioni parecchio spiacevoli.\n\nQualcuno che vive li vicino riuscirebbe a darmi qualche feedback significativo per aiutarmi nella valutazione? Sono parecchio confuso perché l'appartamento mi piace davvero molto e il prezzo è molto vantaggioso.\n\nQualsiasi parere è ben accetto, vi ringrazio! 😁",
        "upvotes": 9,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1prd4li/casa_vicino_al_pickup/"
    },
    {
        "id": "1prmqr7",
        "author": "sixlaneve4_0",
        "title": "Museo Lavazza",
        "content": "Come fare per comprare i biglietti con data aperta?\nMi hanno detto che l' unico modo e andare fisicamente la.\nMa io abito distante ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1prmqr7/museo_lavazza/"
    },
    {
        "id": "1prdmkd",
        "author": "_crisz",
        "title": "Cosa fare in corso Vittorio Emanuele giorno 1 gennaio in attesa che ripartono gli autobus?",
        "content": "Giorno 1 gennaio mi ritroverò in corso Vittorio Emanuele alle 4.30, vicino la stazione dei flixbus. Ho controllato la situazione dei mezzi pubblici e sembra che non esistano corse verso casa fino alle 5.30. Esisterebbero in realtà i night busters ma sono inutili al mio scopo. Mi chiedevo cosa potessi fare alle 4.30 per non stare al freddo, qualcosa come McDonald's o kebab aperti a quell'ora. Avete idee? ",
        "upvotes": 4,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1prdmkd/cosa_fare_in_corso_vittorio_emanuele_giorno_1/"
    },
    {
        "id": "1pqg5a7",
        "author": "Alien_tiramisu",
        "title": "La mappa del disagio di Torino",
        "content": "“L’Istat rende disponibili i primi risultati di un progetto volto a misurare il disagio socio-economico degli individui, inteso come “Condizione in cui gli individui sperimentano difficoltà a soddisfare adeguatamente le loro necessità di base a causa della carenza o insufficienza delle risorse e delle opportunità di tipo sociale, economico, lavorativo ed educativo”.”\n\nhttps://www.istat.it/comunicato-stampa/dati-disagio-socio-economico-livello-sub-comunale-idise-anno-2021/",
        "upvotes": 52,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7nnpzlgeh48g1.jpeg?auto=webp&amp;s=338a133441a119bf6cb49d8e31c3020e5891e599"
        },
        "permalink": "/r/torino/comments/1pqg5a7/la_mappa_del_disagio_di_torino/"
    },
    {
        "id": "1pqtmfh",
        "author": "Garaad252",
        "title": "Affordable short term stay in Torino for 15 days? Any tips",
        "content": "Hi everyone😊\n\nI’m coming to Torino for a one-year program and I’ll be arriving on 29 December. My rental contract starts on 12 January, so I’ll need a place to stay for about 15 days in between.\n\nI booked my flight on the 29th because it was cheaper, but changing it to January would cost me an extra 200–250 dollars. Because of the holidays, prices for hotels and Airbnbs seem quite high, so I’m looking for more affordable short-term options.\n\nDoes anyone know of any cheap places to stay in Torino for around 15 days, such as hostels, budget hotels, Airbnbs, or short-term rentals? Any advice or recommendations would be really appreciated.\n\nThank you so much🙏",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pqtmfh/affordable_short_term_stay_in_torino_for_15_days/"
    },
    {
        "id": "1pqr0p7",
        "author": "Brillant_cucu-mber70",
        "title": "aiuto ho le idee confuse per l'università!!!",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pqr0p7/aiuto_ho_le_idee_confuse_per_luniversità/"
    },
    {
        "id": "1pq37a2",
        "author": "Necessary-Mail-9394",
        "title": "Ho bisogno di ricominciare e a 33 anni sto pensando di trasferirmi (a Torino). Cosa ne pensate?",
        "content": "Ho bisogno di un consiglio da chi sta passando quello che sto vivendo io, da chi si è trasferito, da chi lo ha fatto a Torino o ci vive. Avere dei pareri da altre persone mi sarebbe d’aiuto in questo momento, grazie.\n\nHo 33 anni, vivo in una piccola città della Lombardia. Lavoro come freelance in remoto da tempo nella consulenza digital per aziende, sul lavoro tutto va bene.\n\nDal punto di vista umano e relazionale, credo che il luogo dove vivo non abbia più niente da offrirmi in questa fase della mia vita, e al contrario potrebbe essere tossico. La gente non ha voglia di uscire, la sera dopo le 19.00 è il deserto, la maggior parte dei miei amici ha tempo solo per famiglia, bambini e fare carriera ammazzandosi di lavoro come dipendente per dimostrare qualcosa a non si capisce chi, per uscire a bere un caffè tra amici bisogna fissare un appuntamento con 6 mesi di anticipo, uscire fuori a cena in compagnia ormai un ricordo di secoli fa, se concepibile solo in casa (semestralmente se va bene). Il massimo delle conversazioni che si sentono sono sui lavori in città o racconti di gente iper stressata. La mia famiglia sono un contesto di relazione tossica da cui mi devo allontanare. Anche le amicizie più solide e durature si stanno spegnendo, anche se credo non si spegneranno mai veramente.\n\nLe conversazioni si fanno ormai più sui social che di persona, tutti sembrano estremamente impegnati in ogni singolo secondo della propria vita, non si capisce bene a fare cosa, però poi tutti stanno perennemente su Instagram (ma non voglio criticare questo).\n\nLa mia vita è molto basata su stimoli, emozioni, passioni, relazioni vissute parlandosi a voce. Qui dove sono non trovo più motivazioni, quell’energia e quell’entusiasmo che mi faceva appassionare alle cose e alle persone non la sento più in questo luogo. Ho pensato a lungo a questo, ne ho parlato anche con una psicoterapeuta. Per me è particolarmente difficile perché amo la mia città, è casa per me e non avrei mai neanche immaginato di poter pensare di andarmene, ed è difficile accettare che le mie relazioni siano cambiate e non saranno più quelle di prima.\n\nTorino è una città che mi piace, è vicina a casa mia, potrebbe offrirmi nuove opportunità di lavoro, mi permetterebbe di cambiare aria, mi è sembrata una città viva che ha qualcosa da offrire (poi magari mi sbaglio). Non so come siano le persone, vorrei evitare di trovarmi nello stesso contesto attuale. Stavo valutando anche Firenze e in realtà sono aperto a qualsiasi cosa. Per un problema di vista non posso guidare, i trasporti sembrano essere ok e mi sono sembrate due città dove potrei stare bene e respirare qualcosa di nuovo. Ho già comprato casa dove sto ora ma mi rimane, ormai sono a buon punto con il mutuo, e mi sposterei dove andrò in affitto.\n\nDovrò anche cercare di riprendere a uscire per nuove relazioni, dove sto ormai sono in stand by da tempo, non mi sento neanche motivato.\n\nQualcuno è passato da situazioni simili? Se qualcuno si sente di dare un consiglio su qualsiasi cosa lo leggerò molto volentieri.\n\nGrazie 😍",
        "upvotes": 25,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1pq37a2/ho_bisogno_di_ricominciare_e_a_33_anni_sto/"
    },
    {
        "id": "1pqmpss",
        "author": "glorious-ahole",
        "title": "English book shops in turin",
        "content": "Hey everyone, i was wondering that are there any book stores which sells books in English?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pqmpss/english_book_shops_in_turin/"
    },
    {
        "id": "1pprnk9",
        "author": "Mf-2hd",
        "title": "Sgombero Askatasuna: perquisizioni della polizia nello storico centro sociale di Torino",
        "content": "",
        "upvotes": 60,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wKU4KQoaUYYn64SM4cBEnYM00KP4IoZN1bOYAr0W8ao.jpeg?auto=webp&amp;s=989478593193016c3dd6cdbbf0b8641320bcc94e"
        },
        "permalink": "/r/torino/comments/1pprnk9/sgombero_askatasuna_perquisizioni_della_polizia/"
    },
    {
        "id": "1pqjl7x",
        "author": "mooncake1975",
        "title": "Affittare casa a Torino con reddito estero: consigli su zone, referenze e tempistiche?",
        "content": "Ciao a tutti,\n\nsto pianificando un trasferimento a Torino nei prossimi mesi e sto cercando consigli pratici da chi ha esperienza diretta con il mercato degli affitti.\n\nPremetto che mi trasferirò con il mio partner e che staremo per un annetto circa. Entrambi abbiamo una situazione patrimoniale stabile documentabile con contratti di lavoro esteri e con risparmi in banca in Italia. \n\nVorrei capire meglio:\n\nChe tipo di referenze vengono richieste di solito a Torino?\n\nbuste paga italiane obbligatorie?\n\nestratti conto?\n\ncontratto di lavoro estero tradotto?\n\nfideiussione bancaria o garante\n\nQuanto è realistico trovare casa senza un contratto italiano?\n\nCi sono agenzie o proprietari più aperti a questo tipo di situazione?\n\nDovendoci trasferire dall’estero e dovendo alloggiare in qualche air b&amp;b fino a quando non troveremo un alloggio definitivo vorrei chiedere:\n\nquanto tempo serve in media per trovare un bilocale/monolocale?\n\nè fattibile farlo da remoto o conviene essere già in città?\n\nZone consigliate (non centro, ben collegate):\n\ncerchiamo quartieri sicuri, tranquilli e ben serviti, con affitti possibilmente sotto i 600–650 €\n\n(ok anche zone semicentrali o ben collegate con metro/tram).\n\nQualsiasi esperienza personale o consiglio concreto è davvero benvenuto.\n\nGrazie in anticipo!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pqjl7x/affittare_casa_a_torino_con_reddito_estero/"
    },
    {
        "id": "1pq2xfb",
        "author": "CieloeMare",
        "title": "Bicycles on Sidewalks",
        "content": "Why do people ride bikes on sidewalks when there's a wide road next to them. Sidewalks are already small in the city, and there are always too many cyclists riding on those narrow sidewalks. Use the roads damn it. I'm not even talking about electric bikes and scooters, which are even crazier.\n\nIsn't bicycles allowed to use roads here?\n\nIsn't there a law that says sidewalks are for pedestrians only?\n\nLast but not least, there are always rental bikes and scooters blocking the sidewalks where people park and leave. Why don't Italians (people living here in general) think about these things? Zero awareness for real.\n\nA beautiful city with people who don't know how to live in a city :(",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1pq2xfb/bicycles_on_sidewalks/"
    },
    {
        "id": "1pqb0g9",
        "author": "IceNo134",
        "title": "Can I apply to Polito using my sat scores?",
        "content": "I have a SAT score of 1300 (Math 680 and Reading 620), and I would like to know if that is enough to get accepted into a bachelor's program in engineering at Polito.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pqb0g9/can_i_apply_to_polito_using_my_sat_scores/"
    },
    {
        "id": "1ppvogo",
        "author": "Jimthafo",
        "title": "Ma cosa ca*** succede al 15?",
        "content": "Io abito all' incrocio tra Via Monginevro e corso Brunelleschi, quindi a letteralmente 3 fermate dal capolinea, eppure il 15  che dovrebbe passare ogni 11 minuti a volte non si fa vedere per delle mezz'ore, e a volte il fantastico tracking della GTT da' delle previsioni in tempo reale e poi magari l'autobus arriva 7-8 minuti prima. Qualcuno sa se c'è un motivo specifico o è ordinaria amministrazione dei nostri magnifici trasporti urbani?",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1ppvogo/ma_cosa_ca_succede_al_15/"
    },
    {
        "id": "1ppwf2w",
        "author": "mugiwara_m",
        "title": "serate per capodanno?",
        "content": "ciao a tutti, qualcuno ha da suggerirmi qualche discoteca dove fanno serata a capodanno?? con musica pop anni 90 fino ai giorni nostri sarebbe l'ideale. che sia un posto giovanile siamo un gruppo di amici tutti ventenni",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ppwf2w/serate_per_capodanno/"
    },
    {
        "id": "1ppqkm5",
        "author": "mattgwa",
        "title": "Weekly international events in Torino",
        "content": "👋 Hey friends,\n\nHere is the weekly calendar of my favorite international events in Torino\n\n❤️ Monday 9pm - International karaoke night - organized by ISOT (International Students of Torino) - Rough Dive Bar, via Principe Tommaso 3 \n🔥 Whatsapp: https://chat.whatsapp.com/K89LK5bXlc5BYhrm01Emf5\n\n❤️ Tuesday 8pm - Make International friends and language exchange - Tipsy, piazza Vittorio Veneto 23B \n🔥 Whatsapp: https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q \n🔥 Meetup: https://www.meetup.com/torino-international\n\n ❤️ Wednesday 8pm - Apelinguistico - Murphy's Six Nations, corso Vittorio Emanuele II, 28 \n🔥 Meetup: https://www.meetup.com/Tandem-Learning-Language-Exchange-Torino-coollanguages-org \n\nThursday 8pm - 🇮🇹 ... Speak Italian! ... 🇮🇹 (Italian conversation meeting) - La Drogheria, piazza Vittorio Veneto 16B\n🔥 Meetup: https://www.meetup.com/speak-italian-torino\n🔥 Whatsapp: https://chat.whatsapp.com/Gs15TFtXw6bLvoTOLSmMaR?mode=wwt\n\n❤️ Friday 10pm - Friday @ Jumping Jester (English speaking meeting)- via Giuseppe Mazzini, 2 \n🔥 Meetup:  https://www.meetup.com/englishspeakerinturin \n\n❤️ Sunday 9pm - Make friends over English (English speaking meeting) - Margò, via Michele Buniva, 9 \n🔥 Meetup:  https://www.meetup.com/Vanchiglia-Culture-Club",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ppqkm5/weekly_international_events_in_torino/"
    },
    {
        "id": "1pppevj",
        "author": "Bruno_Barbiere",
        "title": "Vale la pena installare i pannelli solari a Torino?",
        "content": "",
        "upvotes": 3,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cdyqduoefy7g1.jpeg?auto=webp&amp;s=f6c033508d3c6f1e0eb0670b60fbe434a54b7886"
        },
        "permalink": "/r/torino/comments/1pppevj/vale_la_pena_installare_i_pannelli_solari_a_torino/"
    },
    {
        "id": "1ppowcf",
        "author": "DistributinOfWealth",
        "title": "How to get marry in the city?",
        "content": "I'm foreign and my wife is Italian, so I'm trying to coordinate an special surprise for her proposing to her before Christmas; the thing is I'm trying to understand how to get my appointment in the Comune\n\nI already did the: **Richiedere le pubblicazioni di matrimonio**\n\nBut I'm still unsure about when to set the appointment, like the date, of this civil weeding ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ppowcf/how_to_get_marry_in_the_city/"
    },
    {
        "id": "1pptrt7",
        "author": "Brillant_cucu-mber70",
        "title": "ho le idee confuse per l'università!!!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pptrt7/ho_le_idee_confuse_per_luniversità/"
    },
    {
        "id": "1pq6xzs",
        "author": "sourheart12",
        "title": "Sito valutazione quartiere",
        "content": "Ciao a tutti, da persona che sta cercando casa, ho notato la necessità di sapere anche il quartiere che tipo di quartiere è, rumorosità, servizi e quant'altro, quindi ho sviluppato nel tempo libero questo sito [VicinityX.com](https://vicinityx.com/) che appunto si occupa di fare l'analisi di un quartiere da voi ricercato, mi piacerebbe ricevere feedback e osservazioni in merito, e sopratutto se riterreste utile un sito di questo tipo.  \nGrazie mille in anticipo!",
        "upvotes": 0,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4kjvfgpt128g1.png?auto=webp&amp;s=0ab426a201d58f6589c4557a1adffb8f6bad0540"
        },
        "permalink": "/r/torino/comments/1pq6xzs/sito_valutazione_quartiere/"
    },
    {
        "id": "1ppm1ht",
        "author": "Icy-Relief-2535",
        "title": "Avete venduto casa negli ultimi anni? Com’è stata l’esperienza?",
        "content": "Negli ultimi giorni sto cercando di capire meglio come funziona il processo di vendita di una casa in Italia, dal punto di vista di chi l’ha vissuto in prima persona.\n\nSe avete venduto un immobile negli ultimi 5 anni, vi andrebbe di raccontare:\n\n* Se avete venduto da privati o con agenzia\n* Cosa è stato semplice e cosa no\n* Se, col senno di poi, rifareste la stessa scelta\n\nHo messo insieme anche un breve questionario anonimo (8 domande, 2 minuti) solo per raccogliere esperienze reali, senza promuovere nulla.\n\n👉 [https://forms.gle/2MhgLewss9i8UTZC9](https://forms.gle/2MhgLewss9i8UTZC9)\n\nGrazie a chi risponderà o vorrà condividere la propria esperienza nei commenti.",
        "upvotes": 0,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V1EcMBJ0ysky8GOvTPeyJdeJpjB1bCBhS0iOAmk-Wr0.png?auto=webp&amp;s=edc32d1881a8593668eac731c2efdcf7f04b2883"
        },
        "permalink": "/r/torino/comments/1ppm1ht/avete_venduto_casa_negli_ultimi_anni_comè_stata/"
    },
    {
        "id": "1pon4j2",
        "author": "Glittering-Foot-3031",
        "title": "Commento di un milanese su Torino",
        "content": "",
        "upvotes": 143,
        "comments": 173,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/szk3pmhywo7g1.jpeg?auto=webp&amp;s=47171fda91e2ae0e2195cfbdd523ccd0745e73c9"
        },
        "permalink": "/r/torino/comments/1pon4j2/commento_di_un_milanese_su_torino/"
    },
    {
        "id": "1ppa9kq",
        "author": "corbhu",
        "title": "New Year's Eve in Torino",
        "content": "Hi everyone!\nWe’re a group of 5 people in our mid-20s, originally from Romania. Only my wife and I have been living near Cuneo area for about 3 years, and this year we’d really like to do something more spectacular for New Year’s Eve.\n\nWe’ll be in Torino on December 31st and are looking for recommendations for:\n\nfun clubs or lively pubs\n\na young, energetic crowd\n\ngood music and a great party atmosphere until late\n\nAny tips on the best areas, clubs, or special NYE events in Torino?\nDo we need to book tickets in advance?\n\nThanks a lot — we really appreciate any suggestions! \nAnd also Buon Natale e un felice Anno Nuovo pieno di gioia! 🍻",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ppa9kq/new_years_eve_in_torino/"
    },
    {
        "id": "1pp3f3x",
        "author": "TurbulentDragon",
        "title": "Dove conoscere persone alt",
        "content": "Sostanzialmente il titolo. Vorrei conoscere nuova gente, siccome anch'io sono alt preferirei altre persone alternative, visto che verosimilmente  mi troverei meglio a livello di pensieri/idee e quindi ci sarebbe più probabilità di stringere amicizia.\n\n\n\nSo che c'é il baloon ogni sabato mattina, ci sono altri eventi/cose del genere dove si solito si trova gente alt? Mi rendo conto che forse è una domanda stupida hahaha, però tentar non nuoce ",
        "upvotes": 8,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1pp3f3x/dove_conoscere_persone_alt/"
    },
    {
        "id": "1pothkx",
        "author": "jobolix2",
        "title": "Band metal",
        "content": "Basta mi sono rotto i coglioni.\nChi suona uno strumento mi scriva in privato che facciamo una band metal",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pothkx/band_metal/"
    }
]