[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 262,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ix6jar",
        "author": "ellissabain",
        "title": "Brian Laundrie’s sister speaks out after Gabby Petito doc and angrily defends her brother",
        "content": "",
        "upvotes": 1019,
        "comments": 401,
        "media": null,
        "permalink": "/r/netflix/comments/1ix6jar/brian_laundries_sister_speaks_out_after_gabby/"
    },
    {
        "id": "1ixykn6",
        "author": "CampMain",
        "title": "Fifth and final series of You coming to Netflix April 24th",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixykn6/fifth_and_final_series_of_you_coming_to_netflix/"
    },
    {
        "id": "1ixt98g",
        "author": "Sweaty-Toe-6211",
        "title": "“I Can’t Tell You Anything”: One Piece Season 3 Is Happening, But the Show’s Cast Is Keeping Quiet",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixt98g/i_cant_tell_you_anything_one_piece_season_3_is/"
    },
    {
        "id": "1ix1eod",
        "author": "Somethingman_121224",
        "title": "Dave Bautista Is Pushing Netflix To Finally Make A 'Gears Of War' Movie",
        "content": "",
        "upvotes": 264,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1ix1eod/dave_bautista_is_pushing_netflix_to_finally_make/"
    },
    {
        "id": "1ixsz31",
        "author": "Evereign8",
        "title": "\"Device not part of my household\"... yet all devices are.",
        "content": "So I have two tv's, a PS5, and my phone with netflix. All on the same network. The tv's are on wifi and the PS5 is on ethernet. We normally have one or two going at the same time. I have three profiles but all on one account. Our problem is that occasionally one device will say it isn't a part of my household and then I'd be prompted to update my household list (again). So.. I'll check the network, still connected to the one and only router in the house, and do the update anyway. Then, a few days later, another device (on the household list) will pop the same issue. This has been going on for a while and I've been constantly having to update the list on each device when it happens. I'd really appreciate some help with this as it's getting to be such a hassle. Maybe I'm missing something about screens on netflix or something? I have no idea. But if anyone knows about or has gone through similar, any info on this would be awesome. Thanks!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixsz31/device_not_part_of_my_household_yet_all_devices/"
    },
    {
        "id": "1ixvy3i",
        "author": "Somethingman_121224",
        "title": "'Peaky Blinders' Actress Confirms She Won't Be Back in 'The Immortal Man'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixvy3i/peaky_blinders_actress_confirms_she_wont_be_back/"
    },
    {
        "id": "1ixv65l",
        "author": "ItsAlwaysBlue212",
        "title": "I have trouble transfering extra member account back to main one.",
        "content": "In manage profile on the extra account the option to transfer profile os missing, where as it there on my main account. Is it even possible to transfer extra member account?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixv65l/i_have_trouble_transfering_extra_member_account/"
    },
    {
        "id": "1ixso69",
        "author": "Pep_Baldiola",
        "title": "Revelations | Official Teaser | Netflix (from the director of Train to Busan)",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixso69/revelations_official_teaser_netflix_from_the/"
    },
    {
        "id": "1ixjtz3",
        "author": "Worldly-Committee-71",
        "title": "Maria isn’t Maria",
        "content": "I love Angelina to bits, but what horrible movie… I couldn’t finish it. Terrible pacing, no emotion, no range. I don’t believe Callas was that. \nThere were some good scenes when she sang, but all the rest is … really really bad and nothing saves it.\n\nWho thought it’s Oscar-worthy? ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ixjtz3/maria_isnt_maria/"
    },
    {
        "id": "1ixy4ib",
        "author": "antox_99",
        "title": "Theory about Cassandra: A genuine mistake or a hidden part of the story?",
        "content": "I might or might not be the only person who had the Guten Morgen, Sonnenschein song by Nana Mouskouri stuck for days in my head. I surely went over to Youtube to play it over and over again until I learnt the lyrics. But then I noticed something intriguing. The song Cassandra used to sing every morning to wake up the Prill family was released in 1977, and Cassandra allegedly was disconnected by a power overrose the day she saw her family die in 1972. Not sure if it was a mistake from the crew or was intentionally chosen...which makes the whole plot a bit more dark to me, thinking about what happened during those years from which she could have learned the song.\n\nI mean if we think about the fact that she was able to turn on and off by herself, I assume Flynn moving the switch on episode 1 had little to no influence in her awakening, also I'm still skeptic about his mechanical abilities fixing the humanoid robot, he was a remarkable student but his hobbies were more artistic. Also we know so little about Margarethe and her time in \"captivity\", and we know nothing about what happened with Birgit and the baby. On top the way Cassandra immediately assumed the personality of an \"AI\" smart house when she was awaken rather than explaining her situation, and her immediate transformation into the antagonist that wanted to get rid of Samira to take over her family was to me always lacking a little bit on the character developing area.\n\nThe impact of betrayal, loss, and trauma can be profound and may lead to extreme emotions and behaviors. However, the transformation into someone with a desire to harm others usually involves a more extended period of psychological change. The transformation from experiencing trauma to becoming a villain is a complex process and rarely happens overnight, so that was the only part that didn't quite fit to me in Cassandra's redemption arch of the series. But if this is a hint of some background story happening in between the 1972 and the present days, this could eventually provide an explanation to this and all plot holes and doubts we were left with. What do you think? Is this just a mistake or a hint to a season 2?\n\nTL,DR: The good morning song Cassandra sings was released in 1977 and she disconnected in 1972. Is this a hint to a possible season 2 that fills up plot holes or just a mistake from the crew?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixy4ib/theory_about_cassandra_a_genuine_mistake_or_a/"
    },
    {
        "id": "1ixc6fq",
        "author": "RamboToots",
        "title": "Watching ‘Don’t Look Up’ Again",
        "content": "I recommend watching Don’t Look Up with Leave the World Behind.  Two movies worth a watch right now with all that’s going on.  Some comedic effect which I always appreciate.  ",
        "upvotes": 27,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ixc6fq/watching_dont_look_up_again/"
    },
    {
        "id": "1ixw2uk",
        "author": "deadironman",
        "title": "Were both my mom's email and netflix hacked?",
        "content": "Hi all I hope someone has an answer to this.\n\nI live in Morocco and my mom has a netflix account that we share (I have her email too in case I need to confirm household and I cant get a hold of her since we live in different cities).\n\nAnyway for the past couple of weeks we both needed to reconfirm the household every time we wanted to watch something (which usually happened rarely) and when I checked her emails I noticed there was an account that logs into her account either from New York or California. \n\nNothing else seems to be messed on her gmail with so does this mean it was hacked only for the netflix account? and except from changing her password on both platforms is there anything else she can do to avoid this happening? \n\nThanks in advance to anyone who tries to help! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ixw2uk/were_both_my_moms_email_and_netflix_hacked/"
    },
    {
        "id": "1ixa6r8",
        "author": "RebelGrin",
        "title": "Belle Gibson docu - why wasn't she criminally charged?",
        "content": "Belle Gibson’s actions—falsely claiming to have cured her cancer through natural remedies and profiting from those lies—were certainly unethical and deceptive. However, she was never criminally charged in Australia. Instead, she faced civil penalties under consumer law. \n\nAnd why didn't Apple and Penguin sue her? \n\nHere’s why criminal charges were not pursued in Australia:\n\n1. Civil vs. Criminal Law – Gibson’s conduct was primarily treated as a violation of consumer law rather than criminal fraud. The Australian Competition and Consumer Commission (ACCC) pursued her under the Australian Consumer Law (ACL) for misleading and deceptive conduct.\n2. Burden of Proof in Criminal Cases – For criminal fraud charges, prosecutors would need to prove beyond a reasonable doubt that she knowingly and intentionally deceived people for financial gain. While morally clear, legally, this can be more complex.\n3. Consumer Law Penalties – In 2017, the Federal Court found Gibson guilty of misleading consumers and fined her $410,000 for false health claims and failing to donate promised proceeds to charity. This was seen as a sufficient legal response.\n4. No Individual Criminal Complaints – Fraud charges often require direct victims to make formal complaints. While many people felt deceived, there wasn’t a widespread push for criminal prosecution.\n5. Lack of Specific Criminal Charges – Australian law does have fraud provisions, but proving criminal intent and harm at a level warranting prosecution may have been difficult.\n\nSo while her actions seemed fraudulent in a moral sense, legally, authorities chose a civil route rather than criminal charges. \n\nWould you have preferred a criminal case? \n\nI would ! ",
        "upvotes": 19,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ixa6r8/belle_gibson_docu_why_wasnt_she_criminally_charged/"
    },
    {
        "id": "1ixmj3m",
        "author": "DeviantBoi",
        "title": "I accidentally clicked on getting weekly reminders for WWE Raw. Can't find how to make them stop.",
        "content": "I misclicked on my phone and now I'm getting weekly reminders about it.\n\nIt was on My List but the option to remove wasn't there. I had to click on the \"+\" to add it to my list and then I could remove it. But that hasn't stopped the notifications.\n\nEDIT: Just checked my list and it's back on it even though I had removed it. I guess it adds itself with each reminder. This is annoying as hell.\n\nAny ideas?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ixmj3m/i_accidentally_clicked_on_getting_weekly/"
    },
    {
        "id": "1ixaox7",
        "author": "TheMirrorUS",
        "title": "Karla Sofia Gascon plans to attend Oscars after Twitter scandal as Netflix funds outing",
        "content": "",
        "upvotes": 16,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ixaox7/karla_sofia_gascon_plans_to_attend_oscars_after/"
    },
    {
        "id": "1ixghwd",
        "author": "snagbuck",
        "title": "Crossover opportunity for Night Agent and Recruit?",
        "content": "As a fan of both the recruit, and night agent…I think there is a fantastic crossover opportunity with these and the ways both second seasons wrapped up. Without mentioning spoilers, they’re headed to the same location. Bonus points if you can tie in the diplomat (though I only watched the first season of that one). I know the story lines are completely different, but a person can dream. Or maybe the Marvel TV universe has me spoiled. \n\n\nAnyone else thought about this? Anyone care to weigh in on how completely unrealistic this fantasy is? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ixghwd/crossover_opportunity_for_night_agent_and_recruit/"
    },
    {
        "id": "1ixc9f5",
        "author": "Stephxnle",
        "title": "Netflix Error Code CM: 42709",
        "content": "I have gotten a new phone and I had it replaced and now Netflix is popping up this error only on this device. \n\nMy TVs work fine and customer service was unable to resolve this issue so unfortunately I’m stuck. ",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ixc9f5/netflix_error_code_cm_42709/"
    },
    {
        "id": "1ixn2ln",
        "author": "TheViolist2000",
        "title": "Cassandra list of songs",
        "content": "Can someone please go through the effort to list all the songs (not the Netflix soundtrack but the actual songs) played in Cassandra? I've suddenly developed an affinity for 70s German pop as a result of watching???",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixn2ln/cassandra_list_of_songs/"
    },
    {
        "id": "1iwwzok",
        "author": "S4v1r1enCh0r4k",
        "title": "Jessica Gunning has won the SAG Award for Best Actress in a Limited Series for her role in Baby Reindeer.",
        "content": "",
        "upvotes": 48,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iwwzok/jessica_gunning_has_won_the_sag_award_for_best/"
    },
    {
        "id": "1ixmm4h",
        "author": "hooper610",
        "title": "Zero Day not Playing in 4k or HDR",
        "content": "Zero Day for whatever reason will only play in HD. I have tried in Apple TV and LG Netflix app. Every other show I have tried works fine in 4k and HDR. Episode 4 and 5 are totally broken. The earlier episodes I could get HDR or 4k by restarting the stream sometimes. Anyone else? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ixmm4h/zero_day_not_playing_in_4k_or_hdr/"
    },
    {
        "id": "1ixvven",
        "author": "anonymousCryptoCity",
        "title": "Main thoughts after seeing the relationship dynamics shown in the Gabby Petito documentary were about the subtle violence built into systems like the police department.  This involves mainly the ‘birds of a feather flock together’ effect.",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixvven/main_thoughts_after_seeing_the_relationship/"
    },
    {
        "id": "1ix5zg5",
        "author": "MysteriousDelay6266",
        "title": "Adolescence | Official Trailer | Netflix",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ix5zg5/adolescence_official_trailer_netflix/"
    },
    {
        "id": "1iwhx3j",
        "author": "katiereadalot",
        "title": "What cancelled Netflix show would you bring back if you could only pick 1?",
        "content": "If I can only pick one I’m torn between Julie &amp; the Phantoms and The Society but I think more people want JATP. Plus I could use more JATP songs, that album gets so much play on my Spotify for an adult…",
        "upvotes": 252,
        "comments": 1334,
        "media": null,
        "permalink": "/r/netflix/comments/1iwhx3j/what_cancelled_netflix_show_would_you_bring_back/"
    },
    {
        "id": "1ixib6i",
        "author": "Bloomingalenight",
        "title": "What if we are also living in a place just like in pantheon",
        "content": "Hey yall I started watching pantheon it honestly is super relaxing to watch with just the right amount of drama but I can’t stop thinking if…. This has been done before (with the use of chatgbt and other systems), if we too are living in a simulation, or even if what we think is real is all an illusion. What do yall think",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixib6i/what_if_we_are_also_living_in_a_place_just_like/"
    },
    {
        "id": "1iwqn2e",
        "author": "Loose_Clock609",
        "title": "Gabby &amp; Brian- Their Parents",
        "content": "Brian is the villain, there's no doubt about that. He used classic abuse tactics not only on Gabby but her mom as well. It should be discussed how he abused Gabby but how he manipulated the parents as well. \n\nGabby's mom said Brian would text her things about Gabby being around bad people and she believed him. I wonder if the mom had a history of abuse or if this is common with abusers. \n\n**I don't blame her parents. I do wonder if her friends or family intervened would it have changed the outcome? If victims of abuse feel they have a safe place to go-do they go?",
        "upvotes": 66,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1iwqn2e/gabby_brian_their_parents/"
    },
    {
        "id": "1ixaj7w",
        "author": "Yana123723",
        "title": "Just watched Hunger(2023)",
        "content": "This review that I’m writing right now isn’t much because I’m only and Hour and 25 minutes into the movie but so far I’m loving it the Chef is very strict in the movie but also has some nice parts to him, but when he serves the food to his customer’s it looks like he makes it look bloody which could be a bit creepy, but when you get halfway in and hear why he wanted to become a chef it sorta makes sense as too why he likes looking at them eat like that but this show also makes me scared to get married one day because I just past the scene where on the news it shows that the father killed his wife and daughter and then his self after having a meal made by the main chef in the movie and now I can’t just stop thinking what if I get married one day and my husband decides that life is too hard for him and makes the ultimate decision to unalive me and my child then him last. I know death eventually will happen to all of us but I felt that was a coward move to make.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ixaj7w/just_watched_hunger2023/"
    },
    {
        "id": "1ixfdui",
        "author": "Helpful-Figure-1545",
        "title": "Set lighting program?",
        "content": "Hey I want to get into set lighting for netflix. Don't know who to reach out. I heard they have a program to recruit. But don't the name of the program. It there anyone that knows of this program or guidance to get into set lighting for netflix? Internships? In LA? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixfdui/set_lighting_program/"
    },
    {
        "id": "1ix84ip",
        "author": "Scary_Couple8243",
        "title": "Tv show suggestions?",
        "content": "Anybody got great tv show suggestions? If it’s an amazing show but it’s not on Netflix, feel free to tell me about it too!\n\nThese are the shows I watched and really enjoyed: \n-3 Body Problem\n-Breaking Bad\n-Brooklyn 99\n-Stranger Things\n-The Good Place\n-You\n-DarK\n-Mindhunter\n-Squid Game\n-The Queen’s Gambit\n-A Man on the Inside\n-Arcane \n-Cyberpunk Edgerunners\n\n",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ix84ip/tv_show_suggestions/"
    },
    {
        "id": "1iwikkm",
        "author": "PhantasiaFan23",
        "title": "I found the filming location for the house from the series “Cassandra”",
        "content": "",
        "upvotes": 112,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1iwikkm/i_found_the_filming_location_for_the_house_from/"
    },
    {
        "id": "1ixj62d",
        "author": "notsokyaut",
        "title": "Netflix Account Issues",
        "content": "I just realized that I can't access Netflix while traveling as I get the error \"your account can't be used in this location\". On reaching out to customer support, I was told that I need to restart the account such that the subscription will be based on the country I am in. However, once I do that, my account won't be accessible in my home country where I originally created the account. My account is a shared account and this is a weird policy. What is the point of having a shared account with multiple screens and all if Netflix enforces such policies. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixj62d/netflix_account_issues/"
    }
]