[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 35,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pns4fh",
        "author": "Expensive-Elk-9406",
        "title": "'Boots' Canceled By Netflix After One Season",
        "content": "",
        "upvotes": 194,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1pns4fh/boots_canceled_by_netflix_after_one_season/"
    },
    {
        "id": "1pmuo0i",
        "author": "EgoExplicit",
        "title": "Cancelled after being told Netflix can’t be used while traveling",
        "content": "I’ve been a Netflix customer since the early days. I travel frequently for work and usually bring a Roku stick to use in hotels.\n\nThis week I couldn’t log in, so I contacted Netflix support. I was told that my subscription is intended for use at my home location and that I can’t use it while traveling.\n\nWhat’s frustrating is that I’m on a plan with a 4-device limit and I stay within it. I’m not sharing my account with anyone outside my household — I’m just logging in from a different location while traveling.\n\nIt feels like Netflix has shifted from enforcing device limits to enforcing location, which is a big change in how the service works, especially for people who travel often. Streaming on a phone or laptop seems to work, but devices like Roku or Apple TV are where the problems show up.\n\nThe policy itself was disappointing, but what really pushed me to cancel was how little concern there was about losing a long-time customer. The response was essentially “that’s just how it is.”\n\nIf you travel often and rely on streaming devices, this is something to be aware of.",
        "upvotes": 3363,
        "comments": 366,
        "media": null,
        "permalink": "/r/netflix/comments/1pmuo0i/cancelled_after_being_told_netflix_cant_be_used/"
    },
    {
        "id": "1pnqu15",
        "author": "Syphthis1",
        "title": "Question about Man vs Baby (Rowan Atkinson - Netflix)",
        "content": "We randomly put this on and my 1 year old is GLUED to it. Anyone else experience this? And do you have any idea why? One of my friends had the same thing happen and I'm curious now. TIA!",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pnqu15/question_about_man_vs_baby_rowan_atkinson_netflix/"
    },
    {
        "id": "1pmpu37",
        "author": "bottlecoco",
        "title": "need a ONE-SEASON banger Netflix show",
        "content": "Hey guys,\n\nI’m begging at this point. I don’t want a slow burn. I don’t want “it gets good in season 3.”\nI want a ONE-SEASON show on Netflix that just hits from start to finish.\n\nSomething so good I finish it in one sitting, stare at the wall afterward, and rethink my existence.\nNo fillers. No dragging. Just straight banger energy.\n\nAny genre is fine — thriller, mystery, drama, sci-fi — as long as it’s elite.\nPlease save me from scrolling Netflix for 40 minutes and watching nothing 🙏\n\nDrop your best recommendations ⬇️",
        "upvotes": 628,
        "comments": 1151,
        "media": null,
        "permalink": "/r/netflix/comments/1pmpu37/need_a_oneseason_banger_netflix_show/"
    },
    {
        "id": "1pnwsuc",
        "author": "Original_Giraffe_830",
        "title": "Orange man joke",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pnwsuc/orange_man_joke/"
    },
    {
        "id": "1pnwgf2",
        "author": "wonhoppa",
        "title": "Culinary Class Wars | Season 2 | Discussion Thread",
        "content": "\"Culinary Class Wars Season 2\" on Netflix brings back the fierce clash between elite \"White Spoon\" chefs and rising \"Black Spoon\" contenders. Introducing new rules, heightened stakes, and the shocking return of two masked, mystery chefs seeking redemption. It promises even more intense blind tastings and a shake-up of the culinary hierarchy with Michelin stars and street food masters battling for ultimate flavor supremacy.\n\nThe two legendary judges are also back: Baek Jongwon, Korea’s top restaurateur and national culinary mentor, and Anh Sungjae of Mosu Seoul, Korea’s only Michelin three-star restaurant.\n\n* Schedule: Every Tuesday 5pm (KST) starting December 16",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pnwgf2/culinary_class_wars_season_2_discussion_thread/"
    },
    {
        "id": "1pnjib0",
        "author": "JumpAroundJay",
        "title": "What's a newer Netflix show/movie that is ok for tweens, but most parents wouldn't expect it to be?",
        "content": "Trying to find shows that will be worth watching for myself and my wife that the kids will enjoy as well. SO, I'm thinking some good rated R action or comedy (or any genre really) shows/movies that actually don't have too much bloody violence and little/no sexual stuff.  If the R rating is mostly for mild violence and cursing, we're generally ok with that.",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pnjib0/whats_a_newer_netflix_showmovie_that_is_ok_for/"
    },
    {
        "id": "1pnasge",
        "author": "ElBeh",
        "title": "Netflix paid $55 million for a 'visionary' sci-fi epic that was never finished. We saw a glimpse of it at director Carl Rinsch's criminal trial.",
        "content": "",
        "upvotes": 17,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pnasge/netflix_paid_55_million_for_a_visionary_scifi/"
    },
    {
        "id": "1png1ji",
        "author": "hadashitday",
        "title": "Need action movie recommendations",
        "content": "I’m in the mood for some intense action movies on Netflix. I’ve already seen the big ones like Extraction and The Old Guard, but I’m looking for something I might have missed.\n\nWhat are some hidden gems or underrated action flicks you guys recommend? Anything with crazy fight scenes or mind-blowing stunts?",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1png1ji/need_action_movie_recommendations/"
    },
    {
        "id": "1pntepg",
        "author": "peachbeau",
        "title": "Netflix has lately been unable to keep track of where I am in a series. Help?",
        "content": "It used to be that when I would rejoin a series, NF would pick up where I had left off with the correct season, episode, and position in that\n\nepisode. Now it just starts over (even when I last viewed it yesterday) sometimes from the top or at least several episodes back. Anyone else dealing with that? Anyone know what to do about it — besides just making a note of where you are so you’re keeping track of it.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pntepg/netflix_has_lately_been_unable_to_keep_track_of/"
    },
    {
        "id": "1pni9cd",
        "author": "TimesandSundayTimes",
        "title": "Gary Lineker’s podcast company to make £10m in Netflix World Cup deal",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pni9cd/gary_linekers_podcast_company_to_make_10m_in/"
    },
    {
        "id": "1pnrjij",
        "author": "kelemvor33",
        "title": "Does your sound drop out at random times when streaming?",
        "content": "Hi,\n\nI was using a Fire Stick and it worked fine for years.  Suddenly it starts dropping the audio way down to almost nothing at random times.  I could still hear things, but barely.  Then after a minute or two it would shoot back up to normal.\n\nI thought it was the Fire Stick having issue so I swapped it for an Onn Google TV thing.  Tonight it did the same thing again.  Right in the middle of a show, the audio dropped down real far and got tinny.  Then after 30 seconds, it went back up to normal.  Apparently it's not limited to the Fire Stick...\n\nDoes this happen to anyone else?  I don't think it's my equipment since it's just the stick into the TV and the audio to my tuner.  Nothing fancy.\n\nThanks.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pnrjij/does_your_sound_drop_out_at_random_times_when/"
    },
    {
        "id": "1pno0ml",
        "author": "Less_Ad_7357",
        "title": "The monster of Florence",
        "content": "Does anyone know why Salvatore was rapping Barbara? Why was he so powerful in her house? I understand he was renting at the beginning but 2 months afterwards he was the man of the house. Also, why was Stefano so chilled about Francesco and even bringing tea while they were having sex? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pno0ml/the_monster_of_florence/"
    },
    {
        "id": "1pmkt4e",
        "author": "SnooSprouts2672",
        "title": "How would you rank the Knives Out movies?",
        "content": "  \nMy personal take below:\n\n1. Knives out (won by a mile for me)\n2. Wake up dead man\n3. Glass onion\n\nUnlike most people who watched 1 and 2 first. 1 never watched a Knives out movie before. So i watched 2 then 3. And lastly 1. I didnt enjoy Glass Onion but the ending with explosions was spectacular. Loved WUDM but to me the Knives Out 2019 was the perfect movie for me.\n\n\n\n  \n",
        "upvotes": 155,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1pmkt4e/how_would_you_rank_the_knives_out_movies/"
    },
    {
        "id": "1pnhxo8",
        "author": "ProofGlittering9488",
        "title": "Let’s talk about Grand Army",
        "content": "Well, I want to talk a bit about this series. I finished it yesterday, something I really didn’t want to do because unfortunately I found out that the series was canceled back in 2021. I don’t understand why Netflix has to cancel series with so much potential, especially when they left such an incredibly open ending. Anyone who has seen the series will understand the frustration I’m feeling right now. After searching for quite a bit of information, it seems very unlikely that the series will ever return with a second season, and that really makes me angry. I know it’s already been five years since its release, but honestly, I refuse to simply accept that we won’t get a second season. If anyone has more information, or knows of anything we can do to try to put pressure on Netflix, I’d really appreciate any help here.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pnhxo8/lets_talk_about_grand_army/"
    },
    {
        "id": "1pnegww",
        "author": "Froggyblocks",
        "title": "Dune part 2 in Italy",
        "content": "Can anyone in Italy please check if Dune part 2 is currently within the catalog? They make it very hard to check without an account. Among other things, I’d mainly be getting Netflix for that movie, and I’m wondering if I should just buy it separately instead. Thank you",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pnegww/dune_part_2_in_italy/"
    },
    {
        "id": "1pmz5j7",
        "author": "AccomplishedPut5175",
        "title": "Wake Up Dead Man:A knives Out Mystery",
        "content": " i just finished watching this movie, and... I watched, if I can say, the first parts of this film as well, and while each part stands on its own, honestly, this third part of the sequel seems the weakest to me. The cast is perfect, but I prefer the stories from the earlier parts, especially the first part of this film saga.",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pmz5j7/wake_up_dead_mana_knives_out_mystery/"
    },
    {
        "id": "1pniq60",
        "author": "Fulltime-Sheepherder",
        "title": "Aria from Ripple is insufferable...",
        "content": "[](https://www.reddit.com/r/netflix/?f=flair_name%3A%22New%20on%20Netflix%22)I'm really enjoying the show overall, it's sweet, heartwarming, tear-jerking... yet for some reason I find Aria's character to be nearly unwatchable.\n\nWorst is I can't put a finger on it, but I couldn't care less about her story, she's always wining, kind of self-centered. Just wondering if anyone else feels similarly?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pniq60/aria_from_ripple_is_insufferable/"
    },
    {
        "id": "1pn97p0",
        "author": "ThalloAuxoKarpo",
        "title": "What to watch on Netflix",
        "content": "Hi! \n\nI was given a Netflix gift card for one month. So I’m planning to watch some movies and eventually short series over the holidays. I canceled Netflix about 3 years ago, so is there any new content, I missed out on in the past years? Can you recommend something? \n\nI’m already planning to watch: \n\nTrain Dreams\n\nThe Beast in Me\n\nThe new Knives Out movie, eventually.\n\nPlease no Series with more than 2 Seasons. Thanks a lot! ",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pn97p0/what_to_watch_on_netflix/"
    },
    {
        "id": "1pn8q0l",
        "author": "moal09",
        "title": "Flanderization in Scott Pilgrim Takes Off",
        "content": "Flanderizarion in the Netflix cartoon\n\nIt's a fun little \"what if\" series, but a lot of characters feel like extremely one dimensional  versions of themselves.\n\nLucas Lee in particular feels like he was done dirty.  The whole point of his character is that his self important douchebag persona isn't the real him, and that he's actually a decent guy who had his heart broken and used the former as a sort of coping mechanism.  \n\nWallace also went from snarky dick who cares to just a dick.  Neil went from naive and a bit silly to just being a full on moron.\n\nRamona also patches things up with her exes without really growing in any way on her part or realizing how badly she hurt people and how she's largely responsible for a lot of their douchebaggery to begin with.\n\nI feel like the show had to move so quickly, it didnt have a chance to actually have any proper characterization.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pn8q0l/flanderization_in_scott_pilgrim_takes_off/"
    },
    {
        "id": "1pmhlht",
        "author": "Dariusgamer2007",
        "title": "Why is my ‘Your next watch’ 95% things I’ve already watched?",
        "content": "I’m really confused because Netflix for a few months now has been recommending me nothing but series and movies I’ve already watched. What’s going on? How do I stop this? ",
        "upvotes": 59,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pmhlht/why_is_my_your_next_watch_95_things_ive_already/"
    },
    {
        "id": "1pnhyfz",
        "author": "indianbeast454555",
        "title": "After watching Strangers thing S2",
        "content": "I first feel apologetic  about my last post question on season 2 (good or bad)!!\n\n after watching the season 2 of strangers thing, i can say that this was the best decision of my life, why i don't know people hate season 2 ,but i actually kinda a like it , Not like season 1 becuase season 1 is Peak.\n\nBut second season you should give it a try the development of charecter is interesting, Specially Steve Harrington, his become my favorite Like he occupies a space in my heart like iron man , And i think more better connection in him.\n\nbecause he is a normal person but due to his kinda and babysitter behaviour We should be like him selfless and Caring about selfless like Steve dont have any connection with the children but still he ready to sacrifice his life what a Good Person he his.\n\nat last Give it a try last two episodes is Peak of the season and Match the vibe of season 1 , so Go and watch if you haven't!!.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pnhyfz/after_watching_strangers_thing_s2/"
    },
    {
        "id": "1pn6ey4",
        "author": "mgsgamer1",
        "title": "The Dragon Prince - I really REALLY like this show, but the majority of the accents are ass",
        "content": "That's all. Some of the accents drive me nuts with how obviously fake they sound.\n\nConsidering it's a fantasy show, one could just chalk the accents up to \"inspired by\" and not \"representative of\", but the bad ones are so grating on my ears.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pn6ey4/the_dragon_prince_i_really_really_like_this_show/"
    },
    {
        "id": "1pn5bdc",
        "author": "FlynnSanOne201",
        "title": "Black mirror - Mazey day",
        "content": "I thought I had seen every episode but HOLY SHIT.. I did not expect it to go down like that! Went from 0 - 100 real quick. A werewolf wow. Insane what a great episode. I'm curious to know how everyone interpret this episode? It obviously is about the paparazzi but Black mirror seems to always have deeper meanings to each episode. Is there more to this episode? Please help me understand if so. If not I apologise and will delete. Thanks! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pn5bdc/black_mirror_mazey_day/"
    },
    {
        "id": "1pnhr61",
        "author": "aslan_alpay0512",
        "title": "Anybody now the exactly Name of the Series ??",
        "content": "Hey guys, so much of it is still in my head, about teenagers (young people). There was a scene in a youth center. A teenager holds a gun to his own head, like a roulette wheel, brutally psychological, action-packed. The guy gets so sick from the stress that he throws up. The show is about teenagers, peer pressure, guns, and drugs. A girl died; at first, they think it was suicide, later it turns out she was driven to it – overdose/injection. I hope you can at least help me with the name or tell me if it's still airing (and under what title).",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pnhr61/anybody_now_the_exactly_name_of_the_series/"
    },
    {
        "id": "1pn47kz",
        "author": "Mountain-Bid4317",
        "title": "40S325 Roku TV (2019) has had a lot of issues with this app",
        "content": "Anybody else run into this? It feels like every other app runs smoothly except for Netflix. Maybe because the TV is older and Netflix is constantly making updates, my older TV cannot keep Anyone else have this?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pn47kz/40s325_roku_tv_2019_has_had_a_lot_of_issues_with/"
    },
    {
        "id": "1pne1bx",
        "author": "BoringOpposite786",
        "title": "White Chicks",
        "content": "Hi all\n\nDoes anyone know how long this film will be on Netflix?  Anyone seen it and recommend it? Is there a sequel? I heard the actors pretend they are different and it is also a comedy? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pne1bx/white_chicks/"
    },
    {
        "id": "1pmkwnx",
        "author": "Expert_Dealer_4439",
        "title": "Robby Hoffman special",
        "content": "Curious everyone else’s take. I watched this morning n felt pretty 😬 about the begining MEN/pedo jokes. The middle got better but overall I wasn’t super into it. Maybe I just prefer her podcast vibes. But curious what other fans thought.",
        "upvotes": 11,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1pmkwnx/robby_hoffman_special/"
    }
]