[
    {
        "id": "1ndlhup",
        "author": "IcefoxX5",
        "title": "[Match Thread] Wolverhampton Wanderers U21s - Real Madrid Castilla | U21 Premier League International Cup, Group Stage, Matchday 1",
        "content": "#FT: WOLVES 0:1 CASTILLA\n\n&amp;#x200B;\n\n#PREMIER LEAGUE INTERNATIONAL CUP\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n0:1 Bruno Iglesias 84'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n33' - after an even start to the game, Wolves are now pushing - first a header hits our crossbar after Mestre misjudges the trajectory of a corner, then Mestre is forced to a save on another shot \n\n42' - Wolves' Holman loses the plot and goes after Aguado on the floor for no reason, giving him some sort of push - our players react and a scuffle emerges - the referee gives a Wolves player and Valdepeñas yellows, seemingly not for Holman though \n\n45'+4 - best chance for our boys after a nice combination on the right side - the ball gets laid off to Manu Ángel at the edge of the box, and his left-footed shot goes just wide of the near post \n\nHT - half time in a relatively uneventful match, mostly even for the most part, but with Wolves creating more danger so far - Castilla are struggling in the build-up against their pressure and physicality\n\n54' - Castilla come out of the locker rooms much better, pushing hard for the lead - Bruno Iglesias forces the keeper to a great save with a low shot from the edge of the box \n\n56' - great combination now by Roberto Martín and Pol, whose through ball is perfect for Jacobo, but his lob from a tight angle goes over the bar\n\n58' - penalty not given for a foul on Pol Fortuny in the box, he was clearly tripped \n\n🔄 61' - triple sub by Arbeloa: Loren Zúñiga, Pol Durán and Jorge Cestero come on for Jacobo Ortega, Manuel Ángel and Cristian David - like for like substitutions\n\n🔄 67' - two more subs - Valdepeñas off for Joan, Roberto Martín off for Gabri Castrelo\n\n81' - great one two by Pol Durán and Gabri Castrelo, Pol Durán is through in the box, but the keeper saves - Castilla are very close to scoring a winner here\n\n⚽ 84' - GOLLLLL DEL CASTILLA - great free kick position, Bruno Iglesias steps up, lifts it over the wall and curls it nicely into the corner! \n\n90'+5 - one final chance for Wolves after this weird referee lets a clear foul go in our half, Wolves have a 5v3, Mestre storms out of his goal and forces an early shot, which goes far wide\n\nFT - very deserved win in Castilla's debut in the Premier League International Cup after a very dominant second half. Arbeloa managed to set up the buildup and the press in a way that gave Castilla control and took Wolves' attackers out of the game - the team created and missed opportunities in open play, but in the end Bruno Iglesias' free kick golazo still gave them the deserved win\n\n&amp;#x200B;\n\n**Kickoff:** 20:00 CEST\n\n**Venue:** Molineux Stadium, Wolverhampton\n\n**Referee**: Jacob Viera\n\n**Competition:** U21 Premier League International Cup, Group Stage\n\n**Viewing options:** [RM Play](https://play.realmadrid.com/live/237284), [RMTV](https://www.realmadrid.com/es-ES/real-madrid-tv)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Sergio Mestre - Víctor Valdepeñas (67' Joan Martínez), Manu Serrano, Diego Aguado, David Jiménez - Cristian David (61' Jorge Cestero), Roberto Martín (67' Gabri Castrelo), Manuel Ángel (61' Pol Durán) - Bruno Iglesias, Jacobo Ortega (62' Loren Zúñiga), Pol Fortuny\n\nBench: Guille Súnico (GK), Lamini Fati.\n\nUnavailable: Fran González (Spain U21 call-up), Mario Rivas (injury), Jesús Fortea (Spain U19 call-up), César Palacios (injury), Hugo de Llanos (injury), Dani Yáñez (Spain U19 call-up), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** W\n\n**PL International Cup stats:** - | 0pt | 0-0-0 | 0:0\n\n",
        "upvotes": 14,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2pixjVLnWY7BGU5TMwvWlfE2uJGB-j9RsoLP7uEJHGE.jpeg?auto=webp&amp;s=f7789208e1c88bee522d7bf4aff6ea714be6650a"
        },
        "permalink": "/r/realmadrid/comments/1ndlhup/match_thread_wolverhampton_wanderers_u21s_real/"
    },
    {
        "id": "1nbjmya",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 37,
        "comments": 977,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nbjmya/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ne08qi",
        "author": "chunchunmaru1129",
        "title": "How the hell did Bale's bicycle kick goal not win the puskas that year?",
        "content": "It was better than CR7's Bicycle and I'm saying that even as a Ronaldo fan and also every single one of the nominations for best goal of that year was better than the one that eventually won the puskas.\n\nThat Salah goal was a average Lionel Messi goal.\n\nBale's bicycle kick was from a longer distance than Ronaldo's and he also did it in a UCL final.\n\nEven Pavard's goal could have won it.",
        "upvotes": 1615,
        "comments": 74,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ywg9vq2wxgof1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ne08qi/how_the_hell_did_bales_bicycle_kick_goal_not_win/"
    },
    {
        "id": "1ne52qh",
        "author": "landofphi",
        "title": "Fayza Lamari (Mbappe's mother &amp; agent): \"When I saw Kylian leave PSG, while they told him that PSG was closer to winning the Champions League than Real Madrid. He, with childlike eyes, said: “Yes, I know, but it doesn't matter, I'm starting from zero”. I saw the Kylian who dreamed in his room again",
        "content": "",
        "upvotes": 541,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OA__sGkGLeODPgaXTKOI5RyRhkBvKoEPze-SU4HvQ8M.jpeg?auto=webp&amp;s=ce98bfdd67decbd3c63363d2fcda6dcd45797f5d"
        },
        "permalink": "/r/realmadrid/comments/1ne52qh/fayza_lamari_mbappes_mother_agent_when_i_saw/"
    },
    {
        "id": "1ne5y7y",
        "author": "Ok-Fold6928",
        "title": "Imagine walking into training and seeing this squad waiting",
        "content": "",
        "upvotes": 451,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bi3029tmqiof1.jpeg?auto=webp&amp;s=4806d5df22824c380cae364648ccd0c24cd8720c"
        },
        "permalink": "/r/realmadrid/comments/1ne5y7y/imagine_walking_into_training_and_seeing_this/"
    },
    {
        "id": "1nea389",
        "author": "busyblckboy",
        "title": "The way the new 'fans' slaughter Vini and call him lazy and y'all allowed them to...",
        "content": "every time i look at stats, i'm reminded that all you mfs do is LIE about Viní 💀💀💀 siding with new players over club legend who has given us 2 ucl and proved himself again and again smh.\n\nWithout a shadow of doubt he is the best of this generation and i die on this hill.\n\nThey tried to group Vini with Mbappe in terms of workrate/defensive contribution, I feel bad for him😭😭",
        "upvotes": 148,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a2f377riojof1.jpeg?auto=webp&amp;s=7f4885db0d82dcbadf09dc5d4c609e2a7c4f9eaf"
        },
        "permalink": "/r/realmadrid/comments/1nea389/the_way_the_new_fans_slaughter_vini_and_call_him/"
    },
    {
        "id": "1nebll6",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against Eintracht (away) | Women's CL Qualifying Round 1st leg",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qpbp4auyyjof1.jpeg?auto=webp&amp;s=d348e32f6366ff0d1c88723ef9d99e0832d39a19"
        },
        "permalink": "/r/realmadrid/comments/1nebll6/fem_our_starting_xi_against_eintracht_away_womens/"
    },
    {
        "id": "1ndiec8",
        "author": "Worldly-Exercise-340",
        "title": "Mbappé \"I like to say that fans are lucky to just come and enjoy a show without knowing what happens behind the scenes. Honestly, if I didn't have this passion, the world of football would have disgusted me a long time ago. I would never advise my child to step foot in the football world.\"",
        "content": "On the rape allegations last year\n\n\"I wasn't even concerned. It was just sad to see everyone jumping on it like it was a steak, on such a serious subject. It happens to far too many women, unfortunately, for us to jump on it for headlines and articles. No one took the time to ask what happened to the potential victim. And when everyone saw that I wasn't in this story, what happened? She's in the gutter, no one knows where she is, we don't care. It's a sensitive subject and it made me sad. I knew I was going to get back up because I wasn't involved, the police never called me, my name was never mentioned.\"\n\n\"I knew from the start that it would be okay, but it's complicated. Especially for those close to you, even more so for women. Whether you like it or not, you feel that in the other person's eyes, the person is thinking: 'What if there was a 1% chance that he did something?' It hurt me. I have nothing to do with it... These are human reactions from the women around me, because there are too many who go through this. I just had to accept it, keep quiet, go to training. Sometimes you see comments... But you accept it. Carlo (Ancelotti) told me it was unfair. I said to him: 'What should I do other than let it go and score goals?'\"\n\nOn the legal dispute with PSG\n\n\"It's my responsibility by right, it's labor law. The procedure gave the impression that I wanted to harm PSG. I signed an employment contract. I just wanted to be paid. I have nothing against PSG, I love this club, I have friends there. But it's the only way to get what I'm owed, something I've earned with my sweat. Whether you like it or not, it's still a job. But I already knew I wasn't getting paid when I was at PSG. When the money doesn't come in, you see it. I could have caused a scandal while I was there, but I told myself it wasn't worth it. But when you see that you're not being paid, after a while, you have to react. Only you quickly come across as the ex who's angry... If it could have been settled in an office, this story would never have existed.\"\n\nOn Cristiano Ronaldo's quote that he could only trust four people with his eyes closed\n\n\"I understand. 'Why is he telling me that? What does he want from me? What does he expect from me?' There are a lot of 'whys'. The line between being careful and being paranoid is very thin. You can come across as crazy. How many times have I heard people talk about a player and say: 'He's crazy!' No, he's paranoid because there are only crazy people around him. Maybe he met a beautiful person there, but he's just had 20 meetings with crazy people, so he has doubts, and that's normal.\"\n\nOn the mental exhaustion for players\n\n\"The complexity of the thing is that people have trouble with it. You must not show it. Someone in his living room would say, 'Fuck, at the price they're paying you, I'd be happy every day!' That's why sometimes it's better to keep it to yourself. If I win the World Cup, you come to me three days later and ask me about it, I can say it. You're practically untouchable there. You lose a match, you say that, they tell you that you're saying that because you were terrible. It doesn't change anything if I was already like that before the match... It's all a question of timing.\"",
        "upvotes": 849,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6hNmY2xg2wQsyV8WpM30sQl6hjLXu66Rms2YpE69kmQ.jpeg?auto=webp&amp;s=dbcec28269220941917e0275ed0a09bf88b6c3f5"
        },
        "permalink": "/r/realmadrid/comments/1ndiec8/mbappé_i_like_to_say_that_fans_are_lucky_to_just/"
    },
    {
        "id": "1ndl3fm",
        "author": "Optimal_Lie7824",
        "title": "All of our players' official ratings for the new game.",
        "content": "Who do you think should be higher?",
        "upvotes": 517,
        "comments": 122,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ndl3fm/all_of_our_players_official_ratings_for_the_new/"
    },
    {
        "id": "1ndp2sq",
        "author": "Ready_Ad_1353",
        "title": "Kylian Mbappe endorses Zinedine Zidane to take over as France boss after the World Cup: “With him, there's no need to make things complicated. He's Zidane. No one is going to say no. He's the only one in the history of French football who has all the rights”",
        "content": "",
        "upvotes": 315,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h6KmRORylPxEllQMSgfy1BvCBrL3Ec18TTk_Ic6kCKA.jpeg?auto=webp&amp;s=14be365130cf3392a214ee7b844e3d271cf1124f"
        },
        "permalink": "/r/realmadrid/comments/1ndp2sq/kylian_mbappe_endorses_zinedine_zidane_to_take/"
    },
    {
        "id": "1ndnq7h",
        "author": "Lucky_Reading_3757",
        "title": "Oceanian club Real Kakamora sending shade towards Real Madrid on Instagram",
        "content": "",
        "upvotes": 316,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/diuk8k1v0eof1.jpeg?auto=webp&amp;s=f2ca83f95542a3b5e8f6e091efeb0f9613082f43"
        },
        "permalink": "/r/realmadrid/comments/1ndnq7h/oceanian_club_real_kakamora_sending_shade_towards/"
    },
    {
        "id": "1ndigkn",
        "author": "SaniaXazel",
        "title": "Unfathomable how some of our fellow fans still doubt Jude's place as one of the Best in the World",
        "content": "",
        "upvotes": 376,
        "comments": 38,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mikdhezg2dof1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ndigkn/unfathomable_how_some_of_our_fellow_fans_still/"
    },
    {
        "id": "1ndzgfl",
        "author": "nspy1011",
        "title": "Carreras is coming for you Yamal!",
        "content": "\nAs always, Hamid’s cartoon is absolutely awesome….complete with Mendy/Fran running away scared of the prospect of confronting Yamal and even a Sergio Ramos appearance as a singer near Cibeles 😀\n\nYamal might be on a high after the 6-0 defeat of Turkey but Carreras is gonna pocket him and bring him down to earth in El Classico!  Carreras is the real deal and he’s just getting started!\n\n",
        "upvotes": 31,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qqD5QHihOkkrtNzlY-pHp3phQKIRT2xfIEgwCh-s7_Q.jpeg?auto=webp&amp;s=3ba789704ad95b32d559da279613c5ac73ddfa2d"
        },
        "permalink": "/r/realmadrid/comments/1ndzgfl/carreras_is_coming_for_you_yamal/"
    },
    {
        "id": "1ndocyw",
        "author": "IcefoxX5",
        "title": "Wolves U21 0-[1] Real Madrid Castilla - Bruno Iglesias free kick 84' | Premier League International Cup",
        "content": "",
        "upvotes": 146,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ft2u4vxt5eof1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ndocyw/wolves_u21_01_real_madrid_castilla_bruno_iglesias/"
    },
    {
        "id": "1nd5iaj",
        "author": "chunchunmaru1129",
        "title": "You know what I was wrong this is both the greatest and most iconic UCL goal of alltime",
        "content": "How the hell did he even score it with his weak foot and also how did his body bend so much.Bro Zizou didn't seem to score much but when he did score those were like the most beautiful goals I have ever seen.\n\nZidane was truly out of this world I always wondered why he didn't take free kicks and corners and then I remembered that he was built quite strong and tall for a Attacking midfielder and his threat in the box was huge.",
        "upvotes": 451,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/btkfvhqbt9of1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nd5iaj/you_know_what_i_was_wrong_this_is_both_the/"
    },
    {
        "id": "1nct53p",
        "author": "No-Independent2522",
        "title": "Kylian Mbappé overtakes Thierry Henry and goes in second on France’s all-time scoring list",
        "content": "",
        "upvotes": 1635,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h0vefhln17of1.jpeg?auto=webp&amp;s=5c524b731dece231f2874c794af07a848d1851bf"
        },
        "permalink": "/r/realmadrid/comments/1nct53p/kylian_mbappé_overtakes_thierry_henry_and_goes_in/"
    },
    {
        "id": "1nctxqw",
        "author": "New_Dragonfruit_7005",
        "title": "Ronaldo overtakes Carlo Luiz to become the player with most goals in world cup qualifiers",
        "content": "",
        "upvotes": 1034,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mvayethq67of1.png?auto=webp&amp;s=6accea18d47c564b3ddaaeb34b360f86dd29b9ec"
        },
        "permalink": "/r/realmadrid/comments/1nctxqw/ronaldo_overtakes_carlo_luiz_to_become_the_player/"
    },
    {
        "id": "1ncu52h",
        "author": "xggq",
        "title": "France [2]-1 Iceland - Barcola 62' (Mbappe assist)",
        "content": "",
        "upvotes": 949,
        "comments": 69,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sosl1gzz77of1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ncu52h/france_21_iceland_barcola_62_mbappe_assist/"
    },
    {
        "id": "1ndaygh",
        "author": "NRaw27",
        "title": "Is Jude better at the 8 or 10?",
        "content": "",
        "upvotes": 64,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-aFPLPOVydWg8v8c0B-tLRy4YUu172fFHHXpGJWOWV8.jpeg?auto=webp&amp;s=b992a5729a50860cba8a265507766dd269b36d95"
        },
        "permalink": "/r/realmadrid/comments/1ndaygh/is_jude_better_at_the_8_or_10/"
    },
    {
        "id": "1ncx1db",
        "author": "Dastiano",
        "title": "Franco Mastantuono will wear the number 10 jersey for Argentina today against Ecuador.",
        "content": "As Lionel Messi didn't fly to Ecuador with the team the number 10 jersey was set to be given to Thiago Almada for today's match against Ecuador. But after the news of hin feeling unwell for today's match it has been revealed that Franco Mastantuono will be wearing the number 10 jersey for the argentine selection.",
        "upvotes": 493,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xss4kwfos7of1.jpeg?auto=webp&amp;s=28363b9a43ed48754641ddc847db2d8804c25566"
        },
        "permalink": "/r/realmadrid/comments/1ncx1db/franco_mastantuono_will_wear_the_number_10_jersey/"
    },
    {
        "id": "1ncjydh",
        "author": "No-Independent2522",
        "title": "Guler and Huijsen before the game",
        "content": "",
        "upvotes": 1945,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o8lbj38oc5of1.jpeg?auto=webp&amp;s=03b9b7c36fff120836ae0d77094aeb411b39d99c"
        },
        "permalink": "/r/realmadrid/comments/1ncjydh/guler_and_huijsen_before_the_game/"
    },
    {
        "id": "1nde7ns",
        "author": "ManuMora98",
        "title": "[Basket - Official] Trey Lyles signed until the end of the season",
        "content": "Real Madrid CF has reached an agreement with Trey Lyles, power forward from the Sacramento Kings, by which the player remains linked to the club for the next season, until June 30, 2026.\n\nInternational with Canada, the team with which he participated in the 2024 Paris Olympic Games, Lyles arrives at Real Madrid after accumulating extensive experience in the NBA, where he has played a total of 662 games over ten seasons. In the North American league, Lyles has played for the Utah Jazz (2015-2017), Denver Nuggets (2017-2019), San Antonio Spurs (2019-2021), Detroit Pistons (2021-2022) and Sacramento Kings (2022-2025).",
        "upvotes": 25,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1nde7ns/basket_official_trey_lyles_signed_until_the_end/"
    },
    {
        "id": "1ndczxn",
        "author": "Ivan98s",
        "title": "I'm going on a trip and I want to watch a game",
        "content": "Hello everyone \n\n I'm from Argentina and out of nowhere I had the opportunity to travel to Europe (it would be my first time in Europe) in the week of October 20, the trip would be to Lisbon but I wanted to take advantage of this unique opportunity to try to go see a match at the Bernabeu even if you travel and return on the same day.\n\n  \nI saw that there was a Champions League match between Real Madrid and Juventus that week and I wanted to try to go to that match, but today I found out that there was also a classic against Barcelona that week, so that would also be an ideal option.\n\n  \n What are the options for getting tickets for either of these two games? (I'd go alone.) If tickets are available, what would the approximate price be?\n\n  \nAny advice you could give me would be more than grateful.",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ndczxn/im_going_on_a_trip_and_i_want_to_watch_a_game/"
    },
    {
        "id": "1nclgyv",
        "author": "JakGrealish",
        "title": "I had no clue he voiced Darwin",
        "content": "",
        "upvotes": 202,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9p44mx62n5of1.jpeg?auto=webp&amp;s=d327d4cfc5fc795106aa2954898da34345c0390f"
        },
        "permalink": "/r/realmadrid/comments/1nclgyv/i_had_no_clue_he_voiced_darwin/"
    },
    {
        "id": "1nc3w2d",
        "author": "supplementarytables",
        "title": "Happy birthday to the GOAT! 🤍",
        "content": "",
        "upvotes": 2883,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xg3yqpow31of1.jpeg?auto=webp&amp;s=2c448201b7b8c8ef7a94dbc5e24cf5795bbd8835"
        },
        "permalink": "/r/realmadrid/comments/1nc3w2d/happy_birthday_to_the_goat/"
    },
    {
        "id": "1nc8rhc",
        "author": "chunchunmaru1129",
        "title": "Gareth Bale the Roadrunner",
        "content": "Bro was ridicoulously fast.You know what I always thought Bale was faster than Mbappe and was possibly the fastest player in football history the amount of speed that he had was literally also destroying his own body aswell.\n\nHis ridicoulous speed was a double edge sword.Bro didn't need dribbling or precision his speed alone was just Op.\n\nI just wished he didn't get injured so much.\n\nWhenever bale was fit and had his speed he just did these ridicoulously fast and speedy runs which made you feel does he even needs dribbling.",
        "upvotes": 1081,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t188yibi92of1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nc8rhc/gareth_bale_the_roadrunner/"
    },
    {
        "id": "1ncfmv4",
        "author": "Disastrous-Duty-8152",
        "title": "King Benz All Goals and assists in numbers for Real Madrid👑❤️, read body text",
        "content": "2009/10\n\nLa liga : 27 App, 8 Goals, 5 Assists\n\nChampions league : 5 App, 1 Goal, 1 Assist\n\nCopa del Rey : 1 App, 0 Goals, 0 Assists\n\n\n2010/11\n\nLa liga : 33 App, 15 Goals, 4 Assists\n\nChampions league : 8 App, 6 Goals, 1 Assist\n\nCopa del Rey : 7 App, 5 Goals, 2 Assists\n\n\n2011/12\n\nLa Liga : 34 App, 21 Goals, 8 Assists\n\nChampions league : 11 App, 7 Goals, 5 Assists \n\nCopa del rey :  5 App, 3 Goals, 1 Assist\n\nSupercopa : 2 app, 1 Goal, 2 Assists\n\n\n2012/13\n\nLa Liga : 30 App, 11 Goals,  12 Assists\n\nChampions league : 10 App, 5 Goals, 5 Assists\n\nCopa del Rey : 8 App, 4 Goals, 3 Assists\n\nSupercopa, 2 App, 0 Goals, 0 Assists\n\n\n2013/14 \n\nLa Liga :  35 App, 17 Goals,  10 Assists\n\nChampions league :  11 App, 5 Goals, 5 Assists\n\nCopa del Rey : 6 App, 2 Goals, 1 Assists\n\n\n2014/15 \n\nLa Liga : 29 App, 15 Goals,  11 Assists \n\nChampions league : 10 App, 6 Goals, 2 Assists\n\nCopa del Rey :  3 App, 0 Goals, 1 Assists\n\nClub Worldcup :  2 App, 1 Goal, 0 Assist\n\nSuper Cup :  1 App, 0 Goals, 1 Assist\n\nSupercopa : 2 App, 0 Goals, 0 Assist\n\n\n2015/16\n\nLa Liga : 27 App, 24 Goals, 8 Assists \n\nChampions league : 9 App, 4 Goals, 0 Assists\n\n\n2016/17 \n\nLa Liga : 29 App, 11 Goals, 5 assists\n\nChampions league : 13 App, 5 Goals, 1 Assist\n\nCopa del Rey : 3 App, 1 Goal, 1 Assist\n\nClub Worldcup : 2 App, 2 Goals, 1 Assist\n\nSupercup : 1 App, 0 Goals, 0 Assists \n\n\n2017/18\n\nLa Liga : 32 App, 10 Goals, 5 Assists\n\nChampions league : 9 App, 5 Goals, 0 Assists\n\nCopa del Rey : 1 App, 1 Goal, 0 Assists\n\nClub Worldcup : 2 App, 0 Goals, 0 Assists\n\nSupercup : 1 App, 0 Goals, 0 Assists\n\nSupercopa : 2 App, 1 Goal, 0 Assists\n\n\n2018/19 \n\nLa Liga : 36 App,  21 Goals, 7 Assists\n\nChampions league : 8 App, 4 Goals, 2 Assists\n\nCopa del Rey : 6 App, 4 Goals, 1 Assist\n\nClub Worldcup: 2 App, 0 Goals, 1 Assist\n\nSupercup: 1 App, 1 Goals, 0 Assists\n\n\n2019/20\n\nLa Liga : 37 app, 21 Goals, 8 Assists \n\nChampions league : 8 App, 5 Goals, 2 Assists\n\nCopa del Rey : 3 app, 1 Goal, 1 Assist\n\n\n2020/21\n\nLa Liga : 34 App, 23 Goals, 9 Assists\n\nChampions league : 10 App, 6 Goals, 0 Assists\n\nCopa del Rey : 1 App, 0 Goals, 0 Assists\n\nSupercopa : 1 App, 1 Goal, 0 Assists\n\n\n2021/22 \n\nLa Liga : 32  App, 27 Goals, 12 Assists\n\nChampions league : 12 app, 15 Goals, 2 Assists \n\nSupercopa : 2 App, 2 Goals, 1 Assist\n\n\n\n2022/23 ( Last season of him😭)\n\nLa Liga : 24 App, 19 Goals, 3 Assists\n\nChampions league : 10 App, 4 Goals, 1 Assist\n\nCopa del Rey : 5 App, 4 Goals, 1 Assist\n\nClub Worldcup : 1 App, 1 Goal, 1 Assist\n\nSupercup: 1 App, 1 Goal, 0 Assist\n\nSupercopa : 2 app, 2 Goals, 0 Assist \n\n\nSo there is that, Benzema's all goals and assists for us, which season of him is Ur fav apart from the 2021/22 season?\n\n👑❤️\n\n\n\n\n\n",
        "upvotes": 229,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ncfmv4/king_benz_all_goals_and_assists_in_numbers_for/"
    },
    {
        "id": "1ncav9p",
        "author": "FlyingWaterMen",
        "title": "Real Madrid's interest in Konate is an open secret. Liverpool have offered a renewal up to three times, with the response always being the same: refusal to extend his contract. Madrid's another major target for center-back is his fellow Frenchman Saliba, whose contract expires on June 30, 2027.",
        "content": "",
        "upvotes": 360,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mbRr59HZJi044Ufd7hdmiFkhWgISGDgISeOti-V5KaE.jpeg?auto=webp&amp;s=3910efd86b2567ad26fae51a8433a28a7329e82a"
        },
        "permalink": "/r/realmadrid/comments/1ncav9p/real_madrids_interest_in_konate_is_an_open_secret/"
    },
    {
        "id": "1ncpxbi",
        "author": "Temporary_Ad_8615",
        "title": "Big matches in Bernabéu?",
        "content": "Good day Madrid fans! My son is a die hard Real Madrid fan since birth 😅 his birthday is coming soon and i want to gift him an experience he will never forget rather than material things. I am a casual football fan but lately finding myself watching RMA matches with my son and we enjoy it. I am looking to take him to October 4 match against Villareal. So my question is, is this a big match? The reason i am asking this because i logged into Entradas.com and i can still find very good seats with reasonable price for UCL match against Olympique de Marseille. Is there a big chance that tickets would be still available 1 week before the VillaReal match? I was looking for tickets via 3rd party sites and they cost double for worse seats. Anyone who is experienced watching RMA live at Bernabeu? Thank you so much in advance!\n\nEdit: i would love to bring him to el classico but our vacation from work start on October 1. Would it be easier to get tickets for Villareal match contra UCL matches?",
        "upvotes": 35,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ncpxbi/big_matches_in_bernabéu/"
    },
    {
        "id": "1nc0xvh",
        "author": "Few_Analyst_8216",
        "title": "Xabi Alonso is La Liga Manager of the Month🤍",
        "content": "",
        "upvotes": 910,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n1gcgp9mh0of1.jpeg?auto=webp&amp;s=cf0c05b7503c9f22df7741cfe55dd6be99c934e0"
        },
        "permalink": "/r/realmadrid/comments/1nc0xvh/xabi_alonso_is_la_liga_manager_of_the_month/"
    },
    {
        "id": "1ncj34d",
        "author": "New_Manufacturer_303",
        "title": "Things to know as Madridista!",
        "content": "Coming from a culture where football is not so popular. Getting to know the different trophies, teams &amp; players few years back followed by becoming Mbappe's fan then Real Madrid's. \n\nWhich things you think people should know as a Madridista. Anything like the players, history, coaches, management, special matches etc etc. ",
        "upvotes": 43,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ncj34d/things_to_know_as_madridista/"
    },
    {
        "id": "1nc65f9",
        "author": "_Werewolf_314",
        "title": "Is there anybody remotely close to replace Florentino Perez?",
        "content": "Probably Florentino Perez will retire in 2029. I know nobody can fill his shoes at this moment, but is there anybody who is remotely close to replacing him? I hope we don't get anybody else corrupted like Ramon Calderon or someone who run financials to the ground. Maybe, Perez will prepare somebody to take over from him? ",
        "upvotes": 168,
        "comments": 78,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nc65f9/is_there_anybody_remotely_close_to_replace/"
    }
]