[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1humnmr",
        "author": "Safe-Adhesiveness713",
        "title": "How do I turn my language to English? It randomly turned to this language and I don’t know how to switch it",
        "content": "",
        "upvotes": 87,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1humnmr/how_do_i_turn_my_language_to_english_it_randomly/"
    },
    {
        "id": "1huoykl",
        "author": "PowerDubs",
        "title": "Since it's launch on Netflix games Oct 8th... Atari's RollerCoaster Tycoon has over 100,000 downloads on Google Play",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huoykl/since_its_launch_on_netflix_games_oct_8th_ataris/"
    },
    {
        "id": "1huntic",
        "author": "lgh0614",
        "title": "will it not allow people at home to use my netflix account if i say i'm traveling?",
        "content": "i've (18) used my step moms netflix account for YEARS, which hasn't been a problem when i'm not at her place as long as i'm watching stuff on my laptop instead of my tv (i'm guessing because i bring my laptop with me when i go to her and my dads house). recently i've bought a bigger tv and theres this movie on netflix i've been wanting to watch, but i'd rather watch it on the tv instead. my step mom wouldn't mind me saying i'm traveling and giving me the code, i'm just wondering if that would mess up the ability for her to watch netflix at her house.",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1huntic/will_it_not_allow_people_at_home_to_use_my/"
    },
    {
        "id": "1husfm3",
        "author": "GullibleRanger2616",
        "title": "Shows disappearing from continue watching ",
        "content": "Afew days ago the shows I’ve been watching disappeared from my continue watching and I tried to search them up and they weren’t on Netflix, I went onto a different profile and the shows were there still, does anybody experiencing the same issues and have a fix for this",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1husfm3/shows_disappearing_from_continue_watching/"
    },
    {
        "id": "1hudvh3",
        "author": "CM-Edge",
        "title": "Since start of 2025 Netflix stopped working in 4K / 2160p on my Chrome Browser on PC",
        "content": "Netflix suddenly stopped working being in 4K for me on my Chrome browser from one day to the other. Maybe since start of the new year? I noticed it yesterday, while I still watched stuff on there in 4K right before the end of the year.\n\nEverything only has the HD tag there now, so that's confirmation, but in the Edge browser, 4K things still have the 4K tag, so an issue with Chrome? Is this new?\n\nChrome:\n\n[https://a.l3n.co/i/MdjKbQ.png](https://a.l3n.co/i/MdjKbQ.png)\n\n  \nEdge:\n\n[https://c.l3n.co/i/Mdj4lM.png](https://c.l3n.co/i/Mdj4lM.png)",
        "upvotes": 13,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hudvh3/since_start_of_2025_netflix_stopped_working_in_4k/"
    },
    {
        "id": "1huep2f",
        "author": "fayestarr",
        "title": "what are the best rom/thriller movies/series? ",
        "content": "here me out, I’ve been trying to find some good movies/series that would be like the books yk yk yk, I WANT ENEMIES TO LOVER TROPE but I just can’t find any good ones or maybe I’m just too bad at searching, do you guys have any suggestions for netflix?",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1huep2f/what_are_the_best_romthriller_moviesseries/"
    },
    {
        "id": "1huqshb",
        "author": "mateoelpro332minecra",
        "title": "Looking for an old netflix ahow hat was removed",
        "content": "Helo im searching for an animated show i watched way back i think it was 2014 or around that time about a a kid looking for her sister i remember in one episode him and other guy went look for a guys that was really good at swimming and in another episode there was a bunker in a desert if some1 could help me out i would really appreciate it",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1huqshb/looking_for_an_old_netflix_ahow_hat_was_removed/"
    },
    {
        "id": "1husz1e",
        "author": "Miserable_Island_339",
        "title": "I don’t think Mildred Ratched is a bad person.",
        "content": "This is based off the ratched series. I never watched the movie it was based off of. I don’t think she’s a bad person though. She went through a lot of fucked up things in life. She changed a lot during the show. She is a badass and I really enjoy her character. She killed people but they were all bad people anyways. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1husz1e/i_dont_think_mildred_ratched_is_a_bad_person/"
    },
    {
        "id": "1huop3y",
        "author": "PixelVapor",
        "title": "Did it really happen?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huop3y/did_it_really_happen/"
    },
    {
        "id": "1hufi8x",
        "author": "iamamazing1355",
        "title": "Netflix plan for live content",
        "content": "I'm planning on getting Netflix to watch monday night raw and NFL games in the future.  Does it matter what plan I get?  Like is that stuff going to stream with better quality with premium?",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hufi8x/netflix_plan_for_live_content/"
    },
    {
        "id": "1hun9n6",
        "author": "Cri1709",
        "title": "household problem",
        "content": "I use Netflix mainly on my phone, and I've recently started to watch Netflix on my tv, although not very often\nthe problem is that on my phone it says I'm not part of the household, and while my tv is connected to wifi, I use mobile data on my phone cause it's faster (usually bad wifi connection)\nand I even tried to connect my phone to the same wifi and it still doesn't work \nis there any way to remove my household like it was before, and just use Netflix on my phone? or is there any other solution other than using the 14 days code?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hun9n6/household_problem/"
    },
    {
        "id": "1humb82",
        "author": "2017_JKU",
        "title": "Netflix Preview Club?",
        "content": "Anyone done this?  It says after the show I will have a 10-20 minute survey but depending on the runtime 40 minutes to 3.5 hours.  WTH?\n\nI'm not taking a survey that long.  Is that realistic?\n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1humb82/netflix_preview_club/"
    },
    {
        "id": "1hum1wz",
        "author": "azaanu7",
        "title": "Having problems downloading stuff",
        "content": "Only one device has downloads out of the max 2 however it wont let me download on my phone after I powered my phone off which is what it said to do. The download button is not showing up on anything. Why?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hum1wz/having_problems_downloading_stuff/"
    },
    {
        "id": "1hu9311",
        "author": "Anonythrowthetrash",
        "title": "Should I Worry about “New Sign In” from Netflix email",
        "content": "I was worried when I got an legit email from Netflix saying there was a new sign in on iPhone Safari - Mobile Browser from Michigan. This was a few days ago. Then I try to go into my account settings on my app, which does bring me into a browser submenu, then I got the same email but from Texas. I did this the same thing and still got the same email. I think it thinks going into the account settings is a new sign in.\n\nWhat I did notice is that time was from Michigan but this time was Texas. Is this anything I should be worried about?",
        "upvotes": 7,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1hu9311/should_i_worry_about_new_sign_in_from_netflix/"
    },
    {
        "id": "1hujbek",
        "author": "Lamborghini_Gallardo",
        "title": "I have an issue… you too ?",
        "content": "I have an issue with the section « continue reading » that just disappeared from the app so I’m a bit curious to know if anyone has the same issue (it’s not a big deal thought but it’s not useful cuz I need to remember the serie / movie I started) \nThanks for your answers ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hujbek/i_have_an_issue_you_too/"
    },
    {
        "id": "1hun1ie",
        "author": "Historical_Coyote245",
        "title": "Just finished interview w a vampire 😭😭 need suggestions PLEASE ",
        "content": "Here’s some of my favorites \n\nInterview w a vampire \n\nTrublood\n\nBuffy\n\n\nYou \n\nKilling eve \n\nLincoln lawyer \n\nYour honor \n\nEmily in Paris \n\nSuits \n\nDexter\n\nWalking dead \n\nBehind her eyes \n\nLucifer \n\nMidnight club \n\nMidnight mass \n\nFall of the house of usher \n\nHaunting hill house \n\nHaunting of bly manor (love Mike Flanagan) \n\nBlack list \n\nGood girls \n\nWednesday \n\nMoney heist \n\nDark \n\nIn the dark \n\nA brand new cherry flavor \n\nMoney heist \n\nShameless \n\nWeeds \n\nGilmore girls \n\nThe OC \n\nThe flash \n\nArrow \n\nRaising dion \n\nThe order \n\nThe sinner \n\nBlack mirror \n\nHow to get away with murder \n\nTiny pretty things \n\nOzark \n\nGinny and Georgia \n\nGrace and Frankie \n\nParenthood \n\nHouse of cards \n\nThe good place \n\nOrange is the new black \n\nSchitts creek \n\nPrison break \n\nZnation \n\n13 reasons why \n\nNew girl \n\nSnowfall \n\nVikings \n\nHart of Dixie \n\nWorking moms \n\nSilvana sin Lana \n\nThe Woman in the House Across the Street from the Girl in the Window\n\nPower series ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hun1ie/just_finished_interview_w_a_vampire_need/"
    },
    {
        "id": "1hummdh",
        "author": "wizardrous",
        "title": "My Netflix travel streaming is broken",
        "content": "I was watching it and it logged out, and now it won't display the option to enable my Netflix account on this TV as traveling. At first I thought it just timed out, but the option to enable it again literally doesn't exist. It's trying to get me to change households which is obviously not what it's supposed to do. Anyone have this problem and manage to fix it?\n\nWell it's been two hours and this sub is useless. I just set my hotel as the new household, and guess I have to do that every different place I stay. I travel a lot, so I might just cancel Netflix lol.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hummdh/my_netflix_travel_streaming_is_broken/"
    },
    {
        "id": "1hugdh5",
        "author": "serve-zara",
        "title": "Can anyone recommend a serial similar to welcome to eden or ELITE?",
        "content": "I really love those kind of serials, I am wondering if you have seen similar serials on netflix to recommend, similar to welcome to eden or elite, or even GEN Z",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hugdh5/can_anyone_recommend_a_serial_similar_to_welcome/"
    },
    {
        "id": "1hu70vj",
        "author": "Original-Ease-9139",
        "title": "Some titles not displaying or displaying broken video",
        "content": "So, I have been a recurring customer for a while.  I've never had an issue with Netflix until this past week. \n\nWhen they added the new lineup, which has the tobery Mcguire version of Spiderman among several other movies and shows, Netflix decided to break itself. \n\nSeveral movies and shows simply do not display video. Or it's video displayed like the broken channels on not-so-legal cable boxes back in the day, you know, rainbow lines, video \"noise\" but not much else. It doesn't happen on every movie or show, but enough of them that it's an annoyance. \n\nAnyone had this happen? Or any suggestions on how to fix it? Netflix is on the Xbox, I've already deleted and reinstalled, I've changed hdmi cable and port, nothing fixes it. Is Netflix just bonked? Seriously considering unsubscribing and going to a different service. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hu70vj/some_titles_not_displaying_or_displaying_broken/"
    },
    {
        "id": "1hucaop",
        "author": "MidnightsKitten6",
        "title": "Tv show recommendations!",
        "content": "I really like quirky (some might say trashy lol) coming of age shows like never have I ever, Ginny and Georgia, to all the boys I’ve loved before, etc. I want to watch another series since I just finished never have I ever and I’m without a show right now. Any recommendations?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hucaop/tv_show_recommendations/"
    },
    {
        "id": "1htz8s5",
        "author": "hectorb3",
        "title": "In The Dark",
        "content": "Tonight, I wanted to try something different from my normal genres of Fantasy, Action/Adventure, and Sci-Fi, so I saw \"In The Dark\" and gave it a try. Now I'm hooked. I binged 7 episodes. The story line is unique. The actors make it all so believable. They really sell it.\n\n  \nThanks for all the input. Just finished s1 and it's already getting a little twist to it. ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1htz8s5/in_the_dark/"
    },
    {
        "id": "1hu9aq2",
        "author": "BreadfruitNo9500",
        "title": "Hannibal not appearing",
        "content": "I saw that it was on Netflix two weeks ago and I was thought I was gonna watch it after I got back from somewhere but now it appears it’s not there anymore and yet all sources tell me it’s still on Netflix in America. Anyone know why it’s not appearing",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hu9aq2/hannibal_not_appearing/"
    },
    {
        "id": "1htpaw1",
        "author": "Eaglestark98",
        "title": "Interview with the vampire was surprisingly really well done.",
        "content": "Just going to say this was really well done with really good actors.  I was pleasantly surprised!  I enjoyed the back and forth between the vampire focusing on the telling of the story and the interviewer trying cut out the embellishments and go for the stuff he’s leaving out.  In a way it feels like, yes the vampire wants to look good in his story, but also cares more about HOW it sounds something pretty important for stories that last the rest of time.  Whereas the interviewer focusing on hard hitting facts that are cut and dry is something often focused on tonight news.  Something not know for its longevity.  Like each one wants a story but its style of storytelling reflects their age relatively.  I’m used to Netflix being some quick on and done stuff and it’s nice to see something with a little more art and vision.  Like comparing an album to a mixtape.  Can’t wait for part 2",
        "upvotes": 19,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1htpaw1/interview_with_the_vampire_was_surprisingly/"
    },
    {
        "id": "1httsr2",
        "author": "dakky21",
        "title": "Audio stutters in App on Windows 11 in full-screen",
        "content": "Got a super weird problem on Windows 11 HTPC: when watching Netflix through the app and using \"Dolby Atmos for home theater\" as spatial sound in sound settings, everything works great, sound is great, Denon AVR says input is \"Atmos\", everything is fine to the moment I put the app in full screen. \n\nWhen Netflix app is in full-screen, the audio starts to mute itself and pause, while the video plays normally. The moment I exit fullscreen mode and leave Netflix app maximized, audio starts to works normally. It makes no sense that a change into fullscreen makes audio go silent every few seconds.\n\nAny ideas?",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1httsr2/audio_stutters_in_app_on_windows_11_in_fullscreen/"
    },
    {
        "id": "1htyod9",
        "author": "MiserablePiano5211",
        "title": "Device not a part of the household issue",
        "content": "My parents have a Netflix account that they have upgraded to a larger family plan. I live in the same house with them and have my own profile on my phone and PS5 however Netflix will randomly lockout my profile on both these devices but works on the main computer my parents watch on and the only way to fix it is get a code sent to my dad, but the weird thing is it clearly states on their account that both my devices are apart of the household but they only work once he opens the link and goes through it. Any ideas?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1htyod9/device_not_a_part_of_the_household_issue/"
    },
    {
        "id": "1hu13x6",
        "author": "Adventurous-Sport-45",
        "title": "Netflix just casually is missing the last episode of AARO? ",
        "content": "Netflix was releasing episodes of the series 全領域異常解決室 (AARO in English) on a weekly basis, more or less around the same time as their availability in Japan. However, the last episode of the first season, which came out on December 18, is inexplicably missing. \n\nOf course, the episode is still available on a channel on the Japanese version of Prime Video, as well as some other sources, but it's strange that it is missing from Netflix. \n\nHas anyone seen this happen with any other shows? Is this a glitch in Netflix's automation, or is there a reason behind it? \n\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hu13x6/netflix_just_casually_is_missing_the_last_episode/"
    },
    {
        "id": "1hu8400",
        "author": "OptimusShredder",
        "title": "Finally got the subtitles right with Squid Game 2",
        "content": "There is a lot of great international content on Netflix but as a guy who has played too many concerts and been to too many, my hearing isn’t the best, so I enjoy watching shows with the captions on.  Most of the time though the subtitles aren’t even the same words that are being spoken.  Just wanted to come here and say that the words are spot on with Squid Games 2.  Finally Netflix, thank you. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hu8400/finally_got_the_subtitles_right_with_squid_game_2/"
    },
    {
        "id": "1htni42",
        "author": "laeiryn",
        "title": "Removing unwanted shows/films/rows: is there a way to block Games or WWE at all? [ALL][USA]",
        "content": "There's entire rows of this stuff in the way of desired content now, and **no easily visible way to mark it as \"do not recommend\" or anything.**\n\n*Why* there's sketchy mobile games now being advertised through Netflix is a different problem; I just need to know how to mechanically remove it/reject these recommendations/block games from being accessible via our subscription. \n\nFor the Karens who care: The *very first* game advertised is called 'Too Hot to Handle' and it's pretty clearly meant to be sexually titillating; our kids are older teens so they're not limited to 'child' Netflix, but games like this don't really need to be the very first thing they see when opening the app. \n\n#More importantly, it's in the way of desired content.  Is there any way to remove or block certain categories from showing up? Especially 'games'. \n\nThere's also a whole row of live-streaming wrestling matches that can't be thumbs-downed to dissuade the app from trying to suggest similar content. \n\n(Some of the games advertised also have in-app purchases - !!! - and there's no way to block those from going through on the card on record for payment)\n\nThe wrestling content is at least still tv programming; it's just a genre I'd like be to be able to de-prioritize (it should not be at the top, above my list, above continue watching, nor above the category I actually clicked on). \n\nThe games are a cash grab that don't belong, but I know better than to think Netflix will get rid of anything that scrapes them a bit of profit, so I just need to know how to never see 'games' again via my own paid subscription. Especially not as one of the first rows, before I get to the content that I have actively engaged with. \n\n(and of course it's just crap mobile games expy'd, it's not even like we're being offered to demo Echo the Dolphin )\n\nI'm in the USA getting the games spam via Region 1 but I ASSUME they're hawking this to everyone so I also labeled it 'all'.",
        "upvotes": 11,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1htni42/removing_unwanted_showsfilmsrows_is_there_a_way/"
    },
    {
        "id": "1htto99",
        "author": "Mikethederp",
        "title": "Dexter?",
        "content": "Sooo my wife and I have been watching Dexter lately everyday on Netflix, but we just opened the app to continue tonight's episode and it's gone?\nI don't recall seeing any notice about it being removed from rotation soon... are we SoL?\n",
        "upvotes": 4,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1htto99/dexter/"
    },
    {
        "id": "1huirnt",
        "author": "noanoanoah",
        "title": "Can anyone recommend some non-fetishized gay (mlm) movies or shows?",
        "content": "Most of those Asian BL dramas are so fetishized. And as a closeted gay person I wanna watch something comforting and/or something relatable. If I only wanted to watch them making out, I would watch p0rn instead. So if someone’s got any good recommendations, please be kind enough to share. It’ll be better if it’s a teen story.\nI already know about “Heartstopper” btw.\n\nEDIT: It’s not a bait post. I’m genuinely asking for recommendations.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1huirnt/can_anyone_recommend_some_nonfetishized_gay_mlm/"
    }
]