[
    {
        "id": "1pjfxod",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Real Madrid vs Manchester City, UCL round whatever ",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pjfxod)",
        "upvotes": 151,
        "comments": 1281,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pjfxod/post_match_thread_real_madrid_vs_manchester_city/"
    },
    {
        "id": "1ph9lu7",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 14,
        "comments": 4506,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph9lu7/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1plg39b",
        "author": "Character_Calendar47",
        "title": "Mourinho was 100 percent right...",
        "content": "",
        "upvotes": 71,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u58xk17vgx6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1plg39b/mourinho_was_100_percent_right/"
    },
    {
        "id": "1pktlf3",
        "author": "Modo97",
        "title": "Rodrygo if all teams are Man City:",
        "content": "",
        "upvotes": 1547,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2fcf0e5ccs6g1.png?auto=webp&amp;s=47fb7fe624e94e17a0870600c645426e8e444d5c"
        },
        "permalink": "/r/realmadrid/comments/1pktlf3/rodrygo_if_all_teams_are_man_city/"
    },
    {
        "id": "1pkzsda",
        "author": "vil727",
        "title": "What next seasos's Madrid should look like according to this sub.",
        "content": "",
        "upvotes": 387,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o87975vxjt6g1.png?auto=webp&amp;s=c9d98f9b85c498edf6b081be84910026da71aa31"
        },
        "permalink": "/r/realmadrid/comments/1pkzsda/what_next_seasoss_madrid_should_look_like/"
    },
    {
        "id": "1plgi2a",
        "author": "Bunchdawg",
        "title": "Our Star Boy is a natural infront of goal",
        "content": "",
        "upvotes": 31,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nbwpc21hlx6g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1plgi2a/our_star_boy_is_a_natural_infront_of_goal/"
    },
    {
        "id": "1pl0e2l",
        "author": "8Nakul",
        "title": "Toni Kroos: “Manchester City did NOT deserve to win. Real Madrid were actually the more dangerous team",
        "content": "",
        "upvotes": 269,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pl0e2l/toni_kroos_manchester_city_did_not_deserve_to_win/"
    },
    {
        "id": "1pkw5ec",
        "author": "ContextDry9672",
        "title": "Xabi Alonso will fight for his seat at Real Madrid without CB, two full-backs and without his top scorer, total of 11 players are out",
        "content": "",
        "upvotes": 318,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ql4xpix8us6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pkw5ec/xabi_alonso_will_fight_for_his_seat_at_real/"
    },
    {
        "id": "1pkzezt",
        "author": "PunjabiMamba13",
        "title": "My mood for last 2 weeks",
        "content": "",
        "upvotes": 203,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f1wl5o8aht6g1.jpeg?auto=webp&amp;s=68875eb14fed0b109d1e4eb95ce31f1e11d7e17c"
        },
        "permalink": "/r/realmadrid/comments/1pkzezt/my_mood_for_last_2_weeks/"
    },
    {
        "id": "1plgokp",
        "author": "8Nakul",
        "title": "BREAKING: Fede Valverde has an OVERLOAD in the adductor of his right leg. He didn't train with the team today",
        "content": "",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1plgokp/breaking_fede_valverde_has_an_overload_in_the/"
    },
    {
        "id": "1pl0esp",
        "author": "tavorasc",
        "title": "Ernesto Valverde (former FC Barcelona coach during the Negreira era) has testified he had no idea any \"referee reports\" were available for him to use....",
        "content": "As the title says Valverde was not even aware any of the supposed reports which is the excuse the club Barcelona has given for the payments to Enríquez Negreira the vice-president at the time of the technical referee committee of Spanish football which manages the referees of the federation and their promotions, he never knew they existed, the case is clear they were bribing referees. This is the news we should be focusing on, Barcelona is trying to create a smoke screen with Xabi Alonso and our bad performance to hide these declarations.",
        "upvotes": 97,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d2jgryvcot6g1.jpeg?auto=webp&amp;s=9dd8092660b33ea78420884cdc080dc7c43f63f7"
        },
        "permalink": "/r/realmadrid/comments/1pl0esp/ernesto_valverde_former_fc_barcelona_coach_during/"
    },
    {
        "id": "1pkqs8o",
        "author": "SorryWha1",
        "title": "Same ol’ story every single time…",
        "content": "I think it’s ridiculous how much pressure managers experience during their time at the club. Like seriously they are humans just like anyone else so the pressure is just making the situation worse. This mostly comes from media but media is consuming the energy from fanbases such as this one. We should start encouraging them and not turning against them even for a small mistake.",
        "upvotes": 330,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pia3u46bpr6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pkqs8o/same_ol_story_every_single_time/"
    },
    {
        "id": "1pkr6gg",
        "author": "ContextDry9672",
        "title": "Josep Pedrerol hosted a guy who looks like Vini and gave him the mic to say:  \"I don't want Xabi Alonso. I prefer Solari, Zidane, or Arbeloa.\" \"I want a contract like Cristiano's.\"",
        "content": "This video is uploaded for discussion purposes, and I don’t think what’s happening is random. Josep Pedrerol is a drama clown, and in my opinion, Vini’s negotiations with the board have reached a closed door and he probably will walk on a free. Everyone knows it, including Josep. These clown wouldn’t dare to do this if they didn’t know that Pérez doesn’t mind it, ",
        "upvotes": 281,
        "comments": 143,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tdrxbgjsrr6g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pkr6gg/josep_pedrerol_hosted_a_guy_who_looks_like_vini/"
    },
    {
        "id": "1pkwhrm",
        "author": "TheFeatherDiaries",
        "title": "I really dont get the board's obsession to sack Xabi",
        "content": "Usually, managers of clubs of this magnitude are sacked mid-season only when the season is already crippled by December, with no hope or ambition of a top-2 or top-3 finish.  \nWe are safely in the UCL, merely four points off the top in La Liga, with one El Clasico still remaining, multiple starting XI players injured for a long time now, not to mention our previously world-class athletes showing childish tantrums, having bouts of sabotage and hilariously poor form visible for all to see.\n\nAll of them are now vocal that they are coming back to their senses and will fight for the badge.\n\nThere are about ten points for Barcelona to drop from now until the end of the season, excluding El Clasico. It takes one or two moments of madness or a single injury to flip their season upside down.\n\nWe still have all our knockout games ahead of us, and we have already beaten Barca this season, so that monkey is also off our back.\n\nIs there even any sense in sacking Xabi when the board has already committed to transitioning into the tactical-meta era of football?",
        "upvotes": 93,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pkwhrm/i_really_dont_get_the_boards_obsession_to_sack/"
    },
    {
        "id": "1pksw0l",
        "author": "No-Independent2522",
        "title": "Xabi trying to select starting XI from a pool of 8 fit players 😭",
        "content": "",
        "upvotes": 108,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/04vncq317s6g1.jpeg?auto=webp&amp;s=26732ec058b06ceed0a9a89acf3f0a423b319182"
        },
        "permalink": "/r/realmadrid/comments/1pksw0l/xabi_trying_to_select_starting_xi_from_a_pool_of/"
    },
    {
        "id": "1pkud3g",
        "author": "vil727",
        "title": "Bellingham actually hugging Cherki. Another piece of fake news.",
        "content": "",
        "upvotes": 84,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gyhtdmmvhs6g1.jpeg?auto=webp&amp;s=7b77159c98c48cf2833d8e6b3156350612a5fafd"
        },
        "permalink": "/r/realmadrid/comments/1pkud3g/bellingham_actually_hugging_cherki_another_piece/"
    },
    {
        "id": "1pkrguq",
        "author": "OwnWitness2836",
        "title": "Kylian Mbappé is set to be OUT vs Alaves.",
        "content": "",
        "upvotes": 119,
        "comments": 100,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pkrguq/kylian_mbappé_is_set_to_be_out_vs_alaves/"
    },
    {
        "id": "1pksxqe",
        "author": "Biggie_FC",
        "title": "Hugo Sanchez bicycle kick",
        "content": "",
        "upvotes": 90,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ih932qsd7s6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pksxqe/hugo_sanchez_bicycle_kick/"
    },
    {
        "id": "1pkpi1a",
        "author": "Kalpesh_K",
        "title": "If Real madrid had a group chat 😭",
        "content": "",
        "upvotes": 125,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/40n22h9lcr6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pkpi1a/if_real_madrid_had_a_group_chat/"
    },
    {
        "id": "1pl16o0",
        "author": "cyrusmancub",
        "title": "Castilla defender Valdepeñas has a good chance to start at LB v. Alavés",
        "content": "",
        "upvotes": 26,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pl16o0/castilla_defender_valdepeñas_has_a_good_chance_to/"
    },
    {
        "id": "1pkvihs",
        "author": "Flashy_Treat2831",
        "title": "Which of our Players do you think are Undervalued or overvalued by Transfermarkt?",
        "content": "",
        "upvotes": 47,
        "comments": 99,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pkvihs/which_of_our_players_do_you_think_are_undervalued/"
    },
    {
        "id": "1plgc3j",
        "author": "No-Action578",
        "title": "Track jacket jersey sizing",
        "content": "I want to gift my bf a track jacket but im kind of having trouble with predicting their sizing i saw a post here about jerseys sizing that helped but i think the fit for jackets is different. I want it to be a bit oversized so i thought of getting L following advice relative to the jerseys but now im thinking itll be different. Any advice?\nEdit: the title is supposed to be track/training jacker sizing NOT jersey. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1plgc3j/track_jacket_jersey_sizing/"
    },
    {
        "id": "1pkuf8b",
        "author": "cyrusmancub",
        "title": "[Matteo Moretto] Real Madrid are closely monitoring 20-year-old Stade Rennes CB Jeremy Jacquet",
        "content": "",
        "upvotes": 38,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pkuf8b/matteo_moretto_real_madrid_are_closely_monitoring/"
    },
    {
        "id": "1pkgjq2",
        "author": "FishingVirtual513",
        "title": "Fernando Redondo’s backheel nutmeg on Henning Berg and assist to Raúl (2000)",
        "content": "",
        "upvotes": 377,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8vf8cotgro6g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pkgjq2/fernando_redondos_backheel_nutmeg_on_henning_berg/"
    },
    {
        "id": "1pk7lwf",
        "author": "Particular-Storm3670",
        "title": "Why is no one talking about carreras ? He was so exceptional.",
        "content": "",
        "upvotes": 1156,
        "comments": 100,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8vdzze4utm6g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pk7lwf/why_is_no_one_talking_about_carreras_he_was_so/"
    },
    {
        "id": "1pkk97j",
        "author": "asensia-kopfschmerz",
        "title": "Did you realize Mbappe dominates Vini in defensive stats this season",
        "content": "Mbappe dominates Vini this season in successful tackles, blocks, clearances, headed clearances, interceptions, possession won final 3rd. \n\nSource: https://youtu.be/_Qakanm_4-Y?si=KgrrwHFe-iVKrOUb\n\nThis video also shows how a simple &amp; nearby defensive participation Vini failed to do allowed Man City to easily build up.",
        "upvotes": 177,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3f8325jwop6g1.jpeg?auto=webp&amp;s=b290b6c78dd6a68808dab1870d95fbdb4868945b"
        },
        "permalink": "/r/realmadrid/comments/1pkk97j/did_you_realize_mbappe_dominates_vini_in/"
    },
    {
        "id": "1pkxb65",
        "author": "IcyWash",
        "title": "There is Something Fundamentally Wrong With This Institution And It's Been Exposed",
        "content": "It's seriously concerning just how low we've fallen over the past 2 years. It's like after the double in 23/24, we've just completely and utterly forgotten the values and principles.\n\nWe won the double in 21/22 as well, thing's weren't great the years before but this time feels really off, and the main reason is the performance EVEN when we have a strong squad on paper. Why on paper? Because for some odd reason, the strongest squad is NEVER fully fit.\n\nI want to jog your memory back to the 2016/2017 season. The fact we didn't win the treble that year really ticks me off but I digress. In the 16/17 season, we effectively had 2 squads. Zidane rotated between them, and the injuries weren't as common of course counting out Bale (I feel for him icl). But more importantly, they didn't impact the squad NEARLY as much as the injuries do now.\n\nAnd that's plainly because of depth. Our starting 11 consisted of Cris, Benz, Gareth, Luka, Kroos, Case, Sergio, Pepe, Marcelo And Carva, along with Keylor in goal. Unbelievable line up. But here's the really INSANE thing. \n\nOur B team consisted of: Morata, Asensio, James, Danilo, Varane (though he was pretty much a starter too) Nacho, Kovacic, Mariano, Casilla and a few academy players.\n\nToday it could be argued we have a \"B\" team as well. The issue is that it's no longer set and stone. The injury crisis has decimated the defense and the board thinks another young defender is the way to go.\n\n  \nWe've let go of all veterans that could steer the ship, and that too in quick succession. I still cannot fathom we let Luka of all people leave so soon. We've lost experience AND hunger because I'm sorry, for players that have won 2 champions leagues, they sure as hell aren't showing it. It's baffling. \n\nPerhaps they're tired, perhaps there's something else, who knows\n\nNow our board has decided Xabi has to go because he's not getting the results. Just months ago they had decided Ancelotti was no longer getting the results and should go, coming off the back of a double AND riddled with injuries. The next coach will be someone else who they also deem inadequate. \n\nAnd a final note, Vinicius should be sold end of. He's my favorite player on the team, but his behavior has gotten to the point where nobody benefits any longer. It allows for the media to leech to the team and you best believe it affects the players even if they say it doesn't. It's impossible to avoid the noise, and speaking in the most blunt and unbiased way I possibly can. He's no longer the player that won us those 2 champions leagues, and there has been no change in attitude that would give a person faith that he can regain that form. Saudi want him its obvious, we take the money now and be done with it, or have a saga that will destabilize the team further WHILE we lose money.  \n  \nAlonso IS the man for the job. Ancelotti WAS the man for the job. We cannot make the same mistake a third time, punishing the coach for a collective issue with the institution and protecting the players who play a massive role in said issue.\n\nChange is needed now, otherwise in this modern era, we aren't gonna achieve the success we're used to.",
        "upvotes": 19,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pkxb65/there_is_something_fundamentally_wrong_with_this/"
    },
    {
        "id": "1pkxhsk",
        "author": "tavorasc",
        "title": "Stop the division it's time to stick together, you are falling into the trap of our haters.",
        "content": "Spanish media, the league, Negreiralona they all are rejoicing in watching us eat alive the players and coach, stop falling into their game, we need to stand united... Yes the results suck recently and yes we must have high standards but the project just started and needs time, get your heads out of your ass and stand behind our players. At the end of the season we can pass judgment and demand changes as needed, meanwhile we must support our club and stop those who want to divide us from achieving their objective..\n\nHala Madrid !",
        "upvotes": 18,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pkxhsk/stop_the_division_its_time_to_stick_together_you/"
    },
    {
        "id": "1pk5z3r",
        "author": "arthur_kane",
        "title": "Most people in the sub today",
        "content": "When you're a world class club, repeated defeats can be difficult for fans to accept. We were struggling few years after CR7 left us. But we came back. So now let's not act like losing Kroos and Modric wasn't as impactful either. Trust the process. New manager, some new players, new formations to try out. We'll come back stronger. Hala Madrid.",
        "upvotes": 1000,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gbs6qdydim6g1.jpeg?auto=webp&amp;s=caee9d00738751712643f7d591f82b93b156f306"
        },
        "permalink": "/r/realmadrid/comments/1pk5z3r/most_people_in_the_sub_today/"
    },
    {
        "id": "1pka3wn",
        "author": "cyrusmancub",
        "title": "Zidane’s open letter after resigning from Madrid in 2021. What has changed between then and now?",
        "content": "\"What hurt me more than anything, is when I read the news after any bad result, and it said that I would be fired if I didn't win the next game.\n\nI hated it, and the whole team hated it, because these intentionally leaked messages created a negative vibe around the entire squad, created doubts and misunderstandings.\n\nI had wonderful players with me who supported me to death, and whenever things got ugly, they saved me with incredible wins. Because they believed in me, and they knew I believed in them.\"",
        "upvotes": 428,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pka3wn/zidanes_open_letter_after_resigning_from_madrid/"
    }
]