[
    {
        "id": "1pn4mth",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 6,
        "comments": 416,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pn4mth/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pmq8et",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Deportivo Alaves vs Real Madrid, La Liga",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pmq8et)",
        "upvotes": 173,
        "comments": 444,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmq8et/post_match_thread_deportivo_alaves_vs_real_madrid/"
    },
    {
        "id": "1pnojnf",
        "author": "asensia-kopfschmerz",
        "title": "They’ve left Xabi all alone: Bayer Leverkusen CEO Fernando Carro questions Real Madrid's treatment of their coach.",
        "content": "",
        "upvotes": 221,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NHjQJkz7dBOFwBEfgchM1DaL6iKAbPlHfqMJ79auBEo.jpeg?auto=webp&amp;s=fad6841977342fc069d2c1ed99498c9dda4c03dc"
        },
        "permalink": "/r/realmadrid/comments/1pnojnf/theyve_left_xabi_all_alone_bayer_leverkusen_ceo/"
    },
    {
        "id": "1pnwdyn",
        "author": "Heras22",
        "title": "Incase you missed it. Here is Laporta's lies and contradictions at his testimony yesterday.",
        "content": "Testimony was an hour long. I gather some of the important  bits and translated them. \n\n\nRelationship with Negreira\n\nClaim: Laporta said FC Barcelona never dealt with José María Enríquez Negreira, only with his son (Javier Enríquez), who supposedly produced the reports.\n\nContradiction:\n\nFormer president Sandro Rosell testified that Negreira senior personally carried out the reports.\n\nEmails exist between Laporta and Negreira senior, contradicting the claim that they never spoke or dealt with each other.\n\n\nAdditional inconsistency:\n\nLaporta said he didn’t even know Negreira senior was Vice President of the Referees’ Committee, which is widely considered implausible.\n\nWho Supposedly Wrote the Reports\n\nClaim: Laporta said Negreira’s son was responsible for preparing the refereeing reports.\n\nContradictions:\n\nAt the time, Negreira’s son was part of Fenerbahçe’s coaching staff, raising serious doubts about:\n\nHow he had the time\n\nHow he could perform detailed Barça-specific referee analysis\n\n\nRosell’s testimony directly contradicts this, stating the father, not the son, did the work.\n\n\nExistence and Destruction of Reports\n\nClaim: Laporta said reports were routinely destroyed every five years.\n\nContradictions:\n\nLaporta later appeared at a press conference with red boxes full of reports and CDs, allegedly containing hundreds of reports.\n\nHe even displayed two specific reports from 2012, contradicting the claim of systematic destruction.\n\nHundreds of reports later “appeared” in storage, despite allegedly being destroyed years earlier.\n\n\nKnowledge of Payments\n\nClaim: Laporta said he never knew about the payments or their amounts, because presidents don’t approve all expenses.\n\nContradictions:\n\nHe later stated that any payment over €3,000 requires board approval, contradicting his earlier claim of ignorance.\n\nHe personally justified a dramatic increase in payments, meaning he must have known about both:\n\nThe existence of the payments\n\nTheir amounts\n\nEscalation of Payments\n\nClaim: Laporta justified quadrupling the payments by saying there were “more matches and more competitions.”\n\nContradiction:\n\nThis explanation requires detailed knowledge of the payments, directly contradicting his claim that he didn’t know about them.\n\nThe increase (from tens of thousands to hundreds of thousands of euros annually) is considered grossly disproportionate to any increase in matches.\n\n\nCoaches and the Alleged Reports\n\nClaim: Laporta stated that all coaches received and used the refereeing reports.\n\nContradictions (sworn testimony):\n\nLuis Enrique:\n\n&gt; “In six years as a coach, nobody showed me a single refereeing report, neither to me nor my staff.”\n\n\n\nErnesto Valverde:\n\n&gt; “I was never offered nor shown any refereeing reports.”\n\n\n\nThese are the primary intended recipients of such reports, making Laporta’s claim untenable.\n\nSuspicious Invoices\n\nInvoice 1 – “Aloe Vera Gifts”\n\nFC Barcelona paid €60,000 to a Negreira-linked company for an invoice labeled “aloe vera gift packs”.\n\nNo credible explanation was provided as to how this relates to refereeing analysis.\n\n\nInvoice 2 – 2010 World Cup Referee Report\n\nBarça paid for a report analyzing referees at the 2010 World Cup before the tournament even took place.\n\nThis suggests billing for services that could not yet have been performed.\n\n\nOverall Pattern Highlighted by the Testimony\n\nRepeated use of:\n\n“I don’t remember”\n\n“I didn’t know”\n\n“That wasn’t my responsibility”\n\n\nContradictions between:\n\nLaporta’s statements\n\nDocumentary evidence (emails, invoices)\n\nTestimony from other presidents\n\nTestimony from coaches\n\n\nA central defense (“the payments were for reports”) that is directly undermined by every coach who should have received them\n\n\nBottom Line\n\nLaporta simultaneously claims:\n\nHe didn’t know about the payments\n\nHe justified increasing them\n\nThe reports were vital\n\nThe reports were never seen by the coaches\n\n\nThese positions cannot logically coexist.",
        "upvotes": 49,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pnwdyn/incase_you_missed_it_here_is_laportas_lies_and/"
    },
    {
        "id": "1pn2qjr",
        "author": "Nyghl",
        "title": "How did Guler see this? Also what a team play by the Brazilians.",
        "content": "",
        "upvotes": 2526,
        "comments": 164,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lu41lhic0c7g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pn2qjr/how_did_guler_see_this_also_what_a_team_play_by/"
    },
    {
        "id": "1pn77jk",
        "author": "QuietFondant7523",
        "title": "Mbappe will pass Benzema. But will he become a Real Madrid legend?",
        "content": "",
        "upvotes": 539,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ixi5527mcd7g1.png?auto=webp&amp;s=9fc71c4f1d0391cb8de10a00795c7d7f732dfaaf"
        },
        "permalink": "/r/realmadrid/comments/1pn77jk/mbappe_will_pass_benzema_but_will_he_become_a/"
    },
    {
        "id": "1pnclf1",
        "author": "No-Independent2522",
        "title": "Perez: Yesterday against Alavés, the match was refereed by a referee who threatened to take action against our club on the eve of CDR final. And it seems that the interventions suffered by Vinícius and Rodrygo were not penalties. This is the latest episode in a long series of incidents this season",
        "content": "",
        "upvotes": 206,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pnclf1/perez_yesterday_against_alavés_the_match_was/"
    },
    {
        "id": "1pn14cm",
        "author": "Ready_Ad_1353",
        "title": "John Cena recent post on Instagram",
        "content": "",
        "upvotes": 1179,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xp5qgl66hb7g1.jpeg?auto=webp&amp;s=d666e9ae06725c43aca4e6c0844a38ba38734686"
        },
        "permalink": "/r/realmadrid/comments/1pn14cm/john_cena_recent_post_on_instagram/"
    },
    {
        "id": "1pnuhim",
        "author": "Hisense_Sports1",
        "title": "FIFA reveals Best XI forwards shortlist: Messi, Ronaldo, Mbappé, Haaland, Salah, Kane, Vinícius, Yamal… thoughts?",
        "content": "FIFA has officially released the forwards shortlist for the Best XI, featuring Messi, Ronaldo, Mbappé, Haaland, Salah, Kane, Vinícius Jr., Yamal and Dembélé.\n\nFrom a Real Madrid perspective, Vinícius Jr. and Mbappé all stand out after another decisive season on the biggest stages. Their impact in high-pressure matches, direct goal contributions, and importance to Madrid’s attack raise an interesting question:  \nWho are your picks — and what criteria matter most to you: trophies, stats, or big-game influence?",
        "upvotes": 15,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pnuhim/fifa_reveals_best_xi_forwards_shortlist_messi/"
    },
    {
        "id": "1pmzdcn",
        "author": "Scary-Procedure-6018",
        "title": "After all the disrespect he recieved, he still celebrates by kissing the badge.",
        "content": "Imo, our fanbase is definently spoiled if not the most spoiled fanbase itw, we can't face an obstacle without throwing fingers at random people and saying they're at fault.\n\nRodrygo scored 2 goals in 2 games so far and did the same celebration like he always does, kisses the badge and calls it a day. Anyone who doubted him in the first place is a clown, cuz there is no way that you watched this guy play games (not on insta reels) and still end up saying he's a \"waste\". Theirry henry went out on sky sports and said rodrygo is not normal. Jude bellingham himself went out and publicly called rodrygo the most talented player in the squad. \n\nYou can't blame a guy for not scoring in 32 games when he only started in 4 of them. Laliga today is just Barca, Real and 18 other teams that play nothing but low block football. You can't expect rodrygo to get subbed in and score a hattrick everytime. Vini hasn't scored in 12 games so far no one's making that much noise about it.\n\nHe came on against almaty in the 60-70th min and provided 2 assists. Went in to his 2nd ucl start this season against city and he immediately scored, is that a coincidence? I don't think so. The league is a very different story compared to the ucl, especially when its laliga.",
        "upvotes": 938,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n9anzu0iya7g1.jpeg?auto=webp&amp;s=08e712439f3a7690caad2d02510e56fc15d7911c"
        },
        "permalink": "/r/realmadrid/comments/1pmzdcn/after_all_the_disrespect_he_recieved_he_still/"
    },
    {
        "id": "1pngidl",
        "author": "Content-Drag-1499",
        "title": "It is everyone’s fault",
        "content": "I’ve been watching Real Madrid since 2000, and this era is starting to remind me of the Galácticos era.\n\nWe had unreal individual talent back then, but as a collective, it never truly clicked. I’m starting to feel the same pattern now: too much talent, not enough cohesion, and unclear leadership from the top.\n\nUpper Management\n\nThis situation starts with upper management. Their lack of clear and public support for Xabi is a major issue. We’ve seen this story before  it’s exactly why Zidane walked away during his second stint. When a coach feels like every match is a final, it creates fear, not progress.\n\nXabi is constantly under pressure, with the feeling that one bad result could cost him his job. Realistically, how many coaches can work intelligently and build something long-term under that threat? Upper management needs to be decisive: either fully back Xabi or just fire him and bring back Carlo lol.\n\nFlorentino also needs to be firm with Vini. Either sign the contract or accept reduced minutes. No one, regardless of talent, should be bigger than the club. If others are performing better or fitting the system, they deserve playing time.\n\nSquad planning has also been poor. Madrid should have signed more players. We are clearly short in defense  at least one or two more center-backs were needed —and we desperately need another midfielder who can consistently progress the ball and control tempo. Right now, we’re relying too much on individual brilliance instead of structure same as the Carlo era.\n\nPlayers\n\nSeveral players have been underperforming since last season, and not enough has changed. Jude needs to accept that replicating his 23/24 season is unrealistic. That season was exceptional, and asking him to carry the team again isn’t fair to him or the squad.\n\nVini hasn’t been at his best, and honestly, I think his contract situation is affecting him. He’s an emotional player, and when his head isn’t right, it shows. I believe once his future is settled, we’ll see a much better version of him again.\n\nThat said, Vini’s moment at El Clásico hurt the team’s morale. Leadership isn’t just about talent — it’s about composure. When emotions take over, the entire team feels it. Believe me I love Vini and I have every kit that he wore since he joined Real except this season. It breaks my heart to see him like this.\n\nDefensively, many of the goals we’ve conceded come from the same issue, half the team presses while the other half stands and watches. That’s not just a player problem  that’s a system and communication problem.\n\nXabi Alonso\n\nDespite everything, I’m still on Xabi’s side. He showed real promise earlier this season, and he’s been dealt with injuries, ego management, and a squad that wasn’t fully built for his ideas or players that want to believe in his system. \n\nI used to complain a lot about Carlo because we lacked a clear tactical identity. The “Carlo system” relied too heavily on individual moments, and that approach isn’t sustainable long-term. Xabi, at least, is trying to implement a structure  but structure takes time.\n\nThat said, Xabi isn’t blameless. He should have handled Vini better in El Clásico instead of ignoring the situation. Managing stars is part of the job at Madrid.\n\nI also criticize the constant lineup changes. While injuries explain some of it, stability matters. Players need chemistry, especially in midfield and defense.\n\nFinally, Xabi needs to recognize that Jude and Arda cannot play together if Jude is our number 10. The balance just isn’t there, and it hurts both players rather than helping either of them.",
        "upvotes": 45,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pngidl/it_is_everyones_fault/"
    },
    {
        "id": "1pncm4u",
        "author": "AlekhineAl",
        "title": "Happy to have Bellingham at 10 but disappointed to see Arda completely absent from any involvement whatsoever in the final third. He has created 8 BIG Chances this season, the THIRD most in La Liga 2025-26 and the MOST in Real Madrid. Surely there has to be a way?",
        "content": "The problem amplifies when defenders are not able to find him from the back or when they hoof it long to no one. Add to that the structural issues of the team going forward creates an abundance of pointless recycling from deep. No penetration is becoming an Achilles heel of the team and moments of spark are almost always against the run of  play. The frustrating thing is that even playing DLP in the Club World Cup, he was so much more involved in the attack\n\nIs there no principle or system which can utilise Arda’s creativity and long shots in the final third?",
        "upvotes": 66,
        "comments": 67,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pncm4u/happy_to_have_bellingham_at_10_but_disappointed/"
    },
    {
        "id": "1pn12u1",
        "author": "Ready_Ad_1353",
        "title": "[Popfoot] Kylian Mbappe becomes the player with the 4th most goals in a single calendar year in the 21st Century",
        "content": "",
        "upvotes": 347,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rmfi91nogb7g1.jpeg?auto=webp&amp;s=50ddafa0e3ec3985efb3c8b101f8f2ceb02b73d7"
        },
        "permalink": "/r/realmadrid/comments/1pn12u1/popfoot_kylian_mbappe_becomes_the_player_with_the/"
    },
    {
        "id": "1pmprda",
        "author": "No-Independent2522",
        "title": "Rodrygo score, Vini assists",
        "content": "",
        "upvotes": 1830,
        "comments": 157,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7wv29zj5o87g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmprda/rodrygo_score_vini_assists/"
    },
    {
        "id": "1pmo1ol",
        "author": "No-Independent2522",
        "title": "Mbappe opens the score 1-0 Alaves",
        "content": "",
        "upvotes": 1762,
        "comments": 130,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t6c58fyeb87g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmo1ol/mbappe_opens_the_score_10_alaves/"
    },
    {
        "id": "1pn1wht",
        "author": "chunchunmaru1129",
        "title": "Fans who can't stay with Real Madrid in their worst period are all glory hunters and false fans",
        "content": "I have been a Real Madrid fan for the longest time.I was there when Pep's Barcalona used to dominate us and humiliate us every time with scorelines of 5-0 etc...\n\nI was there during the chaotic Galactico era. \n\nI was there during the Pep vs Mourinho era. \n\nI was there during Ancelotii and Zidane dominating days. \n\nI have seen Real Madrid during their worse period as a team and I have seen them during their best period. \n\nI will always support Real Madrid even if tomorrow they become financially in debt like Barcalona.\n\nAlways and Forever Real Madrid. \n\nPeople who can't stay with the Club during their bad patch aren't real fans they are just glory hunters. ",
        "upvotes": 150,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pn1wht/fans_who_cant_stay_with_real_madrid_in_their/"
    },
    {
        "id": "1pmok93",
        "author": "No-Independent2522",
        "title": "Asencio get confused and kicks the wrong ball",
        "content": "",
        "upvotes": 1015,
        "comments": 47,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s404up7bf87g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmok93/asencio_get_confused_and_kicks_the_wrong_ball/"
    },
    {
        "id": "1pmrnjd",
        "author": "No-Independent2522",
        "title": "Thibaut Courtois: \"Saving a ball with my face? You have to give your life for this badge\"",
        "content": "",
        "upvotes": 571,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8g4ugrek297g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmrnjd/thibaut_courtois_saving_a_ball_with_my_face_you/"
    },
    {
        "id": "1pmqc2b",
        "author": "No-Independent2522",
        "title": "Vini penalty incident",
        "content": "",
        "upvotes": 494,
        "comments": 135,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bdbc0d4es87g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmqc2b/vini_penalty_incident/"
    },
    {
        "id": "1pmqoib",
        "author": "utopiaofavalon",
        "title": "It's that time of the year again.",
        "content": "",
        "upvotes": 475,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sndmv8q1v87g1.jpeg?auto=webp&amp;s=c223c659d9393bff9327be37eb44975130c07085"
        },
        "permalink": "/r/realmadrid/comments/1pmqoib/its_that_time_of_the_year_again/"
    },
    {
        "id": "1pnjbyd",
        "author": "jasminequila",
        "title": "supercopa in jeddah 2026",
        "content": "Any previous supercopa attendees here? Or someone who booked for the 2026 matches? I wanna know more about how early I need to be to book for the matches and which legit website I should buy them from/ I’d like to ask some questions about the process as someone coming from outside Saudi since they’re usually held there🙏",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pnjbyd/supercopa_in_jeddah_2026/"
    },
    {
        "id": "1pmv4ad",
        "author": "Hisense_Sports1",
        "title": "Rodrygo with back-to-back goals — are you satisfied with his recent performances?",
        "content": "Rodrygo finally has goals again.\n\nHe scored against **Man City in the UCL**, ending a **32-game goal drought**, and followed it up tonight with another goal — **76th minute away at Alavés**, giving Madrid a 2–1 lead.\n\nThis was also his **first La Liga goal in 329 days** (last one: January 19, 2025 vs Las Palmas), after **27 straight league games without scoring**.  \n**Are you satisfied with Rodrygo’s recent performances?**",
        "upvotes": 122,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmv4ad/rodrygo_with_backtoback_goals_are_you_satisfied/"
    },
    {
        "id": "1pmedxk",
        "author": "CoolIsopod3095",
        "title": "What a player he could have been for the club 💔",
        "content": "",
        "upvotes": 797,
        "comments": 70,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tf4ggslab67g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmedxk/what_a_player_he_could_have_been_for_the_club/"
    },
    {
        "id": "1pmly4b",
        "author": "scoreboard-app",
        "title": "Match Thread: Deportivo Alaves vs Real Madrid Live Score | LaLiga 25/26 | Dec 14, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pmly4b)",
        "upvotes": 84,
        "comments": 4849,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmly4b/match_thread_deportivo_alaves_vs_real_madrid_live/"
    },
    {
        "id": "1pmbmbn",
        "author": "ContextDry9672",
        "title": "journalist, is their a possibility that you might take over training the first team in the coming days?\n🗣️Arbeloa: \"No.\"",
        "content": "",
        "upvotes": 333,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oxj8way1k57g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmbmbn/journalist_is_their_a_possibility_that_you_might/"
    },
    {
        "id": "1pml1o7",
        "author": "FleukYT",
        "title": "Valdepeñas expected to start at LB tonight for Madrid per Marca",
        "content": "",
        "upvotes": 82,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/z2OU4bYaSyS0nk3TPvxmxaWcrNQwGO_cDYDtB7IBwnU.jpeg?auto=webp&amp;s=86d83eeb617ec03d97f732d7da867bfc28dda460"
        },
        "permalink": "/r/realmadrid/comments/1pml1o7/valdepeñas_expected_to_start_at_lb_tonight_for/"
    },
    {
        "id": "1pmlh4y",
        "author": "Sl_PROXY",
        "title": "Starting XI against Deportivo Alaves",
        "content": "",
        "upvotes": 77,
        "comments": 183,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmlh4y/starting_xi_against_deportivo_alaves/"
    },
    {
        "id": "1pmt6b3",
        "author": "_Ademola",
        "title": "Vinicius. A balanced overview of his past, current and future issues",
        "content": "I'll just take some words to talk about Vini. I might leave some questions unanswered and some lines of thought unexplored but here's what I think is a general overview of why he hasn't been playing well and what this means about him as a player, particularly in the future. Is he finished? Let's find out.\n\nForm is confidence, and vini is low on it atm. Take Rodrygo as an example. He scores no goals in 32 games but now has scored back to back. \n\nI'll state my perception of the reason why(he's low on confidence) but keep it brief. I think it's a combination of multiple things that hit its tipping point at the el clasico substitution.\n\nRemember, it's a confidence issue. My feeling is that it revolves around doubts about where he stands with the club and whether or not he's wanted here. There's a couple indicators of this. There's the ballon d'or mbappe signing, the club's unwillingness to commit to a contract with him. People use these things to criticize his mentality but these feelings ARE VALID when we apply context.\n\nVinicius has never been a weak-minded individual. We know that. We should not trivialize the impact these issues have and dismiss them. Ronaldo stated the following as his reason for leaving Madrid.\n\n&gt;I felt it inside the club, especially from the president, that they no longer considered me the same way that they did in the start.\n\nWe know Ronaldo is not a bum by any means, but even he left when he started to feel unloved &amp; unwanted, as he accurately gauged that it would affect his happiness and form.\n\nPlayers are not slaves. Even a good master knows to not ruin his servant's morale. However, we know the club can be ruthless at times. This isn't necessarily a good thing.\n\nRemember that vini was playing really well at the start of the season. He had 5G + 4A(1.08 g+a per 90) and started to get back to his very best. The team also did well in that moment. However, he was unexplainably benched or substituted in scenarios that didn't make sense. It certainly wasn't just mere rotation, neither was it due to form. I remember seeing opinions even then that Madrid were showing a \"power move\" by telling vinicius to either sign the contract or be replaced even without any signing needed. My own opinion was that it was either that or they had promised to give Rodrygo more LW minutes.\n\nThis happened multiple times until Vinicius blew up after the el clasico substitution. His behaviour was wrong and unacceptable, but understandable. We certainly can't pretend it was unwarranted either.\n\nI'm not saying it's the club(or xabi's) fault. Afterall we can't be absolutely sure that they're sending him those subliminal messages. However, for a while it looked like it. By the result, there's valid reasons to doubt if xabi did a good job managing those tensions.\n\nVini's gone out of form since, and though now he appears to have resolved things with Xabi he had already begun on a downward spiral that would always be tricky to recover from. I don't necessarily think they reconciled immediately after El Clasico but they certainly seem to have now.\n\nI think Xabi playing him consistently now is an attempt to fix their broken relationship and by effect his confidence. This is the right step IMO. There's many different reasons to criticize a player for not doing well. But when it's a confidence issue, good managers(or leaders in general) know to not ruin the player's mindset further and to instead show trust in them. Particularly when the player is quality and there are tangible reasons behind their decline in form. It usually is worth it when you believe your chances are better in the long-term with the player. \"**Form is temporary, Class is permanent**\".  \n  \nThe only issue I have is that while showing trust in him is the right move, some might agree that it now feels like an overcompensation and he's playing too many minutes. While xabi is obviously attempting to fix the situation, my personal opinion is that it would have been better if he hadn't contributed to it deteriorating in the first place.\n\nI still think things can turn out fine. Unlike a lot of opinions I've seen claiming that Vini &amp; Mbappe cannot work together(sometimes Jude is thrown in there as well), I think they both can work perfectly and make us clearly the most dangerous front line in Europe. I think losing either of them would be a downgrade. Remember that they each had 49 G+A and 41 G+A last season while being largely out of form for large chunks of it. This is very promising and should be remembered before we make claims that this project won't work. Though either can be replaced, it'd be a big loss if we fumbled either of these players in their prime.\n\nThat being said, neither player is perfect and both still have a lot to learn to play well as a duo. It's largely on Xabi to teach them and help them make that connection. I personally think he has under performed in this regard, although I won't go into details here. He's been trending in the right direction for a couple games now but at a time in the season his tactical requirements for both of them actually made things worse.\n\nThe major question remaining is whether or not the contract situation will get resolved. If it does, it'll be a huge boost for Vinicius. If it doesn't, he'll be forced to leave.",
        "upvotes": 20,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmt6b3/vinicius_a_balanced_overview_of_his_past_current/"
    },
    {
        "id": "1pmbsb3",
        "author": "Cemo137",
        "title": "A dream came true for me",
        "content": "I‘ll never had the cance to see Marcelo and Toni live, honestly i thought after they retired there is zero chance to see them and i was ok with it after a while, but weeks ago Toni and Marcelo decided to put on their shoes for a last dance on the pitch together in the Icon league and Boy i felt like a 6 year old on christmas waiting to rip open the presents 🤍",
        "upvotes": 187,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmbsb3/a_dream_came_true_for_me/"
    },
    {
        "id": "1pmbee2",
        "author": "madbunny89",
        "title": "Most of you aren't true RM fans",
        "content": "Hello to all the so called real fans.\n\nI used to come here all the time, checking the Real Madrid subreddit for the latest club news, updates about injured players, or simply to discuss matches with you. Lately though, I get irritated the moment I see what some of you are posting, and I honestly start wondering whether some of you are actually Barcelona fans in disguise, trying to create chaos here.\n\nAll I see are absurd questions like: would we be better without Mbappé? Or would Kane have been a better option instead? It feels like no matter how well the Frenchman performs, you still find reasons to go after him and criticize him.\n\nLast season you were glorifying Valverde and Jude, and now, almost overnight, you have turned your backs on them and want them replaced or sold. You complain nonstop about the state of the club as if you personally invested money and are now losing it because of the players. I have even seen attacks directed at Pérez. Fine, maybe we do not agree with every single decision he makes, but can we seriously not appreciate what we have? After Pérez is gone, you will all regret it, but by then it will be too late.\n\nThis subreddit is dominated by frustration, anger, and regret. Very few people actually stand by the players and the coach. Even fewer show real compassion and genuine love for the biggest football club in the world.\n\nReal Madrid, like any other team, goes through weaker periods. But because many of you are spoiled little bitches who grew up with Champions League trophies, Ballon d’Or winners, and league titles almost every year, the moment things get difficult, instead of acting like real supporters, you rush to Reddit to post all kinds of nonsense.\n\nI genuinely think many of you have forgotten who Real Madrid really are. And that happens because some of you are here only for appearances, or because you support a single player rather than the team as a whole.\n\nIt is time for all of us to show that we are true Real Madrid supporters, because being a true fan of this club is a privilege. Hala Madrid!",
        "upvotes": 162,
        "comments": 89,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmbee2/most_of_you_arent_true_rm_fans/"
    }
]