[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oaximx",
        "author": "SaltPomegranate4",
        "title": "The Perfect Neighbour is one of the most incredible documentaries I’ve ever seen.",
        "content": "Absolutely powerful. No narration. Just body cam footage acting as a first person account. Incredibly painful to watch. I cried a lot. \n\nThe anger that they didn’t arrest her. That they said “thank you” after she finally stood up to be taken to be charged. America has a big racism problem and it’s not just Susan Lorincz. \n\nIt’s an indictment on the US justice system that I had predicted she’d get away with it or given just a few years in prison. The absolute RELIEF when she got sent down. I hope she’s miserable for the rest of her days. \n\nWhat a beautiful community. I hope the boys and all the neighbours affected are supported through their pain. ",
        "upvotes": 525,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1oaximx/the_perfect_neighbour_is_one_of_the_most/"
    },
    {
        "id": "1ob7ipu",
        "author": "typetiming",
        "title": "something weird abt the perfect neighbor",
        "content": "Susan never talks about any of the other kids in the documentary. Out of all the kids that i could see maybe about 7 of them were black meanwhile there was an entire community of kids that were a mix of races from hispanic to white. \n\nI was honestly surprised the detectives didn’t bring up the fact that she only ever had issues with the black children and not the other children considering the parents of the other children, like that mom, would yell at Susan as well. I think them bringing this up might’ve strengthened their case about her obvious racism as well",
        "upvotes": 121,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1ob7ipu/something_weird_abt_the_perfect_neighbor/"
    },
    {
        "id": "1obhnyh",
        "author": "Longjumping_Land_977",
        "title": "The Perfect Neighbor: Susan Lorincz details her shocking crime in new interview from prison",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1obhnyh/the_perfect_neighbor_susan_lorincz_details_her/"
    },
    {
        "id": "1oaxz4z",
        "author": "JusHarrie",
        "title": "The Perfect Neighbour- What shocked me so much....",
        "content": "...was that this could have been any neighbourhood and could happen anywhere. I remember playing out in the village I was raised in as a child, and there was always one weird house where a scary adult would live. You and your friends would all avoid them at all costs, but sometimes a ball would just go into their garden by accident or you'd just be existing and they'd make your life a misery when they came out, etc. I forgot how scary that used to be as a child and this documentary really reminded me of that fear and power imbalance of an adult making you feel that way when you are just playing and having fun outdoors which should be such a magical part of childhood. I knew something horrible was going to happen in this situation of course, but for some reason I didn't think it would be such a cruel and barbaric murder like that for some reason. Yes, the lady is definitely mean, racist, angry and a nasty bully, but for her to take the life of that wonderful lady and mother, and leave those babies motherless just absolutely broke my heart, I just didn't see it coming. All of that loss and hurt over something minor. One minute they had their lovely mother just advocating for her children and defending them like she had every right to do so, and then next minute she was gone. Her life was lost, and those poor children of hers will never feel the same again. All over that evil lady, who had years to just go live somewhere else if she wasn't happy in a family neighbourhood.\n\nI don't know. It's just really broken my heart. It's just so senseless. ",
        "upvotes": 251,
        "comments": 180,
        "media": null,
        "permalink": "/r/netflix/comments/1oaxz4z/the_perfect_neighbour_what_shocked_me_so_much/"
    },
    {
        "id": "1ob5bpx",
        "author": "aspiringimmortal",
        "title": "WTF Netflix??",
        "content": "Netflix, my dude, explain something to me…\n\nHow on earth are you releasing Frankenstein **A WEEK AFTER** Halloween?\n\nI don’t understand. That’s like releasing a Santa movie in January. Do you hate money? Make this make sense?",
        "upvotes": 97,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1ob5bpx/wtf_netflix/"
    },
    {
        "id": "1ob2x5q",
        "author": "AdvancedDay7854",
        "title": "The Perfect Neighbor- What was the deal with Susan breaking down that fence",
        "content": "Felt it was kind of a loose end, but did Susan end up paying for that fence she broke through? Was it ever revealed why she did it other than her excuses? Did she feel emboldened because she’d ‘gotten away’ essentially with this to be more brazen? ",
        "upvotes": 123,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1ob2x5q/the_perfect_neighbor_what_was_the_deal_with_susan/"
    },
    {
        "id": "1obb73c",
        "author": "AdExtension917",
        "title": "Just watched the perfect neighbour",
        "content": "I'm 35 year old male and I haven't cried in 17 years for bad or for worst but when the dad tells the kids the mom isn't coming back man, I was crying like a baby.. And it got me thinking about when I was young and we'd play football in the street and there was one guy who always moved us on yet nobody else cared. It's wild what memories flood back to you but I'd urge everyone to watch this ",
        "upvotes": 22,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1obb73c/just_watched_the_perfect_neighbour/"
    },
    {
        "id": "1oblh6n",
        "author": "ShadowPaws200",
        "title": "Netflix is probably the best thing that's ever happened to me",
        "content": "I don't really have friends to hang out with and I'm currently unemployed and looking for a job. In the meantime I have Netflix and can binge hours and hours of shows to watch. A lot of them seem to be really good and can kill some time while I'm not working lol. Sure am gonna miss binging Netflix when I get a job  again. Right now I'm watching Breaking Bad and loving it ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oblh6n/netflix_is_probably_the_best_thing_thats_ever/"
    },
    {
        "id": "1ob5wlo",
        "author": "tellmestuffineed2kno",
        "title": "Perfect Neighbor",
        "content": "I have 30 minutes left in this documentary and WHY ISN’T THIS PIECE OF $HIT NOT IN JAIL YET????? I pray to God she doesn’t walk free. She was using the N word like it was nothing being interviewed by the detectives the first time. Evil. Pure evil\n",
        "upvotes": 25,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ob5wlo/perfect_neighbor/"
    },
    {
        "id": "1ob5tuk",
        "author": "gamblinonme",
        "title": "Boots is so fucking good",
        "content": "Idk how accurate the portrayal of Marine boot camp is but they did an amazing job of character development. They did a great job of addressing toxic masculinity, how men struggle with sexuality in the armed forces at any age, how young kids struggle with figuring out who they are and their purpose, loss, relationship dynamics and much more. Kudos to Netflix- can’t wait to read the book. ",
        "upvotes": 28,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ob5tuk/boots_is_so_fucking_good/"
    },
    {
        "id": "1obji7q",
        "author": "cass715",
        "title": "Netflix is just not truck driver friendly.",
        "content": "Me and my husband our long haul team truck drivers, we both stay on our truck for a month at a time and when we go “home” we stay with his parents one month and mine the next. We live in our truck. The update that requires you to be in the  “same household” completely stewed up our Netflix and I suppose we are just cancelling it at this point. We had been getting by without an issue until we took hometime and logged into it at my husbands parents, they have their own Netflix account and don’t use ours but now it’s saying we aren’t in the household when we are in the road.\n\nNetflix making this change is just really not traveler friendly, I understand why they made the change (although I think their corporate greed is disgusting). But it just doesn’t work for anyone who has a nomad lifestyle. It’s just a waste of money.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1obji7q/netflix_is_just_not_truck_driver_friendly/"
    },
    {
        "id": "1oblyr7",
        "author": "toebone_on_toebone",
        "title": "The Perfect Neighbor - Question",
        "content": "Was the woman in (what appeared to be) home security video footage who was walking around on a porch right before the shooting the same lady who was killed?  I was also confused about whose camera it was. I thought Susan didn't have cameras.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oblyr7/the_perfect_neighbor_question/"
    },
    {
        "id": "1oarvcp",
        "author": "689Dementia",
        "title": "The Perfect Neighbor, did everyone truly consent?",
        "content": "I’m feeling deeply uncomfortable about the fact that we have access to intimate footage from a tragic event involving dozens of children, parents, couples, and people who lost their mothers. For us, it’s \"entertainment\". For them, it’s their actual lives.\n\nThis documentary is currently trending on Netflix, but I can’t stop thinking: did everyone involved truly consent to having their trauma turned into a top-rated film?\n\nI’ve seen posts on Facebook from people close to the victims, and many of them are clearly upset. Some mention that one person may have agreed, and possibly received money for everyone(maybe just a rumors), but even if that’s true, does it justify broadcasting such personal pain?\n \n- What do we know about the consent process for this kind of media?  \n- Do you think it’s ethical to share such footage if only one person agreed?  \n- Where do we draw the line between public interest and exploitation?\n\nCurious to hear your thoughts.\n",
        "upvotes": 86,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1oarvcp/the_perfect_neighbor_did_everyone_truly_consent/"
    },
    {
        "id": "1oagjm6",
        "author": "Ok-Intention-4593",
        "title": "The Perfect Neighbor- where did Susan live before?",
        "content": "I just finished the perfect neighbor and it was horrifying. Susan was so consistently malignant and evil, it made me wonder where she lived before she moved to AJs neighborhood and if her prior neighbors have similar stories? Her next level insane behavior and repetitive but very similar lies (always fearing for her life, even as she is being placed under arrest) makes me think it’s not possible this HASN’T happened before? May she rot in prison, I’d bet my last dollar she’s terrorizing other inmates and guards daily. \nIf anyone knew her before I’d be curious to know your experience. I’m sad the law couldn’t have stopped this from happening but I don’t blame anyone but Susan. ",
        "upvotes": 617,
        "comments": 658,
        "media": null,
        "permalink": "/r/netflix/comments/1oagjm6/the_perfect_neighbor_where_did_susan_live_before/"
    },
    {
        "id": "1obkbxf",
        "author": "YanniqX",
        "title": "Does anyone remember this Asian film from a few years ago about a hikikomori girl?",
        "content": "There was a wonderful Asian film (that I saw a few years ago) about a hikikomori girl sleeping in her closet, and (maybe?) earning money by managing a website where she would spot and single out fashion items found in random pictures on the internet and then tell visitors t8 her site where to buy them ( I think). \n\nShe might have had an eating disorder in the past.\nShe would work on her website at night, frim her desktop computer in her room, and she would sleep during the day. There was a scene with her mother bringing food to her bedroom door in the evening, after work, at the time when the girl would wake up.\n\nMid-film or towards the end, the girl ventured out at night (I remember beautifully dark outdoor scenes in an empty urban space, under heavy rain, with the girl barefoot and in her white nightgown), maybe to bring something / to exchange messages through pieces of paper to a man (who was himself in a difficult life situation?) with whom she has somehow connected (maybe after watching him through binoculars, from her window?) and with whom she would 'talk' by using something (beans, maybe?) as 'code'.\n\nThe male character might have narrated the story, either from the beginning or at some point.\n\n[But I couldn't say exactly how much of the above is actually correct, and how much I'm 'filling up' myself!]\n\nThe film was beautifully written and shot, it was nocturnal, dreamy, haunting, it perfectly captured both the magic and the desperation and hollowness of (the girl's version at least of) hikikomori life.\n\nI remember a lush blue palette: the girl had decorated with blue items and fairy lights (I think) her closet (where she slept, on the floor, as in a tiny bedroom inside her room in her parents' house, that she treated as 'the rest of the apartment').\n\nI remember the look of the film vividly, but I can't remember or retrieve the title!   :(\n\nCan anyone help?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1obkbxf/does_anyone_remember_this_asian_film_from_a_few/"
    },
    {
        "id": "1obfrsi",
        "author": "imaregretthislater_",
        "title": "Are there any movies or shows that are like \"life hutch\" from love death and robots?",
        "content": "I saw this episode on a random video i was watching, and it interested me. So i watched it and its been one of the things i been craving to see, so what are other shows or movies like this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1obfrsi/are_there_any_movies_or_shows_that_are_like_life/"
    },
    {
        "id": "1oar7ff",
        "author": "Mylo_Does",
        "title": "I don’t start Netflix shows unless they’ve already finished",
        "content": "The OA being cancelled changed the way I watch streaming content. I thought I was watching one of the greatest stories of all time, as did many others. Now I can’t even recommend it to others because of the heartbreak.\n\nUnfinished stories are a big pet peeve of mine.\n\nAnyone else the same?",
        "upvotes": 66,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1oar7ff/i_dont_start_netflix_shows_unless_theyve_already/"
    },
    {
        "id": "1ob7z7t",
        "author": "TemporaryBarnacle307",
        "title": "The Perfect Neighbor",
        "content": "What kind of meds do you think old Susan was on?  She seems oddly angry and paranoid, and has this weird spaced out look the entire time.  Something seems off with her cognition    She just always looks robotic and blank ",
        "upvotes": 6,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1ob7z7t/the_perfect_neighbor/"
    },
    {
        "id": "1oao54e",
        "author": "Real-Ad-5297",
        "title": "Dr Susan Lorincz - delusional",
        "content": "The most frustrating part is her sat in the interrogation room saying 'No. I can't do this. I'm not going.'\n\nWhat the actual fuck. Delusional. \n\nThe most frustrating part is her sat in the interrogation room saying 'No. I can't do this. I'm not going.'\n\nWhat the actual fuck. Delusional. ",
        "upvotes": 52,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1oao54e/dr_susan_lorincz_delusional/"
    },
    {
        "id": "1ob4jzt",
        "author": "waynehastings",
        "title": "The Diplomat season three",
        "content": "I absolutely love The Diplomat. The writing is so good: funny, tight, smart. The acting is top notch. Somehow I missed that season 3 was released. I'm binge watching seasons 1 and 2 for the third time before starting 3. Who's with me? ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ob4jzt/the_diplomat_season_three/"
    },
    {
        "id": "1oaget4",
        "author": "Funny-Cup-9416",
        "title": "Alright Reddit, please cure my boredom, what’s something absolutely worth watching right now?",
        "content": "I want to watch something really good doesn’t matter if it’s new or old, but please no fantasy or political stuff.\n\nI watch thrillers, drama, crime, emotional stories.\n\nWhat’s that one show or movie that you guys think i should be watching tonight. \n\nI’m doing a night shift, so even if it’s a Tv Show it’s okay to me.\n\nPs: Women in the Cabin 10 sucks one of the worst films i’ve ever seen on Netflix.\n\nEdit: I finally decided to watch, “The perfect Neighbor”.",
        "upvotes": 134,
        "comments": 256,
        "media": null,
        "permalink": "/r/netflix/comments/1oaget4/alright_reddit_please_cure_my_boredom_whats/"
    },
    {
        "id": "1oaxtjl",
        "author": "Adelphos33",
        "title": "Perfect Neighbor - help me solve a debate between me and my wife - should PD have intervened more forcefully earlier?",
        "content": "My argument is that the police department should have had social workers or other officials intervene into what was clearly an escalating situation. Have them talk to the lady, the kids, and the kids parents, encourage the lady to move out (especially when they learned she had a gun, which was before the shooting happened), make sure the lady is on the appropriate meds, have a cop and a social worker observe the kids play, etc. Just repeatedly sending police to that situation should have resulted in the sheriff’s office escalating to some kind of intervention.\n\nMy wife basically says you can’t do that, and it’s pointless.\n\nAm I crazy to think the police department really failed the community here by not getting more involved?",
        "upvotes": 10,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1oaxtjl/perfect_neighbor_help_me_solve_a_debate_between/"
    },
    {
        "id": "1ob8cn3",
        "author": "InterviewCareful1784",
        "title": "THRILLER MYSTERY RECOMMENDATION",
        "content": "intense suspense murder mystery thriller soap opera original TV shows like desperate housewives with multi seasons and focused on solving murder and is fast paced",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob8cn3/thriller_mystery_recommendation/"
    },
    {
        "id": "1ob4xpi",
        "author": "bridgeb0mb",
        "title": "question about wayward? spoiler alert",
        "content": "this show confused the hell out of me, but i finished all 8 eps. so are we supposed to be led to believe Evelyn set Alex up to kill the first person he killed before they moved to twin pines? like, Evelyn set up the scenario so Alex would feel inclined to move to Twin Pines for a fresh start?\n\n\nthe only reason laurie can have a baby is because she did the leap thing, right? so Evelyn wanted both of the babies parents to do the leap? am i understanding this all correctly?\n\n\n\nin the beginning evelyn gives Alex a granola bar that she made. did the granola bar have whatever drug they use for leap in it? and then when alex gave the bar to riley and he ate it instead, he was crazy and that's why he tried to kill laurie? (or was it just a granola bar ???)\n\n\nare these things we are supposed to assume? admittedly i scrolled on my phone a lot while watching this show.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob4xpi/question_about_wayward_spoiler_alert/"
    },
    {
        "id": "1obbt3r",
        "author": "Rough_Abrocoma_5663",
        "title": "NEED A GOOD MOVIE!",
        "content": "Can yall recommend me some good movies on here? I feel like I been looking, but nothing seems to interest me. I’m a whatever genre kind of guy. I don’t wanna start a movie and it’s terrible ya know lol thanks in advance \n",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1obbt3r/need_a_good_movie/"
    },
    {
        "id": "1ob0g66",
        "author": "SplitNational2929",
        "title": "Netflix's The Perfect Neighbor is currently sitting at #1, ahead of KPop Demon Hunters",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ob0g66/netflixs_the_perfect_neighbor_is_currently/"
    },
    {
        "id": "1oa17bq",
        "author": "chunkybonks",
        "title": "The Perfect Neighbor - Dr. Susan Lorincz",
        "content": "Umm excuse me. What exactly was this murderer a “doctor” of? She only referred to herself as a doctor once and nothing comes up when you search for it. Anyone know?",
        "upvotes": 622,
        "comments": 1235,
        "media": null,
        "permalink": "/r/netflix/comments/1oa17bq/the_perfect_neighbor_dr_susan_lorincz/"
    },
    {
        "id": "1ob8mko",
        "author": "Niburu_Exus_4311",
        "title": "Does anyone watching on a phone also have this annoying glitchy top right corner?",
        "content": "More specifically, it looks like a barcode turned sideways, flashing different colors in a very fast-paced tempo. This glitch doesn't occur all the time, but it does occur most of the time.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob8mko/does_anyone_watching_on_a_phone_also_have_this/"
    }
]