[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 44,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qqm8bc",
        "author": "MattTheKing23",
        "title": "Netflix Had a Plan If Alex Honnold Died During Live Skyscraper Climb",
        "content": "",
        "upvotes": 679,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1qqm8bc/netflix_had_a_plan_if_alex_honnold_died_during/"
    },
    {
        "id": "1qqnyn5",
        "author": "Jumpy_Wing_7884",
        "title": "Anyone else feel sad when they outgrow a show? (me: Bridgerton)",
        "content": "I used to LOVE *Bridgerton*, but Season 4 just isn’t hitting for me anymore. Same thing happened with *You*. It’s not bad, I’m just… not as into it.\n\nKind of makes me sad because these used to be such comfort shows for me. 😅\n\nAnyone else go through this with shows they used to love?",
        "upvotes": 249,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1qqnyn5/anyone_else_feel_sad_when_they_outgrow_a_show_me/"
    },
    {
        "id": "1qqjrtn",
        "author": "Hefty_Shoe_7081",
        "title": "The Perfect Neighbor",
        "content": "I know this show has been talked about alot on this sub but I have some things I’d like to discussed that I don’t think have been discussed. \n1. Even if this lady was bothered by these kids (which believe me kids can be annoying especially in large groups) why did NO OTHER FAMILY had anything bad to say about these kids? These kids were playing, being kids, imagine what a miserable piece of garbage you have to be to be so bothered by children playing. \n2. Does anybody feel for her in the sense that mental health is something ignored in their country or was she just an awful person? (Was she schizophrenic, etc…) \n3. Why did it take somebody dying for something to happen? These cops had been here what, over 10 times? And nothing happened? \n",
        "upvotes": 67,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1qqjrtn/the_perfect_neighbor/"
    },
    {
        "id": "1qqwy8g",
        "author": "NavinRJohnson121479",
        "title": "Podcasts",
        "content": "Am I the only one who feels weird ***watching*** podcasts?  I’ve always thought of a podcast as something you ***listen*** to.\n\nI’m finding it hard to bring myself to watch any of them. ",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qqwy8g/podcasts/"
    },
    {
        "id": "1qqoe1g",
        "author": "SugaryFlump",
        "title": "Sense8",
        "content": "Why was Sense8 never renewed for a third season? Just rewatched it all for a second time and I forgot just how brilliant it is! Wish they’d bring it back, I’d love to see them all these years later with a new storyline. ",
        "upvotes": 30,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qqoe1g/sense8/"
    },
    {
        "id": "1qqxyex",
        "author": "IcyAssistance5535",
        "title": "WORST ROMMATE EVER DOC.",
        "content": "First off I just want to say these people are insane as fuck but what really made me want to come type on here was the last 2 episodes where they spoke on fucking Jamison Bachman, a serial squatter, he would find roommates to live with (eventually created a fake name Jed) and after a while stop helping with the rent. He was also very educated when it came to law stuff, so every time they wanted to have a protection order against him and things like that, he ALWAYS ALWAYS ALWAYS found a way to flip it on them, to the point where a couple of them would lose their own apartment to him!! Eventually he met his match and a girl had him sent to jail a couple times, his fucking brother bailed him out each time and I never knew why! Next thing you know, he kills his brother !! I think he had some sort of grudge or anger towards his brother, I’m not sure what it is I just know that his older brother became more successful then him. But he gets locked up for his murder, then fucking kills hangs him self before he really even got sentenced in 2017. He put these people through wayyyy too much to to sit there and cop out on life, he was evil as fuck . I usually don’t care too much when people kill themselves while waiting for their sentencing the way he did, but he was the lastttttt person to sit and have the opportunity to cop out on life the way he did. He was a smart psycho",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qqxyex/worst_rommate_ever_doc/"
    },
    {
        "id": "1qqqbmh",
        "author": "OrangeSpark16",
        "title": "Who is the most successful actor/actress to come from Netflix?",
        "content": "Reworded, who is the most successful actor/actress that got their break on Netflix? I saw a post about a new Noah Centineo movie and it got me thinking about this question. My first thought was Jacob Elordi coming from Kissing Booth. He's nominated for an Oscar this year, coincidentally because of his performance in a Netflix movie! I would also consider Millie Bobby Brown. While she's only been on Netflix shows/movies, it's undeniably given her a lot of fame. Do y'all agree/disagree?",
        "upvotes": 12,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1qqqbmh/who_is_the_most_successful_actoractress_to_come/"
    },
    {
        "id": "1qpx47n",
        "author": "Pawssabillitysawait",
        "title": "Anyone else like the show Derry Girls?",
        "content": "For some reason i never hear anyone ever talk about this show, it is hilarious and so well written (at least in my opinion) and i absolutely adore it. It’s a spectacular comedy show and am so bummed it’s only 3 seasons!",
        "upvotes": 446,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1qpx47n/anyone_else_like_the_show_derry_girls/"
    },
    {
        "id": "1qqz33w",
        "author": "hardlybroken1",
        "title": "Twin Flames Universe",
        "content": "I just watched this again, and it was still just as shocking as it was when it first came out.\n\n Does anyone have an update on the investigation of Jeff and Shelaila? I see their home was raided last July but I cant find anything more recent than that.  ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqz33w/twin_flames_universe/"
    },
    {
        "id": "1qqhpx5",
        "author": "Extro-shy1401",
        "title": "Grace &amp; Frankie",
        "content": "This has become my comfort show, i don’t rewatch anything so I really take them seriously &amp; miss them seasons before the final one.\n\nWell, this show has actually portrayed the importance of having genuine friends around you, more than importance it is about how lucky it is to have a grace or a frankie in life.\n\nIt has really shown me that sometimes there’s nothing wrong with a person but just the company. Everyone have their flaws &amp; pros but friends are people who just don’t care about your pros and flaws but only about your happiness. \n\nI loved the show for its quirkiness, rawness of being a human, being old, depiction of love that is unconditional, personalities such as grace &amp; brianna, i personally relate with them.\n\nGood show! Watching it feels like I’m close to my family when I’m far away. ",
        "upvotes": 20,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qqhpx5/grace_frankie/"
    },
    {
        "id": "1qqdp9v",
        "author": "fuckindisturbed",
        "title": "Hidden gems of Netflix",
        "content": "Netflix has a short film called if anything happens, I love you, and it completely made me cry like UGLY cry I was going to continued and watch all the empty rooms but I don’t think my heart can take all of this. There are a lot of good short films on Netflix even if you don’t want to you should watch a few they might change your outlook on life love and whatever else. Just give it a change and you’ll come out a better person. ",
        "upvotes": 21,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qqdp9v/hidden_gems_of_netflix/"
    },
    {
        "id": "1qqpi51",
        "author": "Prestigious-Back-981",
        "title": "Netflix Will Stream ‘The Secret Agent’ in Brazil, Opens New São Paulo Headquarters",
        "content": "&gt;“The opening of our new São Paulo office is a natural next step in the journey our local team has built over the past 15 years alongside Brazil’s creative community,” said Netflix co-CEO Greg Peters, who flew in for the opening ceremony. “We support Brazilian films in multiple ways because we want to be the best partners and stay flexible so local producers can decide the best way to bring their projects to life,” he said. “That’s why we were so excited to partner with ‘The Secret Agent’s’ producers to help fund the film and pre-license it for Netflix in Brazil.\"\n\n&gt;“The Secret Agent” garnered four Academy Awards nominations, including Best Film, Best International Film, Best Actor (Wagner Moura) and Best Casting. Moura has already won the distinction of being the first Brazilian thesp to win a Best Actor Golden Globe.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqpi51/netflix_will_stream_the_secret_agent_in_brazil/"
    },
    {
        "id": "1qqtzli",
        "author": "Longjumping_One_3079",
        "title": "Netflix recs?",
        "content": "I’ve been home a lot more these days because of remote work. I'm looking at some shows that I'm interested in. Any Netflix recommendations you’d say are truly worth watching? For reference, I recently enjoyed Love Is Blind and Emily in Paris :)",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qqtzli/netflix_recs/"
    },
    {
        "id": "1qqxpnn",
        "author": "captainn_chunk",
        "title": "Is my browser’s settings affecting what Netflix shows me is available to watch?",
        "content": "I’ve been using a laptop to access Netflix for the last several months when I’ve predominantly used an Apple TV or Xbox app to access Netflix over the last decade and on the laptop it seems like my available library to choose from is *significantly* less diverse than what I can view on the other two devices.\n\nAnother example is that if I were to use my girlfriends Netflix app on her Apple TV, she’s shown what looks like an endless choice of options on tv content that I will never see on my laptop. And comedically of course, it’s almost all entirely female character driven shows and movies that she sees compared to what I see. But even then, those same shows are not portrayed anywhere on mine.\n\nIt’s almost like on my laptop I get the same 20-30 movies no matter how I try to divide up the genre search.\n\nDoes this sound like a browser setting due to maybe privacy settings as if my region isn’t fixed?  I’ve even gone so far to wonder if this is potentially a network thing and it just doesnt want to load more options.\n\nEdit: just went to check what shows up on my phone app and it’s almost the same type of thing. *Many* shows and movies show up there that aren’t on my laptop browser options.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqxpnn/is_my_browsers_settings_affecting_what_netflix/"
    },
    {
        "id": "1qqwdim",
        "author": "That-Investigator140",
        "title": "is there any good crime show (not money heist) that i shoud watch",
        "content": "i posted a few days ago and i liked what this sub reddit is so can someone give me a good crime show for me to watch  cuz i loved money heist and it was my fav show for a good bit till in watched beast in me  ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqwdim/is_there_any_good_crime_show_not_money_heist_that/"
    },
    {
        "id": "1qq1sdj",
        "author": "messengers1",
        "title": "'Gundam' Live-Action Pic Starring Sydney Sweeney Lands At Netflix",
        "content": "After One Piece, another well known animation IP is coming up for live action and possible as franchise if it is a hit. However, Sweeney is not really in my casting list.",
        "upvotes": 55,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1qq1sdj/gundam_liveaction_pic_starring_sydney_sweeney/"
    },
    {
        "id": "1qp894z",
        "author": "Salty_Pangolin_6163",
        "title": "Netflix Faces Backlash After Famous Climber Discloses Low Pay For 500-Meter Skyscraper Climb",
        "content": "",
        "upvotes": 1993,
        "comments": 383,
        "media": null,
        "permalink": "/r/netflix/comments/1qp894z/netflix_faces_backlash_after_famous_climber/"
    },
    {
        "id": "1qqumki",
        "author": "SquareDrive45",
        "title": "so 1.7 mbps AV1 = 10.84 mbps HEVC in terms of perceivable quality??",
        "content": "So Netflix is streaming a particular movie in 4K SDR with 1.7 mbps AV1 video stream on its native app on lg oled and the same movie is streamed with 10.87 mbps HEVC 4K SDR video stream on another TV which has no AV1 support.\n\nTheoretically AV1 is about 30% more efficient than HEVC. By that logic shouldnt they provide atleast 7 mbps stream for TVs which support AV1? Or is their logic of \"no perceivable quality difference\" despite 70% less bandwidth with AV1 is really true? I cant seem to agree with that.\n\nWhy punish people with better hardware to save your bandwidth, NF?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qqumki/so_17_mbps_av1_1084_mbps_hevc_in_terms_of/"
    },
    {
        "id": "1qqx2cl",
        "author": "User613111409",
        "title": "Inappropriate ads?",
        "content": "is there anyone else getting inappropriate ads when you’re watching family shows\n\nI keep getting an ad for KY yours, and mine lube. Super awkward when you are watching TV with a 13 year old",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qqx2cl/inappropriate_ads/"
    },
    {
        "id": "1qqs0pq",
        "author": "PrizeStructure2467",
        "title": "[Edge] Building the ultimate \"Productive\" streaming setup for Netflix/Prime – Need stable extension recommendations",
        "content": "I use Microsoft Edge for streaming, and I want to build a complete power-user setup that covers every aspect of the player. I’m tired of installing random extensions that break the site or cause lag.\n\nI am looking for the best, most stable extensions for **Netflix and Amazon Prime** that handle the following needs without side effects:\n\n1. **Playback &amp; Speed:** Reliable speed controllers (like Global Speed) that work smoothly for speeding up slow content without distorting audio.\n2. **Automation:** Extensions that actually work to auto-skip intros, recaps, and Prime Video pre-roll ads so I don't have to touch the mouse.\n3. **Subtitle Power:** Tools for dual subtitles (for learning) or better subtitle customization (font/size/background) beyond the default settings.\n4. **Audio Enhancement:** Volume boosters or equalizers for movies with low dialogue volume.\n5. **Visual Tweaks:** Video filters (brightness/contrast/saturation) for dark scenes and Ultrawide monitor support (to remove black bars).\n6. **Quality Control:** forcing 1080p/4K bitrate without triggering DRM black screens.\n\nBasically, I want a \"Swiss Army Knife\" setup that makes streaming efficient and customizable.\n\nIf you have a specific list of extensions that play nice together on Edge, please share them!\n\nThanks.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqs0pq/edge_building_the_ultimate_productive_streaming/"
    },
    {
        "id": "1qqrvg2",
        "author": "cadence_99",
        "title": "Warrior Nun",
        "content": "I just finished watching second season of Warrior Nun and realised that netflix cancelled s3. But why? I think the series is pretty good, not great but i enjoyed it while it lasted. I think they should continue it. \nJust feeling a bit disappointed. I was curious with what's going on with the Reya part tho.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqrvg2/warrior_nun/"
    },
    {
        "id": "1qqqwu6",
        "author": "902Gal",
        "title": "Slimy promotion of Spinning Out in 2026",
        "content": "Netflix is promoting Spinning Out on my home page and it makes me irrationally angry because I loved this show when it came out and was so sad when they didn’t renew it after the first season. To see them promote it again 6 years after its release just because ice skating is getting hyped up with the Olympics coming up again and they have another new ice skating show makes me crazy.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qqqwu6/slimy_promotion_of_spinning_out_in_2026/"
    },
    {
        "id": "1qqigjp",
        "author": "rackemronnie7",
        "title": "Any good romantic movies on netflix right now?",
        "content": "I’m in the mood for a good romantic movie, but I’m kind of out of the loop with what’s available lately. Does anyone have any recommendations for romantic movies on Netflix that are a must-watch? I’m into everything from classic love stories to newer releases. Would love to hear your favorites!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qqigjp/any_good_romantic_movies_on_netflix_right_now/"
    },
    {
        "id": "1qqmxvp",
        "author": "mo_7anona",
        "title": "Bigger budget doesn’t mean better fantasy",
        "content": "&gt;\"The Letter for the King\" had a much smaller budget, but it felt more focused in its storytelling, character arcs, and overall direction. In comparison, The Last Knight of the Seven Kingdom clearly benefits from a huge production budget and looks \"impressive\", but for me it lacked the same narrative cohesion and emotional weight.  \n  \n**big budget ≠ quality**\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qqmxvp/bigger_budget_doesnt_mean_better_fantasy/"
    },
    {
        "id": "1qqvxs6",
        "author": "docstarr",
        "title": "Netflix style documentaries suck",
        "content": "I am not a fan of Netflix style documentaries at all​ mainly because the topics that they use for documentaries include some sort of crime or a recent event. These are not very educational at all. I agree there are some nature-based documentaries. But give us more historic based documentaries or documentaries based on space, physics, foreign cultures or some other exciting topics. Other annoying thing is that they all follow same template where for most part of the documentary an 'expert' will be looking into the camera (The office style) and talking. Like they have so much budget, they could definitely use some b-roll or something during narration. Documentaries on national geographic or BBC are way more engaging. Honestly some of the YouTube channels make better content than Netflix (like Ruhi Cenet or Explore with us). \n\n  \nEnd of rant ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qqvxs6/netflix_style_documentaries_suck/"
    },
    {
        "id": "1qpp1xi",
        "author": "AmIbi69",
        "title": "Go watch Future man",
        "content": "Great show. never hear anybody recommend it. The series follows an underachieving janitor who is called upon to save the world. It's fucking hilarious. ",
        "upvotes": 69,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qpp1xi/go_watch_future_man/"
    },
    {
        "id": "1qq4slj",
        "author": "skibidi_i3",
        "title": "Bridgerton S4 or Cinderella?",
        "content": "Did they reallyyyyyy just copy the script of Cinderella?????  OHMYGOD what\nBridgerton Season 4 seems like a copy of Cinderella and like they didn’t even try to make some changes or what?! ",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qq4slj/bridgerton_s4_or_cinderella/"
    },
    {
        "id": "1qqdujs",
        "author": "fuckindisturbed",
        "title": "Mantis Korean movie",
        "content": "I know some people don’t like watching Korean movies or shows but I promise this one and kill boksoon are a must watch. The English dubbed is not that bad for mantis, so if you don’t want to listen to it Korean you can still enjoy it in English. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqdujs/mantis_korean_movie/"
    }
]