[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 7,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1o4nvse",
        "author": "Terrible-Ice4984",
        "title": "Tessera GTT",
        "content": "Buongiorno, che qualcuno sappia c'è un metodo - che sia tramite App o sito - per poter usare la tessera bip GTT da cellulare, senza averla fisica?",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o4nvse/tessera_gtt/"
    },
    {
        "id": "1o4oudw",
        "author": "fuckyoualess",
        "title": "Accademia Albertina di Torino",
        "content": "Ciao, per caso qualcuno qui studia all’accademia Albertina? ho qualche domanda, in particolare sul corso di cinema, fotografia e audiovisivo",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o4oudw/accademia_albertina_di_torino/"
    },
    {
        "id": "1o4otp5",
        "author": "DANKLEBERG_66",
        "title": "Cerco un ostello economico per un gruppo di 30 giovani",
        "content": "Ciao tutti,\n\nDevo organizzare un viaggio all’estero per 30 persone e ho bisogno di capire cosa sia fattibile. Abbiamo un budget di circa 15-30 euro a notte a persona per l’alloggio, ma non riesco a trovare nulla di simile a Torino. Forse avete dei consigli o raccomandi?",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1o4otp5/cerco_un_ostello_economico_per_un_gruppo_di_30/"
    },
    {
        "id": "1o4nf5c",
        "author": "Appropriate-Net-6030",
        "title": "Trasporti",
        "content": "Ciao la faccio breve, da buono studente under 26 ho fatto l'abbonamento gratuito ai mezzi e richiesto la carta bip senza particolare attenzione e con abbastanza fretta. Fattostà che, pare che l'isee della mia famiglia potrebbe sforare gli 85000 e ieri, facendo la stessa procedura per mio fratello ho notato che ce scritto che dichiarare il falso è reato (per carità potevo immaginarlo ma pensavo che il programma controllasse automaticamente prima di accettare la richiesta o comunque che ti avrebbe annullato la carta al primo controllo) e quindi che ci saranno sanzioni se fai ciò. Io ho eliminato il mio account bip ma non so se basta. Cosa posso fare? (Tranne prendermela nel culo)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o4nf5c/trasporti/"
    },
    {
        "id": "1o4lw5q",
        "author": "gufoscientifico",
        "title": "Negozio di modellismo gunpla",
        "content": "Salve, mi sono trasferito a torino da poco più di una settimana e sto cercando un negozio di modellismo che venda gunpla (modellini di plastica assemblabili senza colla che non sono da pitturare) ma su maps mi sembra di vedere solo negozi di modellismo statico tradizionale.\nQualcuno sa consigliarmi un negozio o devo rassegnarmi a comprare online?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o4lw5q/negozio_di_modellismo_gunpla/"
    },
    {
        "id": "1o4q0eo",
        "author": "Magnoliavecchia",
        "title": "Restaurant in Torino",
        "content": "Ciao Tutti,\nVorrei andare a Torino per qualche giorni . Conoscete buoni ristoranti con buoni tipici piati Piemonte e una tipica  atmosfera italiana.?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o4q0eo/restaurant_in_torino/"
    },
    {
        "id": "1o4puyo",
        "author": "Similar_Profit_7298",
        "title": "ToMove",
        "content": "Salve, anche voi avete problemi con l'app ToMove di GTT? Non riesco né a bippare il biglietto e né a fare la autoconvalida, per la prima semplicemente la macchineta per bippare non rileva nulla e nel secondo caso mi dice che \"si è verificato un errore\". È mai successo anche a voi?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o4puyo/tomove/"
    },
    {
        "id": "1o407e4",
        "author": "Iaco_V8",
        "title": "Ma perché i giardini della cavallerizza sono chiusi da così tanti anni?",
        "content": "Da piccolo, non ricordo se fosse alle elementari o alle medie, ero stato ai Giardini Reali e avevo trovato chiuso il ponticello su viale Primo Maggio, quello che collega i Giardini della Cavallerizza con il resto dei giardini reali alti. \nPensavo che l'avrebbero riaperto presto.  \n\nOra che frequento le superiori proprio lì vicino, vedo che è ancora tutto chiuso.  \nSapete cosa stanno facendo? Lo riapriranno prima o poi?  \n\nHo notato che ci sono dei lavori in corso e ho sentito dire che vogliono collegare i Giardini Reali alti con quelli bassi.\nPotrebbero forse collegarli dai Giardini della Cavallerizza?\nIn effetti, ho visto un sentiero che parte dalla casetta del Circolo degli Artisti e si dirige proprio da quella parte...",
        "upvotes": 43,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1o407e4/ma_perché_i_giardini_della_cavallerizza_sono/"
    },
    {
        "id": "1o4cqwo",
        "author": "Illustrious_Rule_593",
        "title": "Convertire permesso di soggiorno per studenti in permesso di soggiorno per lavoro",
        "content": "Ciao ragazzi, qualcuno ha esperienza nella conversione del permesso di soggiorno per studi in permesso di soggiorno per lavoro? Qual è il vostro suggerimento per chi volesse farlo?\n\nin generale quale strada suggerisci? \n1) permesso di soggiorno per studio -&gt; permesso di soggiorno per lavoro\n2) permesso di soggiorno studi -&gt; permesso cerco lavoro -&gt; permesso dí soggiorno per lavoro",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1o4cqwo/convertire_permesso_di_soggiorno_per_studenti_in/"
    },
    {
        "id": "1o4jo3m",
        "author": "jaydkali",
        "title": "Serate a torino",
        "content": "Sono un organizzatore di eventi e serate e volevo farvi una domanda, come mai gli under 30 vanno molto meno in discoteca ? ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1o4jo3m/serate_a_torino/"
    },
    {
        "id": "1o4hte7",
        "author": "Ferbang",
        "title": "Dipendenza da pumpkin spice latte",
        "content": "Ciao a tutti\nLa mia ragazza si è trasferita da poco a Torino e autunno per lei vuol dire pumpkin spice latte. A parte Starbucks, conoscete qualche buon bar o posto simile che fa questo tipo di cose? \nIeri siamo andati da Orso vicino il parco Valentino e addirittura ci hanno detto che la cioccolata calda è ancora fuori stagione🥲",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1o4hte7/dipendenza_da_pumpkin_spice_latte/"
    },
    {
        "id": "1o45gr8",
        "author": "Damonyr",
        "title": "Ristoranti tra Venaria e zona nord di Torino",
        "content": "Ho cercato nel sub ma non ho trovato molto.\nSiamo in 7 e domani partiremo attorno alle 12:30 da Borgaro Torinese. Cerchiamo un posto buono e che non sia dall'altra parte di Torino in cui mangiare, va bene anche fuori città. Avete qualcosa da consigliare? :)",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o45gr8/ristoranti_tra_venaria_e_zona_nord_di_torino/"
    },
    {
        "id": "1o47vcn",
        "author": "Mysterious-Bother665",
        "title": "Codice sconto",
        "content": "Buongiorno, qualcuno ha dei codici sconto per i viaggi con chiesa viaggi? Grazie ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o47vcn/codice_sconto/"
    },
    {
        "id": "1o3vhhr",
        "author": "giggi1276",
        "title": "Foresteria a Torino",
        "content": "Ciao, tra due mesi dovrò andare a Torino per lavoro per qualche tempo, diciamo tra i due e i quattro mesi. Dovrò organizzarmi da solo la sistemazione. Che voi sappiate esiste qualcosa tipo foresteria? Airbnb spenderei troppo, affitti penso nessuno mi affitterebbe per così poco. La zona dovre dovrei lavorare è lingotto, ma penso di portarmi la macchina quindi potrei anche spostarmi a sud verso Moncalieri (non conosco la città non so quanto spostandosi fuori sia più facile trovare). Altre idee? Grazie mille",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o3vhhr/foresteria_a_torino/"
    },
    {
        "id": "1o421ip",
        "author": "Mother_Leg2641",
        "title": "Concerto Radiohead 15nov",
        "content": "Qualcuno è riuscito a prendere i biglietti per questa data? Scrivetemi, almeno potremmo farci compagnia a Bologna! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o421ip/concerto_radiohead_15nov/"
    },
    {
        "id": "1o2vxi5",
        "author": "happy_arounding15",
        "title": "Il Valentino è il parco più bello d'Italia. Change my mind",
        "content": "",
        "upvotes": 215,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e5nuraw939uf1.png?auto=webp&amp;s=13c5b942be5eeff09a2018cc78b076cd16e33d87"
        },
        "permalink": "/r/torino/comments/1o2vxi5/il_valentino_è_il_parco_più_bello_ditalia_change/"
    },
    {
        "id": "1o3qkb2",
        "author": "Vegetable-Tie-944",
        "title": "Pranzo all'aperto!",
        "content": "Ciao!  \nconsigli su ristorantini, piole, cascine in cui pranzare in mezzo a un po' di verde (fiume, parchi, collina) o comunque con una bella vista o giardino all'aperto e non in mezzo alla strada?   \nAnche nei dintorni di Torino.  \nGrazie!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o3qkb2/pranzo_allaperto/"
    },
    {
        "id": "1o3crwo",
        "author": "Bimba_Italiana",
        "title": "A favore o contro il ritrasferimento a Torino?",
        "content": "Buongiorno a tutti, il mio Italiano non è così buono quindi abbiate pazienza mentre spiego.\nSono una studentessa (22F) all’università in Canada, studio educazione per diventare una maestra di scuola. Mi laureo nella primavera del 2027 e sto pensando di ritornare a Torino per insegnare per un paio di anni. Prima di prendere una decisione, vorrei sapere se l’Italia, e Torino in particolare, sono ancora ambienti accoglienti per stranieri di colore. (Mi considero straniera, anche se sono nata e cresciuta li, ma era solo per circa 11 anni.)\nHo dei bei ricordi della mia infanzia lì, ma sono preoccupata di poter aver difficoltà a reintegrarmi da adulta. Non del tutto, ma in parte a causa del governo in carico e dell primo ministro, Georgia Melone che fa parte del gruppo politico conservatore di Fratelli d’Italia. No ho sentito tante opinioni positive e farò più ricerche online ma voglio sapere da persone presente nel paese.",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1o3crwo/a_favore_o_contro_il_ritrasferimento_a_torino/"
    },
    {
        "id": "1o2w3xf",
        "author": "Dontcallmebaby2",
        "title": "Esiste un qualche libro, una guida, su tutte le insegne e attività commerciali storiche di Torino?",
        "content": "",
        "upvotes": 19,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8uh46b8959uf1.jpeg?auto=webp&amp;s=3578ded6affa2d629c92d599c009c26c746446b9"
        },
        "permalink": "/r/torino/comments/1o2w3xf/esiste_un_qualche_libro_una_guida_su_tutte_le/"
    },
    {
        "id": "1o2yp9h",
        "author": "Proof_Afternoon_5370",
        "title": "A Torino nasce la nuova casa per l'Intelligenza Artificiale - Un Centro innovativo, primo in Italia: ecco il progetto - TorinoNews24 - Notizie da Torino",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/__QqIDb5oVkYVnOqy7dqkUbv9X2Onh9bvi0Wj6r5Qq0.jpeg?auto=webp&amp;s=03d6734725a14981d9d5beceee4384a427297177"
        },
        "permalink": "/r/torino/comments/1o2yp9h/a_torino_nasce_la_nuova_casa_per_lintelligenza/"
    },
    {
        "id": "1o2w9hf",
        "author": "Subject-Store-1982",
        "title": "Pro e contro di vivere a Torino?",
        "content": "Ciao ragazzi io sto valutando alcune città in cui trasferirmi, e tra queste c'è anche Torino.\nVolevo chiedere a chi abita a Torino se mi può dire i suoi pro e contro nel vivere a Torino.\nPremetto che sono un ragazzo giovane quindi sono interessato al fatto che ci siano eventi/feste nella città. E anche come valutate il mondo lavorativo a Torino.\nLa consiglieresti?e  se ci abitate vorresti andarvene e se si perché?\nGrazie mille ",
        "upvotes": 12,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1o2w9hf/pro_e_contro_di_vivere_a_torino/"
    },
    {
        "id": "1o35ltx",
        "author": "PlanetMars0118",
        "title": "Elettricista",
        "content": "Ciao a tutti, \n\nIo e il mio ragazzo avremmo bisogno di spostare una presa elettrica: ovvero, nella stanza matrimoniale è presente una presa che si ritroverebbe dietro il letto ma vorremmo ricavarne due che andrebbero ai lati per i comodini. \nSi tratterebbe di spaccare il muro, lavorare con i cavi e poi ristuccare. \nConoscete elettricisti di fiducia? Solitamente gli elettricisti si occupano anche di stuccare (chiedo nella mia ignoranza)? \n\nGrazie in anticipo ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o35ltx/elettricista/"
    },
    {
        "id": "1o3blxd",
        "author": "Virtual-Marzipan9664",
        "title": "amic* a Torinoo",
        "content": "Ciao! Ho 21 anni e mi sono appena trasferita a Torino per studiare. Non conosco ancora nessuno qui, quindi mi farebbe un sacco piacere fare nuove amicizie. Se vi va di uscire, prendere un caffè o una birra, fare una passeggiata, andare al mercato... scrivetemi! ",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1o3blxd/amic_a_torinoo/"
    },
    {
        "id": "1o37mvk",
        "author": "eddz_",
        "title": "Trying to buy furniture. Need help",
        "content": "Hello so I am rather new living in turin and I am looking to buy furniture specifically a desk and a chair for studying. Can someone advice me like a good store that has cheap prices as I dont really know any to be honest.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o37mvk/trying_to_buy_furniture_need_help/"
    },
    {
        "id": "1o30spj",
        "author": "verdemanzia",
        "title": "Shoegaze e amici",
        "content": "C’è qualcuno qui che adora lo shoegaze? Mi piacerebbe fare amicizia con appassionati del genere che magari sappiano anche suonare qualche strumento per tirare su un gruppetto! ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1o30spj/shoegaze_e_amici/"
    },
    {
        "id": "1o21zjd",
        "author": "Jess_in_Peace",
        "title": "Non sono di TO, ma la Libreria Luxemburg è uno dei miei luoghi del cuore nel mondo. Con tristezza ho appreso la notizia che avrebbe cambiato location. È già avvenuto? Dove andrà?",
        "content": "",
        "upvotes": 68,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j4k48oxl82uf1.jpeg?auto=webp&amp;s=a4281ac7db0e84190d838b6af34902e03821973c"
        },
        "permalink": "/r/torino/comments/1o21zjd/non_sono_di_to_ma_la_libreria_luxemburg_è_uno_dei/"
    },
    {
        "id": "1o2bfeb",
        "author": "Worried_Childhood_67",
        "title": "Medico di base per malattia",
        "content": "Ciao a tutti, sto cercando disperatamente un medico di base da cui non sia un inferno prendere una malattia quando non si può andare a lavoro. Non mi riferisco a \"finte malattie\" ma fin'ora ne ho provati due che:\n\n-una è impossibile da contattare, ti dà appuntamento due settimane dopo costringendoti ad andare in guardia medica la sera. \n-uno riceve senza appuntamento ma ogni volta ci sono venti vecchietti in fila e in meno di tre ore non si fa nulla. \n\nIl sogno sarebbe un medico che mi dia il protocollo al telefono senza visita, ma anche uno con visite organizzate in modo decente andrebbe bene. \n\nSono in zona Vanchiglietta ma sono disposto a spostarmi per inseguire questa utopia. \n\nGrazie a tutti. ",
        "upvotes": 14,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1o2bfeb/medico_di_base_per_malattia/"
    },
    {
        "id": "1o23oex",
        "author": "CriticismOk9306",
        "title": "Salsicce di pollo ma non c'è il pollo dentro.",
        "content": "Da Ekom vendono queste salsicce di pollo fresche, (che fresche non sono, visto che poi sono uscite da confezioni enormi e non fatte al momento) chiedo per curiosità gli ingredienti visto che le ho viste particolarmente rosa, e l'inserviente legge molto impaurito gli ingredienti, saltandoli.   \n  \nAlla fine mi sono fatta dare la confezione (fresche? mhh) con l'etichetta sopra e gli ingredienti delle SALSICCE DI POLLO erano:  \n27% tacchino 50% PANCETTA DI MAIALE, rimanente fibre vegetali come piselli e bambù, sale e poi additivi vari.\n\nQueste sarebbero le \"salsicce i pollo\" vendute da EKOM.\n\nLeggete sempre le etichette con gli ingredienti prima di comprare, anche se vengono venduti nel banco \"fresco\".",
        "upvotes": 30,
        "comments": 51,
        "media": null,
        "permalink": "/r/torino/comments/1o23oex/salsicce_di_pollo_ma_non_cè_il_pollo_dentro/"
    }
]