[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 157,
        "comments": 565,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n2q9f9",
        "author": "BrettJoz",
        "title": "We’re getting another series based on a serial killer apart of the Monster series.",
        "content": "As a huge fan of the Monster Series, I’m glad they’re making another one based on Ed Gein.\n\nFor those who don’t know who Ed Gein is, he’s a serial killer who would skin his victims &amp; wear their skin as a mask. \n\nFun fact: Leatherface is actually based on Ed Gein",
        "upvotes": 32,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1n2q9f9/were_getting_another_series_based_on_a_serial/"
    },
    {
        "id": "1n226i0",
        "author": "Street_Firefighter_7",
        "title": "The gabby petito story was removed off Netflix",
        "content": "I noticed that the movie is now removed after only being on the platform for less than 24 hrs. I paused it and came back to watch it and now it’s gone and I’m even getting errors whenever I click on the Netflix link for the movie. Anyone know why it was removed? ",
        "upvotes": 446,
        "comments": 189,
        "media": null,
        "permalink": "/r/netflix/comments/1n226i0/the_gabby_petito_story_was_removed_off_netflix/"
    },
    {
        "id": "1n2izkg",
        "author": "peoplemagazine",
        "title": "Netflix Star Verónica Echegui Dies at 42 After Secret Cancer Diagnosis",
        "content": "",
        "upvotes": 30,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n2izkg/netflix_star_verónica_echegui_dies_at_42_after/"
    },
    {
        "id": "1n20z4c",
        "author": "A-Dog22",
        "title": "Sony sold Netflix the rights to ‘KPop Demon Hunters’ in a pandemic-era safety play—and now it’s Netflix’s biggest movie ever",
        "content": "",
        "upvotes": 448,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1n20z4c/sony_sold_netflix_the_rights_to_kpop_demon/"
    },
    {
        "id": "1n2ar5g",
        "author": "FlareGamer64",
        "title": "Series recommendations with episodes that are specifically 20-35 minutes long?",
        "content": "Most shows I've watched on Netflix are 40-50 minutes long (Breaking Bad, Better Call Saul, Resident Alien, Untamed) which is fine but sometimes I need something a bit shorter before I go out. The Thin Blue Line has been perfect for this purpose but I'm almost done with it. I don't care if it's a drama or a animated show, just give me those recommendations.",
        "upvotes": 36,
        "comments": 128,
        "media": null,
        "permalink": "/r/netflix/comments/1n2ar5g/series_recommendations_with_episodes_that_are/"
    },
    {
        "id": "1n2dmco",
        "author": "intelerks",
        "title": "Netflix’s 'Monster' dives into Ed Gein’s gruesome legacy with Charlie Hunnam in lead",
        "content": "",
        "upvotes": 18,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n2dmco/netflixs_monster_dives_into_ed_geins_gruesome/"
    },
    {
        "id": "1n292d8",
        "author": "BossJosh74",
        "title": "Thursday Murder Club is great!",
        "content": "I dont want to rush through the series of books, but Chris Columbus, this cast, this crew, during Christmas would be absolutely CINEMA. netflix plz more.",
        "upvotes": 18,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n292d8/thursday_murder_club_is_great/"
    },
    {
        "id": "1n2twvb",
        "author": "AccomplishedPut5175",
        "title": "Suburræterna any news for S2?",
        "content": "Any news for this show on S2?\nI try to find some news but nothing!\nIf somebody know please tell us.\nWho like Gomora tv shows,must watch this.\nGod bless you all☘️☘️",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2twvb/suburræterna_any_news_for_s2/"
    },
    {
        "id": "1n2nmgs",
        "author": "Individual-Gas5276",
        "title": "Anyone else getting these Netflix “account suspended” messages?",
        "content": "I’ve been getting these weird messages saying my Netflix account is suspended and I need to “log in” to fix it. The page even has a “Continue with Facebook” button. Feels super sketchy. Is this a new scam? Anyone else seeing this?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n2nmgs/anyone_else_getting_these_netflix_account/"
    },
    {
        "id": "1n28v3l",
        "author": "nemopost",
        "title": "Have 20 or so years I have downgraded my Netflix plan.",
        "content": "I went from the top tier 4k plan to 1080p with commercials.  We watch netflix less now and don’t see a reason why we should be paying $30 for one service when we used to pay $50 for many back in the day on cable tv.  Now I hear the prices are going up again.  Something had to give. The new shows are less intriguing than they were, its just not worth it anymore. ",
        "upvotes": 12,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1n28v3l/have_20_or_so_years_i_have_downgraded_my_netflix/"
    },
    {
        "id": "1n1t6ji",
        "author": "AztecTimber",
        "title": "I love foreign language shows and here are my favorites",
        "content": "Do you have any to add? I am particularly interested in German shows because I think it helps me speak it just a bit better. Plus I love the euro city settings. ",
        "upvotes": 117,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1n1t6ji/i_love_foreign_language_shows_and_here_are_my/"
    },
    {
        "id": "1n2p74f",
        "author": "bestcmw",
        "title": "Anybody know what is going on with the loading logo?",
        "content": "Yellow graphic with negative space asterisk. I thought imagined it. Theres an image just before the Netflix logo appears. Probably nothing, but I have never seen it before. Anyone else seeing it when opening the app?",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rkwyoz7iytlf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n2p74f/anybody_know_what_is_going_on_with_the_loading/"
    },
    {
        "id": "1n2e0iq",
        "author": "keepitwildinwyo",
        "title": "Movie night for kids ages 4-9",
        "content": "I’m hosting a popcorn, pizza, and movie night at my house and want to have a fun movie for both groups, but maybe not something they’ve seen or popular at the moment. Any ideas/recs? ",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1n2e0iq/movie_night_for_kids_ages_49/"
    },
    {
        "id": "1n2dend",
        "author": "fergrim85",
        "title": "Million Dollar Secret - i know I'm a bit behind the times here, but did anyone else notice Cara's clearly fabricated claims about her father's illness?",
        "content": "She claimed he had \"lymphoma, melanoma and leukemia\" which is nearly a statistical impossibility. (it's not impossible but the odds are astronomically low)\n\nAnd I mean, that's fine, the show is about lying liars who are lying.  But what made it bizarre is it wasn't something she talked about with fellow contestants, but in confessionals, \n\nAnd what made it even stranger to me is that the edit never keyed in on the magnitude of that particular lie.\n\nLying about a family member having a life threatening illness is tasteless and arguably immoral, but lying about it in such an exaggerated fashion is...a sign of severe issues working things out with reality.  It's the sort of thing someone with schizophrenia might say.\n\nAnyway I was just surprised not to see a single mini article mention it, or to see anyone mention it in the breakdown threads after her win.  Given it was such a gimme and an obvious WTF moment as she said it.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n2dend/million_dollar_secret_i_know_im_a_bit_behind_the/"
    },
    {
        "id": "1n2fba6",
        "author": "Coolme_pro",
        "title": "Netflix profile icons",
        "content": "hi, is there any way to remove the profile icons from my history? some of the pictures are lowk bad to look at because my sibling was trying to disturb me 😭 \n\nalso, does that affect the algorithm of profile icons recommended to me?\n\nfinally, I noticed that every profile has different icons, what should I do if I want a certain one (e.g. arcane) but I don't have it in my options ? (it's available on my other family member's account)\n\nthank you in advance:)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n2fba6/netflix_profile_icons/"
    },
    {
        "id": "1n2f1oq",
        "author": "potassiumnadilaw",
        "title": "Any good architecture stuff on Netflix?",
        "content": "Can you recommend some architecture-related shows on Netflix that are worth watching for someone in the field? Whether it’s a reality show, documentary, movie, or series, I’m open to anything. I just want to widen my perception of architecture.\n\nThanks in advanceee!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n2f1oq/any_good_architecture_stuff_on_netflix/"
    },
    {
        "id": "1n25oao",
        "author": "St3lla_0nR3dd1t",
        "title": "Does the Netflix algorithm suit you or do you have to search for good tv",
        "content": "https://www.theguardian.com/media/2025/aug/28/bland-easy-to-follow-for-fans-of-everything-what-has-the-netflix-algorithm-done-to-our-films\n\nIs it just me but do you get the feeling that Netflix films are not challenging enough and produced to a quota rather than to quality. \n\nWould you pay more for better films?",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n25oao/does_the_netflix_algorithm_suit_you_or_do_you/"
    },
    {
        "id": "1n1krle",
        "author": "Glum_Reputation_9845",
        "title": "Rewatching The Social Dilemma and realizing it wasn’t even the half of it",
        "content": "When I first saw it, I thought it was shocking that apps manipulate us with notifications and algorithms. But the more I’ve learned since then, the scarier part isn’t just the manipulation and it's all about the data that's everywhere.  \n  \nYour phone number, your email, even your address history  all of it is floating around. The Social Dilemma scratched the surface because I feel it's much scarier real life. (that thing about what google knows about you is actually terrifying). I can’t help but think a real sequel would be less about screen addiction and more about how our entire identities are already being bought and sold in the background.  \n  \nHas anyone else felt that paranoia spike after realizing the real problem isn’t the apps on your phone, it’s the invisible network of companies that already own your information?",
        "upvotes": 61,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n1krle/rewatching_the_social_dilemma_and_realizing_it/"
    },
    {
        "id": "1n2bhd8",
        "author": "blueberrman2",
        "title": "How do I disable netflix showing what I watch to other users?",
        "content": "My family has the basic netflix plan, where you can only watch from one device at a time, and if there's someone already watching and you try to watch something, it displays who is watching at that time, on what device they're watching on, and what they're watching. Is there a way to turn this off?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n2bhd8/how_do_i_disable_netflix_showing_what_i_watch_to/"
    },
    {
        "id": "1n2h6o9",
        "author": "Ok-Box9760",
        "title": "First Netflix content filtering browser extension",
        "content": "Hi.\n\nI built the first Netflix content filtering browser extension that allows you to filter content you have watched or rated on Netflix.\n\nI am currently in the testing phase of the extension and I invite you to join the testing group. Once you join the group the download link will be active.\n\nCurrently the first version is unstable but I will soon release a much more stable version 0.2\n\nhttps://groups.google.com/g/advanced-netflix-filter?pli=1",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2h6o9/first_netflix_content_filtering_browser_extension/"
    },
    {
        "id": "1n10zec",
        "author": "AverageCowboyCentaur",
        "title": "Anyone else having trouble navigating Netflix?",
        "content": "some shows work and some shows don't even load the episode grid. It's like they play from the preview. The whole service just seems to be melting down and degrading. anybody else?",
        "upvotes": 1025,
        "comments": 790,
        "media": null,
        "permalink": "/r/netflix/comments/1n10zec/anyone_else_having_trouble_navigating_netflix/"
    },
    {
        "id": "1n1to7o",
        "author": "PerformerAlert4654",
        "title": "Please help me find this Netflix series that was canceled",
        "content": "All I can remember is that there was three main characters and it was under the fantasy genre. It was two boys and a girl. One of the boys were black and is the main main character. I think their is magic involved and it was also a book series. It was canceled after only 1 season but i remember it being so good and wanting to read the book. I believe it had a rather long name as well?\n\nI am trying to remember more but I cant remember most of it.",
        "upvotes": 18,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1n1to7o/please_help_me_find_this_netflix_series_that_was/"
    },
    {
        "id": "1n2tbma",
        "author": "Funkychuckerwaster",
        "title": "Kill Tony 2025",
        "content": "When the really unfunny black lady came on (3rd or 4th) I think, Matt looked sooooo uncomfortable and against the raling she was getting?  Hes MR, he had them lined up  and chose to burn what he couldn’t not have lined up?it’s Kill Tony ffs but dude was feeling! He seems a guid ane like!……just my opinion, I know?! Seemed like to me is all!?!",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1n2tbma/kill_tony_2025/"
    },
    {
        "id": "1n29k6p",
        "author": "Affectionate_Yam4221",
        "title": "7 Exciting Shows To Watch if You Love 'Hostage'",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n29k6p/7_exciting_shows_to_watch_if_you_love_hostage/"
    },
    {
        "id": "1n2ktfr",
        "author": "Bubbly-Business-2666",
        "title": "Dwa różne gospodarstwa",
        "content": "Siemka siemka, ktoś wie jak mogę mieć podłączone dwa gospodarstwa na Netflixie? Long story short, mieszkam u rodziców ale w tygodniu jadę do akademika. Dzisiaj gdy wrócilam do domu, mama skarżyła się że Netflix już jej nie działa bo urządzenie nie jest w gospodarstwie. Tata to samo. Gdy napisałam do Netflixa o tym, to pracownik kazał podłączyć się pod internet gospodarstwa. Nie pisałam mu że żyje u rodziców i w akademiku. Czy to znaczy że muszę kupić te przeklęte dodatkowe urządzenie poza gospodarstwem? Potrzebuje pomocy bo z jednej strony fajnie mogę oglądać sobie seriale w akademiku, ale szkoda bo moi rodzice nie mogą oglądać niczego, no chyba że przyjadą do akademika i się podłączą do internetu co miesiąc... Czy ktoś wie co powinnam zrobić? Nie chcę dawać im kodu dostępu co dwa tygodnie aby mogli oglądać swoje seriale.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2ktfr/dwa_różne_gospodarstwa/"
    },
    {
        "id": "1n28g9g",
        "author": "Plus-Breakfast-6125",
        "title": "Shake’s Love Is Blind NDA has expired, and he's already exposing his 'unhinged' co-stars",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n28g9g/shakes_love_is_blind_nda_has_expired_and_hes/"
    },
    {
        "id": "1n1ek4n",
        "author": "AlittleupsetMax",
        "title": "How bad is Netflix new update",
        "content": "I am having problems with this service, besides the rate hikes and the inability to share, it seems like the actual service is having problems now.  The new home page isn’t very good.  After you browse for something, you have to go all the way to the top to search for what you were looking for.  Remember when they would pop a really anticipated movie on there?  Ahh the good ole days \n\nIs it still worth it?  I just finished Better Call Saul and I would say it was worth it for that show. Not too bad, it’s no Breaking Bad but what is?",
        "upvotes": 52,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1n1ek4n/how_bad_is_netflix_new_update/"
    },
    {
        "id": "1n2mibi",
        "author": "Slate",
        "title": "This New Netflix Series Masterfully Handles a Topic That Too Many of Us Avoid",
        "content": "",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1n2mibi/this_new_netflix_series_masterfully_handles_a/"
    },
    {
        "id": "1n2sint",
        "author": "historyinprogress",
        "title": "American Murder: Gabby Petito",
        "content": "I came in all ready to hate Bryan but I’m just not seeing it. I finished episode 1 and so far he’s been chill. She’s rolling her eyes, she’s snipping at him, and she won’t get off her damn phone. \n\nI know she was killed and he’s supposed to be a monster but I haven’t seen him do anything even remotely out of line in these videos. If he was ever frustrated I could understand, she never puts down her camera, it’s all film, film, film. That would annoy the hell out of me, but we never see him raise his voice, make faces at her, or appear angry. It’s all her. \n\nI’m just surprised by how he’s been painted and what I’m seeing. I believe all women, I always give women the benefit of the doubt, I can toe the line of feminist misandry. But I’m just not seeing it in this doc. Is this a pro Bryan piece? Or is Netflix setting it up to show a complete 180 in the later episodes?",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1n2sint/american_murder_gabby_petito/"
    },
    {
        "id": "1n0unz1",
        "author": "ToonAdventure",
        "title": "'KPop Demon Hunters' Is Netflix's Most-Watched Movie in History",
        "content": "",
        "upvotes": 650,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1n0unz1/kpop_demon_hunters_is_netflixs_mostwatched_movie/"
    }
]