[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 489,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1il84am",
        "author": "Dreambeamed",
        "title": "Kinda pregnant - only about 15 minutes into the movie and already a little grossed out?",
        "content": "Anyone else think Amy Schumer saying sexually explicit dialogue to minors in high school in the classroom scene pretty wrong....? I'm only about 15 minutes in and had to post on Reddit about it find someone who felt the same. Am I crazy 😭\n\nJust seems a little inappropriate and a desperate attempt to be funny....\n\nAnd I just now saw a scene where she criticizes another character for being a teacher and being inappropriate 🤷‍♀️\n",
        "upvotes": 231,
        "comments": 143,
        "media": null,
        "permalink": "/r/netflix/comments/1il84am/kinda_pregnant_only_about_15_minutes_into_the/"
    },
    {
        "id": "1ilaxzi",
        "author": "Robemilak",
        "title": "Ben Affleck to Replace Matt Damon in Netflix Thriller 'Animals'",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ilaxzi/ben_affleck_to_replace_matt_damon_in_netflix/"
    },
    {
        "id": "1ikq32a",
        "author": "peoplemagazine",
        "title": "Prince Documentary Featuring Abuse Claim by Ex Killed by Netflix as Estate Plans New Film",
        "content": "",
        "upvotes": 173,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ikq32a/prince_documentary_featuring_abuse_claim_by_ex/"
    },
    {
        "id": "1ikrhzw",
        "author": "I_ReadThe_Comments",
        "title": "I’m obsessed with the show “MO.”",
        "content": "It’s informative, funny, heartwarming, heartbreaking. It touches ALL aspects of life in the U.S. as a Muslim, Jew, Hispanic, a man on the spectrum. And it all focuses around a family of refugees from war torn Palestine.\n\nDon’t do what I did and sleep on this show.",
        "upvotes": 97,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ikrhzw/im_obsessed_with_the_show_mo/"
    },
    {
        "id": "1ilh59i",
        "author": "MasterMake",
        "title": "What happened to outer banks?",
        "content": "Watched season 1-2 when i was around 17, maybe 18 or 19\n\na few years passed and now it's 2024 and now im 22  \nI skipped the third season and went to season 4, and two options:  \n1. it became bad  \n2. i was a young kid\n\n\n\nfor real tho, what happened to this ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ilh59i/what_happened_to_outer_banks/"
    },
    {
        "id": "1ilfkqw",
        "author": "Clarine87",
        "title": "I've noticed the [muted] netflix playback in a chrome window pauses when a VLC window is fullscreen over it. [All]",
        "content": "How does a muted netflix [via chrome] know that there's a fullscreen window in front of it? It doesn't do this when video games are full screen in front of it. Nor does it do it when VLC is fullscreen on another monitor.\n\nI'm watching the same thing [this isn't really relevant] in vlc as I'm watching on netflix because for some reason the 1080 stream is coming in at &lt;720 on a gigabit line.\n\nFor the time being, I've solved this by putting the chrome window on mute on a virtual monitor.\n\n____\n\nNow don't get me wrong, it is abundantly obvious [several reason] WHY netflix does this. Just feels like they're spying on me.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ilfkqw/ive_noticed_the_muted_netflix_playback_in_a/"
    },
    {
        "id": "1ilcobw",
        "author": "reddit-agro",
        "title": "Dallas Cowboy Cheerleaders series",
        "content": "Just finished this series. Very insightful into such an American cultural icon.\nAnyone else have any good recommendations for American orientated shows (College / high school etc)?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ilcobw/dallas_cowboy_cheerleaders_series/"
    },
    {
        "id": "1ilclwm",
        "author": "Sea_Perspective1271",
        "title": "show and movie recs",
        "content": "i like \ngilmore girls \nnew girl \nmodern family \nhow i met ur mother \nanne with an e \nbridgeton \nouter banks \nall 2000s rom com like how to\nlose a guy in 10 days, 10 things i hate about you, 13 going on 30, 27 dresses \nlittle women\nperks of being a wallflower \nbut i’m a cheer leader \n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ilclwm/show_and_movie_recs/"
    },
    {
        "id": "1iklucu",
        "author": "Alone-Application454",
        "title": "Night agent season 2 is horrible",
        "content": "24 js my favorite show of all time so as a 24 fan i adored season 1 of the night agent. But season 2 is just strange. Firstly the episodes are just straight up boring. No fights are high adrenaline scenes. Just conversations that feel meaningless to the plot. Rose is actually unbearable with her storyline of constantly changing her mind about staying or leaving was so frustrating to watch and it just feels ljke theyre forcing her into the show. Big boss lady is awful and horribly acted. Peter feels like a shell of himself in this season and half the episodes is just his relationship with rose. Its all awful. The final problem with this season is the muslim people always speaking that language. I dont have any problem with muslims or their language but o hate that half the episode isnt captioned and half of it is and when it is the conversations still feel pointless. Who else agrees?",
        "upvotes": 70,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1iklucu/night_agent_season_2_is_horrible/"
    },
    {
        "id": "1ilexy9",
        "author": "rubiporto",
        "title": "The Turin Horse: a haunting meditation on the end of everything",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ilexy9/the_turin_horse_a_haunting_meditation_on_the_end/"
    },
    {
        "id": "1ilizea",
        "author": "KitchenBeneficial302",
        "title": "Ranza is coming to Netflix in 2025!",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/40mph1pg75ie1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ilizea/ranza_is_coming_to_netflix_in_2025/"
    },
    {
        "id": "1ikjdkz",
        "author": "S4v1r1enCh0r4k",
        "title": "Baby Reindeer wins best limited series at critics choice awards",
        "content": "",
        "upvotes": 40,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ikjdkz/baby_reindeer_wins_best_limited_series_at_critics/"
    },
    {
        "id": "1ijvfht",
        "author": "Internal_Deer_5324",
        "title": "Stop making documentaries about serial killers.",
        "content": "Making these documentaries is only giving what these murderer what they want… to be famous. They want to be immortalized by these terrible terrible acts, and these documentaries do exactly that. Please stop fulfilling the hopes of these wretched and vile transgressors.",
        "upvotes": 1240,
        "comments": 197,
        "media": null,
        "permalink": "/r/netflix/comments/1ijvfht/stop_making_documentaries_about_serial_killers/"
    },
    {
        "id": "1iki5at",
        "author": "okaybhaii",
        "title": "What a lively movie! Isn't it? ✨",
        "content": "",
        "upvotes": 26,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/drp72vo3evhe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iki5at/what_a_lively_movie_isnt_it/"
    },
    {
        "id": "1ikbzs2",
        "author": "Dabomblol1231",
        "title": "Why doesn't Netflix see that shows that don't receive Stranger Things ratings can still be used as a way to grow their content library instead of just canceling them?",
        "content": "It seems pretty short-sighted to cancel shows just because they don’t pull in massive ratings like Stranger Things. With almost every major media company now running their own streaming service and fighting for subscribers, it’s more important than ever to have a variety of good content. Keeping shows with solid writing, even if they’re not huge hits, could help in the long run by pulling in niche audiences, keeping loyal fans around, and making the platform look better overall. Instead of only chasing big, instant successes, streaming companies should think about the long-term value of having a mix of different shows that keep people watching and stop them from canceling their subscriptions.\n\n",
        "upvotes": 80,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1ikbzs2/why_doesnt_netflix_see_that_shows_that_dont/"
    },
    {
        "id": "1ikzaas",
        "author": "UltimateisUltimate",
        "title": "CC do not match the audio?",
        "content": "I am hard of hearing so I tend to have subtitles/cc on whenever I am watching something. I watch a lot of anime, although I normally tend to watch it subbed, so maybe this is the same for other dubs?\n\nI began watching the original naruto in English and for the entire first season the cc was fine. But I start on season 2, and the captions are atrociously wrong. It felt more like they were summarizing what the characters were saying instead of actually captioning it. At one point, a character speaks in a very quiet voice and the captions say \"Naruto....\" when she was clearly whispering a full sentence. \n\nI thought maybe the cc and subtitles for the show got mixed up, and switched between them. Not only is that the not case, but the cc do not even follow the Japanese script. (From what I saw)\n\nI am just very confused and frustrated and was wondering if anyone else was having this issue? I was really enjoying myself but it's very frustrating to not be able to fully understand what's going on in it.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikzaas/cc_do_not_match_the_audio/"
    },
    {
        "id": "1ikyyhc",
        "author": "duIcemente",
        "title": "subtitles are so wrong",
        "content": "i am watching cassandra rn, the miniseries. my first language is spanish but i ALWAYS watch stuff on their native language bc i believe it's better and the actors' voices are part of the performance. so i know very little german –i'm learning–, but then one of the characters said something in english, and the translation had NOTHING to do with it. so i was weirded out, and switched it up to english captions. however, i can feel how sometimes instead of translating they change the whole order of sentences, and what got me mad the most is that in the first episode one of the characters said \"merci\" and the english captions said \"gracias\" ???? like what the hell they are two completely different languages.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ikyyhc/subtitles_are_so_wrong/"
    },
    {
        "id": "1ikx3ww",
        "author": "iamobsesswithoitnb",
        "title": "Viva La Vida",
        "content": "I just finished watching this movie and omgggg it's good...why is it not viral or trending??????\n\nAt first, I thought it's going to be sad and melancholic....I was ready to have my heart broken to pieces...\n\nBut nooooooooooooo......this movie is like a roller coasterrrrrrrr",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ikx3ww/viva_la_vida/"
    },
    {
        "id": "1il4kjn",
        "author": "morilythari",
        "title": "The sound mixing on Celebrity Bear Hunt is horrible.",
        "content": "It does from barely audible muffled speaking to deafening musical stings every other shot. Why are there not standards in place for sound mixing on these shows? \n\nThe talking head and narration are fine mostly so I can forgive the action talking a pass but the music editing is SO loud.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1il4kjn/the_sound_mixing_on_celebrity_bear_hunt_is/"
    },
    {
        "id": "1ikwsk0",
        "author": "_wolfgrrl_",
        "title": "TV show recs similar to Supernatural &amp; The Walking Dead?",
        "content": "Anyone have any recommendations for a new show for the hubby and I to binge watch together? We have finished Supernatural and The Walking Dead (I know there’s spinoffs of each I just have mixed feelings starting those tbh). We also really enjoyed Mindhunter but I don’t think that’s coming back. So something similar to that dark / suspenseful vibe probably, but open to hearing what other people have enjoyed!\n\nEdit to add: also enjoyed X-files, and the streaming services I’m working with are Netflix, Disney+, Hulu, Peacock",
        "upvotes": 2,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1ikwsk0/tv_show_recs_similar_to_supernatural_the_walking/"
    },
    {
        "id": "1ik59xa",
        "author": "valentaain",
        "title": "Anyone else totally obsessed with Psych?",
        "content": "A few months ago I was browsing through the homepage on my Netflix prolife and I found out *Psych*. It was and old show whit eight seasons, so I didn´t hit play in that moment... but something later tolde me to give it a try and I watched first episode.\n\nHonestly I think it is a super fun and really fast-paced show, really hilarious! It has a bit of everyting! I loved all the characters and it became an obsession to me. I0m currently finishing season 7 and every time I watc an episode I feel like I'm close to the end, that's make me feel sad :(\n\nIf you haven't watched it yet, I totally recommend it! And if you have, what did you think? Did you get as obsessed as I did?\n\nPS: I'm not really good writing in English so sorry If there is anything that is bad written ;)\n\nhttps://preview.redd.it/z254xtih4she1.png?width=718&amp;format=png&amp;auto=webp&amp;s=3536771552c5955d46c5a8f193b7f5a073a92f8b\n\n  \n",
        "upvotes": 65,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1ik59xa/anyone_else_totally_obsessed_with_psych/"
    },
    {
        "id": "1il57sx",
        "author": "Necessary-Solution19",
        "title": "Netflix broke",
        "content": "Trying to select an episode for yellowstone and it's stuck.\nI can't fast forward pause or even select a new episode. The screen is locked in a dark setting with words about the show stuck on the screen as it plays. I got so frustrated I snapped my remote in half.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1il57sx/netflix_broke/"
    },
    {
        "id": "1ijv5ef",
        "author": "Somethingman_121224",
        "title": "Streaming Giant Netflix Is Looking To Secure F1 Broadcasting Rights",
        "content": "",
        "upvotes": 187,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1ijv5ef/streaming_giant_netflix_is_looking_to_secure_f1/"
    },
    {
        "id": "1ijv56g",
        "author": "Whobitmyname",
        "title": "‘Dungeons &amp; Dragons: Honor Among Thieves’ Releases on Netflix on February 26.",
        "content": "",
        "upvotes": 185,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1ijv56g/dungeons_dragons_honor_among_thieves_releases_on/"
    },
    {
        "id": "1ikrqy4",
        "author": "Familiar_Mine_4353",
        "title": "Ghosts TV show",
        "content": "When are seasons 3 &amp; 4 of Ghosts going to be added on Netflix? Binged the show in 2 days and I totally loved it! I found out the show has 2 more seasons and season 2 left us with a cliffhanger. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikrqy4/ghosts_tv_show/"
    },
    {
        "id": "1il57af",
        "author": "Blossom_MP",
        "title": "How does Netflix know???",
        "content": "This is a semi meme post but I am also a little bit serious. I’ve been re-watching stranger things before bed and each night have fell asleep while watching. When I put it on the next day, it’s left off at the last thing I remember before falling asleep. Almost like Netflix knows I fell asleep and it’s just conveniently at the right spot.   I know after a few episodes it will ask if you’re still watching but I mean it’s legit at the spot I believe I fell asleep at. Has anyone else experienced this or am I completely insane 🤗",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1il57af/how_does_netflix_know/"
    },
    {
        "id": "1ikvktb",
        "author": "Any-Language7291",
        "title": "Looking for a New Comfort Show",
        "content": "I just finished watching Friends, and I NEED, like seriously NEED, a comfort show rn! I want something with a family/friendship vibe, like Modern Family or Brooklyn Nine-Nine I don’t want anything boring or too serious that makes me think (doesn't need to be on Netflix)",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ikvktb/looking_for_a_new_comfort_show/"
    },
    {
        "id": "1ikth8b",
        "author": "Sudden_Pop_2279",
        "title": "'Squid Game 2' clinches the title of best foreign language series at the 2025 Critics Choice Awards",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ikth8b/squid_game_2_clinches_the_title_of_best_foreign/"
    },
    {
        "id": "1ikz01g",
        "author": "General-Opinion-8773",
        "title": "Netflix price increase question.",
        "content": "I have tried googling this to no avail. As we all know prices go up, such is life. \n\nCurrently I have the notification upon opening my profile that prices are increasing and it offers me an option to select accept but not to decline.\n\nIs there a way for me to opted out, so I can continue to watch things until the March 2nd deadline and just let the account close on its own. Or do I have to accept the change and then cancel?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ikz01g/netflix_price_increase_question/"
    },
    {
        "id": "1ikfgv9",
        "author": "pocketfullofprose",
        "title": "Dark Forest Show?",
        "content": "A couple of years ago or so I got into a show about a small-town female detective with a few severed fingers from a traumatic incident in the dark woods in their town. Her trauma unfolds as other teenagers have traumatic events in the woods. I don't remember the title ... And I think it wasn't in English? Anyone remember anything like that?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ikfgv9/dark_forest_show/"
    }
]