[
    {
        "id": "1j4k6og",
        "author": "BunyipPouch",
        "title": "Join us tomorrow Thursday 3/6 for an AMA/Q&amp;A at 2:00 PM ET with Rodrigo Perez-Castro &amp; Ricardo Curtis, co-directors of the upcoming animated comedy-horror 'Night of the Zoopocalypse', starring David Harbour, Gabbi Kosmidis, Scott Thompson, and Paul Sun-Hyung Lee.",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kvng7cul4zme1.jpeg?auto=webp&amp;s=dc30edf10d84a872a7ae989f5a1ee0be1085b150"
        },
        "permalink": "/r/movies/comments/1j4k6og/join_us_tomorrow_thursday_36_for_an_amaqa_at_200/"
    },
    {
        "id": "1j44z7e",
        "author": "yahooentertainment",
        "title": "We're reporters from Variety and Yahoo Entertainment who covered the Oscars from the ground and watched the show to report on all the unusual stuff, what the results mean for film, and more. Ask us anything!",
        "content": "**From Kelsey:** I'm a senior entertainment reporter covering the best and worst of pop culture at Yahoo News. This year, I interviewed many of the Oscar nominees and wrote our weekly Best Picture Leaderboard — a [power ranking](https://www.yahoo.com/entertainment/we-correctly-predicted-anora-would-win-best-picture-at-the-oscars-heres-what-we-learned-from-our-formula-185203877.html) made from an original formula that correctly (!!) predicted *Anora* would win.\n\n**From Taryn:** I was on the ground covering the Oscars for u/yahooentertainment, and wrote about [plenty of things from the show you didn't see on TV](https://www.yahoo.com/entertainment/8-things-you-didnt-see-on-tv-at-the-2025-oscars-timothee-chalamet-and-kylie-jenner-get-cozy-the-conan-obrien-jokes-that-landed-with-the-crowd-and-a-gracious-demi-moore-171758152.html). I can also tell you anything you want to know about Taylor Swift, Justin Bieber, or the Kardashians at any given time.\n\n**Clayton Davis** is the Chief Awards Editor at u/Variety, where he has been a leading voice in awards forecasting since joining the esteemed Hollywood publication in September 2020. Davis is also a two-time Emmy-nominated host of PBS' Variety Studio: Actors on Actors and co-host of the award-winning Variety Awards Circuit Podcast.\n\n**PROOF:** [https://imgur.com/a/yahoo-entertainment-variety-ama-UZffFO7](https://imgur.com/a/yahoo-entertainment-variety-ama-UZffFO7)\n\n&gt;That's all the time we have for today! Your friends at Variety and Yahoo Entertainment thank you all for hopping in and asking fun, thoughtful questions! Big s/o to the mods as well for having us today. Till next time :) - Angel (yahoo reddit guy)",
        "upvotes": 0,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T84FDR47s33kvGeG7NWRi8jTUVGTShGF_prPZBdQRs0.jpg?auto=webp&amp;s=3b17f81b13d36e97254d0b870bbe2fed425d1889"
        },
        "permalink": "/r/movies/comments/1j44z7e/were_reporters_from_variety_and_yahoo/"
    },
    {
        "id": "1j46sx6",
        "author": "ChocolateOrange21",
        "title": "'Movies don't change but their viewers do': Movies that hit differently when you watch them at an older age.",
        "content": "Roger Ebert had this great quote about movies and watching them at different points in your life. Presented in full below.\n\n“Movies do not change, but their viewers do. When I saw La Dolce Vita in 1960, I was an adolescent for whom “the sweet life” represented everything I dreamed of: sin, exotic European glamor, the weary romance of the cynical newspaperman. When I saw it again, around 1970, I was living in a version of Marcello’s world; Chicago’s North Avenue was not the Via Veneto, but at 3 a.m. the denizens were just as colorful, and I was about Marcello’s age.\n\nWhen I saw the movie around 1980, Marcello was the same age, but I was 10 years older, had stopped drinking, and saw him not as a role model but as a victim, condemned to an endless search for happiness that could never be found, not that way. By 1991, when I analyzed the film a frame at a time at the University of Colorado, Marcello seemed younger still, and while I had once admired and then criticized him, now I pitied and loved him. And when I saw the movie right after Mastroianni died, I thought that Fellini and Marcello had taken a moment of discovery and made it immortal.”\n\n\\*\\*\n\nWhat are some movies that had this effect on you? Based on a previous discussion, 500 Days of Summer was one for me. When I first watched it, I just got out of a serious relationship, and Tom resonated with me. Rewatching it with some time, I realized Tom was flawed, and he was putting Summer on a pedestal and not seeing her as a person.\n\nDiscuss away!\n\n",
        "upvotes": 5492,
        "comments": 2074,
        "media": null,
        "permalink": "/r/movies/comments/1j46sx6/movies_dont_change_but_their_viewers_do_movies/"
    },
    {
        "id": "1j4d0m1",
        "author": "NoCulture3505",
        "title": "Kathryn Newton Reteaming With Radio Silence For Searchlight’s ‘Ready Or Not’ Sequel",
        "content": "",
        "upvotes": 1100,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5jbTh4jQtO5MBBwk6VO4MRizseNL5leF0KfJB1W8XUI.jpg?auto=webp&amp;s=9d5637a145d4005e3644b8b6e34f1f723aab5c57"
        },
        "permalink": "/r/movies/comments/1j4d0m1/kathryn_newton_reteaming_with_radio_silence_for/"
    },
    {
        "id": "1j4mzjy",
        "author": "one_pound_of_flesh",
        "title": "The Big Lebowski",
        "content": "Is it a perfect movie? It was a cult favorite in college. But giving it a rewatch and more analysis - the cast is entirely GOATS. The soundtrack. The editing. The cinematography of Roger Deakins. There is no wasted shot. \n\nThe script is funny and tight. It is absurd, self referential, a play. \n\nThe film more than holds up. ",
        "upvotes": 255,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1j4mzjy/the_big_lebowski/"
    },
    {
        "id": "1j4b0bc",
        "author": "DemiFiendRSA",
        "title": "‘Jaws’ Swims Back Into Theaters This Summer for 50th Anniversary on August 29",
        "content": "",
        "upvotes": 1045,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YxzVKLqbhd2LhQDO1u-S0n9fOOJqqjOz9EzazTaG9fc.jpg?auto=webp&amp;s=d1531c974113396245b6cf1cec4c6b920599a992"
        },
        "permalink": "/r/movies/comments/1j4b0bc/jaws_swims_back_into_theaters_this_summer_for/"
    },
    {
        "id": "1j4lqwx",
        "author": "parkergallery",
        "title": "Movies where everything is a lie",
        "content": "Hi! I wanted some recommendations of movies like The Truman Show and Matrix where the main character just finds out that their reality is not real. Not necessarily movies where the character is being watched (like The Hunger Games), but movies where they didn't know and then found out.\n\nI know that asking for those recommendations is asking for spoilers but in this case i don't mind. \n\nEDIT: Thank you some much everyone!! I never expected this post to get so much attention and answers! I will make sure to watch everything and look back at the discussions! xx",
        "upvotes": 213,
        "comments": 517,
        "media": null,
        "permalink": "/r/movies/comments/1j4lqwx/movies_where_everything_is_a_lie/"
    },
    {
        "id": "1j49cyv",
        "author": "LunchyPete",
        "title": "Captain America Co-Creator Jack Kirby Getting Definitive Documentary ‘Kirbyvision’",
        "content": "",
        "upvotes": 1081,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YNSVr2XSJpXmmxgqnwiWG85zJ7tBuKGIYY8NZg6-DWE.jpg?auto=webp&amp;s=fe5160167ee38373b0fa74b4196a201724933daa"
        },
        "permalink": "/r/movies/comments/1j49cyv/captain_america_cocreator_jack_kirby_getting/"
    },
    {
        "id": "1j48ukw",
        "author": "Fun_Protection_6939",
        "title": "Can we appreciate Quentin Tarantino's casting for the Manson family members in Once Upon a Time.....in Hollywood?",
        "content": "One an Oscar winner (Mikey Madison), the other an Oscar nominee (Austin Butler), another's Oscar nomination is a case of when, not if (Margaret Qualley), Maya Hawke who has been doing incredible work and had one of the biggest successes of the year in Inside Out 2.......and then there's Sydney Sweeney. ",
        "upvotes": 906,
        "comments": 233,
        "media": null,
        "permalink": "/r/movies/comments/1j48ukw/can_we_appreciate_quentin_tarantinos_casting_for/"
    },
    {
        "id": "1j3uct4",
        "author": "Sabiancym",
        "title": "Dad gets up during every movie without pausing.",
        "content": "My dad always does something I've only ever heard of people occasionally doing. No matter what movie or TV show he's watching at home, he will get up in the middle of it and with zero urgency, go to the bathroom, grab food, look out the window, or do any number of random things, all without pausing.  He'll then sit back down having missed 5-20 minutes without saying a word and never asks questions after the movie. \n\nIt used to drive me nuts when I lived at home over a decade ago and recently I stayed over one night and watched him do the same thing.  My mom doesn't even bother asking if she should pause. \n\nQuality doesn't matter either. It could be the greatest movie he's ever seen, but he'll still miss 10 minutes of it doing whatever. I've seen him take out the garbage, cook popcorn on the stovetop, and even fold laundry in another room all while a movie he wanted to watch was playing. \n\nThis is insane right? I understand not being in to a movie and getting bored, but in my 30+ years I've never seen or heard of him sitting through an entire movie.  This is the same guy who can sit on the porch for an hour or two doing nothing. I don't understand. \n\nTo be clear, I'm not trying to change him or anything. I just truly don't understand and want to see if anyone else knows someone like this.  \n&amp;nbsp;  \n****EDIT**** People keep saying it's about spending time with others or not wanting to interrupt. It's just my mom and dad at home, and if they disagree on what to watch she'll go upstairs to watch something while he watches what he wants alone....but still gets up without pausing.",
        "upvotes": 11744,
        "comments": 4328,
        "media": null,
        "permalink": "/r/movies/comments/1j3uct4/dad_gets_up_during_every_movie_without_pausing/"
    },
    {
        "id": "1j4514g",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Accountant 2'",
        "content": "",
        "upvotes": 1144,
        "comments": 282,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ldhor3tmyvme1.jpeg?auto=webp&amp;s=3cbdaa867060d4075fca5d50d555523a645e2080"
        },
        "permalink": "/r/movies/comments/1j4514g/new_poster_for_the_accountant_2/"
    },
    {
        "id": "1j4iwl3",
        "author": "Rigamortus2005",
        "title": "Greatest actors without an Oscar win?",
        "content": "It's quite insane the number of legeendary actors without an oscar win for acting. If i had to list off the top of my head I'd personally say Ralph Fiennes, Jake Gyllenhaal,  Edward Norton, Samuel L Jackson, Liam neeson , Johnny Depp, ian mckellen and even willem defoe. Curious to see who else you guys have up there.   ",
        "upvotes": 164,
        "comments": 591,
        "media": null,
        "permalink": "/r/movies/comments/1j4iwl3/greatest_actors_without_an_oscar_win/"
    },
    {
        "id": "1j4crrc",
        "author": "indiewire",
        "title": "Neon Chief Says Netflix Is Their 'Biggest Competitor'",
        "content": "",
        "upvotes": 256,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/juSF6Seu2kFJBdL_TMzShhygn8aDjf50n_8EKrVvR0Q.jpg?auto=webp&amp;s=7d37a1c85600fbe5958518cfe1e44bd35cab671e"
        },
        "permalink": "/r/movies/comments/1j4crrc/neon_chief_says_netflix_is_their_biggest/"
    },
    {
        "id": "1j4lqdi",
        "author": "Spare_Ad6800",
        "title": "What movie totally changed the way you look at life?",
        "content": "We all have that one movie that hit us so hard, we walked out of the theater (or finished it on Netflix) with our minds completely blown. For me, it was The Pursuit of Happyness. The way it explored the struggle of never giving up, even when life is constantly knocking you down, changed the way I view perseverance and resilience. I honestly didn’t expect to get so emotional over it.\n\nSo I’m curious – which movie had a similar effect on you? The one that changed your perspective or made you see the world a little differently? Let’s hear those life-altering cinematic experiences! 🎬💥",
        "upvotes": 68,
        "comments": 191,
        "media": null,
        "permalink": "/r/movies/comments/1j4lqdi/what_movie_totally_changed_the_way_you_look_at/"
    },
    {
        "id": "1j4ccrt",
        "author": "DemiFiendRSA",
        "title": "‘Monopoly’ Movie From Lionsgate And LuckyChap Lands John Francis Daley And Jonathan Goldstein As Writers",
        "content": "",
        "upvotes": 236,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4VC_ft9CFWKQSr-cTbxeCoRlv3hsbwT3yILQ9b4kss4.jpg?auto=webp&amp;s=ed617534d769e2ed03ef137cc0023b8594aff50e"
        },
        "permalink": "/r/movies/comments/1j4ccrt/monopoly_movie_from_lionsgate_and_luckychap_lands/"
    },
    {
        "id": "1j43fjg",
        "author": "CloseCalls4walls",
        "title": "I appreciate how openly emotional the men were in Godzilla Minus One",
        "content": "This was an interesting action movie experience for me. It was good! Something especially notable was how men interacted with each other, being sensitive toward each other and openly expressing their emotions, crying lots of times. It was a refreshing departure from American media where I honestly just don't see anything like it happening. \n\nTypical gender norms sadden me. It's like years of cultural norms have stunted people's growth in so many ways when they otherwise could be processing their emotions in more authentic and likely healthier ways. Here in GMO you see companionship and empathy and it really displays an openness to the way the characters functioned as people. It was almost off-putting, yet their actions would perhaps be true to life, under those circumstances. ",
        "upvotes": 718,
        "comments": 110,
        "media": null,
        "permalink": "/r/movies/comments/1j43fjg/i_appreciate_how_openly_emotional_the_men_were_in/"
    },
    {
        "id": "1j4jdbl",
        "author": "Educational-Leg-9466",
        "title": "watched an oscar-nominated movie at home and suddenly… krasnystaw?! the universe is playing tricks on me",
        "content": "okay, this is actually insane. a real pain, starring Jesse Eisenberg, was filmed in Krasnystaw, Poland a town that even most of my polish friends have never heard of (I’m Polish and I live in Poland) and yet, this small, random place somehow became the setting for an oscar-nominated movie. \n\nbut here’s where it gets even wilder. i was just watching the movie at home, totally unprepared, when suddenly they showed the welcome sign with “krasnystaw” by the end of the scene e. i literally froze. this was the krasnystaw, the place my grandma and mom are from. this is a place that’s such an enormous part of my childhood, just thinking about it makes me instantly nostalgic. just for context, I still live in Poland but 450km (280 miles) west of Krasnystaw. back in the day (omg i’m so old) it took around 9/10 hours to get there. it’s like a fairytale land for me \n\ndid quick research and i found out that Jesse Eisenberg grandma was from there too, i just lost it. i started crying so much. like, what are the actual odds? i had no idea this movie would be so personally significant. it felt like some invisible string was connecting everything, or some massive glitch in my matrix occurred.\n\nand just when i thought it couldn’t get any weirder I just found out that the movie premiered in Krasnystaw on November 8, 2024… which was my 30th birthday. i literally don’t know what to do with this information. this is actually too absurd when you think about it.\n\nis this real life?? Kieran received an actual oscar??? has anyone else had a moment where the universe just casually threw a personal plot twist at them like this? do you know if I can somehow talk to Jesse? what is going on?",
        "upvotes": 76,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1j4jdbl/watched_an_oscarnominated_movie_at_home_and/"
    },
    {
        "id": "1j47x1t",
        "author": "Task_Force-191",
        "title": "Gunslingers (2025) Official Trailer - Stephen Dorff, Heather Graham, Nicolas Cage, Scarlet Stallone",
        "content": "",
        "upvotes": 322,
        "comments": 160,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XuZJp9D_4z5Lj0aFblc5GFPcS_MUvnPoVdYrkwimd8A.jpg?auto=webp&amp;s=281292c49315557c6fc4dbf8c34eba512f555cb0"
        },
        "permalink": "/r/movies/comments/1j47x1t/gunslingers_2025_official_trailer_stephen_dorff/"
    },
    {
        "id": "1j4aup6",
        "author": "NoCulture3505",
        "title": "Matthew Modine Boarding Next Legendary 'Monsterverse' Film",
        "content": "",
        "upvotes": 181,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SafD_ztD9FOqw_-WYg8Ksa_k64Yk8Pj2Gu_fGG7m4uQ.jpg?auto=webp&amp;s=877a331a5d8b78afd6d33d13209a88857a5400ad"
        },
        "permalink": "/r/movies/comments/1j4aup6/matthew_modine_boarding_next_legendary/"
    },
    {
        "id": "1j481si",
        "author": "NoCulture3505",
        "title": "‘Demon Slayer: Kimetsu No Yaiba Infinity Castle’ Sets Fall Release",
        "content": "",
        "upvotes": 236,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Rq_SKjRcU__wmBPLXh4tndGCZCPDf3_drS8N4vYReKE.jpg?auto=webp&amp;s=51ff75a99f5b3f9e2360e8035d38c434cfeb537f"
        },
        "permalink": "/r/movies/comments/1j481si/demon_slayer_kimetsu_no_yaiba_infinity_castle/"
    },
    {
        "id": "1j4m8gy",
        "author": "Visual-Coyote-5562",
        "title": "Why do non-closed captioned subtitles no longer exist as an option on streaming?",
        "content": "When DVDs came out, many offered both closed captions and subtitles as an option.  In fact people would complain if subtitles weren't included.  You see, subtitles don't include words indicating sound effects, noises, or music and are much less intrusive than closed captions which are designed for people who are hard of hearing.   However from what I can tell subtitles outside of foreign titles no longer exist.  It seems like this would be such an easy thing to facilitate with current technology.  Is there a reason for it?",
        "upvotes": 36,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1j4m8gy/why_do_nonclosed_captioned_subtitles_no_longer/"
    },
    {
        "id": "1j3yfjt",
        "author": "randomvegasposts",
        "title": "What's the fastest a character has said the name is a movie in the movie?",
        "content": "I just started in Bruges. The first word is \"Bruges\"\nI'm not counting that but a minute and a half later Colin Farrell says \"In bruges? Are you fucking kidding me?\"\n\nI just have to wonder what the fastest any character said the name of the movie organically (narrators and voice overs don't count) \n\nAnything faster than a minute 30?",
        "upvotes": 1030,
        "comments": 211,
        "media": null,
        "permalink": "/r/movies/comments/1j3yfjt/whats_the_fastest_a_character_has_said_the_name/"
    },
    {
        "id": "1j3zssk",
        "author": "Ok-Impress-2222",
        "title": "Which movies are a good test of media literacy, but AREN'T \"You missed the point by idolizing them\" kind of movies?",
        "content": "The term \"media literacy\" is often brought up in modern fiction discussion. It refers to the viewer's ability to decipher what the author actually really meant to say with their work, and what should be the \"correct\" interpretation of it.\n\nBut most if not all examples of such works are ones where most people end up idolizing a certain character, but the whole point is supposed to be that you shouldn't idolize them. (Some examples being Tyler Durden in *Fight Club,* Patrick Bateman in *American Psycho* for some reason, Travis Bickle in *Taxi Driver,* etc. For works other than movies, I personally would also add Raskoljnikov from *Crime and Punishment* on that list.)\n\nAre there any movies that might be testing some different kind of media literacy, other than the aforementioned one? I personally can't think of any.",
        "upvotes": 626,
        "comments": 1197,
        "media": null,
        "permalink": "/r/movies/comments/1j3zssk/which_movies_are_a_good_test_of_media_literacy/"
    },
    {
        "id": "1j43ja6",
        "author": "BunyipPouch",
        "title": "New Poster for Historical-Epic 'William Tell' - The Austrian Empire, desiring more land, invades neighboring Switzerland. William Tell, a peaceful hunter, finds himself forced to take action as his family and homeland come under threat from the oppressive Austrian King and his ruthless warlords.",
        "content": "",
        "upvotes": 290,
        "comments": 243,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/02kayo0jjvme1.jpeg?auto=webp&amp;s=71c1edcb8260728cdbf725966a0aaba8ad6dd65e"
        },
        "permalink": "/r/movies/comments/1j43ja6/new_poster_for_historicalepic_william_tell_the/"
    },
    {
        "id": "1j46ytt",
        "author": "Minute-Necessary2393",
        "title": "Something I noticed about Ferris Bueller's Day Off.",
        "content": "Something i realized about Ferris Bueller's Day Off when I rewatched last night (great movie, as always, btw) is that Ferris doesn't actually have a character arc in the movie. Yes, he is the title character and the main POV throughout most of the film, but he doesn't have a clear character arc.\n\nIf anything, Cameron Fray, Ferris friend does. At the start of the film, Cameron is in bed sickly and not really confident in himself, but as the movie progresses, he starts to get more confidence, and by the end, he gains the courage to stand up to his father. \n\nIt's kindof wholesome, actually.",
        "upvotes": 162,
        "comments": 194,
        "media": null,
        "permalink": "/r/movies/comments/1j46ytt/something_i_noticed_about_ferris_buellers_day_off/"
    },
    {
        "id": "1j4pqdl",
        "author": "Consistent_Film_5340",
        "title": "The Whale take from someone who's parent left..",
        "content": "I feel like the concept of love being lost can really destroy a person. My mother didn't die but she left my dad and ever since he has been in a self-destructive path. It may not look like being overweight but drugs anger depression terrible mental health. I don't think he's ever gotten over the fact that his children's mother left them and along the way he's made so many mistakes so much that he feels like he can't come back from them and he'll die thinking that way. And just like how Charlie thinks that his daughter is the best thing that he's ever done I think my dad thinks same way but when you mess something up so much it's almost too shameful too difficult to try to come back from it. Unfortunately the child's perspective you don't really give a fuck you just want your dad you just want your mom and we can just figure out the rest. But at the end of the day they're just people trying to figure out life and love and sometimes it's just too hard. Idk it's got me in my feels. Just had to get this out. \n",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1j4pqdl/the_whale_take_from_someone_whos_parent_left/"
    },
    {
        "id": "1j4mbbm",
        "author": "uglyhouse420",
        "title": "I just remembered/rewatched Lords of Dogtown",
        "content": "I was a kid when I got my PSP for Christmas but it came with lords of Dogtown and I loved it then. Obviously not a perfect movie but I rewatched it tonight and I still love it honestly. I could be blinded by nostalgia but I love Heath ledger's character a lot. There's also a lot of that early 2000s shakey cam I hate but I actually dig the movie.",
        "upvotes": 14,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1j4mbbm/i_just_rememberedrewatched_lords_of_dogtown/"
    },
    {
        "id": "1j3v3tv",
        "author": "sndwchss",
        "title": "i love when movies have those stupid in-universe tv shows",
        "content": "Like the ones where its the same exact premise, over and over again\n\nlike the “where are my pants” in the lego movie “ow my balls” in idiocracy, and “i got the shit kicked out of me” in sorry to bother you.\n\ni love how they insist this is the most popular show in universe i need more examples of this 😭😭😭",
        "upvotes": 933,
        "comments": 299,
        "media": null,
        "permalink": "/r/movies/comments/1j3v3tv/i_love_when_movies_have_those_stupid_inuniverse/"
    },
    {
        "id": "1j47ihw",
        "author": "RomanReignsDaBigDawg",
        "title": "Prince of Darkness is one of John Carpenter’s best",
        "content": "Though not without some 80s cheese (some of the acting and dialogue can be rough), its flaws are forgiven for the sheer ambition. Think this movie handles momentum and impending doom as well as any horror film and the slow burn approach really works in its favour. \n\nI love horror films but I find very few of them to be truly unsettling. Sequences in Prince of Darkness just freak me out, though. Those recurring dream messages from the future with the distorted voice and low-budget VHS footage get under my skin, and the “YOU WILL NOT BE SAVED!” scene is just a masterclass of tension. \n\nI also think it has an all-timer ending. The dream sequence repeats once more and the ambiguity of it all (you’re not sure if the evil is still out there or not) is so well done. Prime example of show, don’t tell.\n\nWhile The Thing is the superior film, Prince of Darkness is scarier IMO. What do you all think of the movie? ",
        "upvotes": 90,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1j47ihw/prince_of_darkness_is_one_of_john_carpenters_best/"
    },
    {
        "id": "1j3zzuk",
        "author": "yanakozlova",
        "title": "What movie have you watched the most number of times?",
        "content": "All of us have movies that we love. Some we love because they remind us of different times of our lives. Others we love because they were truly excellent films.\n\nA brief comment or thought on the fact of rewatching movies and the difference you encount from watching the same movie but in different moment.\n\nWhat movie have you watched the most number of times?",
        "upvotes": 289,
        "comments": 1339,
        "media": null,
        "permalink": "/r/movies/comments/1j3zzuk/what_movie_have_you_watched_the_most_number_of/"
    },
    {
        "id": "1j41pf2",
        "author": "RealJohnGillman",
        "title": "‘Bullet Train Explosion’ | Official Teaser | Netflix",
        "content": "",
        "upvotes": 194,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h0b1XbUtGWFGWUxkigBgWb6h0b-Hsx3wj9vjr1t_KUA.jpg?auto=webp&amp;s=11f6f18f656dceaeb8a1a5d771aa5392bbab18d7"
        },
        "permalink": "/r/movies/comments/1j41pf2/bullet_train_explosion_official_teaser_netflix/"
    },
    {
        "id": "1j3f6yv",
        "author": "MarvelsGrantMan136",
        "title": "‘Shōgun’ Star Cosmo Jarvis Joins Christopher Nolan’s ‘The Odyssey’ With Filming Underway In Morocco",
        "content": "",
        "upvotes": 7834,
        "comments": 443,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cWoTFxLPOSFllCkmjFe3hdLM1sf7FJ77psP1uL6mIj0.jpg?auto=webp&amp;s=f50d13d7be55a935c8e179db6cd0e062048d0e33"
        },
        "permalink": "/r/movies/comments/1j3f6yv/shōgun_star_cosmo_jarvis_joins_christopher_nolans/"
    }
]