[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 37,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pwqjqs",
        "author": "justameesa",
        "title": "Stranger Things might crash as hard as GOT",
        "content": "The writing is not doing any favors to the plot or the characters. At this point of time listing things from the 80s is the only \"appeal\" to this nostalgia driven show.\n\nD&amp;D curse much? ( Duffer and Duffer)",
        "upvotes": 224,
        "comments": 211,
        "media": null,
        "permalink": "/r/netflix/comments/1pwqjqs/stranger_things_might_crash_as_hard_as_got/"
    },
    {
        "id": "1pw29y9",
        "author": "Unlucky_Monitor_9644",
        "title": "Millie Bobby Brown",
        "content": "I’ve watched a lot of TV over the years and I’ve really enjoyed Stranger Things, but I do not understand how people laud MBB for this role. \n\nTo me the acting is as one dimensional as it comes and perhaps it’s the writing, but there doesn’t seem to be anything truly challenging about 11’s character. \n\nThe endless praise for MBB’s portrayal just doesn’t sit right with me. ",
        "upvotes": 2451,
        "comments": 556,
        "media": null,
        "permalink": "/r/netflix/comments/1pw29y9/millie_bobby_brown/"
    },
    {
        "id": "1pwbsi3",
        "author": "entcanta333",
        "title": "How do you feel about the three-part release of Stranger Things?",
        "content": "I was so excited for this last season and after watching part 2, I feel like I've almost lost interest. I'm just in it to see the ending at this point, I don't feel emotionally invested in the show. ",
        "upvotes": 185,
        "comments": 203,
        "media": null,
        "permalink": "/r/netflix/comments/1pwbsi3/how_do_you_feel_about_the_threepart_release_of/"
    },
    {
        "id": "1pwm44z",
        "author": "brianmcnail",
        "title": "Death By Lightning",
        "content": "Please don’t sleep on this show.  Netflix did an amazing job bringing this show to life yes there is A LOT of creative liberties, but this amazing and would love to see Netflix to take a stab at other lesser discussed moments from history.",
        "upvotes": 42,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pwm44z/death_by_lightning/"
    },
    {
        "id": "1pwa2j8",
        "author": "stroh_1002",
        "title": "Sadie Sink teases the Stranger Things series finale: 'It feels like a homecoming of sorts. It feels complete'",
        "content": "",
        "upvotes": 87,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pwa2j8/sadie_sink_teases_the_stranger_things_series/"
    },
    {
        "id": "1pwswh2",
        "author": "RolyPolyGangster",
        "title": "Contact (1997): scenes cut out",
        "content": "I wanted to see one of my favourite movies of all time, 'Contact', and was happy to see it listed in Netflix.\n\nI have seen it earlier at a friend's place and I distinctly remember the scene where Ellie's teacher describes her scientific aptitude, also the unique shot of Ellie reaching for her father's pills when he collapses.\n\nI don't understand the reason for these cuts. I could not watch the rest of the movie, knowing something else would have been cut too.\n\nAnybody else got their content cut out?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pwswh2/contact_1997_scenes_cut_out/"
    },
    {
        "id": "1pwtfiu",
        "author": "job_hunter101",
        "title": "Any one else hate these batch releases?",
        "content": "Either release it all at once so we can binge it, or release it weekly so people can enjoy discussing it each week. Instead, these batch releases make me hate it entirely. You usually wouldn’t know when these get released and sometimes it’ll be days before you even know it, unless you don’t have any life. \n\nIt’s bad enough as it is with the yearly gaps between each season and to add these batch releases to it just makes my interest go down the drain. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwtfiu/any_one_else_hate_these_batch_releases/"
    },
    {
        "id": "1pwnb11",
        "author": "J-Dogg989",
        "title": "Not working for me how about you guys?",
        "content": "I’m trying to open Netflix, I’m hearing the “duh duh” but then it just freezes and nothing loads. Is this happening for anyone else right now or is it just me? ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pwnb11/not_working_for_me_how_about_you_guys/"
    },
    {
        "id": "1pvqg9x",
        "author": "ChuckieDabs",
        "title": "Netflix “Spoilers Commercial” 2025",
        "content": "Netflix just released a commercial for themselves during this 2025 Christmas NFL game that contained legitimate spoilers for the newest seasons of their TV shows. I do not get what marketing executive thought it was a good idea to run that. It was genuinely annoying and the message was some generic corporate American pandering.",
        "upvotes": 536,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1pvqg9x/netflix_spoilers_commercial_2025/"
    },
    {
        "id": "1pw9zix",
        "author": "bishtpd",
        "title": "Suspense, crime, detective series on Netflix",
        "content": "I’m looking for recommendations for a gripping suspense or crime series on Netflix, similar in tone and depth to The Fall, Broadchurch, or The Sinner—slow burn, strong characters, and a dark, psychological edge. \n\nAny suggestions?",
        "upvotes": 13,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1pw9zix/suspense_crime_detective_series_on_netflix/"
    },
    {
        "id": "1pwh06l",
        "author": "ALife_TimeModerater",
        "title": "More people need to watch to ronja the robbers daughter the two season show is perfect and is very sad at the end of the show",
        "content": "The show is a medieval fantasy about two lost friends who battle each other and two children who don’t want to follow in there parent’s footsteps and two sisters who hunt robbers for traumatic reasonings  and a nice old dude ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwh06l/more_people_need_to_watch_to_ronja_the_robbers/"
    },
    {
        "id": "1pwsl3i",
        "author": "Asuperniceguy",
        "title": "Remove watch history?",
        "content": "My KID LOVES creature cases and wants to watch it on repeat, which is fine because it's goated, but Netflix knows she's seen every episode so at the end of an episode it's like 'what to watch next'. I want to tell Netflix that we haven't seen it so it'll just play the next episode. Any ideas? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pwsl3i/remove_watch_history/"
    },
    {
        "id": "1pwoj1w",
        "author": "Glonkingvvvvvvv",
        "title": "Help pls",
        "content": "I’ve been trying to play a  game called red dead redemption, since I got i membership, but whenever I try to use option to tell it where I live, I get stuck on a screen saying help with the Netflix logo. And I can’t do anything with it.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pwoj1w/help_pls/"
    },
    {
        "id": "1pvqf6c",
        "author": "cancerman1120",
        "title": "What was with that commercial?",
        "content": "Watching football and Netflix runs a commercial on its own service spoiling a bunch of shows? Maybe it was a gag since I covered my eyes since I did not want anything spoiled for me. Anyone watch it? Were there spoilers?",
        "upvotes": 152,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1pvqf6c/what_was_with_that_commercial/"
    },
    {
        "id": "1pwepm6",
        "author": "Sufficient-Tip-4454",
        "title": "What is up with all these weird new kid shows?",
        "content": "Maybe this is the wrong sub since I didn't see any other kid based discussions... But what is the deal with all these seemingly new kid shows that have no speaking and are just characters doing silly things?? They drive me absolutely crazy &amp; my son always finds them and cackles incessantly at them 😵‍💫😵‍💫 maybe I'm the only one with this opinion lol but please make it stop!",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pwepm6/what_is_up_with_all_these_weird_new_kid_shows/"
    },
    {
        "id": "1pvvbtb",
        "author": "Baapofmovies_123",
        "title": "Stranger Things Season 5 Volume 2 Review (2025): Strong Moments, Weak Payoff Before the Finale",
        "content": "It continued  Netflix’s flagship sci-fi saga and is carrying the weight of an ending that fans have waited years to see. However, with so much expectations, Volume 2 falls flat, as it ultimately feels like an extended bridge to the finale rather than a satisfying chapter on its own. ",
        "upvotes": 53,
        "comments": 218,
        "media": null,
        "permalink": "/r/netflix/comments/1pvvbtb/stranger_things_season_5_volume_2_review_2025/"
    },
    {
        "id": "1pvk4u5",
        "author": "TheMirrorUS",
        "title": "Netflix viewers furious over streaming issues during NFL Christmas coverage",
        "content": "",
        "upvotes": 290,
        "comments": 305,
        "media": null,
        "permalink": "/r/netflix/comments/1pvk4u5/netflix_viewers_furious_over_streaming_issues/"
    },
    {
        "id": "1pwkxz6",
        "author": "TheAlex918",
        "title": "subtitles on iphone",
        "content": "hi i’ve always used and set subtitles on my phone with my font and it always worked on android, in both phone and tablet. i’ve now recently passed to ios with iphone 15 and the subtitles are totally different. the settings in the netflix’s site are still the same though, and i don’t know what to do. i tried setting them again but they’re always the same. anyone knows how to help me? thank you",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwkxz6/subtitles_on_iphone/"
    },
    {
        "id": "1pvokbm",
        "author": "bogeynick28",
        "title": "The amount of ads on the NFL stream is insane",
        "content": "is it just me? I don't usually watch live broadcasts on Netflix but dang the number of ads are insane... tbh I don't remember which plan I have but it's about 25$ a month. I don't even know why I'm getting ads. Really want to cancel after this month..",
        "upvotes": 140,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1pvokbm/the_amount_of_ads_on_the_nfl_stream_is_insane/"
    },
    {
        "id": "1pwemol",
        "author": "DiesIrae7",
        "title": "When you stop watching something early, how do you think about it?",
        "content": "Sometimes I’ll quit start a show or movie that Netflix recommends and still quit 10–15 minutes in.\n\nCurious to know, when that happens, do you usually feel like it just wasn’t for you, or you didn’t give it enough of a chance, or you picked the wrong thing that night?\n\nCurious how other people think about this.",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pwemol/when_you_stop_watching_something_early_how_do_you/"
    },
    {
        "id": "1pvrbvh",
        "author": "smooothaseggs",
        "title": "NFL/sport coverage is abhorrent",
        "content": "Holy smokes…what a terrible product.  The commentary, the (type of) ads, the lack of “watch live” option, the poor stream rate/resolution, the netflix branding of a raw tomahawk steak (“that looks pretty good”, NOT!!)…all just terrible.  I’m pretty sure they’re begging me to end my subscription and stream illegally.  I wasn’t the biggest fan of Amazon prime NFL games, but at least they figured it out.  I should have known after being a sucker and watching some of the “fights” they’ve promoted over the last couple years.  I digress…if you enjoyed it, then kudos!  Just needed to vent, and I won’t be back here.  Drew Brees is a real one, tho, always.",
        "upvotes": 78,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pvrbvh/nflsport_coverage_is_abhorrent/"
    },
    {
        "id": "1pvlzwd",
        "author": "Careless_Worry_7542",
        "title": "Spoilers Monster the Ed Gein Story is the worst show Ive ever watched, ever.",
        "content": "I'd never seen one of these series, maybe watched half an episode on the Menedezes. I gave this a chance because I like Charlie Hunnam and heard the Dahmer and Menedez ones were decent. First episode or two Hunnam and Metcalf do a fine job getting into character and the production value was good. Hell I even was on board when they added Psycho as a sort of meta analysis he had on popular culture to add some filler to an otherwise short story. Then it kept going and going and going. It ends with a parody of Mindhunter, Richard Speck's man tits, and Gein catching Ted Bundy, Gein dying, seeing his mother in heaven, what felt like 95 ending scenes later some kids desecrate his grave and are chased off by the movie monsters he inspired, then finally ends on a flashback with his mom again.   More endings than The Return of The King. Absolute trash. ",
        "upvotes": 172,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pvlzwd/spoilers_monster_the_ed_gein_story_is_the_worst/"
    },
    {
        "id": "1pwj2do",
        "author": "Klutzy_Belt_2296",
        "title": "What is like….the point of The Great Flood?",
        "content": "I’m just watching this moving and I’m so lost lmfao\n\nLike I’m halfway in and I have no idea what the plot even is at this point.\n\nJust when you think you understand what’s going on you jump back to the beginning and what? It was all a dream\n\nThis no lie reminds me a lot of A House of Dynamite\n\nI’ve never seen movies where the plot is so confusing to where you wonder wtf is this even about or why am I even watching this 💀💀💀\n\nAt least House of Dynamite semi made sense even though I was more so at a loss for like, who that movie is supposed to appeal to\n\nIdk these movies are weird ",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1pwj2do/what_is_likethe_point_of_the_great_flood/"
    },
    {
        "id": "1pwilyz",
        "author": "Shot-Transition-2803",
        "title": "Netflix Windows App - volume slider does not work",
        "content": "Hi, \n\nI bought Netflix for first time, using Netflix Windows App from MS Store / Win 11. \n\nProblem is that volume slider do nothing.. does not change volume. \n\nI tried turn off exclusive mode.. etc but no help\n\nThanks for any help",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pwilyz/netflix_windows_app_volume_slider_does_not_work/"
    },
    {
        "id": "1pwhpnl",
        "author": "oloebaloe",
        "title": "What should I watch first",
        "content": "I struggle to keep up with series a lot, the only serie I got finished is gossip girl. I hear a lot of good stories about sex in the city or desperate housewives. which one should I watch first and which serie did you learn to most out of it? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwhpnl/what_should_i_watch_first/"
    },
    {
        "id": "1pvlptr",
        "author": "mrstevegibbs",
        "title": "Your very very long interviews in the middle of football r annoying",
        "content": "Interview celebrities before or after the game, not during. If during, please shorten them by 80%. Too many uncalled plays are taking place. Maybe I’m the only one.  ",
        "upvotes": 114,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1pvlptr/your_very_very_long_interviews_in_the_middle_of/"
    },
    {
        "id": "1pwfif4",
        "author": "River_media",
        "title": "Series to watch?",
        "content": "I’m bored asf constantly and I’m looking for some new content to watch, preferably action based or mystery I can follow along with and solve before the answer is revealed. Any recommendations? Thank you",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pwfif4/series_to_watch/"
    },
    {
        "id": "1pwf51x",
        "author": "Elspackel",
        "title": "AMC, what is this?",
        "content": "A lot of AMC series has been dropped on Netflix, and I have tried watch some...\n\nBut the the ones I have looked at, has all been flat, and not very interesting.\n\nIs there any of them, that are better then the rest, with more depth, more real fealing, more complex characters, more involving storylines?\n\nI have looked a little on Talamaska, NOS4A2, and Moonhaven, but as I said, they all fell flat.\n\nWhere do they come from, all these AMC series?\n",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pwf51x/amc_what_is_this/"
    }
]