[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i7y9hk",
        "author": "Pogrebnik",
        "title": "'Stranger Things 5' Release Date Leaked By Examining Netflix’s Website Code",
        "content": "",
        "upvotes": 300,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1i7y9hk/stranger_things_5_release_date_leaked_by/"
    },
    {
        "id": "1i84c7r",
        "author": "Tuktuktuk2020",
        "title": "American Primeval (trigger warning, spoilers)",
        "content": "I've never seen a better depiction of women in a historical series, or any other series at that. Women are allowed to be independent, opinionated, and vulnerable and feminine - fleshed out and whole people just as much as the male protagonists. \nFurthermore, as a s/a survivor, I was touched by the way it was handled in the series. Delicately, not exploitedly, and showing strength and resilience in the survivor, instead of the usual crumbling and broken victim. It felt authentic. It was treated with compassion and without shame. \nI do think I would have ended many things differently, it was depressing AF, but overall I liked the series. ",
        "upvotes": 27,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1i84c7r/american_primeval_trigger_warning_spoilers/"
    },
    {
        "id": "1i801x6",
        "author": "NathLWX",
        "title": "These are the 8 biggest anime premieres on Netflix (+ Synopsis).",
        "content": "I believe these are the views for the first time they appear in the Netflix Top 10 site.\n\nI recommend giving them a try. I've watched most of them, except Baki Hanma, Dragon Ball Daima, Demon Slayer Season 4. All of them are available in English dub too.\n\n**Sakamoto Days** (Currently simulcasting/weekly release) - 8/10  \nComedy action anime about a hitman who left his job after falling in love at first sight with a convenience store lady. As a result, he left his job and became a father who helped people, prohibited from killing. He's now living his peaceful quiet life... or is he?  \nHe is also being hunted or searched by his former rivals and partners, so he has to stop his enemies without killing them.\n\n**DAN DA DAN** (there's an attempted rape at ep. 1 by the aliens, afterwards it's safe) - 8.5/10  \nHe was an alien fanboy, she was a ghost fangirl. They're in dispute over which one is real since they believe the other one doesn't exist, so the female MC (main character) decided to look for alien; male MC looked for ghost. Turns out both are real. Male MC lost his balls (literally) to Turbo Granny in a tunnel. Long story short they both gain supernatural powers, guess you can say they are a match.\n\n**Record of Ragnarok** - 7/10  \nAnimation needs improvements imho, but it's still enjoyable. The gods want to wipe out humanity due to their sins and selfishness, but one of the Valkyries (Brunhilde) said hold up, let them cook, and proposed an idea to make humans literally fight against the gods in an arena instead. If humans have more wins than gods, humankind will be spared. Some of the fights include Adam vs Zeus, Lü Bu vs Thor, Jack the Ripper vs Heracles, Raiden vs Shiva.\n\n**My Happy Marriage** - 7.5/10  \nThe female MC lives in an abusive household ever since her mother died and her father remarried an evil woman and her daughter. She got forced to be a servant/mais. Her father suddenly brought a news that she is to marry a guy from a noble and distinguished family. Her fiancee is known to be callous and dismissed all his previous fiancees. That's what she expected, but turns out he treated her nicely.\n\n**Ranma 1/2** (2024 remake) - 8/10  \nI'm sure you've heard of this slapstick romance comedy before; if not, it's about a dude (Ranma) who is a gender bender after falling into a hot lake in China; likewise his father who can turn into a Panda. Ranma got engaged with a tomboy girl by his father who is a friend to the fiancee's father.",
        "upvotes": 44,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i801x6/these_are_the_8_biggest_anime_premieres_on/"
    },
    {
        "id": "1i7c7cu",
        "author": "TheExpressUS",
        "title": "Bling Empire New York star Lynn Ban dies aged 51 after brain surgery",
        "content": "",
        "upvotes": 733,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1i7c7cu/bling_empire_new_york_star_lynn_ban_dies_aged_51/"
    },
    {
        "id": "1i84zp8",
        "author": "Remorse_123",
        "title": "Netflix Films Earn 18 Oscar Nominations, Led by Emilia Pérez",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i84zp8/netflix_films_earn_18_oscar_nominations_led_by/"
    },
    {
        "id": "1i7zuqy",
        "author": "JaffaCakesAreMyJam",
        "title": "The Night Agent star Gabriel Basso: ‘Thriller’s 98,000,000 views freaks me out’",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i7zuqy/the_night_agent_star_gabriel_basso_thrillers/"
    },
    {
        "id": "1i7a5uk",
        "author": "Glitchy_McGee",
        "title": "Is Netflix shooting itself in the foot with these constant price hikes?",
        "content": "I’ve been a Netflix subscriber for years, but with the latest price hike for the Premium plan (now $24.99/month!), I’m really starting to question if it’s worth it anymore. They keep raising prices while pushing out content that, honestly, doesn’t always hit the mark. It feels like they’re making us pay for their poor-performing shows and movies instead of focusing on producing quality content that people actually want to watch.\n\nAnd the password-sharing crackdown? I get that they want to boost profits, but it feels like they’re ignoring how modern households actually function. Not everyone under one account lives in the same house 24/7—people go to college, travel for work, or stay with family temporarily. It just seems dumb to alienate loyal customers who aren’t trying to cheat the system but just have a normal life.\n\nA lot of people I know have either canceled their subscriptions or switched to other streaming services that offer just as much—if not more—for less money. It just doesn’t make sense to me. If they’re losing subscribers because of price hikes, why keep doing it? Shouldn’t they focus on improving their content and keeping people around instead of squeezing every dollar out of us?\n\nWhat do you guys think? Are you sticking with Netflix, or are you moving on to other platforms?",
        "upvotes": 362,
        "comments": 334,
        "media": null,
        "permalink": "/r/netflix/comments/1i7a5uk/is_netflix_shooting_itself_in_the_foot_with_these/"
    },
    {
        "id": "1i7s8m4",
        "author": "Big-Acanthisitta8797",
        "title": "Just finished rewatching season 1 of The Night Agent and The Recruit.",
        "content": "My take is The Night Agent and The Recruit are smartly written, well-acted, and packed with edge-of-your-seat action. Who else is excited for the new seasons? Let's get ready for more thrilling twists and turns! 🎬🔥\nAnyone else planning to binge-watch season 2 for both shows?",
        "upvotes": 30,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1i7s8m4/just_finished_rewatching_season_1_of_the_night/"
    },
    {
        "id": "1i7vaiu",
        "author": "okraisyummy",
        "title": "Two Must-Watch Documentaries on War, International Relations, and Terrorism",
        "content": "Just finished watching two Netflix docuseries: Turning Point: The Bomb and the Cold War and Turning Point: 9/11 and the War on Terror. Honestly, both were super interesting and packed with details about these major events in history.\n\nIf you’re into learning about big global moments or people like Oppenheimer, these are definitely worth a watch. They break down a lot of important stuff without feeling too overwhelming. Highly recommend if you’re into history or just want to understand these topics better!\n",
        "upvotes": 19,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i7vaiu/two_mustwatch_documentaries_on_war_international/"
    },
    {
        "id": "1i80mks",
        "author": "ElephantElmer",
        "title": "Getting returned to the sign in screening when signing in",
        "content": "This happens whether I used my password or the sign in code. Has anyone experienced this and how did they resolve it? This has happened across multiple (but not all) devices.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i80mks/getting_returned_to_the_sign_in_screening_when/"
    },
    {
        "id": "1i86816",
        "author": "Robemilak",
        "title": "Every Movie &amp; Series Coming to Netflix in February 2025",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i86816/every_movie_series_coming_to_netflix_in_february/"
    },
    {
        "id": "1i7x0tp",
        "author": "andreimotin",
        "title": "Can’t sign in",
        "content": "Hey, so yesterday I was trying to log into Netflix on my new iPad mini, and when I tried logging in trough the app, it didn’t work, through the website, it didn’t either, I got this error Ion the website: “Something went wrong We are having technical difficulties and are actively working on a fix. Please try again in a few minutes.”, not in a few minutes, not in a few hours worked.\nI tried again today, and now, though I’m using the same password, the correct password, it says “Incorrect password for (my email). You can use a sign in code, reset your password or try again.”\nAnd in the app, I pretty much always get the same error always that’s stating that I’m using the wrong password, and it suggests using a sign in code, reset password or try again.\nAny solutions on it? Thanks in advance.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i7x0tp/cant_sign_in/"
    },
    {
        "id": "1i7jxur",
        "author": "BillDaily",
        "title": "Love, Death, and Robots season 4",
        "content": "Saw that the series was renewed for season 4 back in summer of 2022. Has there been any updates on filming or production?",
        "upvotes": 23,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i7jxur/love_death_and_robots_season_4/"
    },
    {
        "id": "1i7mfwt",
        "author": "Bulky-Board-5090",
        "title": "Is it worth to watch “The 8 show”serie",
        "content": "I just wanted to ask if it’s worth watching or not ,I’ve seen Squid Game and Alice in Borderland, and I’ve heard this series has a similar concept. If it’s really good, I think I’d enjoy it, but I don’t want to waste my time if it’s not that exciting or creative. Could you share your opinion about it without any spoilers, please?",
        "upvotes": 15,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1i7mfwt/is_it_worth_to_watch_the_8_showserie/"
    },
    {
        "id": "1i6tod5",
        "author": "misana123",
        "title": "Netflix Raising Prices in U.S. Again, Including First Hike on Ad-Supported Tier",
        "content": "",
        "upvotes": 1158,
        "comments": 512,
        "media": null,
        "permalink": "/r/netflix/comments/1i6tod5/netflix_raising_prices_in_us_again_including/"
    },
    {
        "id": "1i85gg2",
        "author": "Beneficial_Frame_214",
        "title": "Why is Netflix suddenly narrating events to me?",
        "content": "l am watching Brooklyn Nine-Nine and suddenly Netflix starting narrating events. Like \"Terry glares\", \"the breakroom\"   \n  \nwhat is going on? does anyone know how to fix this? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i85gg2/why_is_netflix_suddenly_narrating_events_to_me/"
    },
    {
        "id": "1i78ysr",
        "author": "TimesandSundayTimes",
        "title": "The fourth quarter of 2024 was the last for which Netflix will report numbers of paying subscribers, suggesting growth in numbers is slowing",
        "content": "",
        "upvotes": 51,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1i78ysr/the_fourth_quarter_of_2024_was_the_last_for_which/"
    },
    {
        "id": "1i7sfpn",
        "author": "Emotional-Pop-4621",
        "title": "Banditos",
        "content": "Just finished season one and two of bandito anyone feel like it’s a different version of outbanks I loved season two and the different age groups all in one so every can appeal to it ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i7sfpn/banditos/"
    },
    {
        "id": "1i7cn9m",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix's 'Zero Day' limited series starring Robert De Niro and Angela Bassett releases trailer, the show will be released on February 20",
        "content": "",
        "upvotes": 18,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i7cn9m/netflixs_zero_day_limited_series_starring_robert/"
    },
    {
        "id": "1i7x70z",
        "author": "SevereBother6712",
        "title": "The New Lottery: An Anonymous Thought Experiment in the Era of Post-Mangione Capitalism",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i7x70z/the_new_lottery_an_anonymous_thought_experiment/"
    },
    {
        "id": "1i7blk9",
        "author": "FunctionAsUare4",
        "title": "Just finished squid games and it was phenomenal",
        "content": "I think I started ut on the 1st of January this year. Subbed of course. From the get go, I was highly entertained. Not for a second, was I anything but loving it.\n\nThe Gganbu episode just sealed it for me. That was the most emotional episode(and the best—at least for now) I've ever watched in any form of entertainment. The ending was good, and although I initially told myself I would wait a bit before starting the next season, I ended up starting season 2 the next day or so.\n\nAnd....\n\n\nIt was Great as well. Didn't exactly have the emotional attachment that to characters that season 1 did, but in terms of entertainment, it was just about the same.\nThanos is really funny\n\nThe ending was good for me. \n\nDespite what a lot of people say, I had no problem whatsoever with when the season ended. Obviously, I would prefer it went longer, but stopping the season there,I have no problem with. I can definitely wait and I realise that not everything the season started with needed to be finished before then(like character's development).\n\nSeason 1 was 10/10\n\nSeason 2: 8,5/10\n\nTherefore,by calculation, I rate Squid game:9,2/10\nAbsolutely phenomenal.\nMy favourite show so far except for One Piece(not live action).\n\n",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i7blk9/just_finished_squid_games_and_it_was_phenomenal/"
    },
    {
        "id": "1i7uko6",
        "author": "paleolith1138",
        "title": "Subtitles",
        "content": "Why does Netflix have multiple movies with more than 1 language, but doesn't sub the other language.\nWatching Midway, it's either all sub or only English without knowing what the Japanese are saying.\n\nMy choices are to have subtitles all the time, pause every couple of seconds, to turn on subs, or to fast forward japanese scenes\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i7uko6/subtitles/"
    },
    {
        "id": "1i7szje",
        "author": "Beybladeprod9",
        "title": "Black screen on idle",
        "content": "I’m streaming on a ps5 which I’ve been doing for years. I went to the kitchen to cook leaving Netflix idle. It usually stays on what I was on or advertises other shows. However this time I came back to a black screen ps5 still on. Touching the joystick it came back but this is very concerning. Help please ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i7szje/black_screen_on_idle/"
    },
    {
        "id": "1i7dmnj",
        "author": "popthatkunt",
        "title": "Are all Netflix originals equally available in all countries?",
        "content": "I'm from South Africa and had a random thought. \n\nNetflix has original South African series and I was wondering if the rest of the world can watch these too?\nExample: Blood and Water, a South African Netflix original series ",
        "upvotes": 5,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1i7dmnj/are_all_netflix_originals_equally_available_in/"
    },
    {
        "id": "1i7pic5",
        "author": "Infinite_Cricket_633",
        "title": "Shows similar to Archer or Spy x Family?",
        "content": "Hi y'all. \n\nI am fairly new to all this anime stuff and kinda got into it by randomly coming across Archer and binge watching it within a few days. \n\nRecently I was searching for something similar to archer and found spy x family, which sounded similar, but was yet fairly different. Anyways I also reallg enjoyed that one and am now needing recommendations on other, similar shows that are either just \"sweet\" like spy family or unbelievably funny like archer, or a mix of both.\n\nThanks in advance",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i7pic5/shows_similar_to_archer_or_spy_x_family/"
    },
    {
        "id": "1i7oi02",
        "author": "CMFraud",
        "title": "Black bars on the left and right on the screen that suddenly appeared",
        "content": "So today I was watching Trailer Park Boys Season 2 Episode 6 and I noticed that now there are vertical black screen bars on the left and right of the screen.\n\nI know the season is rather old but a couple days ago when I was watching the show it didn't have any black bars at all and was showing in full screen.\n\nThis was on a 55inch 4k TV.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i7oi02/black_bars_on_the_left_and_right_on_the_screen/"
    },
    {
        "id": "1i7nohk",
        "author": "HumanCategory8572",
        "title": "help please",
        "content": "my account got hacked and my email address was changed i tried to contact netflix but it said to check back later. is there any thing i can do to get my account back",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i7nohk/help_please/"
    },
    {
        "id": "1i6tlbq",
        "author": "misana123",
        "title": "Netflix Reaches 302 Million Paid Subscribers with 19 Million Adds in Q4",
        "content": "",
        "upvotes": 69,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i6tlbq/netflix_reaches_302_million_paid_subscribers_with/"
    },
    {
        "id": "1i7yemq",
        "author": "Soggy-Beginning604",
        "title": "Squid game season 2 was so bad (Spoiler)",
        "content": "Like for one,\nthe villain had a LOT of plot Armour,  I get in game he wasn't gonna die.\n\nBut legit, Everything else besides the tracker from S1 he hasn't had power over.\n\n2nd point being,  besides the pregnant woman, it wasn't really intriguing as in there wasn't much on the line. Sure the whole\nI've played these games before was intriguing. But they didn't put up much of a fight as a rebellion either.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i7yemq/squid_game_season_2_was_so_bad_spoiler/"
    },
    {
        "id": "1i7ivse",
        "author": "Traegz",
        "title": "Is there a way to watch with multiple audio channels and different languages?",
        "content": "I want to watch in English and my girlfriend in German. Is there a way to have synced audio on two channels? For example English through headphones and German through speakers.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i7ivse/is_there_a_way_to_watch_with_multiple_audio/"
    }
]